
&ИзменениеИКонтроль("ОбработкаПроверкиЗаполнения")
Процедура vs_ОбработкаПроверкиЗаполнения(Форма, Отказ, ПроверяемыеРеквизиты, Объект)
	
	ПараметрыСеанса.ИнтерактивнаяПроверкаЗаполненияСвойств = Истина;
	
	Если НЕ Форма.Свойства_ИспользоватьСвойства
	 ИЛИ НЕ Форма.Свойства_ИспользоватьДопРеквизиты Тогда
		
		Возврат;
	КонецЕсли;
	
	Приемник = Новый Структура;
	Приемник.Вставить("ПараметрыСвойств", Неопределено);
	ЗаполнитьЗначенияСвойств(Приемник, Форма);
	
	Если ТипЗнч(Приемник.ПараметрыСвойств) = Тип("Структура")
		И Приемник.ПараметрыСвойств.Свойство("ВыполненаОтложеннаяИнициализация")
		И Не Приемник.ПараметрыСвойств.ВыполненаОтложеннаяИнициализация Тогда
		ЗаполнитьДополнительныеРеквизитыВФорме(Форма, Объект);
	КонецЕсли;
	
	Для каждого Описание Из Форма.Свойства_ОписаниеДополнительныхРеквизитов Цикл
#Вставка

		Если Описание.Свойство.Имя = "ОплатаПоДоговоруБезСчета_0a8b9b3ad54541998932dc50d98ccd96" Тогда
			ЗначениеДополнительногоРеквизита = vs_ПолучитьЗначениеДополнительногоРеквизитаНаФорме(Форма, Описание.Свойство.Имя);	
			Если ЗначениеДополнительногоРеквизита = Неопределено
				или ЗначениеДополнительногоРеквизита = Ложь Тогда
				// Может это и не надо...
				ПроверяемыеРеквизиты.Добавить("НомерПоДаннымПоставщика");	
				ПроверяемыеРеквизиты.Добавить("ДатаПоДаннымПоставщика");
				// А это надо...
				Если Объект = Неопределено Тогда
					ОписаниеОбъекта = Форма.Объект;
				Иначе
					ОписаниеОбъекта = Объект;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(ОписаниеОбъекта["НомерПоДаннымПоставщика"]) Тогда
					ОбщегоНазначения.СообщитьПользователю(
					НСтр("ru = 'Поле номер Счета поставщика не заполнено.'"),
					,
					"НомерВходящегоДокумента",
					"Объект.НомерПоДаннымПоставщика",
					Отказ);
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(ОписаниеОбъекта["ДатаПоДаннымПоставщика"]) Тогда
					ОбщегоНазначения.СообщитьПользователю(
					НСтр("ru = 'Поле дата Счета поставщика не заполнено.'"),
					,
					"ДатаВходящегоДокумента",
					"Объект.ДатаПоДаннымПоставщика",
					Отказ);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
#КонецВставки
		Если Описание.ЗаполнятьОбязательно И НЕ Описание.Удалено Тогда
			Если Не РеквизитДоступенПоФункциональнымОпциям(Описание) Тогда
				Продолжить;
			КонецЕсли;
			Результат = Истина;
			ОписаниеОбъекта = ?(Объект <> Неопределено, Объект, Форма.Объект);
			
			Для Каждого ЗависимыйРеквизит Из Форма.Свойства_ОписаниеЗависимыхДополнительныхРеквизитов Цикл
				Если ЗависимыйРеквизит.ИмяРеквизитаЗначение = Описание.ИмяРеквизитаЗначение
					И ЗависимыйРеквизит.УсловиеОбязательностиЗаполнения <> Неопределено Тогда
					
					Параметры = Новый Структура;
					Параметры.Вставить("ЗначенияПараметров", ЗависимыйРеквизит.УсловиеОбязательностиЗаполнения.ЗначенияПараметров);
					Параметры.Вставить("Форма", Форма);
					Параметры.Вставить("ОписаниеОбъекта", ОписаниеОбъекта);
					Результат = ОбщегоНазначения.ВычислитьВБезопасномРежиме(ЗависимыйРеквизит.УсловиеОбязательностиЗаполнения.КодУсловия, Параметры);
					
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если Не Результат Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Форма[Описание.ИмяРеквизитаЗначение]) Тогда
				ОбщегоНазначения.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Поле ""%1"" не заполнено.'"), Описание.Наименование),
					,
					Описание.ИмяРеквизитаЗначение,
					,
					Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция vs_ПолучитьПолеДополнительногоРеквизитаНаФорме(Форма, ИмяРеквизита) 
	
	Список = Форма.Свойства_ОписаниеДополнительныхРеквизитов;
	
	Свойство = ОбщегоНазначенияУТВызовСервера.vs_ПолучитьСвойствоПВХПоИмени(ИмяРеквизита);
	
	Если ЗначениеЗаполнено(Свойство) Тогда
	    НайденныеСтроки = Список.НайтиСтроки(Новый Структура("Свойство", Свойство));
		Если НайденныеСтроки.Количество() > 0 Тогда
			Возврат НайденныеСтроки[0];		
		КонецЕсли; 		
	КонецЕсли;
	Возврат(Неопределено);
КонецФункции

Функция vs_ПолучитьЗначениеДополнительногоРеквизитаНаФорме(Форма, ИмяРеквизита)
	Перем ЗначениеРеквизита;
	
	ПолеДополнительногоРеквизитаНаФорме = vs_ПолучитьПолеДополнительногоРеквизитаНаФорме(Форма, ИмяРеквизита);
	
	Если не ПолеДополнительногоРеквизитаНаФорме = Неопределено Тогда
		Возврат Форма[ПолеДополнительногоРеквизитаНаФорме.ИмяРеквизитаЗначение];
	КонецЕсли;
	Возврат(Неопределено);
КонецФункции

