#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура")  Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
	Возврат;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	МассивНепроверяемыхРеквизитов.Добавить("ТипИтога");
	
	Если НЕ ЗначениеЗаполнено(РазделИсточникаДанных) Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ИсточникДанных");
	КонецЕсли;
	
	Если РазделИсточникаДанных <> Перечисления.РазделыИсточниковДанныхБюджетирования.МеждународныйУчет Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ПланСчетовМеждународногоУчета");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	НеЗаполненТипИтога = (РазделИсточникаДанных = Перечисления.РазделыИсточниковДанныхБюджетирования.РегламентированныйУчет
							ИЛИ РазделИсточникаДанных = Перечисления.РазделыИсточниковДанныхБюджетирования.МеждународныйУчет)
						И Не ЗначениеЗаполнено(ТипИтога);
	
	Если НеЗаполненТипИтога Тогда
		ТекстСообщения = НСтр("ru = 'Поле Тип итога не заполнено'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстСообщения, ,"ТипИтога", "Запись", Отказ);
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Наименование = Строка(РазделИсточникаДанных) + ": " + ИсточникДанных;
	Если ЗначениеЗаполнено(ТипИтога) Тогда
		Наименование = Наименование + ", " + ТипИтога;
	КонецЕсли;
	Если ЗначениеЗаполнено(ПредставлениеОтбора) Тогда
		Наименование = Наименование + ", " + ПредставлениеОтбора;
	КонецЕсли;
	
	МаксимальноеКоличествоАналитик = БюджетированиеКлиентСервер.МаксимальноеКоличествоАналитик();
	Для Сч = 1 По МаксимальноеКоличествоАналитик Цикл
		
		Если ЭтотОбъект["ЗаполнятьУказаннымЗначениемАналитику" + Сч]
		   И ЗначениеЗаполнено(ПоказательБюджетов["ВидАналитики" + Сч]) Тогда
			
			ТипАналитики = ПоказательБюджетов["ВидАналитики" + Сч].ТипЗначения;
			ЭтотОбъект["ЗначениеАналитики" + Сч] = БюджетированиеКлиентСервер.ПриведенноеЗначениеАналитики(
				ЭтотОбъект["ЗначениеАналитики" + Сч],
				ТипАналитики);
				
		Иначе
			
			ЭтотОбъект["ЗначениеАналитики" + Сч] = БюджетированиеКлиентСервер.ПустоеЗначениеАналитики();
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Сделаем слепок настроек и схемы для будущего сравнения их между собой без анализа каждого элемента.
	Если Не ЭтотОбъект.ПометкаУдаления Тогда
		БюджетированиеСервер.ЗаполнитьРеквизитыХешейНастроекИСхемы(ЭтотОбъект);
	КонецЕсли;
	
	// Заполним настройки заполнения аналитик
	Если Не ЭтотОбъект.РасширенныйРежимНастройкиЗаполненияАналитики Тогда
		БюджетированиеСервер.ЗаполнитьРеквизитыОбъектаНастроекЗаполненияАналитики(ЭтотОбъект);
	КонецЕсли;
	
	УстановкаРеквизитовИсторииПереходаНаНовыеФормулы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановкаРеквизитовИсторииПереходаНаНовыеФормулы()
	
	Если ПустаяСтрока(ВыражениеЗаполненияАналитики1ИсторияПереходаНаНовыеФормулы)
		И НЕ ПустаяСтрока(ВыражениеЗаполненияАналитики1) Тогда
		ВыражениеЗаполненияАналитики1ИсторияПереходаНаНовыеФормулы = ВыражениеЗаполненияАналитики1;
	КонецЕсли;
	Если ПустаяСтрока(ВыражениеЗаполненияАналитики2ИсторияПереходаНаНовыеФормулы)
		И НЕ ПустаяСтрока(ВыражениеЗаполненияАналитики2) Тогда
		ВыражениеЗаполненияАналитики2ИсторияПереходаНаНовыеФормулы = ВыражениеЗаполненияАналитики2;
	КонецЕсли;
	Если ПустаяСтрока(ВыражениеЗаполненияАналитики3ИсторияПереходаНаНовыеФормулы)
		И НЕ ПустаяСтрока(ВыражениеЗаполненияАналитики3) Тогда
		ВыражениеЗаполненияАналитики2ИсторияПереходаНаНовыеФормулы = ВыражениеЗаполненияАналитики3;
	КонецЕсли;
	Если ПустаяСтрока(ВыражениеЗаполненияАналитики4ИсторияПереходаНаНовыеФормулы)
		И НЕ ПустаяСтрока(ВыражениеЗаполненияАналитики4) Тогда
		ВыражениеЗаполненияАналитики4ИсторияПереходаНаНовыеФормулы = ВыражениеЗаполненияАналитики4;
	КонецЕсли;
	Если ПустаяСтрока(ВыражениеЗаполненияАналитики5ИсторияПереходаНаНовыеФормулы)
		И НЕ ПустаяСтрока(ВыражениеЗаполненияАналитики5) Тогда
		ВыражениеЗаполненияАналитики5ИсторияПереходаНаНовыеФормулы = ВыражениеЗаполненияАналитики5;
	КонецЕсли;
	Если ПустаяСтрока(ВыражениеЗаполненияАналитики6ИсторияПереходаНаНовыеФормулы)
		И НЕ ПустаяСтрока(ВыражениеЗаполненияАналитики6) Тогда
		ВыражениеЗаполненияАналитики6ИсторияПереходаНаНовыеФормулы = ВыражениеЗаполненияАналитики6;
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли
