//@strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Задает расширенные настройки отчета
//
// Параметры:
//   Настройки - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.Настройки.
//
Процедура НастроитьВариантыОтчета(Настройки) Экспорт
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПроизводственныеЗатратыПостатейные);
	ОписаниеОтчета.Описание = НСтр("ru= 'Постатейные производственные расходы в разрезе организаций, отнесенные на подразделение и распределенные на себестоимость продукции.
		|Позволяет проанализировать, все ли постатейные расходы распределены на партии производства.'");
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ВариантыОтчетовУТПереопределяемый.ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "НачальныйОстаток");
	ВариантыОтчетовУТПереопределяемый.ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "Поступления");
	ВариантыОтчетовУТПереопределяемый.ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ИзрасходованоНаПартииПроизводства");
	ВариантыОтчетовУТПереопределяемый.ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "КонечныйОстаток");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДвижениеПостатейныхРасходовПоПредприятию");
	ОписаниеВарианта.Описание = НСтр("ru= 'Постатейные производственные расходы по предприятию в целом, отнесенные на подразделение и распределенные на себестоимость продукции.
		|Позволяет проанализировать, все ли постатейные расходы распределены на партии производства.'");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
