
&ИзменениеИКонтроль("ПроверитьНеобходимостьСогласованияУсловийЗакупки")
Процедура vs_ПроверитьНеобходимостьСогласованияУсловийЗакупки(Знач ДокументЗакупки, ЕстьОтклоненияОтЦеновыхУсловий, ЕстьОтклоненияОтФинансовыхУсловий, ЕстьОтклоненияОтЛогистическихУсловий)

	СоглашениеДокументаЗакупки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументЗакупки, "Соглашение");
	Если НЕ ЗначениеЗаполнено(СоглашениеДокументаЗакупки) Тогда

#Удаление
		ЕстьОтклоненияОтЦеновыхУсловий = Истина;
		ЕстьОтклоненияОтФинансовыхУсловий = Истина;
		ЕстьОтклоненияОтЛогистическихУсловий= Истина;
#КонецУдаления
#Вставка
// Здесь можно описать новое поведение.

#КонецВставки

		Возврат;

	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);

	ИмяТаблицы     = ДокументЗакупки.Метаданные().ПолноеИмя();

	// Проверим нужно ли проверять диапазон допустимых цен
	ВидМаксимальноДопустимыхЦенЗакупки = Константы.ВидМаксимальноДопустимыхЦенЗакупки.Получить();
	ПроверятьДиапазонЦен = ЗначениеЗаполнено(ВидМаксимальноДопустимыхЦенЗакупки);

	// Проверим нужно ли проверять скидки и наценки
	ИспользоватьРучныеСкидки = ПолучитьФункциональнуюОпцию("ИспользоватьРучныеСкидкиВЗакупках");

	ИменаРеквизитовЗакупки = "ХозяйственнаяОперация, Дата, Соглашение, СуммаДокумента, ВернутьМногооборотнуюТару, Организация";

	ЗаполнятьЗалогЗаТаруПоДокументу = Ложь;
	Если ДокументЗакупки.Метаданные().Реквизиты.Найти("ТребуетсяЗалогЗаТару") <> Неопределено Тогда
		ИменаРеквизитовЗакупки = ИменаРеквизитовЗакупки +", ТребуетсяЗалогЗаТару";
		ЗаполнятьЗалогЗаТаруПоДокументу = Истина;
	КонецЕсли;

	РеквизитыДокументаЗакупки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументЗакупки, ИменаРеквизитовЗакупки);

	// Проверим является ли документ приемом на комиссию
	ДокументПриемаНаКомиссию = РеквизитыДокументаЗакупки.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПриемНаКомиссию;

	ИспользуетсяЦенообразование25 = ЦенообразованиеВызовСервера.ИспользуетсяЦенообразование25(РеквизитыДокументаЗакупки.Дата);

	// Заполним массив необходимых проверок в зависимости от типа документа

	МассивПроверок  = Новый Массив();

	Если НЕ ЗначениеЗаполнено(РеквизитыДокументаЗакупки.Соглашение) Тогда

#Удаление
		ЕстьОтклоненияОтЦеновыхУсловий = Истина;
		ЕстьОтклоненияОтФинансовыхУсловий = Истина;
		ЕстьОтклоненияОтЛогистическихУсловий= Истина;
#КонецУдаления

		УстановитьПривилегированныйРежим(Ложь);
		Возврат;

	КонецЕсли;

	МассивПроверок.Добавить("ВременнаяТаблицаДокументЗакупки");
	МассивПроверок.Добавить("ВременнаяТаблицаТовары");
	МассивПроверок.Добавить("ВременнаяТаблицаКурсыВалют");
	МассивПроверок.Добавить("ВременнаяТаблицаСкладыКорректныеПоСоглашению");

	МассивПроверок.Добавить("СоответствиеШапкиУсловиямЗакупок");
	МассивПроверок.Добавить("СоответствиеТоваровУсловиямЗакупок");

	Если ИспользоватьРучныеСкидки И НЕ ДокументПриемаНаКомиссию Тогда
		МассивПроверок.Добавить("ДопустимостьРучныхСкидокНаценок");
	КонецЕсли;

	Если ПроверятьДиапазонЦен Тогда
		Если ИспользуетсяЦенообразование25 Тогда
			МассивПроверок.Добавить("ВхождениеЦенВДопустимыйДиапазонПредварительнаяОбработка");
		КонецЕсли;
		МассивПроверок.Добавить("ВхождениеЦенВДопустимыйДиапазон");
	КонецЕсли;

	Если НЕ ДокументПриемаНаКомиссию И РеквизитыДокументаЗакупки.СуммаДокумента <> 0 Тогда

		МассивПроверок.Добавить("ВременнаяТаблицаЭтапыГрафикаОплаты");
		МассивПроверок.Добавить("КорректностьЭтаповГрафикаОплаты");

	КонецЕсли;

	Если ИмяТаблицы = "Документ.ЗаказПоставщику" 
		ИЛИ ИмяТаблицы = "Документ.ПриобретениеТоваровУслуг" Тогда 
		СоглашениеУказано = ЗначениеЗаполнено(РеквизитыДокументаЗакупки.Соглашение);
		Если СоглашениеУказано Тогда
			МассивПроверок.Добавить("КорректностьУказанияСтавкиНДС");
		КонецЕсли;
	КонецЕсли;		


	ТребуетсяЗалогЗаТару = ?(ЗаполнятьЗалогЗаТаруПоДокументу, РеквизитыДокументаЗакупки.ТребуетсяЗалогЗаТару, Ложь);

	// Сформируем запрос проверки

	ТекстЗапроса = "";
	ПараметрыЗапроса = Новый Структура();

	ПараметрыЗапроса.Вставить("Дата", РеквизитыДокументаЗакупки.Дата);
	ПараметрыЗапроса.Вставить("ВозвратМногооборотнойТары",РеквизитыДокументаЗакупки.ВернутьМногооборотнуюТару);
	ПараметрыЗапроса.Вставить("ТребуетсяЗалогЗаТару", ТребуетсяЗалогЗаТару);
	ПараметрыЗапроса.Вставить("БазоваяВалюта", ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(РеквизитыДокументаЗакупки.Организация));
	ПараметрыЗапроса.Вставить("СтранаРегистрации", ЗначениеНастроекКлиентСерверПовтИсп.СтранаРегистрацииОрганизации(РеквизитыДокументаЗакупки.Организация));

	Для Каждого ТекЭлемент Из МассивПроверок Цикл

		Если ТекЭлемент = "ВременнаяТаблицаДокументЗакупки" Тогда

			СформироватьЗапросВременнаяТаблицаШапкаДокументаЗакупки(ТекстЗапроса, ПараметрыЗапроса, ДокументЗакупки);

		ИначеЕсли ТекЭлемент = "ВременнаяТаблицаТовары" Тогда

			СформироватьЗапросВременнаяТаблицаТоварыДокументаЗакупки(ТекстЗапроса, ПараметрыЗапроса, ДокументЗакупки, ИмяТаблицы);

		ИначеЕсли ТекЭлемент = "ВременнаяТаблицаКурсыВалют" Тогда

			СформироватьЗапросВременнаяТаблицаКурсыВалют(ТекстЗапроса);

		ИначеЕсли ТекЭлемент = "ВременнаяТаблицаСкладыКорректныеПоСоглашению" Тогда

			СформироватьЗапросВременнаяТаблицаСкладыКорректныеПоСоглашению(ТекстЗапроса);

		ИначеЕсли ТекЭлемент = "СоответствиеШапкиУсловиямЗакупок" Тогда

			СформироватьЗапросШапкаДокументаЗакупки(ТекстЗапроса, ИмяТаблицы);

		ИначеЕсли ТекЭлемент = "ВременнаяТаблицаЭтапыГрафикаОплаты" Тогда

			СформироватьЗапросВременнаяТаблицаЭтапыОплаты(ТекстЗапроса, ПараметрыЗапроса, ДокументЗакупки);

		ИначеЕсли ТекЭлемент = "СоответствиеТоваровУсловиямЗакупок" Тогда

			СформироватьЗапросТоварыДокументаЗакупки(ТекстЗапроса);

		ИначеЕсли ТекЭлемент = "ВхождениеЦенВДопустимыйДиапазон" Тогда

			Если ИспользуетсяЦенообразование25 Тогда
				СформироватьЗапросВхождениеЦенВДопустимыйДиапазон2_5(ТекстЗапроса);
			Иначе
				СформироватьЗапросВхождениеЦенВДопустимыйДиапазон(ТекстЗапроса);
			КонецЕсли;

		ИначеЕсли ТекЭлемент = "ДопустимостьРучныхСкидокНаценок" Тогда

			СформироватьЗапросДопустимостьРучныхСкидокНаценок(ТекстЗапроса);

		ИначеЕсли  ТекЭлемент = "КорректностьЗаполненияСклада" Тогда

			СформироватьЗапросКорректностьЗаполненияСклада(ТекстЗапроса);

		ИначеЕсли ТекЭлемент = "КорректностьЭтаповГрафикаОплаты" Тогда

			СформироватьЗапросКорректностьЭтаповГрафикаОплаты(ТекстЗапроса);

		ИначеЕсли ТекЭлемент = "КорректностьУказанияСтавкиНДС" Тогда

			СформироватьЗапросКорректностьУказанияСтавкиНДСЗакупки(ТекстЗапроса);

		КонецЕсли;

	КонецЦикла;

	Если Не ЗначениеЗаполнено(ТекстЗапроса) Тогда

#Удаление
		ЕстьОтклоненияОтЦеновыхУсловий = Истина;
		ЕстьОтклоненияОтФинансовыхУсловий = Истина;
		ЕстьОтклоненияОтЛогистическихУсловий= Истина;
#КонецУдаления

		УстановитьПривилегированныйРежим(Ложь);
		Возврат;

	КонецЕсли;

	Запрос = Новый Запрос(ТекстЗапроса);

	Для Каждого ПараметрЗапроса Из ПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(ПараметрЗапроса.Ключ,ПараметрЗапроса.Значение);
	КонецЦикла;

	МассивРезультатов = Запрос.ВыполнитьПакет(); 

	// Определим результаты проверки для каждого результата запроса

	Для ТекИндекс = 0 По МассивРезультатов.Количество()-1 Цикл

		// Если имеются отклонения от всех проверяемых условий, дальнейшая проверка не требуется.
		Если ЕстьОтклоненияОтЦеновыхУсловий И 
			ЕстьОтклоненияОтФинансовыхУсловий И 
			ЕстьОтклоненияОтЛогистическихУсловий Тогда
			Прервать;
		КонецЕсли;

		ТекЭлемент = МассивПроверок[ТекИндекс];
		Выборка = МассивРезультатов[ТекИндекс].Выбрать();

		Если ТекЭлемент = "СоответствиеШапкиУсловиямЗакупок" Тогда

			Пока Выборка.Следующий() Цикл
				Если ЕстьОтклоненияОтЦеновыхУсловий И ЕстьОтклоненияОтЛогистическихУсловий И ЕстьОтклоненияОтФинансовыхУсловий Тогда
					Прервать;
				КонецЕсли;
				Если Выборка.ЕстьОшибкиЗаполненияВалюта // Валюта не должна отличаться от значения в соглашении
					ИЛИ Выборка.ЕстьОшибкиЗаполненияЦенаВключаетНДС Тогда // Признак ""Цена включает НДС"" не должен отличаться от значения в соглашении
#Удаление
					ЕстьОтклоненияОтЦеновыхУсловий = Истина;
#КонецУдаления
				КонецЕсли;
				Если Выборка.ЕстьОшибкиЗаполненияСклад Тогда // Склад не должен отличаться от значения в соглашении
#Удаление
					ЕстьОтклоненияОтЛогистическихУсловий = Истина;
#КонецУдаления
				КонецЕсли;
				Если Выборка.ЕстьОшибкиЗаполненияФормаОплаты Тогда // ФормаОплаты не должна отличаться от значения в соглашении
					ЕстьОтклоненияОтФинансовыхУсловий = Истина;
				КонецЕсли;
			КонецЦикла;

		ИначеЕсли ТекЭлемент = "СоответствиеТоваровУсловиямЗакупок" Тогда

			Пока Выборка.Следующий() Цикл
				Если ЕстьОтклоненияОтЦеновыхУсловий Тогда
					Прервать;
				КонецЕсли;
				Если Выборка.ЕстьОшибкиМаксимальноДопустимаяЦена Тогда // Цена не должна превышать максимально допустимую 
					
#Удаление
					ЕстьОтклоненияОтЦеновыхУсловий = Истина;
#КонецУдаления
					Прервать;
				КонецЕсли;
			КонецЦикла;

		ИначеЕсли ТекЭлемент = "ВхождениеЦенВДопустимыйДиапазон" Тогда

			Пока Выборка.Следующий() Цикл
				Если ЕстьОтклоненияОтЦеновыхУсловий Тогда
					Прервать;
				КонецЕсли;
				Если Выборка.ЕстьОшибкиМаксимальноДопустимаяЦена Тогда
#Удаление
					ЕстьОтклоненияОтЦеновыхУсловий = Истина;
#КонецУдаления
					Прервать;
				КонецЕсли;
			КонецЦикла;

		ИначеЕсли ТекЭлемент = "ДопустимостьРучныхСкидокНаценок" Тогда

			Пока Выборка.Следующий() Цикл
				Если ЕстьОтклоненияОтЦеновыхУсловий Тогда
					Прервать;
				КонецЕсли;
				Если Выборка.ЕстьОшибкиЗаполненияРучнойНаценки Тогда
#Удаление
					ЕстьОтклоненияОтЦеновыхУсловий = Истина;
#КонецУдаления
					Прервать;
				КонецЕсли;
			КонецЦикла;

		ИначеЕсли ТекЭлемент = "КорректностьЭтаповГрафикаОплаты" Тогда

			ГрафикПоУмолчанию = Новый ТаблицаЗначений();
			ГрафикПоУмолчанию.Колонки.Добавить("ВариантОплаты");
			ГрафикПоУмолчанию.Колонки.Добавить("ВариантОтсчета");
			ГрафикПоУмолчанию.Колонки.Добавить("ДатаПлатежа");
			ГрафикПоУмолчанию.Колонки.Добавить("ПроцентПлатежа");
			ГрафикПоУмолчанию.Колонки.Добавить("СуммаПлатежа");
			ГрафикПоУмолчанию.Колонки.Добавить("ПроцентЗалогаЗаТару");
			ГрафикПоУмолчанию.Колонки.Добавить("СуммаЗалогаЗаТару");
			ГрафикПоУмолчанию.Колонки.Добавить("Сдвиг");

			Если Выборка.Следующий() 
				И НЕ Выборка.НакладнаяПоЗаказам Тогда
				ПараметрыЗаполнения = ЭтапыОплатыСервер.ПараметрыЗаполненияЭтаповОплаты();
				ПараметрыЗаполнения.ЭтоРасчетыСКлиентами = Ложь;
				ПараметрыЗаполнения.НакладнаяПоЗаказам   = Ложь;
				ПараметрыЗаполнения.ПорядокРасчетов      = Выборка.ПорядокРасчетов;
				ПараметрыЗаполнения.ЭтоЗаказ             = Выборка.ЭтоЗаказ;
				ПараметрыЗаполнения.ДатаЗаказа           = ?(Выборка.ЭтоЗаказ,Выборка.Дата,Дата(1,1,1));
				ПараметрыЗаполнения.ДатаСогласования     = Выборка.ДатаСогласования;
				ПараметрыЗаполнения.ЕстьДатаПереходаПраваСобственности = Ложь;
				Если Выборка.НеОтгружатьЧастями Тогда
					ПараметрыЗаполнения.ДатаОтгрузки = Выборка.ДатаОтгрузки;
					ЕстьЗалог = Ложь;
				Иначе
					ТаблицаТовары = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ДокументЗакупки).СуммыПоЗаказам(ДокументЗакупки);
					ПараметрыЗаполнения.ДатаОтгрузки = ТаблицаТовары;
					ЕстьЗалог = ТаблицаТовары.Итог("СуммаЗалогаЗаТару") <> 0;
				КонецЕсли;
				ПараметрыЗаполнения.Соглашение        = Выборка.Соглашение;
				ПараметрыЗаполнения.СуммаЗалогаЗаТару = ?(ЕстьЗалог,100,0);
				ПараметрыЗаполнения.СуммаОплаты       = 100;
				ЭтапыОплатыСервер.ЗаполнитьЭтапыОплаты(ГрафикПоУмолчанию, ПараметрыЗаполнения);
			КонецЕсли;

			СуммаПроцентовПлатежа = 0;
			СуммаПроцентовПлатежаШаблона = 0;

			Выборка.Сбросить();
			сч = 0;

			Пока Выборка.Следующий() Цикл

				Если ЕстьОтклоненияОтФинансовыхУсловий Тогда
					Прервать;
				КонецЕсли;

				Если Не Выборка.ЕстьОшибкиЗаполненияЭтапыГрафикаОплаты Тогда// В документе не заполнено соглашение или сумма документа равна 0
					Прервать;
				КонецЕсли;

				СтрокаГрафикаПоУмолчанию = ГрафикПоУмолчанию[сч];

				Если СтрокаГрафикаПоУмолчанию.ДатаПлатежа > Выборка.ДатаПлатежа Тогда // Дата платежа должна быть не меньше, чем в графике оплаты
					ЕстьОтклоненияОтФинансовыхУсловий = Истина;
					Прервать;
				КонецЕсли;

				СуммаПроцентовПлатежаШаблона = СуммаПроцентовПлатежаШаблона + СтрокаГрафикаПоУмолчанию.ПроцентПлатежа;
				СуммаПроцентовПлатежа = СуммаПроцентовПлатежа + Выборка.ПроцентПлатежа;

				Если СуммаПроцентовПлатежа > СуммаПроцентовПлатежаШаблона Тогда // Проценты до следующего платежа по графику не должны превышать проценты по графику соглашения

					ЕстьОтклоненияОтФинансовыхУсловий = Истина;
					Прервать;
				КонецЕсли;

			КонецЦикла;

		ИначеЕсли МассивПроверок[ТекИндекс] = "КорректностьУказанияСтавкиНДС" Тогда

			Пока Выборка.Следующий() Цикл
#Удаление
				ЕстьОтклоненияОтЦеновыхУсловий = Истина;
#КонецУдаления
			КонецЦикла;

		КонецЕсли;

	КонецЦикла;

	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры
