Функция ЕстьДоизготовления(ИТБК_АктИзготовления)   Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ первые 1 
		|	ВнутреннееПотребление.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ВнутреннееПотребление КАК ВнутреннееПотребление
		|ГДЕ
		|	ВнутреннееПотребление.ИТБК_ЭтоДоизготовление
		|	И ВнутреннееПотребление.ИТБК_АктИзготовления = &ИТБК_АктИзготовления
		|	И не ВнутреннееПотребление.ПометкаУдаления ";
	
	Запрос.УстановитьПараметр("ИТБК_АктИзготовления", ИТБК_АктИзготовления);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ЕстьДоизготовления = ВыборкаДетальныеЗаписи.Следующий();
	
	Если ЕстьДоизготовления тогда 
		Сообщить("По " + ИТБК_АктИзготовления + " есть доизготовления");
	КонецЕсли;
	
	Возврат  ЕстьДоизготовления;

КонецФункции // ЕстьДоизготовления()
