
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТекстОбщегоЗапроса(ИсточникДанных, ТолькоРазрешенные) Экспорт
	
	ТекстЗапроса = ЗарплатаКадрыОбщиеНаборыДанныхБазовый.ПолучитьТекстОбщегоЗапроса(ИсточникДанных, ТолькоРазрешенные);
	
	Если ВРег(ИсточникДанных) = ВРег("НачисленияУдержания") Тогда
		ДополнитьТекстЗапросаНачисленияУдержанияЗначениямиПоказателей(ТекстЗапроса);
	ИначеЕсли ВРег(ИсточникДанных) = ВРег("НачисленияУдержанияСтатистикаПерсонала") Тогда
		
		ТекстЗапроса = ЗапросНачисленияДляСтатистики();
		
		// Расширение набора данных кадровыми данными ВидДоговора
		ДополнительныеПоляКадровыхДанныхСотрудников = ЗарплатаКадрыОбщиеНаборыДанных.ПустаяТаблицаДополнительныхПолейПредставлений();
		
		СтрокаДополнительногоПоля = ДополнительныеПоляКадровыхДанныхСотрудников.Добавить();
		СтрокаДополнительногоПоля.ИмяПоля = "ВидДоговора";
		СтрокаДополнительногоПоля.ПустоеЗначениеНаЯзыкеЗапросов = "ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровССотрудниками.ПустаяСсылка)";
		
		ОписаниеПредставлений = Новый Структура("Представления_КадровыеДанныеСотрудниковАнализНачисленийИУдержаний", ДополнительныеПоляКадровыхДанныхСотрудников);
		ЗарплатаКадрыОбщиеНаборыДанных.ВывестиДополнительныеПоляПредставленийВТекстЗапроса(ТекстЗапроса, ОписаниеПредставлений);
		
	ИначеЕсли ВРег(ИсточникДанных) = ВРег("НачисленияУдержанияАвансом") Тогда
		
		ТекстЗапроса = 
			"ВЫБРАТЬ
			|	ДАТАВРЕМЯ(1, 1, 1) КАК Период
			|ПОМЕСТИТЬ Представления_Периоды
			|ГДЕ
			|	""НачалоИнтервала"" = &НачалоПериода
			|	И ""ОкончаниеИнтервала"" = &КонецПериода
			|	И ""Периодичность"" = ""МЕСЯЦ""
			|	И ""ИспользоватьКонецПериода"" = ЛОЖЬ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВзаиморасчетыССотрудниками.Сотрудник КАК Сотрудник,
			|	ВзаиморасчетыССотрудниками.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ВзаиморасчетыССотрудниками.СтатьяФинансирования КАК СтатьяФинансирования,
			|	ВзаиморасчетыССотрудниками.СтатьяРасходов КАК СтатьяРасходов,
			|	ВзаиморасчетыССотрудниками.Организация КАК Организация,
			|	ВзаиморасчетыССотрудниками.Подразделение КАК Подразделение,
			|	ВзаиморасчетыССотрудниками.СуммаВзаиморасчетовНачальныйОстаток КАК НачальныйОстаток,
			|	ВзаиморасчетыССотрудниками.СуммаВзаиморасчетовКонечныйОстаток КАК КонечныйОстаток,
			|	ВзаиморасчетыССотрудниками.Период КАК Период,
			|	НЕОПРЕДЕЛЕНО КАК Группа
			|ПОМЕСТИТЬ ВТОстаткиИОборотыВзаиморасчетыССотрудниками
			|ИЗ
			|	РегистрНакопления.ВзаиморасчетыССотрудниками.ОстаткиИОбороты(&НачалоПериода {(&НачалоПериода)}, &КонецПериода {(&КонецПериода)}, Месяц, , {(Сотрудник), (ФизическоеЛицо), (Организация)}) КАК ВзаиморасчетыССотрудниками
			|{ГДЕ
			|	ВзаиморасчетыССотрудниками.Организация.*,
			|	ВзаиморасчетыССотрудниками.Сотрудник.*,
			|	ВзаиморасчетыССотрудниками.ФизическоеЛицо.*,
			|	ВзаиморасчетыССотрудниками.СтатьяФинансирования.*,
			|	ВзаиморасчетыССотрудниками.СтатьяРасходов.*,
			|	ВзаиморасчетыССотрудниками.Подразделение.*,
			|	(НЕОПРЕДЕЛЕНО) КАК Группа}
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НАЧАЛОПЕРИОДА(НачисленияИУдержания.Период, МЕСЯЦ) КАК МесяцНачисления,
			|	НачисленияИУдержания.Период КАК Период,
			|	НачисленияИУдержания.ФизическоеЛицо КАК ФизическоеЛицо,
			|	НачисленияИУдержания.СтатьяФинансирования КАК СтатьяФинансирования,
			|	НачисленияИУдержания.СтатьяРасходов КАК СтатьяРасходов,
			|	НачисленияИУдержания.Подразделение КАК Подразделение,
			|	НачисленияИУдержания.ГруппаНачисленияУдержанияВыплаты КАК Группа,
			|	ВЫБОР
			|		КОГДА НЕ &ДетализироватьНачисленияПоСреднемуЗаработку
			|				И ТИПЗНАЧЕНИЯ(НачисленияИУдержания.НачислениеУдержание) = ТИП(ПланВидовРасчета.Начисления)
			|				И НачисленияИУдержания.НачислениеУдержание.ОсновнойВидРасчета <> ЗНАЧЕНИЕ(ПланВидовРасчета.Начисления.ПустаяСсылка)
			|			ТОГДА НачисленияИУдержания.НачислениеУдержание.ОсновнойВидРасчета
			|		ИНАЧЕ НачисленияИУдержания.НачислениеУдержание
			|	КОНЕЦ КАК ВидРасчета,
			|	СУММА(НачисленияИУдержания.Сумма) КАК Сумма,
			|	НачисленияИУдержания.Организация КАК Организация,
			|	НачисленияИУдержания.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
			|	НачисленияИУдержания.Сотрудник КАК Сотрудник,
			|	НачисленияИУдержания.ДатаНачала КАК ДатаНачала,
			|	НачисленияИУдержания.ДатаОкончания КАК ДатаОкончания,
			|	ВЫРАЗИТЬ(НачисленияИУдержания.Сотрудник КАК Справочник.Сотрудники).ГоловнойСотрудник КАК ГоловнойСотрудник,
			|	НачисленияИУдержания.ПериодДействия КАК ПериодДействия,
			|	НачисленияИУдержания.Регистратор КАК Регистратор,
			|	НачисленияИУдержания.ИдентификаторСтроки КАК ИдентификаторСтроки,
			|	НачисленияИУдержания.Сторно КАК Сторно
			|ПОМЕСТИТЬ ВТНачисленияИУдержанияБезКадровыхДанных
			|ИЗ
			|	РегистрНакопления.НачисленияУдержанияПоСотрудникамАвансом КАК НачисленияИУдержания
			|ГДЕ
			|	НачисленияИУдержания.Период МЕЖДУ &НачалоПериода И &КонецПериода
			|{ГДЕ
			|	НачисленияИУдержания.Сотрудник.*,
			|	НачисленияИУдержания.ФизическоеЛицо.*,
			|	НачисленияИУдержания.Организация.*,
			|	НачисленияИУдержания.Сотрудник.ГоловнойСотрудник.* КАК ГоловнойСотрудник}
			|
			|СГРУППИРОВАТЬ ПО
			|	НачисленияИУдержания.Период,
			|	НачисленияИУдержания.ФизическоеЛицо,
			|	НачисленияИУдержания.СтатьяФинансирования,
			|	НачисленияИУдержания.СтатьяРасходов,
			|	НачисленияИУдержания.Подразделение,
			|	НачисленияИУдержания.ГруппаНачисленияУдержанияВыплаты,
			|	НачисленияИУдержания.Организация,
			|	НачисленияИУдержания.Сотрудник,
			|	НачисленияИУдержания.ДатаНачала,
			|	НачисленияИУдержания.ДатаОкончания,
			|	ВЫРАЗИТЬ(НачисленияИУдержания.Сотрудник КАК Справочник.Сотрудники).ГоловнойСотрудник,
			|	НачисленияИУдержания.Регистратор,
			|	НАЧАЛОПЕРИОДА(НачисленияИУдержания.Период, МЕСЯЦ),
			|	НачисленияИУдержания.ПериодДействия,
			|	НачисленияИУдержания.ИдентификаторСтроки,
			|	НачисленияИУдержания.Сторно,
			|	НачисленияИУдержания.Организация.ГоловнаяОрганизация,
			|	ВЫБОР
			|		КОГДА НЕ &ДетализироватьНачисленияПоСреднемуЗаработку
			|				И ТИПЗНАЧЕНИЯ(НачисленияИУдержания.НачислениеУдержание) = ТИП(ПланВидовРасчета.Начисления)
			|				И НачисленияИУдержания.НачислениеУдержание.ОсновнойВидРасчета <> ЗНАЧЕНИЕ(ПланВидовРасчета.Начисления.ПустаяСсылка)
			|			ТОГДА НачисленияИУдержания.НачислениеУдержание.ОсновнойВидРасчета
			|		ИНАЧЕ НачисленияИУдержания.НачислениеУдержание
			|	КОНЕЦ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ВзаиморасчетыССотрудниками.Организация КАК Организация,
			|	ВзаиморасчетыССотрудниками.Сотрудник КАК Сотрудник,
			|	ВзаиморасчетыССотрудниками.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ВзаиморасчетыССотрудниками.СтатьяФинансирования КАК СтатьяФинансирования,
			|	ВзаиморасчетыССотрудниками.СтатьяРасходов КАК СтатьяРасходов,
			|	ВзаиморасчетыССотрудниками.Подразделение КАК Подразделение,
			|	КОНЕЦПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) КАК Период
			|ПОМЕСТИТЬ ВТВсеСотрудникиСПериодом
			|ИЗ
			|	ВТОстаткиИОборотыВзаиморасчетыССотрудниками КАК ВзаиморасчетыССотрудниками
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	НачисленияИУдержания.Организация,
			|	НачисленияИУдержания.Сотрудник,
			|	НачисленияИУдержания.ФизическоеЛицо,
			|	НачисленияИУдержания.СтатьяФинансирования,
			|	НачисленияИУдержания.СтатьяРасходов,
			|	НачисленияИУдержания.Подразделение,
			|	КОНЕЦПЕРИОДА(НачисленияИУдержания.Период, МЕСЯЦ)
			|ИЗ
			|	ВТНачисленияИУдержанияБезКадровыхДанных КАК НачисленияИУдержания
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	НачисленияИУдержания.Организация,
			|	НачисленияИУдержания.Сотрудник,
			|	НачисленияИУдержания.ФизическоеЛицо,
			|	НачисленияИУдержания.СтатьяФинансирования,
			|	НачисленияИУдержания.СтатьяРасходов,
			|	НачисленияИУдержания.Подразделение,
			|	НачисленияИУдержания.ПериодДействия
			|ИЗ
			|	ВТНачисленияИУдержанияБезКадровыхДанных КАК НачисленияИУдержания
			|ГДЕ
			|	НачисленияИУдержания.ПериодДействия <> ДАТАВРЕМЯ(1, 1, 1)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ОстаткиИОбороты.Организация КАК Организация,
			|	ОстаткиИОбороты.Сотрудник КАК Сотрудник,
			|	ОстаткиИОбороты.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ОстаткиИОбороты.Подразделение КАК Подразделение,
			|	ОстаткиИОбороты.СтатьяФинансирования КАК СтатьяФинансирования,
			|	ОстаткиИОбороты.СтатьяРасходов КАК СтатьяРасходов,
			|	ОстаткиИОбороты.Период КАК Период
			|ПОМЕСТИТЬ ВТВсеПериодомКадровыхДанных
			|ИЗ
			|	ВТВсеСотрудникиСПериодом КАК ОстаткиИОбороты
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ОстаткиИОбороты.Организация,
			|	ОстаткиИОбороты.Сотрудник,
			|	ОстаткиИОбороты.ФизическоеЛицо,
			|	ОстаткиИОбороты.Подразделение,
			|	ОстаткиИОбороты.СтатьяФинансирования,
			|	ОстаткиИОбороты.СтатьяРасходов,
			|	Месяцы.Период
			|ИЗ
			|	ВТВсеСотрудникиСПериодом КАК ОстаткиИОбороты
			|		ЛЕВОЕ СОЕДИНЕНИЕ Представления_Периоды КАК Месяцы
			|		ПО (ИСТИНА)
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ОстаткиИОбороты.Организация,
			|	ОстаткиИОбороты.Сотрудник,
			|	ОстаткиИОбороты.ФизическоеЛицо,
			|	ОстаткиИОбороты.Подразделение,
			|	ОстаткиИОбороты.СтатьяФинансирования,
			|	ОстаткиИОбороты.СтатьяРасходов,
			|	КОНЕЦПЕРИОДА(Месяцы.Период, МЕСЯЦ)
			|ИЗ
			|	ВТВсеСотрудникиСПериодом КАК ОстаткиИОбороты
			|		ЛЕВОЕ СОЕДИНЕНИЕ Представления_Периоды КАК Месяцы
			|		ПО (ИСТИНА)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ОстаткиИОбороты.Организация КАК Организация,
			|	ОстаткиИОбороты.Сотрудник КАК Сотрудник,
			|	ОстаткиИОбороты.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ОстаткиИОбороты.Подразделение КАК Подразделение,
			|	ОстаткиИОбороты.СтатьяФинансирования КАК СтатьяФинансирования,
			|	ОстаткиИОбороты.СтатьяРасходов КАК СтатьяРасходов,
			|	Месяцы.Период КАК Месяц
			|ПОМЕСТИТЬ ВТСотрудникиМесяцы
			|ИЗ
			|	ВТВсеСотрудникиСПериодом КАК ОстаткиИОбороты
			|		ЛЕВОЕ СОЕДИНЕНИЕ Представления_Периоды КАК Месяцы
			|		ПО (ИСТИНА)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДАТАВРЕМЯ(1, 1, 1) КАК Период,
			|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ФизическоеЛицо,
			|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) КАК Сотрудник,
			|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) КАК ГоловнойСотрудник,
			|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация,
			|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК ГоловнаяОрганизация,
			|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК Подразделение,
			|	ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка) КАК Должность,
			|	ЗНАЧЕНИЕ(Справочник.РазрядыКатегорииДолжностей.ПустаяСсылка) КАК РазрядКатегория,
			|	ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ПустаяСсылка) КАК ВидЗанятости,
			|	"""" КАК ФИОПолные,
			|	"""" КАК ФамилияИО,
			|	"""" КАК Фамилия,
			|	"""" КАК Имя,
			|	"""" КАК Отчество,
			|	0 КАК ТарифнаяСтавка,
			|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаУвольнения,
			|	0 КАК ПриоритетРабочегоМеста
			|ПОМЕСТИТЬ Представления_КадровыеДанныеСотрудниковАнализНачисленийИУдержаний
			|ГДЕ
			|	""ТолькоРазрешенные"" = ИСТИНА
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ДАТАВРЕМЯ(1, 1, 1) КАК Период,
			|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ФизическоеЛицо,
			|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК ГоловнаяОрганизация,
			|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК ОрганизацияСортировки,
			|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеСортировки
			|ПОМЕСТИТЬ Представления_ПодразделенияСортировкиСотрудников
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СотрудникиМесяцы.Организация КАК Организация,
			|	СотрудникиМесяцы.Сотрудник КАК Сотрудник,
			|	СотрудникиМесяцы.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СотрудникиМесяцы.СтатьяФинансирования КАК СтатьяФинансирования,
			|	СотрудникиМесяцы.СтатьяРасходов КАК СтатьяРасходов,
			|	СотрудникиМесяцы.Подразделение КАК Подразделение,
			|	СотрудникиМесяцы.Месяц КАК Месяц,
			|	МАКСИМУМ(ОстаткиИОбороты.Период) КАК ПоследнийМесяцОстатков
			|ПОМЕСТИТЬ ВТСотрудникиМесяцыОстатков
			|ИЗ
			|	ВТСотрудникиМесяцы КАК СотрудникиМесяцы
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиИОборотыВзаиморасчетыССотрудниками КАК ОстаткиИОбороты
			|		ПО СотрудникиМесяцы.Организация = ОстаткиИОбороты.Организация
			|			И СотрудникиМесяцы.Сотрудник = ОстаткиИОбороты.Сотрудник
			|			И СотрудникиМесяцы.ФизическоеЛицо = ОстаткиИОбороты.ФизическоеЛицо
			|			И СотрудникиМесяцы.Подразделение = ОстаткиИОбороты.Подразделение
			|			И СотрудникиМесяцы.СтатьяФинансирования = ОстаткиИОбороты.СтатьяФинансирования
			|			И СотрудникиМесяцы.СтатьяРасходов = ОстаткиИОбороты.СтатьяРасходов
			|			И СотрудникиМесяцы.Месяц >= ОстаткиИОбороты.Период
			|
			|СГРУППИРОВАТЬ ПО
			|	СотрудникиМесяцы.Организация,
			|	СотрудникиМесяцы.Сотрудник,
			|	СотрудникиМесяцы.ФизическоеЛицо,
			|	СотрудникиМесяцы.СтатьяФинансирования,
			|	СотрудникиМесяцы.СтатьяРасходов,
			|	СотрудникиМесяцы.Подразделение,
			|	СотрудникиМесяцы.Месяц
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СотрудникиМесяцыОстатков.Организация КАК Организация,
			|	СотрудникиМесяцыОстатков.Сотрудник КАК Сотрудник,
			|	СотрудникиМесяцыОстатков.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СотрудникиМесяцыОстатков.СтатьяФинансирования КАК СтатьяФинансирования,
			|	СотрудникиМесяцыОстатков.СтатьяРасходов КАК СтатьяРасходов,
			|	СотрудникиМесяцыОстатков.Подразделение КАК Подразделение,
			|	ЕСТЬNULL(ВЫБОР
			|			КОГДА СотрудникиМесяцыОстатков.Месяц = ОстаткиИОбороты.Период
			|				ТОГДА ОстаткиИОбороты.НачальныйОстаток
			|			ИНАЧЕ ОстаткиИОбороты.КонечныйОстаток
			|		КОНЕЦ, 0) КАК НачальныйОстаток,
			|	КОНЕЦПЕРИОДА(СотрудникиМесяцыОстатков.Месяц, МЕСЯЦ) КАК Период
			|ПОМЕСТИТЬ ВТСальдоВсеСотрудникиПериоды
			|ИЗ
			|	ВТСотрудникиМесяцыОстатков КАК СотрудникиМесяцыОстатков
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстаткиИОборотыВзаиморасчетыССотрудниками КАК ОстаткиИОбороты
			|		ПО СотрудникиМесяцыОстатков.Организация = ОстаткиИОбороты.Организация
			|			И СотрудникиМесяцыОстатков.Сотрудник = ОстаткиИОбороты.Сотрудник
			|			И СотрудникиМесяцыОстатков.ФизическоеЛицо = ОстаткиИОбороты.ФизическоеЛицо
			|			И СотрудникиМесяцыОстатков.Подразделение = ОстаткиИОбороты.Подразделение
			|			И СотрудникиМесяцыОстатков.СтатьяФинансирования = ОстаткиИОбороты.СтатьяФинансирования
			|			И СотрудникиМесяцыОстатков.СтатьяРасходов = ОстаткиИОбороты.СтатьяРасходов
			|			И СотрудникиМесяцыОстатков.ПоследнийМесяцОстатков = ОстаткиИОбороты.Период
			|ГДЕ
			|	НЕ ОстаткиИОбороты.НачальныйОстаток ЕСТЬ NULL
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПодразделенияСортировкиСотрудников.ОрганизацияСортировки КАК ОрганизацияСортировки,
			|	ПодразделенияСортировкиСотрудников.ПодразделениеСортировки КАК ПодразделениеСортировки,
			|	КадровыеДанныеСотрудниковНаКонецПериода.ПриоритетРабочегоМеста КАК ПриоритетРабочегоМеста,
			|	ВзаиморасчетыССотрудниками.Сотрудник КАК Сотрудник,
			|	ВЫРАЗИТЬ(ВзаиморасчетыССотрудниками.Сотрудник КАК Справочник.Сотрудники).ГоловнойСотрудник КАК ГоловнойСотрудник,
			|	КадровыеДанныеСотрудниковНаКонецПериода.Должность КАК ДолжностьГоловногоСотрудникаНаКонецПериода,
			|	КадровыеДанныеСотрудниковНаКонецПериода.РазрядКатегория КАК РазрядКатегорияГоловногоСотрудникаНаКонецПериода,
			|	КадровыеДанныеСотрудниковНаКонецПериода.Организация КАК ОрганизацияГоловногоСотрудникаНаКонецПериода,
			|	КадровыеДанныеСотрудниковНаКонецПериода.Подразделение КАК ПодразделениеГоловногоСотрудникаНаКонецПериода,
			|	КадровыеДанныеСотрудниковНаКонецПериода.ВидЗанятости КАК ВидЗанятостиГоловногоСотрудникаНаКонецПериода,
			|	ВзаиморасчетыССотрудниками.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ВзаиморасчетыССотрудниками.СтатьяФинансирования КАК СтатьяФинансирования,
			|	ВзаиморасчетыССотрудниками.СтатьяРасходов КАК СтатьяРасходов,
			|	ВзаиморасчетыССотрудниками.Организация КАК Организация,
			|	ВзаиморасчетыССотрудниками.Подразделение КАК Подразделение,
			|	ВзаиморасчетыССотрудниками.НачальныйОстаток КАК НачальныйОстаток,
			|	НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) КАК Период,
			|	КадровыеДанныеСотрудниковНаКонецПериода.Подразделение КАК ПодразделениеНаКонецПериода,
			|	КадровыеДанныеСотрудниковНаКонецПериода.ВидЗанятости КАК ВидЗанятостиНаКонецПериода,
			|	КадровыеДанныеСотрудников.ФИОПолные КАК ФИОПолные,
			|	КадровыеДанныеСотрудников.ФамилияИО КАК ФамилияИО,
			|	КадровыеДанныеСотрудников.Фамилия КАК Фамилия,
			|	КадровыеДанныеСотрудников.Имя КАК Имя,
			|	КадровыеДанныеСотрудников.Отчество КАК Отчество,
			|	КадровыеДанныеСотрудников.Должность КАК Должность,
			|	КадровыеДанныеСотрудников.РазрядКатегория КАК РазрядКатегория,
			|	КадровыеДанныеСотрудниковНаКонецПериода.Должность КАК ДолжностьНаКонецПериода,
			|	КадровыеДанныеСотрудниковНаКонецПериода.РазрядКатегория КАК РазрядКатегорияНаКонецПериода,
			|	КадровыеДанныеСотрудниковНаКонецПериода.ТарифнаяСтавка КАК ТарифнаяСтавка,
			|	КадровыеДанныеСотрудников.ВидЗанятости КАК ВидЗанятости,
			|	КадровыеДанныеСотрудников.ДатаУвольнения КАК ДатаУвольнения
			|ПОМЕСТИТЬ ВТСальдоПоРасчетамССотрудниками
			|ИЗ
			|	ВТСальдоВсеСотрудникиПериоды КАК ВзаиморасчетыССотрудниками
			|		{ЛЕВОЕ СОЕДИНЕНИЕ Представления_КадровыеДанныеСотрудниковАнализНачисленийИУдержаний КАК КадровыеДанныеСотрудниковНаКонецПериода
			|		ПО ВзаиморасчетыССотрудниками.Сотрудник = КадровыеДанныеСотрудниковНаКонецПериода.Сотрудник
			|			И (КОНЕЦПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) = КадровыеДанныеСотрудниковНаКонецПериода.Период)}
			|		{ЛЕВОЕ СОЕДИНЕНИЕ Представления_КадровыеДанныеСотрудниковАнализНачисленийИУдержаний КАК КадровыеДанныеСотрудников
			|		ПО ВзаиморасчетыССотрудниками.Сотрудник = КадровыеДанныеСотрудников.Сотрудник
			|			И ВзаиморасчетыССотрудниками.Период = КадровыеДанныеСотрудников.Период}
			|		{ЛЕВОЕ СОЕДИНЕНИЕ Представления_ПодразделенияСортировкиСотрудников КАК ПодразделенияСортировкиСотрудников
			|		ПО ВзаиморасчетыССотрудниками.ФизическоеЛицо = ПодразделенияСортировкиСотрудников.ФизическоеЛицо
			|			И ВзаиморасчетыССотрудниками.Организация.ГоловнаяОрганизация = ПодразделенияСортировкиСотрудников.ГоловнаяОрганизация
			|			И (КОНЕЦПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) = ПодразделенияСортировкиСотрудников.Период)}
			|ГДЕ
			|	ВзаиморасчетыССотрудниками.НачальныйОстаток <> 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	НачисленияИУдержания.Регистратор КАК Регистратор,
			|	НачисленияИУдержания.ВидРасчета КАК ВидРасчета,
			|	НачисленияИУдержания.ИдентификаторСтроки КАК ИдентификаторСтроки,
			|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи
			|ПОМЕСТИТЬ ВТНомераЗаписей
			|ИЗ
			|	ВТНачисленияИУдержанияБезКадровыхДанных КАК НачисленияИУдержания
			|
			|СГРУППИРОВАТЬ ПО
			|	НачисленияИУдержания.Регистратор,
			|	НачисленияИУдержания.ВидРасчета,
			|	НачисленияИУдержания.ИдентификаторСтроки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПодразделенияСортировкиСотрудников.ОрганизацияСортировки КАК ОрганизацияСортировки,
			|	ПодразделенияСортировкиСотрудников.ПодразделениеСортировки КАК ПодразделениеСортировки,
			|	КадровыеДанныеСотрудниковНаКонецПериода.ПриоритетРабочегоМеста КАК ПриоритетРабочегоМеста,
			|	НачисленияИУдержания.МесяцНачисления КАК МесяцНачисления,
			|	НачисленияИУдержания.ФизическоеЛицо КАК ФизическоеЛицо,
			|	НачисленияИУдержания.СтатьяФинансирования КАК СтатьяФинансирования,
			|	НачисленияИУдержания.СтатьяРасходов КАК СтатьяРасходов,
			|	НачисленияИУдержания.Подразделение КАК Подразделение,
			|	НачисленияИУдержания.Группа КАК Группа,
			|	НачисленияИУдержания.ВидРасчета КАК ВидРасчета,
			|	НачисленияИУдержания.Сумма КАК Сумма,
			|	НачисленияИУдержания.Организация КАК Организация,
			|	НачисленияИУдержания.Сотрудник КАК Сотрудник,
			|	НачисленияИУдержания.ДатаНачала КАК ДатаНачала,
			|	НачисленияИУдержания.ДатаОкончания КАК ДатаОкончания,
			|	НачисленияИУдержания.ГоловнойСотрудник КАК ГоловнойСотрудник,
			|	КадровыеДанныеГоловныхСотрудников.ФИОПолные КАК ФИОПолные,
			|	КадровыеДанныеГоловныхСотрудников.ФамилияИО КАК ФамилияИО,
			|	КадровыеДанныеГоловныхСотрудников.Фамилия КАК Фамилия,
			|	КадровыеДанныеГоловныхСотрудников.Имя КАК Имя,
			|	КадровыеДанныеГоловныхСотрудников.Отчество КАК Отчество,
			|	КадровыеДанныеГоловныхСотрудников.Должность КАК ДолжностьГоловногоСотрудникаНаКонецПериода,
			|	КадровыеДанныеГоловныхСотрудников.РазрядКатегория КАК РазрядКатегорияГоловногоСотрудникаНаКонецПериода,
			|	КадровыеДанныеГоловныхСотрудников.Организация КАК ОрганизацияГоловногоСотрудникаНаКонецПериода,
			|	КадровыеДанныеГоловныхСотрудников.Подразделение КАК ПодразделениеГоловногоСотрудникаНаКонецПериода,
			|	КадровыеДанныеГоловныхСотрудников.ВидЗанятости КАК ВидЗанятостиГоловногоСотрудникаНаКонецПериода,
			|	НачисленияИУдержания.ПериодДействия КАК ПериодДействия,
			|	НачисленияИУдержания.Регистратор КАК Регистратор,
			|	КадровыеДанныеСотрудниковНаКонецПериода.Подразделение КАК ПодразделениеНаКонецПериода,
			|	КадровыеДанныеСотрудниковНаКонецПериода.ВидЗанятости КАК ВидЗанятостиНаКонецПериода,
			|	КадровыеДанныеСотрудниковНаКонецПериода.Должность КАК ДолжностьНаКонецПериода,
			|	КадровыеДанныеСотрудниковНаКонецПериода.РазрядКатегория КАК РазрядКатегорияНаКонецПериода,
			|	КадровыеДанныеСотрудников.Должность КАК Должность,
			|	КадровыеДанныеСотрудников.РазрядКатегория КАК РазрядКатегория,
			|	КадровыеДанныеСотрудниковНаКонецПериода.ТарифнаяСтавка КАК ТарифнаяСтавкаНаКонецПериода,
			|	КадровыеДанныеСотрудников.ТарифнаяСтавка КАК ТарифнаяСтавка,
			|	КадровыеДанныеСотрудников.ВидЗанятости КАК ВидЗанятости,
			|	NULL КАК Показатель,
			|	0 КАК Значение,
			|	NULL КАК ПорядокПоказателей,
			|	ИСТИНА КАК ПервыйПоказатель,
			|	КадровыеДанныеГоловныхСотрудников.ДатаУвольнения КАК ДатаУвольнения,
			|	НачисленияИУдержания.ИдентификаторСтроки КАК ИдентификаторСтроки,
			|	НачисленияИУдержания.Сторно КАК Сторно,
			|	ВЫБОР
			|		КОГДА ТИПЗНАЧЕНИЯ(НачисленияИУдержания.ВидРасчета) = ТИП(ПланВидовРасчета.Начисления)
			|				ИЛИ ТИПЗНАЧЕНИЯ(НачисленияИУдержания.ВидРасчета) = ТИП(ПланВидовРасчета.Удержания)
			|			ТОГДА НачисленияИУдержания.ВидРасчета.РеквизитДопУпорядочивания * 10000000000000000 + ВЫБОР
			|					КОГДА &ВыводитьПериодыНачислений
			|						ТОГДА РАЗНОСТЬДАТ(ДАТАВРЕМЯ(2000, 1, 1), ВЫБОР
			|									КОГДА ЕСТЬNULL(НачисленияИУдержания.ДатаНачала, ДАТАВРЕМЯ(1, 1, 1)) < ДАТАВРЕМЯ(2000, 1, 1)
			|										ТОГДА ДАТАВРЕМЯ(2000, 1, 1)
			|									ИНАЧЕ НачисленияИУдержания.ДатаНачала
			|								КОНЕЦ, ДЕНЬ) * 100000000000 + РАЗНОСТЬДАТ(ДАТАВРЕМЯ(2000, 1, 1), ВЫБОР
			|									КОГДА ЕСТЬNULL(НачисленияИУдержания.ДатаОкончания, ДАТАВРЕМЯ(1, 1, 1)) < ДАТАВРЕМЯ(2000, 1, 1)
			|										ТОГДА ДАТАВРЕМЯ(2000, 1, 1)
			|									ИНАЧЕ НачисленияИУдержания.ДатаОкончания
			|								КОНЕЦ, ДЕНЬ) * 1000000
			|					ИНАЧЕ 0
			|				КОНЕЦ + ВЫБОР
			|					КОГДА &ВыводитьПоказателиНачисленийИУдержаний
			|							ИЛИ &ВыводитьВсеПоказателиНачисленийИУдержаний
			|						ТОГДА НомераЗаписей.НомерЗаписи
			|					ИНАЧЕ 0
			|				КОНЕЦ
			|		ИНАЧЕ НачисленияИУдержания.ВидРасчета.Порядок
			|	КОНЕЦ КАК ПриоритетВидаРасчета
			|ПОМЕСТИТЬ ВТНачисленияИУдержанияСКадровымиДанными
			|ИЗ
			|	ВТНачисленияИУдержанияБезКадровыхДанных КАК НачисленияИУдержания
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНомераЗаписей КАК НомераЗаписей
			|		ПО НачисленияИУдержания.Регистратор = НомераЗаписей.Регистратор
			|			И НачисленияИУдержания.ВидРасчета = НомераЗаписей.ВидРасчета
			|			И НачисленияИУдержания.ИдентификаторСтроки = НомераЗаписей.ИдентификаторСтроки
			|		{ЛЕВОЕ СОЕДИНЕНИЕ Представления_КадровыеДанныеСотрудниковАнализНачисленийИУдержаний КАК КадровыеДанныеСотрудниковНаКонецПериода
			|		ПО НачисленияИУдержания.Сотрудник = КадровыеДанныеСотрудниковНаКонецПериода.Сотрудник
			|			И (КОНЕЦПЕРИОДА(НачисленияИУдержания.Период, МЕСЯЦ) = КадровыеДанныеСотрудниковНаКонецПериода.Период)}
			|		{ЛЕВОЕ СОЕДИНЕНИЕ Представления_КадровыеДанныеСотрудниковАнализНачисленийИУдержаний КАК КадровыеДанныеСотрудников
			|		ПО НачисленияИУдержания.Сотрудник = КадровыеДанныеСотрудников.Сотрудник
			|			И (ВЫБОР
			|				КОГДА НачисленияИУдержания.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
			|					ТОГДА КОНЕЦПЕРИОДА(НачисленияИУдержания.Период, МЕСЯЦ)
			|				ИНАЧЕ НачисленияИУдержания.ДатаНачала
			|			КОНЕЦ = КадровыеДанныеСотрудников.Период)}
			|		{ЛЕВОЕ СОЕДИНЕНИЕ Представления_КадровыеДанныеСотрудниковАнализНачисленийИУдержаний КАК КадровыеДанныеГоловныхСотрудников
			|		ПО (ВЫРАЗИТЬ(НачисленияИУдержания.Сотрудник КАК Справочник.Сотрудники).ГоловнойСотрудник = КадровыеДанныеГоловныхСотрудников.Сотрудник)
			|			И (КОНЕЦПЕРИОДА(НачисленияИУдержания.Период, МЕСЯЦ) = КадровыеДанныеГоловныхСотрудников.Период)}
			|		{ЛЕВОЕ СОЕДИНЕНИЕ Представления_ПодразделенияСортировкиСотрудников КАК ПодразделенияСортировкиСотрудников
			|		ПО НачисленияИУдержания.ФизическоеЛицо = ПодразделенияСортировкиСотрудников.ФизическоеЛицо
			|			И (КОНЕЦПЕРИОДА(НачисленияИУдержания.Период, МЕСЯЦ) = ПодразделенияСортировкиСотрудников.Период)
			|			И НачисленияИУдержания.ГоловнаяОрганизация = ПодразделенияСортировкиСотрудников.ГоловнаяОрганизация}
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	НАЧАЛОПЕРИОДА(ОтработанноеВремя.Период, МЕСЯЦ) КАК МесяцНачисления,
			|	ОтработанноеВремя.ПериодДействия КАК ПериодДействия,
			|	ОтработанноеВремя.Регистратор КАК Регистратор,
			|	ОтработанноеВремя.Сотрудник КАК Сотрудник,
			|	ОтработанноеВремя.Подразделение КАК Подразделение,
			|	ОтработанноеВремя.Начисление КАК ВидРасчета,
			|	ОтработанноеВремя.ВремяВЧасах КАК ВремяВЧасах,
			|	ОтработанноеВремя.ДатаНачала КАК ДатаНачала,
			|	СУММА(ОтработанноеВремя.ОтработаноДней) КАК ОтработаноДней,
			|	СУММА(ОтработанноеВремя.ОтработаноЧасов) КАК ОтработаноЧасов,
			|	СУММА(ОтработанноеВремя.ОплаченоДней) КАК ОплаченоДней,
			|	СУММА(ОтработанноеВремя.ОплаченоЧасов) КАК ОплаченоЧасов,
			|	ОтработанноеВремя.ИдентификаторСтроки КАК ИдентификаторСтроки
			|ПОМЕСТИТЬ ВТОтработанноеВремяВПериодах
			|ИЗ
			|	РегистрНакопления.ОтработанноеВремяПоСотрудникамАвансом КАК ОтработанноеВремя
			|ГДЕ
			|	ОтработанноеВремя.Период МЕЖДУ &НачалоПериода И &КонецПериода
			|{ГДЕ
			|	ОтработанноеВремя.Сотрудник.*,
			|	ОтработанноеВремя.ФизическоеЛицо.*,
			|	ОтработанноеВремя.Организация.*,
			|	ОтработанноеВремя.Сотрудник.ГоловнойСотрудник.* КАК ГоловнойСотрудник}
			|
			|СГРУППИРОВАТЬ ПО
			|	ОтработанноеВремя.Регистратор,
			|	ОтработанноеВремя.Сотрудник,
			|	ОтработанноеВремя.Подразделение,
			|	ОтработанноеВремя.Начисление,
			|	НАЧАЛОПЕРИОДА(ОтработанноеВремя.Период, МЕСЯЦ),
			|	ОтработанноеВремя.ПериодДействия,
			|	ОтработанноеВремя.ВремяВЧасах,
			|	ОтработанноеВремя.ДатаНачала,
			|	ОтработанноеВремя.ИдентификаторСтроки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ОтработанноеВремя.МесяцНачисления КАК МесяцНачисления,
			|	ОтработанноеВремя.ПериодДействия КАК ПериодДействия,
			|	ОтработанноеВремя.Регистратор КАК Регистратор,
			|	ОтработанноеВремя.Сотрудник КАК Сотрудник,
			|	ОтработанноеВремя.Подразделение КАК Подразделение,
			|	ОтработанноеВремя.ВидРасчета КАК ВидРасчета,
			|	ОтработанноеВремя.ОтработаноДней КАК ОтработаноДней,
			|	ОтработанноеВремя.ОтработаноЧасов КАК ОтработаноЧасов,
			|	ОтработанноеВремя.ОплаченоДней КАК ОплаченоДней,
			|	ОтработанноеВремя.ОплаченоЧасов КАК ОплаченоЧасов,
			|	ОтработанноеВремя.ВремяВЧасах КАК ВремяВЧасах,
			|	ОтработанноеВремя.ДатаНачала КАК ДатаНачала,
			|	НачисленияИУдержания.СтатьяФинансирования КАК СтатьяФинансирования,
			|	НачисленияИУдержания.СтатьяРасходов КАК СтатьяРасходов,
			|	ОтработанноеВремя.ИдентификаторСтроки КАК ИдентификаторСтроки
			|ПОМЕСТИТЬ ВТОтработанноеВремяСНачислениями
			|ИЗ
			|	ВТОтработанноеВремяВПериодах КАК ОтработанноеВремя
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисленияИУдержанияБезКадровыхДанных КАК НачисленияИУдержания
			|		ПО (ОтработанноеВремя.МесяцНачисления = НАЧАЛОПЕРИОДА(НачисленияИУдержания.Период, МЕСЯЦ))
			|			И ОтработанноеВремя.Регистратор = НачисленияИУдержания.Регистратор
			|			И ОтработанноеВремя.Сотрудник = НачисленияИУдержания.Сотрудник
			|			И ОтработанноеВремя.Подразделение = НачисленияИУдержания.Подразделение
			|			И ОтработанноеВремя.ВидРасчета = НачисленияИУдержания.ВидРасчета
			|			И ОтработанноеВремя.ИдентификаторСтроки = НачисленияИУдержания.ИдентификаторСтроки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ОтработанноеВремя.МесяцНачисления КАК МесяцНачисления,
			|	ОтработанноеВремя.ПериодДействия КАК ПериодДействия,
			|	ОтработанноеВремя.Регистратор КАК Регистратор,
			|	ОтработанноеВремя.Сотрудник КАК Сотрудник,
			|	ОтработанноеВремя.Подразделение КАК Подразделение,
			|	ОтработанноеВремя.ВидРасчета КАК ВидРасчета,
			|	ОтработанноеВремя.ОтработаноДней КАК ОтработаноДней,
			|	ОтработанноеВремя.ОтработаноЧасов КАК ОтработаноЧасов,
			|	ОтработанноеВремя.ОплаченоДней КАК ОплаченоДней,
			|	ОтработанноеВремя.ОплаченоЧасов КАК ОплаченоЧасов,
			|	ОтработанноеВремя.ДатаНачала КАК ДатаНачала,
			|	ОтработанноеВремя.ВремяВЧасах КАК ВремяВЧасах,
			|	МИНИМУМ(ОтработанноеВремя.СтатьяФинансирования) КАК СтатьяФинансирования,
			|	ОтработанноеВремя.ИдентификаторСтроки КАК ИдентификаторСтроки
			|ПОМЕСТИТЬ ВТОтработанноеВремяСоСтатьейФинансирования
			|ИЗ
			|	ВТОтработанноеВремяСНачислениями КАК ОтработанноеВремя
			|
			|СГРУППИРОВАТЬ ПО
			|	ОтработанноеВремя.МесяцНачисления,
			|	ОтработанноеВремя.ПериодДействия,
			|	ОтработанноеВремя.Регистратор,
			|	ОтработанноеВремя.Сотрудник,
			|	ОтработанноеВремя.Подразделение,
			|	ОтработанноеВремя.ВидРасчета,
			|	ОтработанноеВремя.ОтработаноДней,
			|	ОтработанноеВремя.ОтработаноЧасов,
			|	ОтработанноеВремя.ОплаченоДней,
			|	ОтработанноеВремя.ОплаченоЧасов,
			|	ОтработанноеВремя.ДатаНачала,
			|	ОтработанноеВремя.ВремяВЧасах,
			|	ОтработанноеВремя.ИдентификаторСтроки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ОтработанноеВремя.МесяцНачисления КАК МесяцНачисления,
			|	ОтработанноеВремя.ПериодДействия КАК ПериодДействия,
			|	ОтработанноеВремя.Регистратор КАК Регистратор,
			|	ОтработанноеВремя.Сотрудник КАК Сотрудник,
			|	ОтработанноеВремя.Подразделение КАК Подразделение,
			|	ОтработанноеВремя.ВидРасчета КАК ВидРасчета,
			|	ОтработанноеВремя.ОтработаноДней КАК ОтработаноДней,
			|	ОтработанноеВремя.ОтработаноЧасов КАК ОтработаноЧасов,
			|	ОтработанноеВремя.ОплаченоДней КАК ОплаченоДней,
			|	ОтработанноеВремя.ОплаченоЧасов КАК ОплаченоЧасов,
			|	ОтработанноеВремя.ДатаНачала КАК ДатаНачала,
			|	ОтработанноеВремя.СтатьяФинансирования КАК СтатьяФинансирования,
			|	ОтработанноеВремя.ВремяВЧасах КАК ВремяВЧасах,
			|	МИНИМУМ(ОтработанноеВремя.СтатьяРасходов) КАК СтатьяРасходов,
			|	ОтработанноеВремя.ИдентификаторСтроки КАК ИдентификаторСтроки
			|ПОМЕСТИТЬ ВТОтработанноеВремя
			|ИЗ
			|	ВТОтработанноеВремяСНачислениями КАК ОтработанноеВремя
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтработанноеВремяСоСтатьейФинансирования КАК ОтработанноеВремяСоСтатьейФинансирования
			|		ПО ОтработанноеВремя.МесяцНачисления = ОтработанноеВремяСоСтатьейФинансирования.МесяцНачисления
			|			И ОтработанноеВремя.ПериодДействия = ОтработанноеВремяСоСтатьейФинансирования.ПериодДействия
			|			И ОтработанноеВремя.Регистратор = ОтработанноеВремяСоСтатьейФинансирования.Регистратор
			|			И ОтработанноеВремя.Сотрудник = ОтработанноеВремяСоСтатьейФинансирования.Сотрудник
			|			И ОтработанноеВремя.Подразделение = ОтработанноеВремяСоСтатьейФинансирования.Подразделение
			|			И ОтработанноеВремя.ВидРасчета = ОтработанноеВремяСоСтатьейФинансирования.ВидРасчета
			|			И ОтработанноеВремя.ДатаНачала = ОтработанноеВремяСоСтатьейФинансирования.ДатаНачала
			|			И ОтработанноеВремя.СтатьяФинансирования = ОтработанноеВремяСоСтатьейФинансирования.СтатьяФинансирования
			|			И ОтработанноеВремя.ВремяВЧасах = ОтработанноеВремяСоСтатьейФинансирования.ВремяВЧасах
			|
			|СГРУППИРОВАТЬ ПО
			|	ОтработанноеВремя.МесяцНачисления,
			|	ОтработанноеВремя.ПериодДействия,
			|	ОтработанноеВремя.Регистратор,
			|	ОтработанноеВремя.Сотрудник,
			|	ОтработанноеВремя.Подразделение,
			|	ОтработанноеВремя.ВидРасчета,
			|	ОтработанноеВремя.ОтработаноДней,
			|	ОтработанноеВремя.ОтработаноЧасов,
			|	ОтработанноеВремя.ОплаченоДней,
			|	ОтработанноеВремя.ОплаченоЧасов,
			|	ОтработанноеВремя.ДатаНачала,
			|	ОтработанноеВремя.СтатьяФинансирования,
			|	ОтработанноеВремя.ВремяВЧасах,
			|	ОтработанноеВремя.ИдентификаторСтроки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	МИНИМУМ(СальдоПоРасчетамССотрудниками.Период) КАК ПервыйМесяц,
			|	МАКСИМУМ(СальдоПоРасчетамССотрудниками.Период) КАК ПоследнийМесяц,
			|	СальдоПоРасчетамССотрудниками.Организация КАК Организация,
			|	СальдоПоРасчетамССотрудниками.Сотрудник КАК Сотрудник,
			|	СальдоПоРасчетамССотрудниками.ФизическоеЛицо КАК ФизическоеЛицо,
			|	СальдоПоРасчетамССотрудниками.Подразделение КАК Подразделение,
			|	СальдоПоРасчетамССотрудниками.СтатьяФинансирования КАК СтатьяФинансирования,
			|	СальдоПоРасчетамССотрудниками.СтатьяРасходов КАК СтатьяРасходов
			|ПОМЕСТИТЬ ВТПоследниеПервыеМесяцы
			|ИЗ
			|	ВТСальдоПоРасчетамССотрудниками КАК СальдоПоРасчетамССотрудниками
			|
			|СГРУППИРОВАТЬ ПО
			|	СальдоПоРасчетамССотрудниками.Организация,
			|	СальдоПоРасчетамССотрудниками.Сотрудник,
			|	СальдоПоРасчетамССотрудниками.ФизическоеЛицо,
			|	СальдоПоРасчетамССотрудниками.Подразделение,
			|	СальдоПоРасчетамССотрудниками.СтатьяФинансирования,
			|	СальдоПоРасчетамССотрудниками.СтатьяРасходов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ПодразделенияСортировкиСотрудников.ОрганизацияСортировки КАК ОрганизацияСортировки,
			|	ПодразделенияСортировкиСотрудников.ПодразделениеСортировки КАК ПодразделениеСортировки,
			|	КадровыеДанныеСотрудников.ПриоритетРабочегоМеста КАК ПриоритетРабочегоМеста,
			|	НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) КАК МесяцНачисления,
			|	ВзаиморасчетыССотрудниками.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ВзаиморасчетыССотрудниками.СтатьяФинансирования КАК СтатьяФинансирования,
			|	ВзаиморасчетыССотрудниками.СтатьяРасходов КАК СтатьяРасходов,
			|	ВзаиморасчетыССотрудниками.Подразделение КАК Подразделение,
			|	ВзаиморасчетыССотрудниками.ГруппаНачисленияУдержанияВыплаты КАК Группа,
			|	ВзаиморасчетыССотрудниками.ВидВзаиморасчетов КАК ВидРасчета,
			|	ВЫБОР
			|		КОГДА ВзаиморасчетыССотрудниками.Регистратор В (&ИсключаемыеСсылки)
			|			ТОГДА 0
			|		ИНАЧЕ ВзаиморасчетыССотрудниками.СуммаВзаиморасчетов
			|	КОНЕЦ КАК Сумма,
			|	ВЫБОР
			|		КОГДА НЕ ВзаиморасчетыССотрудниками.Подразделение.Владелец ЕСТЬ NULL
			|			ТОГДА ВзаиморасчетыССотрудниками.Подразделение.Владелец
			|		КОГДА КадровыеДанныеСотрудников.Организация <> ЗНАЧЕНИЕ(СПРАВОЧНИК.Организации.ПустаяСсылка)
			|			ТОГДА КадровыеДанныеСотрудников.Организация
			|		ИНАЧЕ ВзаиморасчетыССотрудниками.Организация
			|	КОНЕЦ КАК Организация,
			|	ВзаиморасчетыССотрудниками.Сотрудник КАК Сотрудник,
			|	ВЫРАЗИТЬ(ВзаиморасчетыССотрудниками.Сотрудник КАК Справочник.Сотрудники).ГоловнойСотрудник КАК ГоловнойСотрудник,
			|	КадровыеДанныеГоловныхСотрудников.ФИОПолные КАК ФИОПолные,
			|	КадровыеДанныеГоловныхСотрудников.ФамилияИО КАК ФамилияИО,
			|	КадровыеДанныеГоловныхСотрудников.Фамилия КАК Фамилия,
			|	КадровыеДанныеГоловныхСотрудников.Имя КАК Имя,
			|	КадровыеДанныеГоловныхСотрудников.Отчество КАК Отчество,
			|	КадровыеДанныеГоловныхСотрудников.Должность КАК ДолжностьГоловногоСотрудникаНаКонецПериода,
			|	КадровыеДанныеГоловныхСотрудников.РазрядКатегория КАК РазрядКатегорияГоловногоСотрудникаНаКонецПериода,
			|	КадровыеДанныеГоловныхСотрудников.Организация КАК ОрганизацияГоловногоСотрудникаНаКонецПериода,
			|	КадровыеДанныеГоловныхСотрудников.Подразделение КАК ПодразделениеГоловногоСотрудникаНаКонецПериода,
			|	КадровыеДанныеГоловныхСотрудников.ВидЗанятости КАК ВидЗанятостиГоловногоСотрудникаНаКонецПериода,
			|	НАЧАЛОПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) КАК ПериодДействия,
			|	ВзаиморасчетыССотрудниками.Регистратор КАК Регистратор,
			|	КадровыеДанныеСотрудников.Подразделение КАК ПодразделениеНаКонецПериода,
			|	КадровыеДанныеСотрудников.ВидЗанятости КАК ВидЗанятостиНаКонецПериода,
			|	КадровыеДанныеСотрудников.Должность КАК ДолжностьНаКонецПериода,
			|	КадровыеДанныеСотрудников.РазрядКатегория КАК РазрядКатегорияНаКонецПериода,
			|	КадровыеДанныеСотрудников.ТарифнаяСтавка КАК ТарифнаяСтавкаНаКонецПериода,
			|	КадровыеДанныеСотрудников.ВидЗанятости КАК ВидЗанятости,
			|	КадровыеДанныеСотрудников.Должность КАК Должность,
			|	КадровыеДанныеСотрудников.РазрядКатегория КАК РазрядКатегория,
			|	КадровыеДанныеСотрудников.ТарифнаяСтавка КАК ТарифнаяСтавка,
			|	КадровыеДанныеГоловныхСотрудников.ДатаУвольнения КАК ДатаУвольнения
			|ПОМЕСТИТЬ ВТДвиженияВзаиморасчетов
			|ИЗ
			|	РегистрНакопления.ВзаиморасчетыССотрудниками КАК ВзаиморасчетыССотрудниками
			|		{ЛЕВОЕ СОЕДИНЕНИЕ Представления_КадровыеДанныеСотрудниковАнализНачисленийИУдержаний КАК КадровыеДанныеСотрудников
			|		ПО ВзаиморасчетыССотрудниками.Сотрудник = КадровыеДанныеСотрудников.Сотрудник
			|			И (КОНЕЦПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) = КадровыеДанныеСотрудников.Период)}
			|		{ЛЕВОЕ СОЕДИНЕНИЕ Представления_КадровыеДанныеСотрудниковАнализНачисленийИУдержаний КАК КадровыеДанныеГоловныхСотрудников
			|		ПО (ВЫРАЗИТЬ(ВзаиморасчетыССотрудниками.Сотрудник КАК Справочник.Сотрудники).ГоловнойСотрудник = КадровыеДанныеГоловныхСотрудников.Сотрудник)
			|			И (КОНЕЦПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) = КадровыеДанныеГоловныхСотрудников.Период)}
			|		{ЛЕВОЕ СОЕДИНЕНИЕ Представления_ПодразделенияСортировкиСотрудников КАК ПодразделенияСортировкиСотрудников
			|		ПО ВзаиморасчетыССотрудниками.ФизическоеЛицо = ПодразделенияСортировкиСотрудников.ФизическоеЛицо
			|			И ВзаиморасчетыССотрудниками.Организация.ГоловнаяОрганизация = ПодразделенияСортировкиСотрудников.ГоловнаяОрганизация
			|			И (КОНЕЦПЕРИОДА(ВзаиморасчетыССотрудниками.Период, МЕСЯЦ) = ПодразделенияСортировкиСотрудников.Период)}
			|ГДЕ
			|	ВзаиморасчетыССотрудниками.Период МЕЖДУ &НачалоПериода И &КонецПериода
			|	И ВзаиморасчетыССотрудниками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
			|	И ВзаиморасчетыССотрудниками.ВидВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ВидыВзаиморасчетовССотрудниками.ВыплатаАванса)
			|{ГДЕ
			|	ВзаиморасчетыССотрудниками.Сотрудник.*,
			|	ВзаиморасчетыССотрудниками.ФизическоеЛицо.*,
			|	ВзаиморасчетыССотрудниками.Организация.*,
			|	ВзаиморасчетыССотрудниками.Сотрудник.ГоловнойСотрудник.* КАК ГоловнойСотрудник}
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДанныеСотрудников.ОрганизацияСортировки КАК ОрганизацияСортировки,
			|	ДанныеСотрудников.ПодразделениеСортировки КАК ПодразделениеСортировки,
			|	ДанныеСотрудников.ПриоритетРабочегоМеста КАК ПриоритетРабочегоМеста,
			|	ДанныеСотрудников.МесяцНачисления КАК МесяцНачисления,
			|	ДанныеСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
			|	ДанныеСотрудников.СтатьяФинансирования КАК СтатьяФинансирования,
			|	ДанныеСотрудников.СтатьяРасходов КАК СтатьяРасходов,
			|	ДанныеСотрудников.Подразделение КАК Подразделение,
			|	ДанныеСотрудников.Группа КАК Группа,
			|	ДанныеСотрудников.ВидРасчета КАК ВидРасчета,
			|	ДанныеСотрудников.Сумма КАК Сумма,
			|	ДанныеСотрудников.ДатаНачала КАК ДатаНачала,
			|	ДанныеСотрудников.ДатаОкончания КАК ДатаОкончания,
			|	ВЫБОР
			|		КОГДА ДанныеСотрудников.ПервыйПоказатель
			|			ТОГДА ЕСТЬNULL(ОтработанноеВремя.ОтработаноДней, 0)
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ОтработаноДней,
			|	ВЫБОР
			|		КОГДА ДанныеСотрудников.ПервыйПоказатель
			|			ТОГДА ЕСТЬNULL(ОтработанноеВремя.ОтработаноЧасов, 0)
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ОтработаноЧасов,
			|	ВЫБОР
			|		КОГДА ДанныеСотрудников.ПервыйПоказатель
			|			ТОГДА ЕСТЬNULL(ОтработанноеВремя.ОплаченоДней, 0)
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ОплаченоДней,
			|	ВЫБОР
			|		КОГДА ДанныеСотрудников.ПервыйПоказатель
			|			ТОГДА ЕСТЬNULL(ОтработанноеВремя.ОплаченоЧасов, 0)
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ОплаченоЧасов,
			|	ДанныеСотрудников.Организация КАК Организация,
			|	ДанныеСотрудников.Сотрудник КАК Сотрудник,
			|	ДанныеСотрудников.ФИОПолные КАК ФИОПолные,
			|	ДанныеСотрудников.ФамилияИО КАК ФамилияИО,
			|	ДанныеСотрудников.Фамилия КАК Фамилия,
			|	ДанныеСотрудников.Имя КАК Имя,
			|	ДанныеСотрудников.Отчество КАК Отчество,
			|	ДанныеСотрудников.ГоловнойСотрудник КАК ГоловнойСотрудник,
			|	ДанныеСотрудников.ДолжностьГоловногоСотрудникаНаКонецПериода КАК ДолжностьГоловногоСотрудникаНаКонецПериода,
			|	ДанныеСотрудников.РазрядКатегорияГоловногоСотрудникаНаКонецПериода КАК РазрядКатегорияГоловногоСотрудникаНаКонецПериода,
			|	ДанныеСотрудников.ОрганизацияГоловногоСотрудникаНаКонецПериода КАК ОрганизацияГоловногоСотрудникаНаКонецПериода,
			|	ДанныеСотрудников.ПодразделениеГоловногоСотрудникаНаКонецПериода КАК ПодразделениеГоловногоСотрудникаНаКонецПериода,
			|	ДанныеСотрудников.ВидЗанятостиГоловногоСотрудникаНаКонецПериода КАК ВидЗанятостиГоловногоСотрудникаНаКонецПериода,
			|	ДанныеСотрудников.ПериодДействия КАК ПериодДействия,
			|	ДанныеСотрудников.Регистратор КАК Регистратор,
			|	ДанныеСотрудников.ПодразделениеНаКонецПериода КАК ПодразделениеНаКонецПериода,
			|	ДанныеСотрудников.ВидЗанятостиНаКонецПериода КАК ВидЗанятостиНаКонецПериода,
			|	ДанныеСотрудников.ДолжностьНаКонецПериода КАК ДолжностьНаКонецПериода,
			|	ДанныеСотрудников.РазрядКатегорияНаКонецПериода КАК РазрядКатегорияНаКонецПериода,
			|	ДанныеСотрудников.ТарифнаяСтавкаНаКонецПериода КАК ТарифнаяСтавкаНаКонецПериода,
			|	ДанныеСотрудников.ВидЗанятости КАК ВидЗанятости,
			|	ДанныеСотрудников.Должность КАК Должность,
			|	ДанныеСотрудников.РазрядКатегория КАК РазрядКатегория,
			|	ДанныеСотрудников.ТарифнаяСтавка КАК ТарифнаяСтавка,
			|	ОтработанноеВремя.ВремяВЧасах КАК ВремяВЧасах,
			|	ДанныеСотрудников.Показатель КАК Показатель,
			|	ДанныеСотрудников.Значение КАК Значение,
			|	ДанныеСотрудников.ПорядокПоказателей КАК ПорядокПоказателей,
			|	ДанныеСотрудников.ДатаУвольнения КАК ДатаУвольнения,
			|	ДанныеСотрудников.Сторно КАК Сторно,
			|	ДанныеСотрудников.ПриоритетВидаРасчета КАК ПриоритетВидаРасчета
			|ПОМЕСТИТЬ ОбщиеЗапросы_НачисленияУдержанияАвансом
			|ИЗ
			|	ВТНачисленияИУдержанияСКадровымиДанными КАК ДанныеСотрудников
			|		{ЛЕВОЕ СОЕДИНЕНИЕ ВТОтработанноеВремя КАК ОтработанноеВремя
			|		ПО ДанныеСотрудников.Регистратор = ОтработанноеВремя.Регистратор
			|			И ДанныеСотрудников.Сотрудник = ОтработанноеВремя.Сотрудник
			|			И ДанныеСотрудников.Подразделение = ОтработанноеВремя.Подразделение
			|			И ДанныеСотрудников.ВидРасчета = ОтработанноеВремя.ВидРасчета
			|			И ДанныеСотрудников.МесяцНачисления = ОтработанноеВремя.МесяцНачисления
			|			И ДанныеСотрудников.ДатаНачала = ОтработанноеВремя.ДатаНачала
			|			И ДанныеСотрудников.СтатьяФинансирования = ОтработанноеВремя.СтатьяФинансирования
			|			И ДанныеСотрудников.СтатьяРасходов = ОтработанноеВремя.СтатьяРасходов
			|			И ДанныеСотрудников.ИдентификаторСтроки = ОтработанноеВремя.ИдентификаторСтроки}
			|{ГДЕ
			|	ДанныеСотрудников.Группа.*}
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДанныеСотрудников.ОрганизацияСортировки,
			|	ДанныеСотрудников.ПодразделениеСортировки,
			|	ДанныеСотрудников.ПриоритетРабочегоМеста,
			|	ДанныеСотрудников.МесяцНачисления,
			|	ДанныеСотрудников.ФизическоеЛицо,
			|	ДанныеСотрудников.СтатьяФинансирования,
			|	ДанныеСотрудников.СтатьяРасходов,
			|	ДанныеСотрудников.Подразделение,
			|	ДанныеСотрудников.Группа,
			|	ДанныеСотрудников.ВидРасчета,
			|	ДанныеСотрудников.Сумма,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	ДанныеСотрудников.Организация,
			|	ДанныеСотрудников.Сотрудник,
			|	ДанныеСотрудников.ФИОПолные,
			|	ДанныеСотрудников.ФамилияИО,
			|	ДанныеСотрудников.Фамилия,
			|	ДанныеСотрудников.Имя,
			|	ДанныеСотрудников.Отчество,
			|	ДанныеСотрудников.ГоловнойСотрудник,
			|	ДанныеСотрудников.ДолжностьГоловногоСотрудникаНаКонецПериода,
			|	ДанныеСотрудников.РазрядКатегорияГоловногоСотрудникаНаКонецПериода,
			|	ДанныеСотрудников.ОрганизацияГоловногоСотрудникаНаКонецПериода,
			|	ДанныеСотрудников.ПодразделениеГоловногоСотрудникаНаКонецПериода,
			|	ДанныеСотрудников.ВидЗанятостиГоловногоСотрудникаНаКонецПериода,
			|	ДанныеСотрудников.ПериодДействия,
			|	ДанныеСотрудников.Регистратор,
			|	ДанныеСотрудников.ПодразделениеНаКонецПериода,
			|	ДанныеСотрудников.ВидЗанятостиНаКонецПериода,
			|	ДанныеСотрудников.ДолжностьНаКонецПериода,
			|	ДанныеСотрудников.РазрядКатегорияНаКонецПериода,
			|	ДанныеСотрудников.ТарифнаяСтавкаНаКонецПериода,
			|	ДанныеСотрудников.ВидЗанятости,
			|	ДанныеСотрудников.Должность,
			|	ДанныеСотрудников.РазрядКатегория,
			|	ДанныеСотрудников.ТарифнаяСтавка,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	ДанныеСотрудников.ДатаУвольнения,
			|	NULL,
			|	0
			|ИЗ
			|	ВТДвиженияВзаиморасчетов КАК ДанныеСотрудников
			|{ГДЕ
			|	ДанныеСотрудников.Группа.*}
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДанныеСотрудников.ОрганизацияСортировки,
			|	ДанныеСотрудников.ПодразделениеСортировки,
			|	ДанныеСотрудников.ПриоритетРабочегоМеста,
			|	ДанныеСотрудников.Период,
			|	ДанныеСотрудников.ФизическоеЛицо,
			|	ДанныеСотрудников.СтатьяФинансирования,
			|	ДанныеСотрудников.СтатьяРасходов,
			|	ДанныеСотрудников.Подразделение,
			|	ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.НачальноеСальдо),
			|	NULL,
			|	ДанныеСотрудников.НачальныйОстаток,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	ДанныеСотрудников.Организация,
			|	ДанныеСотрудников.Сотрудник,
			|	ДанныеСотрудников.ФИОПолные,
			|	ДанныеСотрудников.ФамилияИО,
			|	ДанныеСотрудников.Фамилия,
			|	ДанныеСотрудников.Имя,
			|	ДанныеСотрудников.Отчество,
			|	ДанныеСотрудников.ГоловнойСотрудник,
			|	ДанныеСотрудников.ДолжностьГоловногоСотрудникаНаКонецПериода,
			|	ДанныеСотрудников.РазрядКатегорияГоловногоСотрудникаНаКонецПериода,
			|	ДанныеСотрудников.ОрганизацияГоловногоСотрудникаНаКонецПериода,
			|	ДанныеСотрудников.ПодразделениеГоловногоСотрудникаНаКонецПериода,
			|	ДанныеСотрудников.ВидЗанятостиГоловногоСотрудникаНаКонецПериода,
			|	NULL,
			|	NULL,
			|	ДанныеСотрудников.ПодразделениеНаКонецПериода,
			|	ДанныеСотрудников.ВидЗанятостиНаКонецПериода,
			|	ДанныеСотрудников.ДолжностьНаКонецПериода,
			|	ДанныеСотрудников.РазрядКатегорияНаКонецПериода,
			|	ДанныеСотрудников.ТарифнаяСтавка,
			|	ДанныеСотрудников.ВидЗанятости,
			|	ДанныеСотрудников.Должность,
			|	ДанныеСотрудников.РазрядКатегория,
			|	ДанныеСотрудников.ТарифнаяСтавка,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	ДанныеСотрудников.ДатаУвольнения,
			|	NULL,
			|	0
			|ИЗ
			|	ВТСальдоПоРасчетамССотрудниками КАК ДанныеСотрудников
			|ГДЕ
			|	ДанныеСотрудников.Организация ЕСТЬ НЕ NULL 
			|{ГДЕ
			|	(ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.НачальноеСальдо)).* КАК Группа}
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДанныеСотрудников.ОрганизацияСортировки,
			|	ДанныеСотрудников.ПодразделениеСортировки,
			|	ДанныеСотрудников.ПриоритетРабочегоМеста,
			|	ДанныеСотрудников.МесяцНачисления,
			|	ДанныеСотрудников.ФизическоеЛицо,
			|	ДанныеСотрудников.СтатьяФинансирования,
			|	ДанныеСотрудников.СтатьяРасходов,
			|	ДанныеСотрудников.Подразделение,
			|	ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.КонечноеСальдо),
			|	NULL,
			|	ВЫБОР
			|		КОГДА ДанныеСотрудников.Группа = ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.Начислено)
			|			ТОГДА ДанныеСотрудников.Сумма
			|		КОГДА ДанныеСотрудников.Группа = ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.Удержано)
			|			ТОГДА -ДанныеСотрудников.Сумма
			|		ИНАЧЕ 0
			|	КОНЕЦ,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	ДанныеСотрудников.Организация,
			|	ДанныеСотрудников.Сотрудник,
			|	ДанныеСотрудников.ФИОПолные,
			|	ДанныеСотрудников.ФамилияИО,
			|	ДанныеСотрудников.Фамилия,
			|	ДанныеСотрудников.Имя,
			|	ДанныеСотрудников.Отчество,
			|	ДанныеСотрудников.ГоловнойСотрудник,
			|	ДанныеСотрудников.ДолжностьГоловногоСотрудникаНаКонецПериода,
			|	ДанныеСотрудников.РазрядКатегорияГоловногоСотрудникаНаКонецПериода,
			|	ДанныеСотрудников.ОрганизацияГоловногоСотрудникаНаКонецПериода,
			|	ДанныеСотрудников.ПодразделениеГоловногоСотрудникаНаКонецПериода,
			|	ДанныеСотрудников.ВидЗанятостиГоловногоСотрудникаНаКонецПериода,
			|	NULL,
			|	NULL,
			|	ДанныеСотрудников.ПодразделениеНаКонецПериода,
			|	ДанныеСотрудников.ВидЗанятостиНаКонецПериода,
			|	ДанныеСотрудников.ДолжностьНаКонецПериода,
			|	ДанныеСотрудников.РазрядКатегорияНаКонецПериода,
			|	ДанныеСотрудников.ТарифнаяСтавкаНаКонецПериода,
			|	ДанныеСотрудников.ВидЗанятости,
			|	ДанныеСотрудников.Должность,
			|	ДанныеСотрудников.РазрядКатегория,
			|	ДанныеСотрудников.ТарифнаяСтавка,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	ДанныеСотрудников.ДатаУвольнения,
			|	NULL,
			|	0
			|ИЗ
			|	ВТНачисленияИУдержанияСКадровымиДанными КАК ДанныеСотрудников
			|		{ЛЕВОЕ СОЕДИНЕНИЕ ВТОтработанноеВремя КАК ОтработанноеВремя
			|		ПО ДанныеСотрудников.Регистратор = ОтработанноеВремя.Регистратор
			|			И ДанныеСотрудников.Сотрудник = ОтработанноеВремя.Сотрудник
			|			И ДанныеСотрудников.Подразделение = ОтработанноеВремя.Подразделение
			|			И ДанныеСотрудников.ВидРасчета = ОтработанноеВремя.ВидРасчета
			|			И ДанныеСотрудников.МесяцНачисления = ОтработанноеВремя.МесяцНачисления
			|			И ДанныеСотрудников.ДатаНачала = ОтработанноеВремя.ДатаНачала
			|			И ДанныеСотрудников.СтатьяФинансирования = ОтработанноеВремя.СтатьяФинансирования
			|			И ДанныеСотрудников.СтатьяРасходов = ОтработанноеВремя.СтатьяРасходов
			|			И ДанныеСотрудников.ИдентификаторСтроки = ОтработанноеВремя.ИдентификаторСтроки}
			|{ГДЕ
			|	(ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.КонечноеСальдо)).* КАК Группа}
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДанныеСотрудников.ОрганизацияСортировки,
			|	ДанныеСотрудников.ПодразделениеСортировки,
			|	ДанныеСотрудников.ПриоритетРабочегоМеста,
			|	ДанныеСотрудников.МесяцНачисления,
			|	ДанныеСотрудников.ФизическоеЛицо,
			|	ДанныеСотрудников.СтатьяФинансирования,
			|	ДанныеСотрудников.СтатьяРасходов,
			|	ДанныеСотрудников.Подразделение,
			|	ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.КонечноеСальдо),
			|	ДанныеСотрудников.ВидРасчета,
			|	-ДанныеСотрудников.Сумма,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	ДанныеСотрудников.Организация,
			|	ДанныеСотрудников.Сотрудник,
			|	ДанныеСотрудников.ФИОПолные,
			|	ДанныеСотрудников.ФамилияИО,
			|	ДанныеСотрудников.Фамилия,
			|	ДанныеСотрудников.Имя,
			|	ДанныеСотрудников.Отчество,
			|	ДанныеСотрудников.ГоловнойСотрудник,
			|	ДанныеСотрудников.ДолжностьГоловногоСотрудникаНаКонецПериода,
			|	ДанныеСотрудников.РазрядКатегорияГоловногоСотрудникаНаКонецПериода,
			|	ДанныеСотрудников.ОрганизацияГоловногоСотрудникаНаКонецПериода,
			|	ДанныеСотрудников.ПодразделениеГоловногоСотрудникаНаКонецПериода,
			|	ДанныеСотрудников.ВидЗанятостиГоловногоСотрудникаНаКонецПериода,
			|	ДанныеСотрудников.ПериодДействия,
			|	ДанныеСотрудников.Регистратор,
			|	ДанныеСотрудников.ПодразделениеНаКонецПериода,
			|	ДанныеСотрудников.ВидЗанятостиНаКонецПериода,
			|	ДанныеСотрудников.ДолжностьНаКонецПериода,
			|	ДанныеСотрудников.РазрядКатегорияНаКонецПериода,
			|	ДанныеСотрудников.ТарифнаяСтавкаНаКонецПериода,
			|	ДанныеСотрудников.ВидЗанятости,
			|	ДанныеСотрудников.Должность,
			|	ДанныеСотрудников.РазрядКатегория,
			|	ДанныеСотрудников.ТарифнаяСтавка,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	ДанныеСотрудников.ДатаУвольнения,
			|	NULL,
			|	0
			|ИЗ
			|	ВТДвиженияВзаиморасчетов КАК ДанныеСотрудников
			|{ГДЕ
			|	(ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.КонечноеСальдо)).* КАК Группа}
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДанныеСотрудников.ОрганизацияСортировки,
			|	ДанныеСотрудников.ПодразделениеСортировки,
			|	ДанныеСотрудников.ПриоритетРабочегоМеста,
			|	ДанныеСотрудников.Период,
			|	ДанныеСотрудников.ФизическоеЛицо,
			|	ДанныеСотрудников.СтатьяФинансирования,
			|	ДанныеСотрудников.СтатьяРасходов,
			|	ДанныеСотрудников.Подразделение,
			|	ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.КонечноеСальдо),
			|	NULL,
			|	ДанныеСотрудников.НачальныйОстаток,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	ДанныеСотрудников.Организация,
			|	ДанныеСотрудников.Сотрудник,
			|	ДанныеСотрудников.ФИОПолные,
			|	ДанныеСотрудников.ФамилияИО,
			|	ДанныеСотрудников.Фамилия,
			|	ДанныеСотрудников.Имя,
			|	ДанныеСотрудников.Отчество,
			|	ДанныеСотрудников.ГоловнойСотрудник,
			|	ДанныеСотрудников.ДолжностьГоловногоСотрудникаНаКонецПериода,
			|	ДанныеСотрудников.РазрядКатегорияГоловногоСотрудникаНаКонецПериода,
			|	ДанныеСотрудников.ОрганизацияГоловногоСотрудникаНаКонецПериода,
			|	ДанныеСотрудников.ПодразделениеГоловногоСотрудникаНаКонецПериода,
			|	ДанныеСотрудников.ВидЗанятостиГоловногоСотрудникаНаКонецПериода,
			|	NULL,
			|	NULL,
			|	ДанныеСотрудников.ПодразделениеНаКонецПериода,
			|	ДанныеСотрудников.ВидЗанятостиНаКонецПериода,
			|	ДанныеСотрудников.ДолжностьНаКонецПериода,
			|	ДанныеСотрудников.РазрядКатегорияНаКонецПериода,
			|	ДанныеСотрудников.ТарифнаяСтавка,
			|	ДанныеСотрудников.ВидЗанятости,
			|	ДанныеСотрудников.Должность,
			|	ДанныеСотрудников.РазрядКатегория,
			|	ДанныеСотрудников.ТарифнаяСтавка,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	ДанныеСотрудников.ДатаУвольнения,
			|	NULL,
			|	0
			|ИЗ
			|	ВТСальдоПоРасчетамССотрудниками КАК ДанныеСотрудников
			|ГДЕ
			|	ДанныеСотрудников.Организация ЕСТЬ НЕ NULL 
			|{ГДЕ
			|	(ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.КонечноеСальдо)).* КАК Группа}";
		
		ДополнитьТекстЗапросаНачисленияУдержанияЗначениямиПоказателей(ТекстЗапроса);
		
	КонецЕсли;
	
	Если Не ПустаяСтрока(ТекстЗапроса) И Не ТолькоРазрешенные Тогда
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "РАЗРЕШЕННЫЕ", "");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, """ТолькоРазрешенные"" = ИСТИНА", """ТолькоРазрешенные"" = ЛОЖЬ");
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьЗапросПоПредставлению(ТекстЗапроса, СоответствиеПараметров) Экспорт
	
	Запрос = Неопределено;
	
	ПозицияСловаПоместить = СтрНайти(ВРег(ТекстЗапроса), "ПОМЕСТИТЬ ");
	
	ИмяИсточникаДанных = ЗарплатаКадрыОбщиеНаборыДанных.ПервоеСловоНачинаяСПозицииВТексте(ТекстЗапроса, ПозицияСловаПоместить + СтрДлина("ПОМЕСТИТЬ "));
	МассивПодстрокИмениИсточникаДанных = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИмяИсточникаДанных, "_");
	ИмяВременнойТаблицы = МассивПодстрокИмениИсточникаДанных[0];
	ИмяПредставления = МассивПодстрокИмениИсточникаДанных[1];
	Если МассивПодстрокИмениИсточникаДанных.Количество() > 2 Тогда
		ИмяПараметра = МассивПодстрокИмениИсточникаДанных[2];
	Иначе
		ИмяПараметра = Неопределено;
	КонецЕсли;
	
	МассивИменВТИсточниковПараметров = ЗарплатаКадрыОбщиеНаборыДанных.МассивИменВТИсточниковПараметров(ТекстЗапроса, ИмяИсточникаДанных);
	ПараметрыЗапроса = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрыЗапроса(ТекстЗапроса, ИмяИсточникаДанных);
	
	ПредставлениеТолькоРазрешенные = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрЗапроса("ТолькоРазрешенные", ПараметрыЗапроса);
	ТолькоРазрешенные = ВРег(ПредставлениеТолькоРазрешенные) = "ИСТИНА";
	
	Если ВРег(ИмяПредставления) = ВРег("ШтатноеРасписание") Тогда
		
		ПредставлениеВключатьНачисления = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрЗапроса("ВключатьНачисления", ПараметрыЗапроса);
		НеВключатьНачисления = ВРег(ПредставлениеВключатьНачисления) = "ЛОЖЬ";
		ВключаяЗакрытые = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрЗапроса("ВключаяЗакрытые", ПараметрыЗапроса);
		Если ВРег(ВключаяЗакрытые) = "ИСТИНА" Тогда
			ВключаяЗакрытые = Истина;
		ИначеЕсли ВРег(ВключаяЗакрытые) = "ЛОЖЬ" Тогда
			ВключаяЗакрытые = Ложь;
		КонецЕсли;
		ДатаАктуальности = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрЗапроса("ДатаАктуальности", ПараметрыЗапроса);
		Если МассивИменВТИсточниковПараметров.Количество() > 0  Тогда
			ИмяВТИсточникДанных = МассивИменВТИсточниковПараметров[0];
		Иначе
			ИмяВТИсточникДанных = "";
		КонецЕсли;
		
		КоллекцияПолей = ЗарплатаКадрыОбщиеНаборыДанных.МассивПолейЗапроса(Лев(ТекстЗапроса, ПозицияСловаПоместить - 1));
		Запрос = УправлениеШтатнымРасписанием.ЗапросПредставленияШтатноеРасписание(
			ТолькоРазрешенные, ДатаАктуальности, КоллекцияПолей, ИмяИсточникаДанных,
			ВключаяЗакрытые, НЕ НеВключатьНачисления, ИмяВТИсточникДанных);
		
	ИначеЕсли ВРег(ИмяПредставления) = ВРег("ТекущаяКадроваяРасстановка") Тогда
		
		Организация = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрЗапроса("Организация", ПараметрыЗапроса);
		Дата = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрЗапроса("Дата", ПараметрыЗапроса);
		
		Запрос = КадровыйУчетРасширенный.ЗапросВТТекущаяКадроваяРасстановка(
			ТолькоРазрешенные,
			Организация,
			Дата,
			ИмяИсточникаДанных);
			
	ИначеЕсли ВРег(ИмяПредставления) = ВРег("ФункциональныеОпцииОрганизаций") Тогда
			
		МассивИменФункциональныхОпций =  ЗарплатаКадрыОбщиеНаборыДанных.МассивПолейЗапроса(Лев(ТекстЗапроса, ПозицияСловаПоместить - 1));
		
		Запрос = КадровыйУчетБазовый.ЗапросВТФункциональныеОпцииОрганизаций(
			ТолькоРазрешенные,
			ИмяИсточникаДанных,
			МассивИменФункциональныхОпций);
				
	ИначеЕсли ВРег(ИмяПредставления) = ВРег("ФактическиеОтпускаСотрудников") Тогда
			
		ИмяВТИсточникДанных = МассивИменВТИсточниковПараметров[0];
		
		ОписательВременныхТаблиц = ОстаткиОтпусков.ОписательВременныхТаблицДляСоздатьВТФактическиеОтпускаСотрудников(
			Неопределено,
			ИмяВТИсточникДанных,
			,
			ИмяИсточникаДанных);
		
		Запрос = ОстаткиОтпусков.ЗапросВТФактическиеОтпускаСотрудников(ОписательВременныхТаблиц, ТолькоРазрешенные);
		
	ИначеЕсли ВРег(ИмяПредставления) = ВРег("ПлановыеНачисленияСотрудников") Тогда
		
		ФормироватьСПериодичностьДень = Истина;
		ПредставлениеФормироватьСПериодичностьДень = ЗарплатаКадрыОбщиеНаборыДанных.ПараметрЗапроса("ПараметрыПостроения_ФормироватьСПериодичностьДень", ПараметрыЗапроса);
		Если ВРег(ПредставлениеФормироватьСПериодичностьДень) = "ЛОЖЬ" Тогда
			ФормироватьСПериодичностьДень = Ложь;
		КонецЕсли;
		
		ИмяВТИсточникДанных = МассивИменВТИсточниковПараметров[0];
		Запрос = КадровыйУчетРасширенный.ЗапросВТПлановыеНачисленияСотрудников(ТолькоРазрешенные, ИмяИсточникаДанных, ИмяВТИсточникДанных, , , ФормироватьСПериодичностьДень);
		
	ИначеЕсли ВРег(ИмяПредставления) = ВРег("ПлановыеУдержанияСотрудников") Тогда
		
		ИмяВТИсточникДанных = МассивИменВТИсточниковПараметров[0];
		Запрос = КадровыйУчетРасширенный.ЗапросВТПлановыеУдержанияСотрудников(ТолькоРазрешенные, ИмяИсточникаДанных, ИмяВТИсточникДанных);
		
	ИначеЕсли ВРег(ИмяПредставления) = ВРег("СтажиСотрудников") Тогда
		
		ИмяВТИсточникДанных = МассивИменВТИсточниковПараметров[0];
		ОписаниеВременнойТаблицыОтборов = КадровыйУчетРасширенный.ОписательВременнойТаблицыОтборовДляВТСтажиФизическихЛиц(ИмяВТИсточникДанных);
		Запрос = КадровыйУчетРасширенный.ЗапросВТСтажиФизическихЛиц(ТолькоРазрешенные, ОписаниеВременнойТаблицыОтборов, ИмяИсточникаДанных);
		
	ИначеЕсли ВРег(ИмяПредставления) = ВРег("СвойстваСтатейФинансирования") Тогда
		
		Если ПолучитьФункциональнуюОпцию("РаботаВХозрасчетнойОрганизации") Тогда
			
			Запрос = Новый Запрос;
			
			Запрос.Текст =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	СтатьиФинансированияЗарплата.Ссылка КАК СтатьяФинансирования,
				|	2 КАК НомерКолонки
				|ПОМЕСТИТЬ Представления_СвойстваСтатейФинансирования
				|ИЗ
				|	Справочник.СтатьиФинансированияЗарплата КАК СтатьиФинансированияЗарплата";
			
		КонецЕсли;
		
	ИначеЕсли ВРег(ИмяПредставления) = ВРег("БухучетЗарплатыСотрудников") Тогда
		
		ИмяВТИсточникДанных = МассивИменВТИсточниковПараметров[0];
		Запрос = ОтражениеЗарплатыВБухучетеРасширенный.ЗапросПредставленияБухучетЗарплатыСотрудников(ТолькоРазрешенные, ИмяВТИсточникДанных);
		
	КонецЕсли;
	
	Если Запрос = Неопределено Тогда
		Запрос = УчетРабочегоВремениРасширенный.ЗапросПоПредставлению(ТолькоРазрешенные, ИмяПредставления, МассивИменВТИсточниковПараметров, ПараметрыЗапроса, ИмяИсточникаДанных);
	КонецЕсли;	
	
	Если Запрос = Неопределено Тогда
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.АттестацииСотрудников") Тогда
			Модуль = ОбщегоНазначения.ОбщийМодуль("АттестацииСотрудников");
			Запрос = Модуль.ЗапросПоПредставлению(ИмяПредставления, ПараметрыЗапроса);
		КонецЕсли;
	КонецЕсли;
	
	Если Запрос = Неопределено Тогда
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Медицина") Тогда
			Модуль = ОбщегоНазначения.ОбщийМодуль("Медицина");
			Запрос = Модуль.ЗапросПоПредставлению(ИмяПредставления, ПараметрыЗапроса);
		КонецЕсли;
	КонецЕсли;
	
	Если Запрос = Неопределено Тогда
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.УчетБюджетныхУчреждений") Тогда
			МодульУчетБюджетныхУчреждений = ОбщегоНазначения.ОбщийМодуль("УчетБюджетныхУчреждений");
			Запрос = МодульУчетБюджетныхУчреждений.ЗапросПоПредставлению(ИмяПредставления, ПараметрыЗапроса);
		КонецЕсли;
	КонецЕсли;
	
	Если Запрос = Неопределено Тогда
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.РабочиеМестаОхраныТруда") Тогда
			МодульРабочиеМестаОхраныТруда = ОбщегоНазначения.ОбщийМодуль("РабочиеМестаОхраныТруда");
			Запрос = МодульРабочиеМестаОхраныТруда.ЗапросПоПредставлению(ИмяПредставления, ПараметрыЗапроса, ТолькоРазрешенные);
		КонецЕсли;
	КонецЕсли;
	
	Если Запрос = Неопределено Тогда
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.КадровоеПланирование") Тогда
			МодульКадровоеПланирование = ОбщегоНазначения.ОбщийМодуль("КадровоеПланирование");
			Запрос = МодульКадровоеПланирование.ЗапросПоПредставлению(ИмяПредставления, ПараметрыЗапроса, ТолькоРазрешенные);
		КонецЕсли;
	КонецЕсли;
	
	Если Запрос = Неопределено Тогда
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ПодборПерсонала") Тогда
			МодульПодборПерсонала = ОбщегоНазначения.ОбщийМодуль("ПодборПерсонала");
			Запрос = МодульПодборПерсонала.ЗапросПоПредставлению(ИмяПредставления, ПараметрыЗапроса, ТолькоРазрешенные);
		КонецЕсли;
	КонецЕсли;
	
	Если Запрос = Неопределено Тогда
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КадровыйРезерв.КадровыйРезервГосслужащих") Тогда
			МодульКадровыйРезервГосслужащих = ОбщегоНазначения.ОбщийМодуль("КадровыйРезервГосслужащих");
			Запрос = МодульКадровыйРезервГосслужащих.ЗапросПоПредставлению(ИмяПредставления, ПараметрыЗапроса);
		КонецЕсли;
	КонецЕсли;
	
	Если Запрос = Неопределено Тогда
		Запрос = ЗарплатаКадрыОбщиеНаборыДанныхБазовый.ПолучитьЗапросПоПредставлению(ТекстЗапроса, СоответствиеПараметров);
	КонецЕсли;
		
	Возврат Запрос;
	
КонецФункции

Процедура ПриПолученииСвойствРегистра(ИмяРегистра, СтруктураОписанияРегистра) Экспорт
	ПлановыеНачисленияСотрудников.ПриПолученииСвойствРегистраВторичныхДанных(ИмяРегистра, СтруктураОписанияРегистра);	
КонецПроцедуры

Функция ЗапросВТПредставленияОтработанноеВремя(ИмяВТНачисленияИУдержания, НачалоПериода, ОкончаниеПериода, ИмяВТОтработанноеВремя) Экспорт
	
	Запрос = ЗарплатаКадрыОбщиеНаборыДанныхБазовый.ЗапросВТПредставленияОтработанноеВремя(ИмяВТНачисленияИУдержания, НачалоПериода, ОкончаниеПериода, ИмяВТОтработанноеВремя);
	
	ТекстЗапросаСКорректировками =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НАЧАЛОПЕРИОДА(ОтработанноеВремя.Период, МЕСЯЦ) КАК МесяцНачисления,
		|	ОтработанноеВремя.ПериодДействия КАК ПериодДействия,
		|	ОтработанноеВремя.Регистратор КАК Регистратор,
		|	ОтработанноеВремя.Сотрудник КАК Сотрудник,
		|	ОтработанноеВремя.Организация КАК Организация,
		|	ОтработанноеВремя.Подразделение КАК Подразделение,
		|	ОтработанноеВремя.Начисление КАК ВидРасчета,
		|	ОтработанноеВремя.ДокументОснование КАК ДокументОснование,
		|	ОтработанноеВремя.ДатаНачала КАК ДатаНачала,
		|	ОтработанноеВремя.ВремяВЧасах КАК ВремяВЧасах,
		|	ОтработанноеВремя.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ОтработанноеВремя.ОтработаноДней КАК ОтработаноДней,
		|	ОтработанноеВремя.ОтработаноЧасов КАК ОтработаноЧасов,
		|	ВЫБОР
		|		КОГДА ОтработанноеВремя.Период = ОтработанноеВремя.ПериодДействия
		|			ТОГДА ОтработанноеВремя.ОтработаноДней
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОтработаноДнейВПериоде,
		|	ВЫБОР
		|		КОГДА ОтработанноеВремя.Период = ОтработанноеВремя.ПериодДействия
		|			ТОГДА ОтработанноеВремя.ОтработаноЧасов
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОтработаноЧасовВПериоде,
		|	ОтработанноеВремя.ОплаченоДней КАК ОплаченоДней,
		|	ОтработанноеВремя.ОплаченоЧасов КАК ОплаченоЧасов
		|ПОМЕСТИТЬ ВТПериодыОтработанноеВремяСКорректировками
		|ИЗ
		|	РегистрНакопления.ОтработанноеВремяПоСотрудникам КАК ОтработанноеВремя
		|ГДЕ
		|	ОтработанноеВремя.Период МЕЖДУ &ОтработанноеВремяПараметрНачалоПериода И &ОтработанноеВремяПараметрОкончаниеПериода
		|{ГДЕ
		|	ОтработанноеВремя.Сотрудник.*,
		|	ОтработанноеВремя.ФизическоеЛицо.*,
		|	ОтработанноеВремя.Организация.*,
		|	ОтработанноеВремя.Сотрудник.ГоловнойСотрудник.* КАК ГоловнойСотрудник}
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ОтработанноеВремя.Период, МЕСЯЦ),
		|	ОтработанноеВремя.ПериодДействия,
		|	ОтработанноеВремя.Регистратор,
		|	ОтработанноеВремя.Сотрудник,
		|	ОтработанноеВремя.Организация,
		|	ОтработанноеВремя.Подразделение,
		|	ОтработанноеВремя.Начисление,
		|	ОтработанноеВремя.ДокументОснование,
		|	ОтработанноеВремя.ДатаНачала,
		|	ОтработанноеВремя.ВремяВЧасах,
		|	ОтработанноеВремя.ИдентификаторСтроки,
		|	ОтработанноеВремя.ОтработаноДней,
		|	NULL,
		|	ВЫБОР
		|		КОГДА ОтработанноеВремя.Период = ОтработанноеВремя.ПериодДействия
		|			ТОГДА ОтработанноеВремя.ОтработаноДней
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	NULL,
		|	ОтработанноеВремя.ОплаченоДней,
		|	NULL
		|ИЗ
		|	РегистрНакопления.ОтработанноеВремяПоСотрудникамКорректировка КАК ОтработанноеВремя
		|ГДЕ
		|	ОтработанноеВремя.Период МЕЖДУ &ОтработанноеВремяПараметрНачалоПериода И &ОтработанноеВремяПараметрОкончаниеПериода
		|{ГДЕ
		|	ОтработанноеВремя.Сотрудник.*,
		|	ОтработанноеВремя.ФизическоеЛицо.*,
		|	ОтработанноеВремя.Организация.*,
		|	ОтработанноеВремя.Сотрудник.ГоловнойСотрудник.* КАК ГоловнойСотрудник}
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ОтработанноеВремя.ПериодДействия, МЕСЯЦ),
		|	ОтработанноеВремя.ПериодДействия,
		|	ОтработанноеВремя.Регистратор,
		|	ОтработанноеВремя.Сотрудник,
		|	ОтработанноеВремя.Организация,
		|	ОтработанноеВремя.Подразделение,
		|	ОтработанноеВремя.Начисление,
		|	ОтработанноеВремя.ДокументОснование,
		|	ОтработанноеВремя.ДатаНачала,
		|	ОтработанноеВремя.ВремяВЧасах,
		|	ОтработанноеВремя.ИдентификаторСтроки,
		|	0,
		|	0,
		|	ОтработанноеВремя.ОтработаноДней,
		|	ОтработанноеВремя.ОтработаноЧасов,
		|	0,
		|	0
		|ИЗ
		|	РегистрНакопления.ОтработанноеВремяПоСотрудникам КАК ОтработанноеВремя
		|ГДЕ
		|	ОтработанноеВремя.ПериодДействия МЕЖДУ &ОтработанноеВремяПараметрНачалоПериода И &ОтработанноеВремяПараметрОкончаниеПериода
		|	И ОтработанноеВремя.Период <> ОтработанноеВремя.ПериодДействия
		|{ГДЕ
		|	ОтработанноеВремя.Сотрудник.*,
		|	ОтработанноеВремя.ФизическоеЛицо.*,
		|	ОтработанноеВремя.Организация.*,
		|	ОтработанноеВремя.Сотрудник.ГоловнойСотрудник.* КАК ГоловнойСотрудник}
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(ОтработанноеВремя.ПериодДействия, МЕСЯЦ),
		|	ОтработанноеВремя.ПериодДействия,
		|	ОтработанноеВремя.Регистратор,
		|	ОтработанноеВремя.Сотрудник,
		|	ОтработанноеВремя.Организация,
		|	ОтработанноеВремя.Подразделение,
		|	ОтработанноеВремя.Начисление,
		|	ОтработанноеВремя.ДокументОснование,
		|	ОтработанноеВремя.ДатаНачала,
		|	ОтработанноеВремя.ВремяВЧасах,
		|	ОтработанноеВремя.ИдентификаторСтроки,
		|	0,
		|	0,
		|	ОтработанноеВремя.ОтработаноДней,
		|	0,
		|	0,
		|	0
		|ИЗ
		|	РегистрНакопления.ОтработанноеВремяПоСотрудникамКорректировка КАК ОтработанноеВремя
		|ГДЕ
		|	ОтработанноеВремя.ПериодДействия МЕЖДУ &ОтработанноеВремяПараметрНачалоПериода И &ОтработанноеВремяПараметрОкончаниеПериода
		|	И ОтработанноеВремя.Период <> ОтработанноеВремя.ПериодДействия
		|{ГДЕ
		|	ОтработанноеВремя.Сотрудник.*,
		|	ОтработанноеВремя.ФизическоеЛицо.*,
		|	ОтработанноеВремя.Организация.*,
		|	ОтработанноеВремя.Сотрудник.ГоловнойСотрудник.* КАК ГоловнойСотрудник}
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОтработанноеВремяВПериодахСКорректировками.МесяцНачисления КАК МесяцНачисления,
		|	ОтработанноеВремяВПериодахСКорректировками.ПериодДействия КАК ПериодДействия,
		|	ОтработанноеВремяВПериодахСКорректировками.Регистратор КАК Регистратор,
		|	ОтработанноеВремяВПериодахСКорректировками.Сотрудник КАК Сотрудник,
		|	ОтработанноеВремяВПериодахСКорректировками.Организация КАК Организация,
		|	ОтработанноеВремяВПериодахСКорректировками.Подразделение КАК Подразделение,
		|	ОтработанноеВремяВПериодахСКорректировками.ВидРасчета КАК ВидРасчета,
		|	ОтработанноеВремяВПериодахСКорректировками.ДокументОснование КАК ДокументОснование,
		|	ОтработанноеВремяВПериодахСКорректировками.ДатаНачала КАК ДатаНачала,
		|	ОтработанноеВремяВПериодахСКорректировками.ВремяВЧасах КАК ВремяВЧасах,
		|	ОтработанноеВремяВПериодахСКорректировками.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	СУММА(ОтработанноеВремяВПериодахСКорректировками.ОтработаноДней) КАК ОтработаноДней,
		|	СУММА(ОтработанноеВремяВПериодахСКорректировками.ОтработаноЧасов) КАК ОтработаноЧасов,
		|	СУММА(ОтработанноеВремяВПериодахСКорректировками.ОтработаноДнейВПериоде) КАК ОтработаноДнейВПериоде,
		|	СУММА(ОтработанноеВремяВПериодахСКорректировками.ОтработаноЧасовВПериоде) КАК ОтработаноЧасовВПериоде,
		|	СУММА(ОтработанноеВремяВПериодахСКорректировками.ОплаченоДней) КАК ОплаченоДней,
		|	СУММА(ОтработанноеВремяВПериодахСКорректировками.ОплаченоЧасов) КАК ОплаченоЧасов
		|ПОМЕСТИТЬ ВТПериодыОтработанноеВремя
		|ИЗ
		|	ВТПериодыОтработанноеВремяСКорректировками КАК ОтработанноеВремяВПериодахСКорректировками
		|
		|СГРУППИРОВАТЬ ПО
		|	ОтработанноеВремяВПериодахСКорректировками.МесяцНачисления,
		|	ОтработанноеВремяВПериодахСКорректировками.ПериодДействия,
		|	ОтработанноеВремяВПериодахСКорректировками.Регистратор,
		|	ОтработанноеВремяВПериодахСКорректировками.Сотрудник,
		|	ОтработанноеВремяВПериодахСКорректировками.Подразделение,
		|	ОтработанноеВремяВПериодахСКорректировками.ВидРасчета,
		|	ОтработанноеВремяВПериодахСКорректировками.ДокументОснование,
		|	ОтработанноеВремяВПериодахСКорректировками.ДатаНачала,
		|	ОтработанноеВремяВПериодахСКорректировками.ВремяВЧасах,
		|	ОтработанноеВремяВПериодахСКорректировками.ИдентификаторСтроки,
		|	ОтработанноеВремяВПериодахСКорректировками.Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПериодыОтработанноеВремяСКорректировками";
	
	Если ТипЗнч(НачалоПериода) = Тип("Строка") Тогда
		ТекстЗапросаСКорректировками = СтрЗаменить(ТекстЗапросаСКорректировками, "&ОтработанноеВремяПараметрНачалоПериода", НачалоПериода);
	КонецЕсли;
	
	Если ТипЗнч(ОкончаниеПериода) = Тип("Строка") Тогда
		ТекстЗапросаСКорректировками = СтрЗаменить(ТекстЗапросаСКорректировками, "&ОтработанноеВремяПараметрОкончаниеПериода", ОкончаниеПериода);
	КонецЕсли;
	
	Если Не ЗарплатаКадрыОбщиеНаборыДанных.ЗаменитьЗапросСозданияВременнойТаблицы(Запрос.Текст, "ВТПериодыОтработанноеВремя", ТекстЗапросаСКорректировками) Тогда
		ВызватьИсключение НСтр("ru='Неправильный текст запроса к отработанному времени'");
	КонецЕсли;
	
	Возврат Запрос;
	
КонецФункции

Функция ЗапросПредставленияКадровыеДанныеСотрудниковАнализНачисленийИУдержаний(ТекстИсходногоЗапроса, ТолькоРазрешенные) Экспорт
	
	Запрос = ЗарплатаКадрыОбщиеНаборыДанныхБазовый.ЗапросПредставленияКадровыеДанныеСотрудниковАнализНачисленийИУдержаний(ТекстИсходногоЗапроса, ТолькоРазрешенные);
	Возврат Запрос;
	
КонецФункции

Функция ЗапросНачисленияДляСтатистики() 
	Возврат 
	"ВЫБРАТЬ
	|	ДАТАВРЕМЯ(1, 1, 1) КАК Период
	|ПОМЕСТИТЬ Представления_Периоды
	|ГДЕ
	|	""НачалоИнтервала"" = &НачалоПериода
	|	И ""ОкончаниеИнтервала"" = &КонецПериода
	|	И ""Периодичность"" = ""МЕСЯЦ""
	|	И ""ИспользоватьКонецПериода"" = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НАЧАЛОПЕРИОДА(НачисленияИУдержания.Период, МЕСЯЦ) КАК МесяцНачисления,
	|	НачисленияИУдержания.Период КАК Период,
	|	НачисленияИУдержания.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НачисленияИУдержания.СтатьяФинансирования КАК СтатьяФинансирования,
	|	НачисленияИУдержания.СтатьяРасходов КАК СтатьяРасходов,
	|	НачисленияИУдержания.Подразделение КАК Подразделение,
	|	НачисленияИУдержания.ГруппаНачисленияУдержанияВыплаты КАК Группа,
	|	НачисленияИУдержания.НачислениеУдержание КАК ВидРасчета,
	|	СУММА(НачисленияИУдержания.Сумма) КАК Сумма,
	|	НачисленияИУдержания.Организация КАК Организация,
	|	НачисленияИУдержания.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	НачисленияИУдержания.Сотрудник КАК Сотрудник,
	|	НачисленияИУдержания.ДатаНачала КАК ДатаНачала,
	|	НачисленияИУдержания.ДатаОкончания КАК ДатаОкончания,
	|	НачисленияИУдержания.Сотрудник.ГоловнойСотрудник КАК ГоловнойСотрудник,
	|	НачисленияИУдержания.ПериодДействия КАК ПериодДействия,
	|	НачисленияИУдержания.Регистратор КАК Регистратор,
	|	НачисленияИУдержания.ДокументОснование КАК ДокументОснование,
	|	НачисленияИУдержания.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	НачисленияИУдержания.Сторно КАК Сторно,
	|	НачисленияИУдержания.ТерриторияВыполненияРаботВОрганизации КАК ТерриторияНачисления,
	|	ИСТИНА КАК НачислениеТекущегоПериода
	|ПОМЕСТИТЬ ВТНачисленияИУдержанияБезКадровыхДанных
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК НачисленияИУдержания
	|ГДЕ
	|	НачисленияИУдержания.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ НачисленияИУдержания.Регистратор В (&ИсключаемыеСсылки)
	|{ГДЕ
	|	НачисленияИУдержания.Сотрудник.*,
	|	НачисленияИУдержания.ФизическоеЛицо.*,
	|	НачисленияИУдержания.Организация.ГоловнаяОрганизация.* КАК ГоловнаяОрганизация,
	|	НачисленияИУдержания.Сотрудник.ГоловнойСотрудник.* КАК ГоловнойСотрудник}
	|
	|СГРУППИРОВАТЬ ПО
	|	НачисленияИУдержания.Период,
	|	НачисленияИУдержания.ФизическоеЛицо,
	|	НачисленияИУдержания.СтатьяФинансирования,
	|	НачисленияИУдержания.СтатьяРасходов,
	|	НачисленияИУдержания.Подразделение,
	|	НачисленияИУдержания.ГруппаНачисленияУдержанияВыплаты,
	|	НачисленияИУдержания.НачислениеУдержание,
	|	НачисленияИУдержания.Организация,
	|	НачисленияИУдержания.Сотрудник,
	|	НачисленияИУдержания.ДатаНачала,
	|	НачисленияИУдержания.ДатаОкончания,
	|	НачисленияИУдержания.Сотрудник.ГоловнойСотрудник,
	|	НачисленияИУдержания.ПериодДействия,
	|	НачисленияИУдержания.Регистратор,
	|	НАЧАЛОПЕРИОДА(НачисленияИУдержания.Период, МЕСЯЦ),
	|	НачисленияИУдержания.ДокументОснование,
	|	НачисленияИУдержания.ИдентификаторСтроки,
	|	НачисленияИУдержания.Организация.ГоловнаяОрганизация,
	|	НачисленияИУдержания.Сторно,
	|	НачисленияИУдержания.ТерриторияВыполненияРаботВОрганизации
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НАЧАЛОПЕРИОДА(НачисленияИУдержания.ПериодДействия, МЕСЯЦ),
	|	НачисленияИУдержания.Период,
	|	НачисленияИУдержания.ФизическоеЛицо,
	|	НачисленияИУдержания.СтатьяФинансирования,
	|	НачисленияИУдержания.СтатьяРасходов,
	|	НачисленияИУдержания.Подразделение,
	|	НачисленияИУдержания.ГруппаНачисленияУдержанияВыплаты,
	|	НачисленияИУдержания.НачислениеУдержание,
	|	0,
	|	НачисленияИУдержания.Организация,
	|	НачисленияИУдержания.Организация.ГоловнаяОрганизация,
	|	НачисленияИУдержания.Сотрудник,
	|	НачисленияИУдержания.ДатаНачала,
	|	НачисленияИУдержания.ДатаОкончания,
	|	ВЫРАЗИТЬ(НачисленияИУдержания.Сотрудник КАК Справочник.Сотрудники).ГоловнойСотрудник,
	|	НачисленияИУдержания.ПериодДействия,
	|	НачисленияИУдержания.Регистратор,
	|	НачисленияИУдержания.ДокументОснование,
	|	НачисленияИУдержания.ИдентификаторСтроки,
	|	НачисленияИУдержания.Сторно,
	|	НачисленияИУдержания.ТерриторияВыполненияРаботВОрганизации,
	|	ЛОЖЬ
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК НачисленияИУдержания
	|ГДЕ
	|	НачисленияИУдержания.ПериодДействия МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ НачисленияИУдержания.Регистратор В (&ИсключаемыеСсылки)
	|	И НачисленияИУдержания.ПериодДействия <> НачисленияИУдержания.Период
	|{ГДЕ
	|	НачисленияИУдержания.Сотрудник.*,
	|	НачисленияИУдержания.ФизическоеЛицо.*,
	|	НачисленияИУдержания.Организация.ГоловнаяОрганизация.* КАК ГоловнаяОрганизация,
	|	НачисленияИУдержания.Сотрудник.ГоловнойСотрудник.* КАК ГоловнойСотрудник}
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НачисленияИУдержания.Организация КАК Организация,
	|	НачисленияИУдержания.Сотрудник КАК Сотрудник,
	|	НачисленияИУдержания.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НачисленияИУдержания.СтатьяФинансирования КАК СтатьяФинансирования,
	|	НачисленияИУдержания.СтатьяРасходов КАК СтатьяРасходов,
	|	НачисленияИУдержания.Подразделение КАК Подразделение,
	|	КОНЕЦПЕРИОДА(НачисленияИУдержания.Период, МЕСЯЦ) КАК Период
	|ПОМЕСТИТЬ ВТВсеСотрудникиСПериодом
	|ИЗ
	|	ВТНачисленияИУдержанияБезКадровыхДанных КАК НачисленияИУдержания
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НачисленияИУдержания.Организация,
	|	НачисленияИУдержания.Сотрудник,
	|	НачисленияИУдержания.ФизическоеЛицо,
	|	НачисленияИУдержания.СтатьяФинансирования,
	|	НачисленияИУдержания.СтатьяРасходов,
	|	НачисленияИУдержания.Подразделение,
	|	НачисленияИУдержания.ДатаНачала
	|ИЗ
	|	ВТНачисленияИУдержанияБезКадровыхДанных КАК НачисленияИУдержания
	|ГДЕ
	|	НачисленияИУдержания.ДатаНачала <> ДАТАВРЕМЯ(1, 1, 1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОстаткиИОбороты.Организация КАК Организация,
	|	ОстаткиИОбороты.Сотрудник КАК Сотрудник,
	|	ОстаткиИОбороты.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ОстаткиИОбороты.Подразделение КАК Подразделение,
	|	ОстаткиИОбороты.СтатьяФинансирования КАК СтатьяФинансирования,
	|	ОстаткиИОбороты.СтатьяРасходов КАК СтатьяРасходов,
	|	Месяцы.Период КАК Месяц
	|ПОМЕСТИТЬ ВТСотрудникиМесяцы
	|ИЗ
	|	ВТВсеСотрудникиСПериодом КАК ОстаткиИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Представления_Периоды КАК Месяцы
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВсеСотрудникиСПериодом.Организация КАК Организация,
	|	ВсеСотрудникиСПериодом.Сотрудник КАК Сотрудник,
	|	ВсеСотрудникиСПериодом.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВсеСотрудникиСПериодом.Подразделение КАК Подразделение,
	|	ВсеСотрудникиСПериодом.СтатьяФинансирования КАК СтатьяФинансирования,
	|	ВсеСотрудникиСПериодом.СтатьяРасходов КАК СтатьяРасходов,
	|	ВсеСотрудникиСПериодом.Период КАК Период
	|ПОМЕСТИТЬ ВТВсеПериодомКадровыхДанных
	|ИЗ
	|	ВТВсеСотрудникиСПериодом КАК ВсеСотрудникиСПериодом
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СотрудникиМесяцы.Организация,
	|	СотрудникиМесяцы.Сотрудник,
	|	СотрудникиМесяцы.ФизическоеЛицо,
	|	СотрудникиМесяцы.Подразделение,
	|	СотрудникиМесяцы.СтатьяФинансирования,
	|	СотрудникиМесяцы.СтатьяРасходов,
	|	СотрудникиМесяцы.Месяц
	|ИЗ
	|	ВТСотрудникиМесяцы КАК СотрудникиМесяцы
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СотрудникиМесяцы.Организация,
	|	СотрудникиМесяцы.Сотрудник,
	|	СотрудникиМесяцы.ФизическоеЛицо,
	|	СотрудникиМесяцы.Подразделение,
	|	СотрудникиМесяцы.СтатьяФинансирования,
	|	СотрудникиМесяцы.СтатьяРасходов,
	|	КОНЕЦПЕРИОДА(СотрудникиМесяцы.Месяц, МЕСЯЦ)
	|ИЗ
	|	ВТСотрудникиМесяцы КАК СотрудникиМесяцы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДАТАВРЕМЯ(1, 1, 1) КАК Период,
	|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) КАК Сотрудник,
	|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) КАК ГоловнойСотрудник,
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК ГоловнаяОрганизация,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка) КАК Должность,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыЗанятости.ПустаяСсылка) КАК ВидЗанятости,
	|	"""" КАК Фамилия,
	|	"""" КАК Имя,
	|	"""" КАК Отчество,
	|	0 КАК ТарифнаяСтавка,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаУвольнения,
	|	0 КАК ПриоритетРабочегоМеста
	|ПОМЕСТИТЬ Представления_КадровыеДанныеСотрудниковАнализНачисленийИУдержаний
	|ГДЕ
	|	""ТолькоРазрешенные"" = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДАТАВРЕМЯ(1, 1, 1) КАК Период,
	|	ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) КАК ФизическоеЛицо,
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК ГоловнаяОрганизация,
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК ОрганизацияСортировки,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК ПодразделениеСортировки
	|ПОМЕСТИТЬ Представления_ПодразделенияСортировкиСотрудников
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПодразделенияСортировкиСотрудников.ОрганизацияСортировки КАК ОрганизацияСортировки,
	|	ПодразделенияСортировкиСотрудников.ПодразделениеСортировки КАК ПодразделениеСортировки,
	|	КадровыеДанныеСотрудниковНаКонецПериода.ПриоритетРабочегоМеста КАК ПриоритетРабочегоМеста,
	|	НачисленияИУдержания.МесяцНачисления КАК МесяцНачисления,
	|	НачисленияИУдержания.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НачисленияИУдержания.СтатьяФинансирования КАК СтатьяФинансирования,
	|	НачисленияИУдержания.СтатьяРасходов КАК СтатьяРасходов,
	|	НачисленияИУдержания.Подразделение КАК Подразделение,
	|	НачисленияИУдержания.Группа КАК Группа,
	|	НачисленияИУдержания.ВидРасчета КАК ВидРасчета,
	|	НачисленияИУдержания.Сумма КАК Сумма,
	|	НачисленияИУдержания.Организация КАК Организация,
	|	НачисленияИУдержания.Сотрудник КАК Сотрудник,
	|	НачисленияИУдержания.ДатаНачала КАК ДатаНачала,
	|	НачисленияИУдержания.ДатаОкончания КАК ДатаОкончания,
	|	НачисленияИУдержания.ГоловнойСотрудник КАК ГоловнойСотрудник,
	|	КадровыеДанныеГоловныхСотрудников.Фамилия КАК Фамилия,
	|	КадровыеДанныеГоловныхСотрудников.Имя КАК Имя,
	|	КадровыеДанныеГоловныхСотрудников.Отчество КАК Отчество,
	|	КадровыеДанныеГоловныхСотрудников.Должность КАК ДолжностьГоловногоСотрудникаНаКонецПериода,
	|	КадровыеДанныеГоловныхСотрудников.Организация КАК ОрганизацияГоловногоСотрудникаНаКонецПериода,
	|	КадровыеДанныеГоловныхСотрудников.Подразделение КАК ПодразделениеГоловногоСотрудникаНаКонецПериода,
	|	КадровыеДанныеГоловныхСотрудников.ВидЗанятости КАК ВидЗанятостиГоловногоСотрудникаНаКонецПериода,
	|	НачисленияИУдержания.ПериодДействия КАК ПериодДействия,
	|	НачисленияИУдержания.Регистратор КАК Регистратор,
	|	КадровыеДанныеСотрудниковНаКонецПериода.Подразделение КАК ПодразделениеНаКонецПериода,
	|	КадровыеДанныеСотрудниковНаКонецПериода.ВидЗанятости КАК ВидЗанятостиНаКонецПериода,
	|	КадровыеДанныеСотрудниковНаКонецПериода.Должность КАК ДолжностьНаКонецПериода,
	|	КадровыеДанныеСотрудников.Должность КАК Должность,
	|	КадровыеДанныеСотрудниковНаКонецПериода.ТарифнаяСтавка КАК ТарифнаяСтавкаНаКонецПериода,
	|	КадровыеДанныеСотрудников.ТарифнаяСтавка КАК ТарифнаяСтавка,
	|	КадровыеДанныеСотрудников.ВидЗанятости КАК ВидЗанятости,
	|	NULL КАК Показатель,
	|	0 КАК Значение,
	|	КадровыеДанныеГоловныхСотрудников.ДатаУвольнения КАК ДатаУвольнения,
	|	НачисленияИУдержания.ДокументОснование КАК ДокументОснование,
	|	НачисленияИУдержания.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	НачисленияИУдержания.Сторно КАК Сторно,
	|	НачисленияИУдержания.ТерриторияНачисления КАК ТерриторияНачисления,
	|	НачисленияИУдержания.НачислениеТекущегоПериода КАК НачислениеТекущегоПериода
	|ПОМЕСТИТЬ ВТНачисленияИУдержанияСКадровымиДанными
	|ИЗ
	|	ВТНачисленияИУдержанияБезКадровыхДанных КАК НачисленияИУдержания
	|		{ЛЕВОЕ СОЕДИНЕНИЕ Представления_КадровыеДанныеСотрудниковАнализНачисленийИУдержаний КАК КадровыеДанныеСотрудниковНаКонецПериода
	|		ПО НачисленияИУдержания.Сотрудник = КадровыеДанныеСотрудниковНаКонецПериода.Сотрудник
	|			И (КОНЕЦПЕРИОДА(НачисленияИУдержания.Период, МЕСЯЦ) = КадровыеДанныеСотрудниковНаКонецПериода.Период)}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ Представления_КадровыеДанныеСотрудниковАнализНачисленийИУдержаний КАК КадровыеДанныеСотрудников
	|		ПО НачисленияИУдержания.Сотрудник = КадровыеДанныеСотрудников.Сотрудник
	|			И (ВЫБОР
	|				КОГДА НачисленияИУдержания.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА КОНЕЦПЕРИОДА(НачисленияИУдержания.Период, МЕСЯЦ)
	|				ИНАЧЕ НачисленияИУдержания.ДатаНачала
	|			КОНЕЦ = КадровыеДанныеСотрудников.Период)}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ Представления_КадровыеДанныеСотрудниковАнализНачисленийИУдержаний КАК КадровыеДанныеГоловныхСотрудников
	|		ПО (ВЫРАЗИТЬ(НачисленияИУдержания.Сотрудник КАК Справочник.Сотрудники).ГоловнойСотрудник = КадровыеДанныеГоловныхСотрудников.Сотрудник)
	|			И (КОНЕЦПЕРИОДА(НачисленияИУдержания.Период, МЕСЯЦ) = КадровыеДанныеГоловныхСотрудников.Период)}
	|		{ЛЕВОЕ СОЕДИНЕНИЕ Представления_ПодразделенияСортировкиСотрудников КАК ПодразделенияСортировкиСотрудников
	|		ПО НачисленияИУдержания.ФизическоеЛицо = ПодразделенияСортировкиСотрудников.ФизическоеЛицо
	|			И (КОНЕЦПЕРИОДА(НачисленияИУдержания.Период, МЕСЯЦ) = ПодразделенияСортировкиСотрудников.Период)
	|			И НачисленияИУдержания.ГоловнаяОрганизация = ПодразделенияСортировкиСотрудников.ГоловнаяОрганизация}
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДАТАВРЕМЯ(1, 1, 1) КАК МесяцНачисления,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ПериодДействия,
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) КАК Сотрудник,
	|	ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка) КАК Подразделение,
	|	ЗНАЧЕНИЕ(ПланВидовРасчета.Начисления.ПустаяСсылка) КАК ВидРасчета,
	|	0 КАК ОтработаноДней,
	|	0 КАК ОтработаноЧасов,
	|	0 КАК ОтработаноДнейВПериоде,
	|	0 КАК ОтработаноЧасовВПериоде,
	|	0 КАК ОплаченоДней,
	|	0 КАК ОплаченоЧасов,
	|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаНачала,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиФинансированияЗарплата.ПустаяСсылка) КАК СтатьяФинансирования,
	|	ЛОЖЬ КАК ВремяВЧасах,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиРасходовЗарплата.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК ДокументОснование,
	|	0 КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ Представления_ОтработанноеВремя
	|ИЗ
	|	ВТНачисленияИУдержанияБезКадровыхДанных КАК НачисленияИУдержания
	|ГДЕ
	|	""НачалоПериода"" = &НачалоПериода
	|	И ""ОкончаниеПериода"" = &КонецПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеСотрудников.ОрганизацияСортировки КАК ОрганизацияСортировки,
	|	ДанныеСотрудников.ПодразделениеСортировки КАК ПодразделениеСортировки,
	|	ДанныеСотрудников.ПриоритетРабочегоМеста КАК ПриоритетРабочегоМеста,
	|	ДанныеСотрудников.МесяцНачисления КАК МесяцНачисления,
	|	ДанныеСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДанныеСотрудников.СтатьяФинансирования КАК СтатьяФинансирования,
	|	ДанныеСотрудников.СтатьяРасходов КАК СтатьяРасходов,
	|	ДанныеСотрудников.Подразделение КАК Подразделение,
	|	ДанныеСотрудников.Группа КАК Группа,
	|	ДанныеСотрудников.ВидРасчета КАК ВидРасчета,
	|	ДанныеСотрудников.ДокументОснование КАК ДокументОснование,
	|	ДанныеСотрудников.Сумма КАК Сумма,
	|	ДанныеСотрудников.ДатаНачала КАК ДатаНачала,
	|	ДанныеСотрудников.ДатаОкончания КАК ДатаОкончания,
	|	ЕСТЬNULL(ОтработанноеВремя.ОтработаноДней, 0) КАК ОтработаноДней,
	|	ЕСТЬNULL(ОтработанноеВремя.ОтработаноЧасов, 0) КАК ОтработаноЧасов,
	|	ЕСТЬNULL(ОтработанноеВремя.ОтработаноДнейВПериоде, 0) КАК ОтработаноДнейВПериоде,
	|	ЕСТЬNULL(ОтработанноеВремя.ОтработаноЧасовВПериоде, 0) КАК ОтработаноЧасовВПериоде,
	|	ЕСТЬNULL(ОтработанноеВремя.ОплаченоДней, 0) КАК ОплаченоДней,
	|	ЕСТЬNULL(ОтработанноеВремя.ОплаченоЧасов, 0) КАК ОплаченоЧасов,
	|	ДанныеСотрудников.Организация.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ДанныеСотрудников.Организация КАК Организация,
	|	ДанныеСотрудников.Сотрудник КАК Сотрудник,
	|	ДанныеСотрудников.Фамилия КАК Фамилия,
	|	ДанныеСотрудников.Имя КАК Имя,
	|	ДанныеСотрудников.Отчество КАК Отчество,
	|	ДанныеСотрудников.ГоловнойСотрудник КАК ГоловнойСотрудник,
	|	ДанныеСотрудников.ДолжностьГоловногоСотрудникаНаКонецПериода КАК ДолжностьГоловногоСотрудникаНаКонецПериода,
	|	ДанныеСотрудников.ОрганизацияГоловногоСотрудникаНаКонецПериода КАК ОрганизацияГоловногоСотрудникаНаКонецПериода,
	|	ДанныеСотрудников.ПодразделениеГоловногоСотрудникаНаКонецПериода КАК ПодразделениеГоловногоСотрудникаНаКонецПериода,
	|	ДанныеСотрудников.ВидЗанятостиГоловногоСотрудникаНаКонецПериода КАК ВидЗанятостиГоловногоСотрудникаНаКонецПериода,
	|	ДанныеСотрудников.ПериодДействия КАК ПериодДействия,
	|	ДанныеСотрудников.Регистратор КАК Регистратор,
	|	ДанныеСотрудников.ПодразделениеНаКонецПериода КАК ПодразделениеНаКонецПериода,
	|	ДанныеСотрудников.ВидЗанятостиНаКонецПериода КАК ВидЗанятостиНаКонецПериода,
	|	ДанныеСотрудников.ДолжностьНаКонецПериода КАК ДолжностьНаКонецПериода,
	|	ДанныеСотрудников.ТарифнаяСтавкаНаКонецПериода КАК ТарифнаяСтавкаНаКонецПериода,
	|	ДанныеСотрудников.ВидЗанятости КАК ВидЗанятости,
	|	ДанныеСотрудников.Должность КАК Должность,
	|	ДанныеСотрудников.ТарифнаяСтавка КАК ТарифнаяСтавка,
	|	ОтработанноеВремя.ВремяВЧасах КАК ВремяВЧасах,
	|	ДанныеСотрудников.Показатель КАК Показатель,
	|	ДанныеСотрудников.Значение КАК Значение,
	|	ДанныеСотрудников.ДатаУвольнения КАК ДатаУвольнения,
	|	ДанныеСотрудников.Сторно КАК Сторно,
	|	ДанныеСотрудников.ТерриторияНачисления КАК ТерриторияНачисления,
	|	ВЫРАЗИТЬ(NULL КАК БУЛЕВО) КАК ПервыйМесяц,
	|	ВЫРАЗИТЬ(NULL КАК БУЛЕВО) КАК ПоследнийМесяц
	|ПОМЕСТИТЬ ОбщиеЗапросы_НачисленияУдержанияСтатистикаПерсонала
	|ИЗ
	|	ВТНачисленияИУдержанияСКадровымиДанными КАК ДанныеСотрудников
	|		{ЛЕВОЕ СОЕДИНЕНИЕ Представления_ОтработанноеВремя КАК ОтработанноеВремя
	|		ПО ДанныеСотрудников.Регистратор = ОтработанноеВремя.Регистратор
	|			И ДанныеСотрудников.ДокументОснование = ОтработанноеВремя.ДокументОснование
	|			И ДанныеСотрудников.Организация = ОтработанноеВремя.Организация
	|			И ДанныеСотрудников.Сотрудник = ОтработанноеВремя.Сотрудник
	|			И ДанныеСотрудников.Подразделение = ОтработанноеВремя.Подразделение
	|			И ДанныеСотрудников.ВидРасчета = ОтработанноеВремя.ВидРасчета
	|			И ДанныеСотрудников.МесяцНачисления = ОтработанноеВремя.МесяцНачисления
	|			И ДанныеСотрудников.СтатьяФинансирования = ОтработанноеВремя.СтатьяФинансирования
	|			И ДанныеСотрудников.СтатьяРасходов = ОтработанноеВремя.СтатьяРасходов
	|			И ДанныеСотрудников.ИдентификаторСтроки = ОтработанноеВремя.ИдентификаторСтроки}
	|ГДЕ
	|	ДанныеСотрудников.НачислениеТекущегоПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеСотрудников.ОрганизацияСортировки,
	|	ДанныеСотрудников.ПодразделениеСортировки,
	|	ДанныеСотрудников.ПриоритетРабочегоМеста,
	|	ДанныеСотрудников.МесяцНачисления,
	|	ДанныеСотрудников.ФизическоеЛицо,
	|	ДанныеСотрудников.СтатьяФинансирования,
	|	ДанныеСотрудников.СтатьяРасходов,
	|	ДанныеСотрудников.Подразделение,
	|	ДанныеСотрудников.Группа,
	|	ДанныеСотрудников.ВидРасчета,
	|	ДанныеСотрудников.ДокументОснование,
	|	ДанныеСотрудников.Сумма,
	|	ДанныеСотрудников.ДатаНачала,
	|	ДанныеСотрудников.ДатаОкончания,
	|	ЕСТЬNULL(ОтработанноеВремя.ОтработаноДней, 0),
	|	ЕСТЬNULL(ОтработанноеВремя.ОтработаноЧасов, 0),
	|	ЕСТЬNULL(ОтработанноеВремя.ОтработаноДнейВПериоде, 0),
	|	ЕСТЬNULL(ОтработанноеВремя.ОтработаноЧасовВПериоде, 0),
	|	ЕСТЬNULL(ОтработанноеВремя.ОплаченоДней, 0),
	|	ЕСТЬNULL(ОтработанноеВремя.ОплаченоЧасов, 0),
	|	ДанныеСотрудников.Организация.ГоловнаяОрганизация,
	|	ДанныеСотрудников.Организация,
	|	ДанныеСотрудников.Сотрудник,
	|	ДанныеСотрудников.Фамилия,
	|	ДанныеСотрудников.Имя,
	|	ДанныеСотрудников.Отчество,
	|	ДанныеСотрудников.ГоловнойСотрудник,
	|	ДанныеСотрудников.ДолжностьГоловногоСотрудникаНаКонецПериода,
	|	ДанныеСотрудников.ОрганизацияГоловногоСотрудникаНаКонецПериода,
	|	ДанныеСотрудников.ПодразделениеГоловногоСотрудникаНаКонецПериода,
	|	ДанныеСотрудников.ВидЗанятостиГоловногоСотрудникаНаКонецПериода,
	|	ДанныеСотрудников.ПериодДействия,
	|	ДанныеСотрудников.Регистратор,
	|	ДанныеСотрудников.ПодразделениеНаКонецПериода,
	|	ДанныеСотрудников.ВидЗанятостиНаКонецПериода,
	|	ДанныеСотрудников.ДолжностьНаКонецПериода,
	|	ДанныеСотрудников.ТарифнаяСтавкаНаКонецПериода,
	|	ДанныеСотрудников.ВидЗанятости,
	|	ДанныеСотрудников.Должность,
	|	ДанныеСотрудников.ТарифнаяСтавка,
	|	ОтработанноеВремя.ВремяВЧасах,
	|	ДанныеСотрудников.Показатель,
	|	ДанныеСотрудников.Значение,
	|	ДанныеСотрудников.ДатаУвольнения,
	|	ДанныеСотрудников.Сторно,
	|	ДанныеСотрудников.ТерриторияНачисления,
	|	NULL,
	|	NULL
	|ИЗ
	|	ВТНачисленияИУдержанияСКадровымиДанными КАК ДанныеСотрудников
	|		{ЛЕВОЕ СОЕДИНЕНИЕ Представления_ОтработанноеВремя КАК ОтработанноеВремя
	|		ПО ДанныеСотрудников.Регистратор = ОтработанноеВремя.Регистратор
	|			И ДанныеСотрудников.ДокументОснование = ОтработанноеВремя.ДокументОснование
	|			И ДанныеСотрудников.Организация = ОтработанноеВремя.Организация
	|			И ДанныеСотрудников.Сотрудник = ОтработанноеВремя.Сотрудник
	|			И ДанныеСотрудников.Подразделение = ОтработанноеВремя.Подразделение
	|			И ДанныеСотрудников.ВидРасчета = ОтработанноеВремя.ВидРасчета
	|			И ДанныеСотрудников.МесяцНачисления = ОтработанноеВремя.МесяцНачисления
	|			И ДанныеСотрудников.СтатьяФинансирования = ОтработанноеВремя.СтатьяФинансирования
	|			И ДанныеСотрудников.СтатьяРасходов = ОтработанноеВремя.СтатьяРасходов
	|			И ДанныеСотрудников.ИдентификаторСтроки = ОтработанноеВремя.ИдентификаторСтроки}
	|ГДЕ
	|	НЕ ДанныеСотрудников.НачислениеТекущегоПериода
	|	И НЕ ОтработанноеВремя.МесяцНачисления ЕСТЬ NULL";
	
КонецФункции

Процедура ДополнитьТекстЗапросаНачисленияУдержанияЗначениямиПоказателей(ТекстЗапроса)
	ИскомаяВТ = ВРег("ПОМЕСТИТЬ ВТНачисленияИУдержанияСКадровымиДанными");
	
	МассивПодзапросов = СтрРазделить(ТекстЗапроса, ";");
	Для каждого ТекстПодзапроса Из МассивПодзапросов Цикл
		
		Если СтрНайти(ВРег(ТекстПодзапроса), ИскомаяВТ) > 0 Тогда
			
			ИсходныйПодзапрос = ТекстПодзапроса;
			
			ТекстЗапросаПоказателейНачислений =
				"ВЫБРАТЬ
				|	НачисленияПоказатели.Ссылка КАК ВидРасчета
				|ПОМЕСТИТЬ ВТВидыРасчетаБезОсновныхПоказателей
				|ИЗ
				|	ПланВидовРасчета.Начисления.Показатели КАК НачисленияПоказатели
				|
				|СГРУППИРОВАТЬ ПО
				|	НачисленияПоказатели.Ссылка
				|
				|ИМЕЮЩИЕ
				|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НачисленияПоказатели.НомерСтроки) > 0 И
				|	МАКСИМУМ(ЕСТЬNULL(НачисленияПоказатели.ОсновнойПоказатель, ЛОЖЬ)) = ЛОЖЬ
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	УдержанияПоказатели.Ссылка
				|ИЗ
				|	ПланВидовРасчета.Удержания.Показатели КАК УдержанияПоказатели
				|
				|СГРУППИРОВАТЬ ПО
				|	УдержанияПоказатели.Ссылка
				|
				|ИМЕЮЩИЕ
				|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ УдержанияПоказатели.НомерСтроки) > 0 И
				|	МАКСИМУМ(ЕСТЬNULL(УдержанияПоказатели.ОсновнойПоказатель, ЛОЖЬ)) = ЛОЖЬ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	СотрудникиМесяцы.Организация КАК Организация,
				|	СотрудникиМесяцы.Сотрудник КАК Сотрудник,
				|	СотрудникиМесяцы.Месяц КАК ПериодРегистрации,
				|	НачисленияИУдержания.Регистратор КАК Регистратор,
				|	НачисленияИУдержания.ДатаНачала КАК ПериодДействияНачало,
				|	МИНИМУМ(НачисленияИУдержания.ДатаОкончания) КАК ПериодДействияКонец,
				|	НачисленияИУдержания.ВидРасчета КАК ВидРасчета,
				|	НачисленияПоказатели.Показатель КАК Показатель,
				|	НачисленияИУдержания.ИдентификаторСтроки КАК ИдентификаторСтроки,
				|	ЕСТЬNULL(НачисленияПоказатели.ОсновнойПоказатель, ЛОЖЬ) КАК ОсновнойПоказатель,
				|	ВЫБОР
				|		КОГДА НачисленияПоказатели.ОсновнойПоказатель
				|			ТОГДА 1
				|		ИНАЧЕ 10
				|	КОНЕЦ * НачисленияПоказатели.НомерСтроки КАК ПорядокПоказателей
				|ПОМЕСТИТЬ ВТПоказателиНачисленийПредварительно
				|ИЗ
				|	ВТСотрудникиМесяцы КАК СотрудникиМесяцы
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисленияИУдержанияБезКадровыхДанных КАК НачисленияИУдержания
				|		ПО СотрудникиМесяцы.Сотрудник = НачисленияИУдержания.Сотрудник
				|			И СотрудникиМесяцы.Месяц = НачисленияИУдержания.МесяцНачисления
				|			И (НачисленияИУдержания.Группа = ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.Начислено))
				|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления.Показатели КАК НачисленияПоказатели
				|		ПО (НачисленияИУдержания.ВидРасчета = НачисленияПоказатели.Ссылка)
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыРасчетаБезОсновныхПоказателей КАК ВидыРасчетаБезОсновныхПоказателей
				|		ПО (НачисленияПоказатели.Ссылка = ВидыРасчетаБезОсновныхПоказателей.ВидРасчета)
				|ГДЕ
				|	НЕ НачисленияПоказатели.Показатель ЕСТЬ NULL
				|
				|СГРУППИРОВАТЬ ПО
				|	СотрудникиМесяцы.Организация,
				|	СотрудникиМесяцы.Сотрудник,
				|	СотрудникиМесяцы.Месяц,
				|	НачисленияИУдержания.Регистратор,
				|	НачисленияИУдержания.ДатаНачала,
				|	НачисленияИУдержания.ВидРасчета,
				|	НачисленияИУдержания.ИдентификаторСтроки,
				|	НачисленияПоказатели.Показатель,
				|	НачисленияПоказатели.ОсновнойПоказатель,
				|	НачисленияПоказатели.НомерСтроки,
				|	ВидыРасчетаБезОсновныхПоказателей.ВидРасчета
				|
				|ОБЪЕДИНИТЬ
				|
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	СотрудникиМесяцы.Организация,
				|	СотрудникиМесяцы.Сотрудник,
				|	СотрудникиМесяцы.Месяц,
				|	НачисленияИУдержания.Регистратор,
				|	НачисленияИУдержания.МесяцНачисления,
				|	МИНИМУМ(НачисленияИУдержания.МесяцНачисления),
				|	НачисленияИУдержания.ВидРасчета,
				|	УдержанияПоказатели.Показатель,
				|	НачисленияИУдержания.ИдентификаторСтроки,
				|	ЕСТЬNULL(УдержанияПоказатели.ОсновнойПоказатель, ЛОЖЬ),
				|	ВЫБОР
				|		КОГДА УдержанияПоказатели.ОсновнойПоказатель
				|			ТОГДА 1
				|		ИНАЧЕ 10
				|	КОНЕЦ * УдержанияПоказатели.НомерСтроки
				|ИЗ
				|	ВТСотрудникиМесяцы КАК СотрудникиМесяцы
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисленияИУдержанияБезКадровыхДанных КАК НачисленияИУдержания
				|		ПО СотрудникиМесяцы.ФизическоеЛицо = НачисленияИУдержания.ФизическоеЛицо
				|			И СотрудникиМесяцы.Месяц = НачисленияИУдержания.МесяцНачисления
				|			И (НачисленияИУдержания.Группа = ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.Удержано))
				|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Удержания.Показатели КАК УдержанияПоказатели
				|		ПО (НачисленияИУдержания.ВидРасчета = УдержанияПоказатели.Ссылка)
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВидыРасчетаБезОсновныхПоказателей КАК ВидыРасчетаБезОсновныхПоказателей
				|		ПО (УдержанияПоказатели.Ссылка = ВидыРасчетаБезОсновныхПоказателей.ВидРасчета)
				|ГДЕ
				|	НЕ УдержанияПоказатели.Показатель ЕСТЬ NULL
				|
				|СГРУППИРОВАТЬ ПО
				|	СотрудникиМесяцы.Организация,
				|	СотрудникиМесяцы.Сотрудник,
				|	СотрудникиМесяцы.Месяц,
				|	НачисленияИУдержания.Регистратор,
				|	НачисленияИУдержания.МесяцНачисления,
				|	НачисленияИУдержания.ВидРасчета,
				|	НачисленияИУдержания.ИдентификаторСтроки,
				|	УдержанияПоказатели.Показатель,
				|	УдержанияПоказатели.ОсновнойПоказатель,
				|	УдержанияПоказатели.НомерСтроки,
				|	ВидыРасчетаБезОсновныхПоказателей.ВидРасчета
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
				|	ПоказателиНачислений.Сотрудник КАК Сотрудник,
				|	ПоказателиНачислений.Регистратор КАК Регистратор,
				|	ПоказателиНачислений.ВидРасчета КАК ВидРасчета,
				|	ПоказателиНачислений.ИдентификаторСтроки КАК ИдентификаторСтроки,
				|	ЕСТЬNULL(ЗначенияПоказателейНачислений.Показатель, ЗначенияПоказателейУдержаний.Показатель) КАК Показатель,
				|	ПоказателиНачислений.ОсновнойПоказатель КАК ОсновнойПоказатель,
				|	МАКСИМУМ(ЕСТЬNULL(ЗначенияПоказателейНачислений.Значение, ЗначенияПоказателейУдержаний.Значение)) КАК Значение,
				|	ПоказателиНачислений.ПорядокПоказателей КАК ПорядокПоказателей
				|ПОМЕСТИТЬ ВТПоказателиНачисленийСоЗначениямиПоказателей
				|ИЗ
				|	ВТПоказателиНачисленийПредварительно КАК ПоказателиНачислений
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПоказателейНачислений КАК ЗначенияПоказателейНачислений
				|		ПО ПоказателиНачислений.Регистратор = ЗначенияПоказателейНачислений.Регистратор
				|			И ПоказателиНачислений.ИдентификаторСтроки = ЗначенияПоказателейНачислений.ИдентификаторСтроки
				|			И ПоказателиНачислений.Показатель = ЗначенияПоказателейНачислений.Показатель
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПоказателейУдержаний КАК ЗначенияПоказателейУдержаний
				|		ПО ПоказателиНачислений.Регистратор = ЗначенияПоказателейУдержаний.Регистратор
				|			И ПоказателиНачислений.ИдентификаторСтроки = ЗначенияПоказателейУдержаний.ИдентификаторСтроки
				|			И ПоказателиНачислений.Показатель = ЗначенияПоказателейУдержаний.Показатель
				|ГДЕ
				|	(&ВыводитьВсеПоказателиНачисленийИУдержаний
				|				И НЕ ЕСТЬNULL(ЗначенияПоказателейНачислений.Показатель, ЗначенияПоказателейУдержаний.Показатель) ЕСТЬ NULL
				|			ИЛИ &ВыводитьПоказателиНачисленийИУдержаний
				|				И ЕСТЬNULL(ПоказателиНачислений.ОсновнойПоказатель, ЛОЖЬ))
				|
				|СГРУППИРОВАТЬ ПО
				|	ПоказателиНачислений.Сотрудник,
				|	ПоказателиНачислений.Регистратор,
				|	ПоказателиНачислений.ВидРасчета,
				|	ПоказателиНачислений.ИдентификаторСтроки,
				|	ЕСТЬNULL(ЗначенияПоказателейНачислений.Показатель, ЗначенияПоказателейУдержаний.Показатель),
				|	ПоказателиНачислений.ОсновнойПоказатель,
				|	ПоказателиНачислений.ПорядокПоказателей
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ПоказателиНачислений.Сотрудник КАК Сотрудник,
				|	ПоказателиНачислений.Регистратор КАК Регистратор,
				|	ПоказателиНачислений.ВидРасчета КАК ВидРасчета,
				|	ПоказателиНачислений.ИдентификаторСтроки КАК ИдентификаторСтроки,
				|	МИНИМУМ(ПоказателиНачислений.ПорядокПоказателей) КАК ПорядокПоказателей
				|ПОМЕСТИТЬ ВТПервыеПоказатели
				|ИЗ
				|	ВТПоказателиНачисленийСоЗначениямиПоказателей КАК ПоказателиНачислений
				|
				|СГРУППИРОВАТЬ ПО
				|	ПоказателиНачислений.Сотрудник,
				|	ПоказателиНачислений.Регистратор,
				|	ПоказателиНачислений.ВидРасчета,
				|	ПоказателиНачислений.ИдентификаторСтроки
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ПоказателиНачислений.Сотрудник КАК Сотрудник,
				|	ПоказателиНачислений.Регистратор КАК Регистратор,
				|	ПоказателиНачислений.ВидРасчета КАК ВидРасчета,
				|	ПоказателиНачислений.ИдентификаторСтроки КАК ИдентификаторСтроки,
				|	ПоказателиНачислений.Показатель КАК Показатель,
				|	ПоказателиНачислений.ОсновнойПоказатель КАК ОсновнойПоказатель,
				|	ВЫБОР
				|		КОГДА ПервыеПоказатели.ПорядокПоказателей ЕСТЬ NULL
				|			ТОГДА ЛОЖЬ
				|		ИНАЧЕ ИСТИНА
				|	КОНЕЦ КАК ПервыйПоказатель,
				|	ПоказателиНачислений.Значение КАК Значение,
				|	ПоказателиНачислений.ПорядокПоказателей КАК ПорядокПоказателей
				|ПОМЕСТИТЬ ВТПоказателиНачислений
				|ИЗ
				|	ВТПоказателиНачисленийСоЗначениямиПоказателей КАК ПоказателиНачислений
				|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПервыеПоказатели КАК ПервыеПоказатели
				|		ПО ПоказателиНачислений.Сотрудник = ПервыеПоказатели.Сотрудник
				|			И ПоказателиНачислений.Регистратор = ПервыеПоказатели.Регистратор
				|			И ПоказателиНачислений.ВидРасчета = ПервыеПоказатели.ВидРасчета
				|			И ПоказателиНачислений.ИдентификаторСтроки = ПервыеПоказатели.ИдентификаторСтроки
				|			И ПоказателиНачислений.ПорядокПоказателей = ПервыеПоказатели.ПорядокПоказателей
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	Сотрудник";
			
			СоединениеСТаблицамиПоказателей = "
				|		{ЛЕВОЕ СОЕДИНЕНИЕ ВТПоказателиНачислений КАК ПоказателиНачислений
				|		ПО НачисленияИУдержания.Регистратор = ПоказателиНачислений.Регистратор
				|			И НачисленияИУдержания.ВидРасчета = ПоказателиНачислений.ВидРасчета
				|			И НачисленияИУдержания.Сотрудник = ПоказателиНачислений.Сотрудник
				|			И НачисленияИУдержания.ИдентификаторСтроки = ПоказателиНачислений.ИдентификаторСтроки}
				|";
			
			ТекстПодзапроса = СтрЗаменить(ТекстПодзапроса, "NULL КАК Показатель",
				"(ВЫБОР
				|	КОГДА &ВыводитьВсеПоказателиНачисленийИУдержаний ИЛИ &ВыводитьПоказателиНачисленийИУдержаний И ЕСТЬNULL(ПоказателиНачислений.ОсновнойПоказатель, ЛОЖЬ)
				|		ТОГДА ПоказателиНачислений.Показатель
				|	ИНАЧЕ NULL
				|КОНЕЦ) КАК Показатель");
			
			ТекстПодзапроса = СтрЗаменить(ТекстПодзапроса, "0 КАК Значение",
				"(ВЫБОР
				|	КОГДА &ВыводитьВсеПоказателиНачисленийИУдержаний ИЛИ &ВыводитьПоказателиНачисленийИУдержаний И ЕСТЬNULL(ПоказателиНачислений.ОсновнойПоказатель, ЛОЖЬ)
				|		ТОГДА ПоказателиНачислений.Значение
				|	ИНАЧЕ 0
				|КОНЕЦ) КАК Значение");
			
			ТекстПодзапроса = СтрЗаменить(ТекстПодзапроса, "NULL КАК ПорядокПоказателей", "ЕСТЬNULL(ПоказателиНачислений.ПорядокПоказателей, 1) КАК ПорядокПоказателей");
			ТекстПодзапроса = СтрЗаменить(ТекстПодзапроса, "ИСТИНА КАК ПервыйПоказатель,", "ЕСТЬNULL(ПоказателиНачислений.ПервыйПоказатель, ИСТИНА) КАК ПервыйПоказатель,");
			ТекстПодзапроса = СтрЗаменить(ТекстПодзапроса, "ИСТИНА КАК ОсновнойПоказатель,", "ЕСТЬNULL(ПоказателиНачислений.ОсновнойПоказатель, ИСТИНА) КАК ОсновнойПоказатель,");
			ТекстПодзапроса = СтрЗаменить(ТекстПодзапроса, "НачисленияИУдержания.Сумма КАК Сумма,",
				"	ВЫБОР
				|		КОГДА ЕСТЬNULL(ПоказателиНачислений.ПервыйПоказатель, ИСТИНА) = ИСТИНА
				|			ТОГДА НачисленияИУдержания.Сумма
				|		ИНАЧЕ 0
				|	КОНЕЦ КАК Сумма,");
			
			ТекстПодзапроса = ТекстЗапросаПоказателейНачислений
				+ ЗарплатаКадрыОбщиеНаборыДанных.РазделительЗапросов()
				+ ТекстПодзапроса
				+ СоединениеСТаблицамиПоказателей;
			
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ИсходныйПодзапрос, ТекстПодзапроса);
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЗапросПредставленияПодразделенияСортировкиСотрудников() Экспорт
	
	Запрос = ЗарплатаКадрыОбщиеНаборыДанныхБазовый.ЗапросПредставленияПодразделенияСортировкиСотрудников();
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.УправленческаяЗарплата") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("УправленческаяЗарплата");
		Модуль.ДополнитьЗапросПредставленияПодразделенияСортировкиСотрудников(Запрос);
	КонецЕсли;
	
	Возврат Запрос;
	
КонецФункции

#КонецОбласти