//@strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Задает расширенные настройки отчета
//
// Параметры:
//   Настройки - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.Настройки.
//
Процедура НастроитьВариантыОтчета(Настройки) Экспорт
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПроизводственныеЗатратыПоПартиямПроизводства);
	ОписаниеОтчета.Описание = НСтр("ru= 'Первичные затраты (материалы, труд и постатейные) отнесенные на партии производства.'");
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;	
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "РаспределениеЗатратНаПартииПроизводства");
	ОписаниеВарианта.Описание = НСтр("ru= 'Первичные затраты в разрезе организаций (материалы, труд и постатейные), сгруппированные по местам возникновения затрат.
		|Позволяет увидеть, на какие партии распределены затраты.'");
	ВариантыОтчетовУТПереопределяемый.УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ГруппировкаЗатратПоПартиямПроизводства");
	ОписаниеВарианта.Описание = НСтр("ru= 'Первичные затраты подразделений в разрезе организаций (материалы, труд и постатейные) сгруппированные по партиям производства.
		|Позволяет увидеть, из каких затрат, каких подразделений сложилась себестоимость партии производства.'");
	ВариантыОтчетовУТПереопределяемый.УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Истина;
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "РаспределениеЗатратНаПартииПроизводстваПоПредприятию");
	ОписаниеВарианта.Описание = НСтр("ru= 'Первичные затраты по предприятию в целом (материалы, труд и постатейные), сгруппированные по местам возникновения затрат.
		|Позволяет увидеть, на какие партии распределены затраты.'");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ГруппировкаЗатратПоПартиямПроизводстваПоПредприятию");
	ОписаниеВарианта.Описание = НСтр("ru= 'Первичные затраты подразделений по предприятию в целом (материалы, труд и постатейные) сгруппированные по партиям производства.
		|Позволяет увидеть, из каких затрат, каких подразделений сложилась себестоимость партии производства.'");
	
	ВариантыОтчетовУТПереопределяемый.ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "НачальныйОстаток");
	ВариантыОтчетовУТПереопределяемый.ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ИзрасходованоНаПартииПроизводства");
	ВариантыОтчетовУТПереопределяемый.ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "РасходыНаПроизводство");
	ВариантыОтчетовУТПереопределяемый.ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "КонечныйОстаток");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
