
&ИзменениеИКонтроль("ОчиститьНеиспользуемыеСерииСУчетомТовараВШапке")
Процедура vs_ОчиститьНеиспользуемыеСерииСУчетомТовараВШапке(ДокументОбъект, ПараметрыУказанияСерий)

	ТЧТовары = Новый Массив;
	ТЧТовары.Добавить(ДокументОбъект);
	Если ПараметрыУказанияСерий.Свойство("Шапка") Тогда
#Удаление
		ОчиститьНеиспользуемыеСерииВТЧТовары(ДокументОбъект, ПараметрыУказанияСерий.Шапка, ТЧТовары);
#КонецУдаления
#Вставка
		Если Не ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.СборкаТоваров") Тогда
			ОчиститьНеиспользуемыеСерииВТЧТовары(ДокументОбъект, ПараметрыУказанияСерий.Шапка, ТЧТовары);
		КонецЕсли;
#КонецВставки
	Иначе
		ОчиститьНеиспользуемыеСерииВТЧТовары(ДокументОбъект, ПараметрыУказанияСерий, ТЧТовары);
	КонецЕсли;	

	Если ПараметрыУказанияСерий.Свойство("ТЧ") Тогда
		ОчиститьНеиспользуемыеСерииВТЧТовары(ДокументОбъект, ПараметрыУказанияСерий.ТЧ, ДокументОбъект[ПараметрыУказанияСерий.ТЧ.ИмяТЧТовары]);	
	КонецЕсли;

	Если ПараметрыУказанияСерий.Свойство("ТЧ") Тогда
		ТаблицаТовары = ДокументОбъект[ПараметрыУказанияСерий.ТЧ.ИмяТЧТовары].Выгрузить();
	Иначе
		ТаблицаТовары = Новый ТаблицаЗначений;
		ТаблицаТовары.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТаблицаТовары.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
		ТаблицаТовары.Колонки.Добавить("СтатусУказанияСерий", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(2,0, ДопустимыйЗнак.Неотрицательный)));

		Для каждого СтрМас Из ПараметрыУказанияСерий.ПоляСвязи Цикл
			МассивТипов = Новый Массив;
			МассивТипов.Добавить(ТипЗнч(ДокументОбъект[СтрМас]));
			ТаблицаТовары.Колонки.Добавить(СтрМас, Новый ОписаниеТипов(МассивТипов));
		КонецЦикла;
	КонецЕсли;

	НоваяСтрока = ТаблицаТовары.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ДокументОбъект);


	Если ПараметрыУказанияСерий.Свойство("Шапка") Тогда
		Если ПараметрыУказанияСерий.Шапка.ЭтоЗаказ
			И СкладыКлиентСервер.ЕстьОтгрузка(ПараметрыУказанияСерий.Шапка.СкладскиеОперации)
			И НЕ ДокументОбъект.Обособленно Тогда

			НоваяСтрока.Назначение = Справочники.Назначения.ПустаяСсылка();

		КонецЕсли;

		Если ПараметрыУказанияСерий.Шапка.СерииПриПланированииОтгрузкиУказываютсяВТЧСерии
			И Не ПараметрыУказанияСерий.ТЧ.СерииПриПланированииОтгрузкиУказываютсяВТЧСерии
			И (НоваяСтрока.СтатусУказанияСерий = 9
			Или НоваяСтрока.СтатусУказанияСерий = 10) Тогда
			НоваяСтрока.СтатусУказанияСерий = 8;
		КонецЕсли;
	КонецЕсли;

	Если ПараметрыУказанияСерий.Свойство("ТЧ") Тогда
		ОчиститьНеиспользуемыеСерииВТЧСерии(ДокументОбъект, ПараметрыУказанияСерий.ТЧ, ТаблицаТовары);
	Иначе
		ОчиститьНеиспользуемыеСерииВТЧСерии(ДокументОбъект, ПараметрыУказанияСерий, ТаблицаТовары);
	КонецЕсли;	
КонецПроцедуры
