
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если не ИспользуютсяСерии(ПараметрКоманды) тогда
		Сообщить("Для не серийной номенклатуры доизготовление невозможно!");
		Возврат;
	КонецЕсли;
	
	
	ПараметрыФормы = Новый Структура("ПараметрКоманды",ПараметрКоманды );
	ОткрытьФорму("Документ.ВнутреннееПотребление.Форма.vs_ФормаДоизготовление", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

&Насервере
Функция  ИспользуютсяСерии(Документ)
	
	возврат Документ.Номенклатура.ВидНоменклатуры.ИспользоватьСерии;
	
КонецФункции
