&ИзменениеИКонтроль("ПКО_Документ_ОтгрузкаТоваровСХранения_Возврат_Отправка_ПриОтправкеДанных")
Процедура vs_ПКО_Документ_ОтгрузкаТоваровСХранения_Возврат_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;

	Префикс = "N";
	//++ Локализация
	Префикс = "Н";
	//-- Локализация
	ДанныеXDTO.КлючевыеСвойства.Номер = Лев(ДанныеИБ.Номер, 5) + Префикс + Сред(ДанныеИБ.Номер, 7);

	СкладДляВыгрузки = СкладДляВыгрузки(ДанныеИБ.Склад, КомпонентыОбмена.ПараметрыКонвертации);
	ДанныеXDTO.Вставить("Склад", СкладДляВыгрузки);
	ВыгрузитьПодразделениеИзРеквизитаДокумента(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, "Склад");
	ВыгрузитьДополнительныеРеквизитыИСведения(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO);

	// Дополнительные свойства для договора
	Если НЕ ЗначениеЗаполнено(ДанныеИБ.Договор) Тогда
		ПараметрыПоУмолчанию = Новый Структура(ДоговорФиксированнаяСтруктураКлючей());
		ЗаполнитьЗначенияСвойств(ПараметрыПоУмолчанию, ДанныеИБ, "Контрагент, Организация");
		ПараметрыПоУмолчанию.РасчетыВУсловныхЕдиницах = Ложь;
		ПараметрыПоУмолчанию.ВалютаВзаиморасчетов = ДанныеИБ.Валюта;
		ПараметрыПоУмолчанию.ВидДоговора = "СПокупателем";
		ДанныеXDTO.Вставить("Договор", ДоговорИнструкцияКонвертацииПоДаннымВзаиморасчетов(ПараметрыПоУмолчанию, КомпонентыОбмена));
	Иначе
		ДанныеXDTO.Вставить("Договор", ДанныеИБ.Договор);
	КонецЕсли;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеИБ, "ДополнительныеСвойства") Тогда
		Если ДанныеИБ.ДополнительныеСвойства.Свойство("Товары") Тогда
			Товары = ДанныеИБ.ДополнительныеСвойства.Товары;
			Если НЕ Товары = Неопределено И Товары.Количество() > 0 Тогда
				ДанныеXDTO.Вставить("Товары", Товары);
			КонецЕсли;
		КонецЕсли;
		Если ДанныеИБ.ДополнительныеСвойства.Свойство("ДанныеОперации") Тогда
			ДанныеОперации = ДанныеИБ.ДополнительныеСвойства.ДанныеОперации;
			ДанныеXDTO.Вставить("КурсВзаиморасчетов", ДанныеОперации.КурсВзаиморасчетов);
			ДанныеXDTO.Вставить("КратностьВзаиморасчетов", ДанныеОперации.КратностьВзаиморасчетов);
		КонецЕсли;
	КонецЕсли;
	ДанныеXDTO.Вставить("Сумма", Товары.Итог("Сумма"));
#Удаление
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.17") Тогда
		ЗаполнитьСерииПоДокументу(ДанныеИБ.Ссылка, "Документ.ОтгрузкаТоваровСХранения.Серии", ДанныеXDTO);
	КонецЕсли;
#КонецУдаления
КонецПроцедуры
			
&ИзменениеИКонтроль("ПКО_Документ_ЗаказКлиента_Отправка_ПриОтправкеДанных")
Процедура vs_ПКО_Документ_ЗаказКлиента_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
		Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.8") Тогда
			СтруктураСвойств = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеИБ, "ДатаПоДаннымКлиента, НомерПоДаннымКлиента");
			ДанныеXDTO.Вставить("ДатаВходящегоДокумента", СтруктураСвойств.ДатаПоДаннымКлиента);
			ДанныеXDTO.Вставить("НомерВходящегоДокумента", СтруктураСвойств.НомерПоДаннымКлиента);
		КонецЕсли;
	
		Возврат;
	КонецЕсли;
	
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.8") Тогда
		ДанныеXDTO.КлючевыеСвойства.Вставить("ДатаВходящегоДокумента", ДанныеИБ.ДатаПоДаннымКлиента);
		ДанныеXDTO.КлючевыеСвойства.Вставить("НомерВходящегоДокумента", ДанныеИБ.НомерПоДаннымКлиента);
		
		ДанныеXDTO.Вставить("ОтгружатьЗаказЦеликом", ДанныеИБ.НеОтгружатьЧастями);
		ВыгрузитьНалогообложениеНДС(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, Истина, Ложь, "НалогообложениеНДСПродавца");
	КонецЕсли;
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.17") Тогда
		УстановитьПравилоДляПКСТабЧасти(КомпонентыОбмена,
										"Документ_ЗаказКлиента_Отправка", 
										"Товары", 
										"СтавкаНДС",
										Истина,
										"СправочникСсылка_СтавкиНДС_Отправка");
		УстановитьПравилоДляПКСТабЧасти(КомпонентыОбмена,
										"Документ_ЗаказКлиента_Отправка", 
										"Услуги", 
										"СтавкаНДС",
										Истина,
										"СправочникСсылка_СтавкиНДС_Отправка");
	КонецЕсли;
	
	СкладДляВыгрузки = СкладДляВыгрузки(ДанныеИБ.Склад, КомпонентыОбмена.ПараметрыКонвертации, Истина);
	ДанныеXDTO.Вставить("Склад", СкладДляВыгрузки);
	
	Если ДанныеИБ.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаПоАдресу
		Или ДанныеИБ.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаДоНашегоСклада
		Или ДанныеИБ.СпособДоставки = Перечисления.СпособыДоставки.СиламиПеревозчикаДоПунктаПередачи Тогда
			
		ДанныеXDTO.Вставить("АдресДоставки", ДанныеИБ.АдресДоставкиПеревозчика);
	Иначе
		ДанныеXDTO.Вставить("АдресДоставки", ДанныеИБ.АдресДоставки);
	КонецЕсли;
	
	// Способ доставки "Курьером" не поддерживается в ранних форматах
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) < ВерсияФорматаЧислом("1.10")
		И ДанныеИБ.СпособДоставки = Перечисления.СпособыДоставки.ДоКлиентаКурьером  Тогда
		ДанныеИБ.СпособДоставки = Перечисления.СпособыДоставки.ДоКлиента;
	КонецЕсли;
	
	ВыгрузитьПодразделениеИзРеквизитаДокумента(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, "Склад");
	ВыгрузитьДополнительныеРеквизитыИСведения(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO);
	
	ВалютаВзаиморасчетов = ДанныеИБ.Валюта;
	
	// Дополнительные свойства для договора
	Если ЗначениеЗаполнено(ДанныеИБ.Договор) Тогда
		
		СвойстваДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			ДанныеИБ.Договор, "ОплатаВВалюте, ВалютаВзаиморасчетов, Организация");
		
		ДанныеXDTO.Вставить("Договор",                  ДанныеИБ.Договор);
		ДанныеXDTO.Вставить("РасчетыВУсловныхЕдиницах", ВедетсяРасчетВУЕ(СвойстваДоговора.ВалютаВзаиморасчетов, СвойстваДоговора.ОплатаВВалюте, СвойстваДоговора.Организация, КомпонентыОбмена));
		
		ВалютаВзаиморасчетов = СвойстваДоговора.ВалютаВзаиморасчетов;
		
	Иначе
		
		Если ЗначениеЗаполнено(ДанныеИБ.Соглашение) Тогда
			ВалютаВзаиморасчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеИБ.Соглашение, "Валюта");
		КонецЕсли;
		
		ПараметрыПоУмолчанию = Новый Структура(ДоговорФиксированнаяСтруктураКлючей());
		ПараметрыПоУмолчанию.Контрагент = ДанныеИБ.Контрагент;
		ПараметрыПоУмолчанию.Организация = ДанныеИБ.Организация;
		ПараметрыПоУмолчанию.ВалютаВзаиморасчетов = ВалютаВзаиморасчетов;
		ПараметрыПоУмолчанию.ВидДоговора = ВзаиморасчетыСервер.ВидДоговораКонтрагента(ДанныеИБ.Ссылка, ДанныеИБ.Соглашение, ДанныеИБ.ХозяйственнаяОперация);
#Удаление
		ПараметрыПоУмолчанию.Дата = ДанныеИБ.Дата;
		ПараметрыПоУмолчанию.Номер = ДанныеИБ.Номер;
#КонецУдаления
#Вставка
		Если ТипЗнч(ДанныеИБ.Ссылка) = Тип("ДокументСсылка.ЗаказКлиента")
			//и Не ЗначениеЗаполнено(ДанныеИБ.Номер)
			и (ЗначениеЗаполнено(ДанныеИБ.ДатаПоДаннымКлиента)
				или ЗначениеЗаполнено(ДанныеИБ.НомерПоДаннымКлиента)) Тогда
			ПараметрыПоУмолчанию.Дата = ДанныеИБ.ДатаПоДаннымКлиента;
			ПараметрыПоУмолчанию.Номер = ДанныеИБ.НомерПоДаннымКлиента;
		Иначе
			ПараметрыПоУмолчанию.Дата = ДанныеИБ.Дата;
			ПараметрыПоУмолчанию.Номер = ДанныеИБ.Номер;
		КонецЕсли;

#КонецВставки
		
		Если ПараметрыПоУмолчанию.ВидДоговора = "СКомиссионером" Тогда
			РасчетыВУсловныхЕдиницах = Ложь;
		Иначе
			Если ЗначениеЗаполнено(ДанныеИБ.Соглашение) Тогда
				ДанныеРасчетаУЕ          = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеИБ.Соглашение, "ВалютаВзаиморасчетов, ОплатаВВалюте, Организация");
				РасчетыВУсловныхЕдиницах = ВедетсяРасчетВУЕ(ДанныеРасчетаУЕ.ВалютаВзаиморасчетов, ДанныеРасчетаУЕ.ОплатаВВалюте, ДанныеРасчетаУЕ.Организация, КомпонентыОбмена);
			Иначе
				РасчетыВУсловныхЕдиницах = Ложь;
			КонецЕсли;
		КонецЕсли;
		ПараметрыПоУмолчанию.РасчетыВУсловныхЕдиницах = РасчетыВУсловныхЕдиницах;
		
		Заказ = Новый Структура("Заказ, Соглашение, Сделка", ДанныеИБ.Ссылка, ДанныеИБ.Соглашение, ДанныеИБ.Сделка);
		Договор = ДоговорИнструкцияКонвертацииПоДаннымВзаиморасчетов(ПараметрыПоУмолчанию, КомпонентыОбмена, Заказ, ДанныеИБ);
		
		ДанныеXDTO.Вставить("Договор", Договор);
		ДанныеXDTO.Вставить("РасчетыВУсловныхЕдиницах", РасчетыВУсловныхЕдиницах);
	КонецЕсли;
	
	ДанныеXDTO.Вставить("ВалютаВзаиморасчетов", ВалютаВзаиморасчетов);
	
	ВыгрузитьКурсИКратностьВзаиморасчетов(ДанныеXDTO, ВалютаВзаиморасчетов, ДанныеИБ.Дата, ДанныеИБ.Организация);
	ВыгрузитьКонтактноеЛицоПартнера(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена);
	
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.7") Тогда
		ДанныеXDTO.Вставить("СпособДоставки", ДанныеИБ.СпособДоставки);
	КонецЕсли;
	
	// Табличные части
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	Товары.НомерСтроки КАК НомерСтрокиДокумента,
		|	Товары.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(НоменклатураСправочник.ТипНоменклатуры, ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПустаяСсылка)) КАК ТипНоменклатуры,
		|	ЕСТЬNULL(НоменклатураСправочник.ВариантОформленияПродажи, ЗНАЧЕНИЕ(Перечисление.ВариантыОформленияПродажи.ПустаяСсылка)) КАК ВариантОформленияПродажи,
		|	ВЫБОР
		|		КОГДА Товары.Характеристика <> ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|			ТОГДА ВЫБОР
		|					КОГДА ХарактеристикаСправочник.НаименованиеПолное = """"
		|						ТОГДА ХарактеристикаСправочник.Наименование
		|					ИНАЧЕ ХарактеристикаСправочник.НаименованиеПолное
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ХарактеристикаНаименование,
		|	ВЫБОР
		|		КОГДА НоменклатураСправочник.НаименованиеПолное = """"
		|			ТОГДА НоменклатураСправочник.Наименование
		|		ИНАЧЕ НоменклатураСправочник.НаименованиеПолное
		|	КОНЕЦ КАК НоменклатураНаименование,
		|	ЕСТЬNULL(НоменклатураСправочник.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) КАК ЕдиницаИзмерения,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(НоменклатураСправочник.ТипНоменклатуры, ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
		|				И Товары.Ссылка.ВернутьМногооборотнуюТару
		|			ТОГДА ВЫРАЗИТЬ(""ВозвратнаяТара"" КАК СТРОКА(20))
		|		ИНАЧЕ ВЫРАЗИТЬ(&СобственныеТовары КАК СТРОКА(20))
		|	КОНЕЦ КАК ТипЗапасов,
		|	Товары.Содержание КАК Содержание,
		|	Товары.Количество КАК Количество,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(НоменклатураСправочник.ТипНоменклатуры, ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		|				ИЛИ ЕСТЬNULL(НоменклатураСправочник.ТипНоменклатуры, ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
		|			ТОГДА ВЫБОР
		|					КОГДА Товары.Количество > 0
		|						ТОГДА ВЫРАЗИТЬ(Товары.Сумма / Товары.Количество КАК ЧИСЛО(31, 2))
		|					ИНАЧЕ 0
		|				КОНЕЦ
		|		ИНАЧЕ Товары.Цена
		|	КОНЕЦ КАК Цена,
		|	Товары.Сумма КАК Сумма,
		|	Товары.СтавкаНДС КАК СтавкаНДС,
		|	Товары.СуммаНДС КАК СуммаНДС,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Упаковка КАК Упаковка,
		|	Товары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ВЫБОР
		|		КОГДА Товары.Количество > 0
		|			ТОГДА ВЫРАЗИТЬ(Товары.Сумма / Товары.КоличествоУпаковок КАК ЧИСЛО(31, 2))
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЦенаЗаУпаковку,
		|	Товары.НоменклатураПартнера КАК SKUКонтрагента,
		|	ВЫБОР
		|		КОГДА &ПоступлениеОднойДатой
		|			ТОГДА &ДатаПоступления
		|		ИНАЧЕ Товары.ДатаОтгрузки
		|	КОНЕЦ КАК ОжидаемаяДатаПоставки
		|ПОМЕСТИТЬ ЗаказанныеПозиции
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСправочник
		|		ПО Товары.Номенклатура = НоменклатураСправочник.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикаСправочник
		|		ПО Товары.Характеристика = ХарактеристикаСправочник.Ссылка
		|ГДЕ
		|	Товары.Ссылка = &Ссылка
		|	И Товары.Отменено = ЛОЖЬ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ТипНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТовары.НомерСтрокиДокумента КАК НомерСтрокиДокумента,
		|	ТаблицаТовары.Номенклатура КАК Номенклатура,
		|	ТаблицаТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ТаблицаТовары.ТипЗапасов КАК ТипЗапасов,
		|	ТаблицаТовары.Количество КАК Количество,
		|	ТаблицаТовары.Цена КАК Цена,
		|	ТаблицаТовары.Сумма КАК Сумма,
		|	ТаблицаТовары.СтавкаНДС КАК СтавкаНДС,
		|	ТаблицаТовары.СуммаНДС КАК СуммаНДС,
		|	&ТекстЗапросаSKUКонтрагента,
		|	&ТекстЗапросаХарактеристика,
		|	&ТекстЗапросаУпаковка,
		|	&ТекстЗапросаОжидаемаяДатаПоставкиТовара,
		|	ТаблицаТовары.ЦенаЗаУпаковку КАК ЦенаЗаУпаковку
		|ИЗ
		|	ЗаказанныеПозиции КАК ТаблицаТовары
		|ГДЕ
		|	(ТаблицаТовары.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		|			ИЛИ ТаблицаТовары.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТаблицаТовары.НомерСтрокиДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаУслуги.НомерСтрокиДокумента КАК НомерСтрокиДокумента,
		|	ТаблицаУслуги.Номенклатура КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА ТаблицаУслуги.ВариантОформленияПродажи = ЗНАЧЕНИЕ(Перечисление.ВариантыОформленияПродажи.АктВыполненныхРабот)
		|				ИЛИ ТаблицаУслуги.ВариантОформленияПродажи = ЗНАЧЕНИЕ(Перечисление.ВариантыОформленияПродажи.АктНаПередачуПрав)
		|			ТОГДА ТаблицаУслуги.Содержание
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ТаблицаУслуги.ХарактеристикаНаименование = """"
		|					ТОГДА ТаблицаУслуги.НоменклатураНаименование
		|				ИНАЧЕ ТаблицаУслуги.НоменклатураНаименование + "" ("" + ТаблицаУслуги.ХарактеристикаНаименование + "")""
		|			КОНЕЦ
		|	КОНЕЦ КАК Содержание,
		|	ТаблицаУслуги.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ТаблицаУслуги.Количество КАК Количество,
		|	ТаблицаУслуги.Цена КАК Цена,
		|	ТаблицаУслуги.Сумма КАК Сумма,
		|	ТаблицаУслуги.СтавкаНДС КАК СтавкаНДС,
		|	ТаблицаУслуги.СуммаНДС КАК СуммаНДС,
		|	&ТекстЗапросаОжидаемаяДатаПоставкиУслуги,
		|	&ТекстЗапросаУслугаКонтрагента
		|ИЗ
		|	ЗаказанныеПозиции КАК ТаблицаУслуги
		|ГДЕ
		|	(ТаблицаУслуги.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
		|			ИЛИ ТаблицаУслуги.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТаблицаУслуги.НомерСтрокиДокумента
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&ФормаОплаты КАК ФормаОплаты,
		|	ЗаказКлиентаЭтапыГрафикаОплаты.ВариантОплаты КАК ВариантОплаты,
		|	ЗаказКлиентаЭтапыГрафикаОплаты.ДатаПлатежа КАК ДатаПлатежа,
		|	ЗаказКлиентаЭтапыГрафикаОплаты.ПроцентПлатежа КАК ПроцентПлатежа,
		|	ЗаказКлиентаЭтапыГрафикаОплаты.СуммаПлатежа КАК СуммаПлатежа,
		|	ЗаказКлиентаЭтапыГрафикаОплаты.Сдвиг КАК КоличествоДнейОтсрочки
		|ИЗ
		|	Документ.ЗаказКлиента.ЭтапыГрафикаОплаты КАК ЗаказКлиентаЭтапыГрафикаОплаты
		|ГДЕ
		|	ЗаказКлиентаЭтапыГрафикаОплаты.Ссылка = &Ссылка
		|	И ЗаказКлиентаЭтапыГрафикаОплаты.СуммаПлатежа > 0
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ЗаказанныеПозиции.ОжидаемаяДатаПоставки) КАК ОжидаемаяДатаПоставки
		|ИЗ
		|	ЗаказанныеПозиции КАК ЗаказанныеПозиции
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаказанныеПозиции.Номенклатура КАК Номенклатура,
		|	ЗаказанныеПозиции.Характеристика КАК Характеристика,
		|	ЗаказанныеПозиции.Упаковка КАК Упаковка,
		|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗаказанныеПозиции КАК ЗаказанныеПозиции
		|		ПО (ЗаказанныеПозиции.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура)
		|			И (ЗаказанныеПозиции.Характеристика = ШтрихкодыНоменклатуры.Характеристика)
		|			И (ЗаказанныеПозиции.Упаковка = ШтрихкодыНоменклатуры.Упаковка)
		|ГДЕ
		|	ЗаказанныеПозиции.Упаковка.Владелец <> ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.БазовыеЕдиницыИзмерения)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаказанныеПозиции.Номенклатура,
		|	ЗаказанныеПозиции.Характеристика,
		|	ЗаказанныеПозиции.Упаковка,
		|	ШтрихкодыНоменклатуры.Штрихкод
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗаказанныеПозиции КАК ЗаказанныеПозиции
		|		ПО (ЗаказанныеПозиции.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура)
		|			И (ЗаказанныеПозиции.Характеристика = ШтрихкодыНоменклатуры.Характеристика)
		|			И (ЗаказанныеПозиции.Упаковка.Владелец = ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.БазовыеЕдиницыИзмерения))";
	
	ЗаполнитьСобственныеТоварыВТексте(ТекстЗапроса);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаХарактеристика",
		ПолучитьТекстЗапросаХарактеристики(КомпонентыОбмена, "ТаблицаТовары"));
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаУпаковка",
		ПолучитьТекстЗапросаУпаковки(КомпонентыОбмена, "ТаблицаТовары"));
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаSKUКонтрагента",
			ТекстЗапросаSKUКонтрагента(КомпонентыОбмена, "ТаблицаТовары",
			ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.8")));
		
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаУслугаКонтрагента",
		ТекстЗапросаSKUКонтрагента(КомпонентыОбмена, "ТаблицаУслуги",
		ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.8")));
	
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.8") Тогда
		ТекстЗапросаОжидаемаяДатаПоставкиТовара = "ТаблицаТовары.ОжидаемаяДатаПоставки КАК ОжидаемаяДатаПоставки";
		ТекстЗапросаОжидаемаяДатаПоставкиУслуги = "ТаблицаУслуги.ОжидаемаяДатаПоставки КАК ОжидаемаяДатаПоставки";
	Иначе
		ТекстЗапросаОжидаемаяДатаПоставкиТовара = "Неопределено КАК ОжидаемаяДатаПоставки";
		ТекстЗапросаОжидаемаяДатаПоставкиУслуги = "Неопределено КАК ОжидаемаяДатаПоставки";
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаОжидаемаяДатаПоставкиТовара",
		ТекстЗапросаОжидаемаяДатаПоставкиТовара);
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаОжидаемаяДатаПоставкиУслуги",
		ТекстЗапросаОжидаемаяДатаПоставкиУслуги);
		
	Запрос = Новый Запрос(ТекстЗапроса);
		
	Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
	Запрос.УстановитьПараметр("ПоступлениеОднойДатой", ДанныеИБ.НеОтгружатьЧастями);
	Запрос.УстановитьПараметр("ДатаПоступления", ДанныеИБ.ДатаОтгрузки);
	Запрос.УстановитьПараметр("ФормаОплаты", ?(ЗначениеЗаполнено(ДанныеИБ.ФормаОплаты),
		ДанныеИБ.ФормаОплаты, Перечисления.ФормыОплаты.Безналичная));
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Товары = РезультатЗапроса[1].Выгрузить();
	ЗаполнитьХарактеристикуУпаковкуВТЧ(КомпонентыОбмена, Товары);
	ЗаполнитьШтрихкодыВТЧ(КомпонентыОбмена, Товары, РезультатЗапроса[5].Выгрузить());
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) < ВерсияФорматаЧислом("1.17") Тогда   
		 ПереопределитьСтавкуНДСДляСтарыхФорматов(Товары, Ложь);
	КонецЕсли;
	ДанныеXDTO.Вставить("Товары", Товары);
	
	Услуги = РезультатЗапроса[2].Выгрузить();
	ЗаполнитьНоменклатуруКонтрагентаВТЧ(КомпонентыОбмена, Услуги, ДанныеИБ.Контрагент); 
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) < ВерсияФорматаЧислом("1.17") Тогда   
		 ПереопределитьСтавкуНДСДляСтарыхФорматов(Услуги, Ложь);
	КонецЕсли;
	ДанныеXDTO.Вставить("Услуги", Услуги);
		
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.6") Тогда
		ДанныеXDTO.Вставить("Комментарий", ДанныеИБ.Комментарий);
	КонецЕсли;
		
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.8") Тогда
		ДанныеXDTO.Вставить("ЭтапыОплаты", РезультатЗапроса[3].Выгрузить());
		
		ИмяРеквизитаДатаПоставки = "ОжидаемаяДатаПоставки";
		
		Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.19") Тогда
			
			ИмяРеквизитаДатаПоставки = "ДатаДоставкиДоКлиента";
			
			ДанныеXDTO.Вставить("ВремяДоставкиС", ДанныеИБ.ВремяДоставкиС); 
			ДанныеXDTO.Вставить("ВремяДоставкиПо", ДанныеИБ.ВремяДоставкиПо);   
			
		КонецЕсли;
		
		АгрегированныеДанные = РезультатЗапроса[4].Выгрузить();
		
		Если АгрегированныеДанные.Количество() > 0 Тогда
			ДанныеXDTO.Вставить(ИмяРеквизитаДатаПоставки, АгрегированныеДанные[0].ОжидаемаяДатаПоставки);
		КонецЕсли;  
		
	КонецЕсли;
КонецПроцедуры

&ИзменениеИКонтроль("ДоговорИнструкцияКонвертацииПоДаннымВзаиморасчетов")
Функция vs_ДоговорИнструкцияКонвертацииПоДаннымВзаиморасчетов(ПараметрыПоУмолчанию, КомпонентыОбмена, ОбъектРасчетов, ДанныеИБ)
	// Функция формирует и возвращает инструкция для выгрузки договора
	// по полученным параметрам и настройкам узла плана обмена.
	//
	// Функция, по сформированной инструкции, выполняет принудительную выгрузку договора в файл обмена.
	//
	// Перед вызовом этой функции выполняется проверка наличия договора в выгружаемом документе
	// или в объекте взаиморасчетов, если договор не найден, то выполняется вызов этой функции.
	
	СтруктураДанныеДоговора = Новый Структура(ДоговорФиксированнаяСтруктураКлючей());
	ДоговорЗаполнен = Ложь;
	СтруктураДанныеДоговора.ВидДоговора = ПараметрыПоУмолчанию.ВидДоговора;
	
	Если ЗначениеЗаполнено(ОбъектРасчетов)
		И ТипЗнч(ОбъектРасчетов) = Тип("СправочникСсылка.ДоговорыМеждуОрганизациями") Тогда
		
		ЗаполнитьЗначенияСвойств(СтруктураДанныеДоговора, ПараметрыПоУмолчанию,
			"Организация, Контрагент");
		
		РеквизитыИнтеркампани = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбъектРасчетов,
			"Дата, Номер, Наименование, ВалютаВзаиморасчетов, ОплатаВВалюте, Организация");
		ЗаполнитьЗначенияСвойств(СтруктураДанныеДоговора, РеквизитыИнтеркампани);
	
		СтруктураДанныеДоговора.РасчетыВУсловныхЕдиницах = ВедетсяРасчетВУЕ(
														РеквизитыИнтеркампани.ВалютаВзаиморасчетов, 
														РеквизитыИнтеркампани.ОплатаВВалюте,
														РеквизитыИнтеркампани.Организация, 
														КомпонентыОбмена);	
		
		ДоговорЗаполнен = Истина;
			
	ИначеЕсли ЗначениеЗаполнено(ОбъектРасчетов)
		И ДанныеИБ <> Неопределено
		И Не ДопАналитикаПоДоговорам(КомпонентыОбмена).ДоговорВДоговор Тогда
		Если ТипЗнч(ОбъектРасчетов) = Тип("Структура") Тогда
			// Если в документе соглашение и заказ - 2 разных реквизита, то значения этих реквизитов передаются в структуре:
			// "Заказ" - Ссылка на Заказ клиента (поставщику).
			// "Соглашение" - Ссылка на Соглашение с клиентом (поставщиком).
			// "Сделки" - Ссылка на Сделку с клиентом.
			ЗаказСсылка      = Неопределено;
			СоглашениеСсылка = Неопределено;
			СделкаСсылка     = Неопределено;
			
			ЭтоЗаказ      = ОбъектРасчетов.Свойство("Заказ", ЗаказСсылка) И ЗначениеЗаполнено(ЗаказСсылка);
			ЭтоСоглашение = ОбъектРасчетов.Свойство("Соглашение", СоглашениеСсылка) И ЗначениеЗаполнено(СоглашениеСсылка);
			ЭтоСделка     = ОбъектРасчетов.Свойство("Сделка", СделкаСсылка) И ЗначениеЗаполнено(СделкаСсылка);
		Иначе
			// Подразумевается, что реквизит выгружаемого документа "Заказ" - имеет составной тип
			// и может быть Заказом, Соглашением, Сделкой или другим видом документа/справочника,
			// помимо этого у объекта, указанного в этом реквизите могут быть реквизиты "Соглашение" и/или "Сделка".
			ЗаказСсылка      = ОбъектРасчетов;
			СоглашениеСсылка = ОбъектРасчетов;
			СделкаСсылка     = ОбъектРасчетов;
			
			ЭтоЗаказ = ТипЗнч(ОбъектРасчетов) = Тип("ДокументСсылка.ЗаказКлиента")
				Или ТипЗнч(ОбъектРасчетов) = Тип("ДокументСсылка.ЗаказПоставщику");
			
			РеквизитыЗаказа = Новый Массив;
			Если ОбъектРасчетов.Метаданные().Реквизиты.Найти("Соглашение") <> Неопределено Тогда
				РеквизитыЗаказа.Добавить("Соглашение");
			КонецЕсли;
			Если ОбъектРасчетов.Метаданные().Реквизиты.Найти("Сделка") <> Неопределено Тогда
				РеквизитыЗаказа.Добавить("Сделка");
			КонецЕсли;
			
			Если РеквизитыЗаказа.Количество() > 0 Тогда
				СтруктураДанныеЗаказа = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбъектРасчетов, РеквизитыЗаказа);
			Иначе
				СтруктураДанныеЗаказа = Новый Структура;
			КонецЕсли;
			
			ЭтоСоглашение = ТипЗнч(ОбъектРасчетов) = Тип("СправочникСсылка.СоглашенияСКлиентами")
				Или ТипЗнч(ОбъектРасчетов) = Тип("СправочникСсылка.СоглашенияСПоставщиками")
				Или (СтруктураДанныеЗаказа.Свойство("Соглашение", СоглашениеСсылка) И ЗначениеЗаполнено(СоглашениеСсылка));
				
			ЭтоСделка = ТипЗнч(ОбъектРасчетов) = Тип("СправочникСсылка.СделкиСКлиентами")
				Или (СтруктураДанныеЗаказа.Свойство("Сделка", СделкаСсылка) И ЗначениеЗаполнено(СделкаСсылка));
		КонецЕсли;
			
		Если ЭтоЗаказ Или ЭтоСоглашение Или ЭтоСделка Тогда
			Если ЭтоЗаказ И КомпонентыОбмена.ПараметрыКонвертации.НастройкиДопАналитикиПоДоговорам.ЗаказВДоговор Тогда
				
				Запрос = Новый Запрос;
				Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
				
				Запрос.УстановитьПараметр("Ссылка", ЗаказСсылка);
				Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета(ЗаказСсылка.Организация));
				
				Если ТипЗнч(ЗаказСсылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ЗаказКлиента.Ссылка КАК Ссылка,
					|	ЗаказКлиента.Контрагент КАК Контрагент,
					|	ЗаказКлиента.Организация КАК Организация,
					|	ЗаказКлиента.Дата КАК Дата,
					|	ЗаказКлиента.Номер КАК Номер,
#Вставка
					|	ЗаказКлиента.ДатаПоДаннымКлиента КАК ДатаДоговора,
					|	ЗаказКлиента.НомерПоДаннымКлиента КАК НомерДоговора,
#КонецВставки
					|	ЗаказКлиента.Валюта КАК Валюта,
					|	ЗаказКлиента.Представление КАК Представление,
					|	ЗаказКлиента.Валюта <> &ВалютаРегламентированногоУчета И Не ЗаказКлиента.ОплатаВВалюте КАК РасчетыВУсловныхЕдиницах
					|ПОМЕСТИТЬ ВТ_Документ
					|ИЗ
					|	Документ.ЗаказКлиента КАК ЗаказКлиента
					|ГДЕ
					|	ЗаказКлиента.Ссылка = &Ссылка";
					Запрос.Выполнить();
				ИначеЕсли ТипЗнч(ЗаказСсылка) = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ЗаявкаНаВозвратТоваровОтКлиента.Ссылка КАК Ссылка,
					|	ЗаявкаНаВозвратТоваровОтКлиента.Контрагент КАК Контрагент,
					|	ЗаявкаНаВозвратТоваровОтКлиента.Организация КАК Организация,
					|	ЗаявкаНаВозвратТоваровОтКлиента.Дата КАК Дата,
					|	ЗаявкаНаВозвратТоваровОтКлиента.Номер КАК Номер,
#Вставка
					|	NULL КАК ДатаДоговора,
					|	NULL КАК НомерДоговора,
#КонецВставки
					|	ЗаявкаНаВозвратТоваровОтКлиента.Валюта КАК Валюта,
					|	ЗаявкаНаВозвратТоваровОтКлиента.Представление КАК Представление,
					|	ЗаявкаНаВозвратТоваровОтКлиента.Валюта <> &ВалютаРегламентированногоУчета И Не ЗаявкаНаВозвратТоваровОтКлиента.ОплатаВВалюте КАК РасчетыВУсловныхЕдиницах
					|ПОМЕСТИТЬ ВТ_Документ
					|ИЗ
					|	Документ.ЗаявкаНаВозвратТоваровОтКлиента КАК ЗаявкаНаВозвратТоваровОтКлиента
					|ГДЕ
					|	ЗаявкаНаВозвратТоваровОтКлиента.Ссылка = &Ссылка";
					Запрос.Выполнить();
				ИначеЕсли ТипЗнч(ЗаказСсылка) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ЗаказПоставщику.Ссылка КАК Ссылка,
					|	ЗаказПоставщику.Контрагент КАК Контрагент,
					|	ЗаказПоставщику.Организация КАК Организация,
					|	ЗаказПоставщику.Дата КАК Дата,
					|	ЗаказПоставщику.Номер КАК Номер,
#Вставка
					|	ЗаказПоставщику.ДатаПоДаннымПоставщика КАК ДатаДоговора,
					|	ЗаказПоставщику.НомерПоДаннымПоставщика КАК НомерДоговора,
#КонецВставки
					|	ЗаказПоставщику.Валюта КАК Валюта,
					|	ЗаказПоставщику.Представление КАК Представление,
					|	ЗаказПоставщику.Валюта <> &ВалютаРегламентированногоУчета И Не ЗаказПоставщику.ОплатаВВалюте КАК РасчетыВУсловныхЕдиницах
					|ПОМЕСТИТЬ ВТ_Документ
					|ИЗ
					|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
					|ГДЕ
					|	ЗаказПоставщику.Ссылка = &Ссылка";
					Запрос.Выполнить();
				КонецЕсли;
				
				Если Запрос.МенеджерВременныхТаблиц.Таблицы.Количество() > 0 Тогда
					
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ВТ_Документ.Ссылка КАК Ссылка,
					|	ВТ_Документ.Контрагент КАК Контрагент,
					|	ВТ_Документ.Организация КАК Организация,
					|	ВТ_Документ.Дата КАК Дата,
					|	ВТ_Документ.Номер КАК Номер,
#Вставка
					|	ВТ_Документ.ДатаДоговора КАК ДатаДоговора,
					|	ВТ_Документ.НомерДоговора КАК НомерДоговора,
#КонецВставки
					|	ВТ_Документ.Валюта КАК ВалютаВзаиморасчетов,
					|	ВТ_Документ.Представление КАК Наименование,
					|	ВТ_Документ.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
					|	КурсыВалютСрезПоследних.КурсЧислитель КАК КурсВзаиморасчетов,
					|	КурсыВалютСрезПоследних.КурсЗнаменатель КАК КратностьВзаиморасчетов
					|ИЗ
					|	ВТ_Документ КАК ВТ_Документ
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&ДатаДок, БазоваяВалюта = &БазоваяВалюта) КАК КурсыВалютСрезПоследних
					|		ПО ВТ_Документ.Валюта = КурсыВалютСрезПоследних.Валюта";
					Запрос.УстановитьПараметр("ДатаДок", ДанныеИБ.Дата);
					Запрос.УстановитьПараметр("БазоваяВалюта", ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(ЗаказСсылка.Организация));
					
					Выборка = Запрос.Выполнить().Выбрать();
					Если Выборка.Следующий() Тогда
						ЗаполнитьЗначенияСвойств(СтруктураДанныеДоговора, Выборка);
						СтруктураДанныеДоговора.Наименование = ОбщегоНазначенияУТ.ПолучитьПредставлениеДокумента(ЗаказСсылка, Выборка.Номер, Выборка.Дата);
						ДоговорЗаполнен = Истина;
#Вставка
						Если ЗначениеЗаполнено(Выборка.НомерДоговора) 
							или ЗначениеЗаполнено(Выборка.ДатаДоговора) Тогда
							СтруктураДанныеДоговора.ВнешнийИдентификатор 	= СтруктураДанныеДоговора.Наименование;
							СтруктураДанныеДоговора.Номер					= Выборка.НомерДоговора;
							СтруктураДанныеДоговора.Дата					= Выборка.ДатаДоговора;	
							СтруктураДанныеДоговора.Наименование 			= ОбщегоНазначенияУТ.vs_ПолучитьПредставлениеДоговора("Счет", Выборка.НомерДоговора, Выборка.ДатаДоговора);
						Иначе
							ДоговорЗаполнен = Ложь;
						КонецЕсли;
#КонецВставки
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
			
			Если ЭтоСоглашение И ДопАналитикаПоДоговорам(КомпонентыОбмена).СоглашениеВДоговор Тогда
				
				Запрос = Новый Запрос;
				Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
				
				Запрос.УстановитьПараметр("Ссылка", СоглашениеСсылка);
				Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета(СоглашениеСсылка.Организация));
				
				Если ТипЗнч(СоглашениеСсылка) = Тип("СправочникСсылка.СоглашенияСКлиентами") Тогда
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	СоглашенияСКлиентами.Ссылка КАК Ссылка,
					|	СоглашенияСКлиентами.Контрагент КАК Контрагент,
					|	СоглашенияСКлиентами.Организация КАК Организация,
					|	СоглашенияСКлиентами.Дата КАК Дата,
					|	СоглашенияСКлиентами.Номер КАК Номер,
					|	СоглашенияСКлиентами.Валюта КАК ВалютаВзаиморасчетов,
					|	СоглашенияСКлиентами.Наименование КАК Наименование,
					|	СоглашенияСКлиентами.Типовое КАК Типовое,
					|	СоглашенияСКлиентами.Валюта <> &ВалютаРегламентированногоУчета И Не СоглашенияСКлиентами.ОплатаВВалюте КАК РасчетыВУсловныхЕдиницах
					|ПОМЕСТИТЬ ВТ_Соглашение
					|ИЗ
					|	Справочник.СоглашенияСКлиентами КАК СоглашенияСКлиентами
					|ГДЕ
					|	СоглашенияСКлиентами.Ссылка = &Ссылка";
					Запрос.Выполнить();
				ИначеЕсли ТипЗнч(СоглашениеСсылка) = Тип("СправочникСсылка.СоглашенияСПоставщиками") Тогда
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	СоглашенияСПоставщиками.Ссылка КАК Ссылка,
					|	СоглашенияСПоставщиками.Контрагент КАК Контрагент,
					|	СоглашенияСПоставщиками.Организация КАК Организация,
					|	СоглашенияСПоставщиками.Дата КАК Дата,
					|	СоглашенияСПоставщиками.Номер КАК Номер,
					|	СоглашенияСПоставщиками.Валюта КАК ВалютаВзаиморасчетов,
					|	СоглашенияСПоставщиками.Наименование КАК Наименование,
					|	ЛОЖЬ КАК Типовое,
					|	СоглашенияСПоставщиками.Валюта <> &ВалютаРегламентированногоУчета И Не СоглашенияСПоставщиками.ОплатаВВалюте КАК РасчетыВУсловныхЕдиницах
					|ПОМЕСТИТЬ ВТ_Соглашение
					|ИЗ
					|	Справочник.СоглашенияСПоставщиками КАК СоглашенияСПоставщиками
					|ГДЕ
					|	СоглашенияСПоставщиками.Ссылка = &Ссылка";
					Запрос.Выполнить();
				КонецЕсли;
				
				Если Запрос.МенеджерВременныхТаблиц.Таблицы.Количество() > 0 Тогда
					
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	СоглашенияСКлиентами.Ссылка КАК Ссылка,
					|	СоглашенияСКлиентами.Контрагент КАК Контрагент,
					|	СоглашенияСКлиентами.Организация КАК Организация,
					|	СоглашенияСКлиентами.Дата КАК Дата,
					|	СоглашенияСКлиентами.Номер КАК Номер,
					|	СоглашенияСКлиентами.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
					|	СоглашенияСКлиентами.Наименование КАК Наименование,
					|	СоглашенияСКлиентами.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
					|	СоглашенияСКлиентами.Типовое КАК Типовое,
					|	КурсыВалютСрезПоследних.КурсЧислитель КАК КурсВзаиморасчетов,
					|	КурсыВалютСрезПоследних.КурсЗнаменатель КАК КратностьВзаиморасчетов
					|ИЗ
					|	ВТ_Соглашение КАК СоглашенияСКлиентами
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&ДатаДок, БазоваяВалюта = &БазоваяВалюта) КАК КурсыВалютСрезПоследних
					|		ПО СоглашенияСКлиентами.ВалютаВзаиморасчетов = КурсыВалютСрезПоследних.Валюта";
					Запрос.УстановитьПараметр("ДатаДок", ДанныеИБ.Дата);
					Запрос.УстановитьПараметр("БазоваяВалюта", ВалютаРегламентированногоУчета(СоглашениеСсылка.Организация));
					
					Выборка = Запрос.Выполнить().Выбрать();
					Если Выборка.Следующий() Тогда
						ЗаполнитьЗначенияСвойств(СтруктураДанныеДоговора, Выборка);
						
						Если Не ЗначениеЗаполнено(СтруктураДанныеДоговора.Контрагент) Тогда
							Если ЕстьРеквизитДанныхИБ(ДанныеИБ, "Контрагент") Тогда
								СтруктураДанныеДоговора.Контрагент = ДанныеИБ.Контрагент;
							Иначе
								СтруктураДанныеДоговора.Контрагент = ПараметрыПоУмолчанию.Контрагент;
							КонецЕсли;
						КонецЕсли;
						
						Если Не ЗначениеЗаполнено(СтруктураДанныеДоговора.Организация) Тогда
							Если ЗначениеЗаполнено(ДанныеИБ.Организация) Тогда
								СтруктураДанныеДоговора.Организация = ДанныеИБ.Организация;
							Иначе
								СтруктураДанныеДоговора.Организация = ПараметрыПоУмолчанию.Организация;
							КонецЕсли;
						КонецЕсли;
						
						Если ТипЗнч(СоглашениеСсылка) = Тип("СправочникСсылка.СоглашенияСКлиентами") Тогда
							Наименование = ?(Выборка.Типовое, НСтр("ru = 'Типовое'"), НСтр("ru = 'Индивидуальное'")) + "; ";
						Иначе
						    Наименование = "";
						КонецЕсли;
						
						Наименование = Наименование + Выборка.Наименование
							+ " " + ?(ЗначениеЗаполнено(Выборка.Номер), "№" + Выборка.Номер, "")
							+ " " + ?(ЗначениеЗаполнено(Выборка.Дата), НСтр("ru = 'от'") + " " + Формат(Выборка.Дата, "ДЛФ=D"), "");
							
						СтруктураДанныеДоговора.Наименование = СокрЛП(Наименование);
						ДоговорЗаполнен = Истина;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если ЭтоСделка И ДопАналитикаПоДоговорам(КомпонентыОбмена).СделкаВДоговор Тогда
				Запрос = Новый Запрос(
				"ВЫБРАТЬ
				|	СделкиСКлиентами.Ссылка,
				|	СделкиСКлиентами.Код КАК Номер,
				|	"""" КАК Контрагент,
				|	"""" КАК Организация,
				|	СделкиСКлиентами.ДатаНачала КАК Дата,
				|	КурсыВалютСрезПоследних.Валюта КАК ВалютаВзаиморасчетов,
				|	СделкиСКлиентами.Наименование КАК Наименование,
				|	КурсыВалютСрезПоследних.КурсЧислитель КАК КурсВзаиморасчетов,
				|	КурсыВалютСрезПоследних.КурсЗнаменатель КАК КратностьВзаиморасчетов
				|ИЗ
				|	Справочник.СделкиСКлиентами КАК СделкиСКлиентами,
				|	РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&ДатаДок, Валюта = &Валюта И БазоваяВалюта = &БазоваяВалюта) КАК КурсыВалютСрезПоследних
				|ГДЕ
				|	СделкиСКлиентами.Ссылка = &Ссылка");
				Запрос.УстановитьПараметр("Ссылка",  СделкаСсылка);
				Запрос.УстановитьПараметр("ДатаДок", ДанныеИБ.Дата);
				Запрос.УстановитьПараметр("Валюта",  ПараметрыПоУмолчанию.ВалютаВзаиморасчетов);
				Запрос.УстановитьПараметр("БазоваяВалюта", ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(ДанныеИБ.Организация));
				
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					ЗаполнитьЗначенияСвойств(СтруктураДанныеДоговора, Выборка);
					СтруктураДанныеДоговора.Организация = ДанныеИБ.Организация;
					Если ЕстьРеквизитДанныхИБ(ДанныеИБ, "Контрагент") Тогда
						СтруктураДанныеДоговора.Контрагент = ДанныеИБ.Контрагент;
					Иначе
						СтруктураДанныеДоговора.Контрагент = ПараметрыПоУмолчанию.Контрагент;
					КонецЕсли;
					Если ПараметрыПоУмолчанию.Свойство("РасчетыВУсловныхЕдиницах") Тогда
						СтруктураДанныеДоговора.РасчетыВУсловныхЕдиницах = ПараметрыПоУмолчанию.РасчетыВУсловныхЕдиницах;
					КонецЕсли;
					СтруктураДанныеДоговора.Наименование = ?(ЗначениеЗаполнено(СделкаСсылка.Метаданные().ПредставлениеОбъекта),
						СделкаСсылка.Метаданные().ПредставлениеОбъекта, СделкаСсылка.Метаданные().Синоним)
							+ ?(ЗначениеЗаполнено(Выборка.Номер), " " + Выборка.Номер, "");
					ДоговорЗаполнен = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ДоговорЗаполнен Тогда
		ЗаполнитьЗначенияСвойств(СтруктураДанныеДоговора, ПараметрыПоУмолчанию, , "Дата, Номер");
		СтруктураДанныеДоговора.Наименование = НСтр("ru = 'Основной договор'");
	Иначе	
		СтруктураДанныеДоговора.ВнешнийИдентификатор = СтруктураДанныеДоговора.Наименование;
	КонецЕсли;
	
	ДопРеквизиты = Новый ТаблицаЗначений;
	ДопРеквизиты.Колонки.Добавить("Свойство");
	ДопРеквизиты.Колонки.Добавить("ЗначениеСвойства");
	
	СтрокаДопРеквизитов = ДопРеквизиты.Добавить();
	СтрокаДопРеквизитов.Свойство = Новый Структура("Наименование", "ВиртуальныйДоговор");
	СтрокаДопРеквизитов.ЗначениеСвойства = "ВиртуальныйДоговор";
	
	СтруктураДанныеДоговора.Вставить("ДополнительныеРеквизиты", ДопРеквизиты);
	
	Договор = Новый Структура("Значение, ИмяПКО", СтруктураДанныеДоговора, "Справочник_ДоговорыКонтрагентов_ИзСтруктуры");
	
	ПравилоОбработки = КомпонентыОбмена.ПравилаОбработкиДанных.Найти("Справочник_ДоговорыКонтрагентов_Отправка", "Имя");
#Удаление
	Если Не ПравилоОбработки = Неопределено Тогда
#КонецУдаления
#Вставка
	Если Не ПравилоОбработки = Неопределено 
		и ДоговорЗаполнен Тогда
#КонецВставки
		ОбменДаннымиXDTOСервер.ВыгрузкаОбъектаВыборки(КомпонентыОбмена, СтруктураДанныеДоговора, ПравилоОбработки);
	КонецЕсли;
	
#Удаление
	Возврат Договор;
#КонецУдаления
#Вставка
	Если ДоговорЗаполнен Тогда
		Возврат Договор;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
#КонецВставки
КонецФункции

&ИзменениеИКонтроль("Мержевание_СБДС")
Процедура vs_Мержевание_СБДС(ПолученныеДанные, ДанныеИБ, КонвертацияСвойств, КомпонентыОбмена)
	Если ДанныеИБ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеИБ_КонтрагентДоИзменения = ДанныеИБ.Контрагент;
	
	#Область Шапка
	
	// Очередность платежа.
	Если Не ЗначениеЗаполнено(ПолученныеДанные.ОчередностьПлатежа) Тогда
		ПолученныеДанные.ОчередностьПлатежа = ДанныеИБ.ОчередностьПлатежа;
	КонецЕсли;
	ДополнительныеСвойства = ПолученныеДанные.ДополнительныеСвойства;
	
	Если ДополнительныеСвойства.Свойство("Договор") Тогда
		ПолученныеДанные.Договор = ДополнительныеСвойства.Договор;
	КонецЕсли;
	// Заполнение контрагента, если он не заполнен.
	Если Не ЗначениеЗаполнено(ПолученныеДанные.Контрагент) Тогда
		Если ЗначениеЗаполнено(ДанныеИБ.Контрагент) Тогда
			ПолученныеДанные.Контрагент = ДанныеИБ.Контрагент;
		Иначе
			ЗаполнитьКонтрагентаНашеПредприятие(ПолученныеДанные, КомпонентыОбмена.ПараметрыКонвертации);
		КонецЕсли;
	КонецЕсли;
	
	// При операциях "интеркампани", некоторые реквизиты объекта ИБ имеют больший приоритет.
	Если ДанныеИБ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию Тогда
		ЗаполнитьЗначенияСвойств(ПолученныеДанные, ДанныеИБ,
			"Контрагент,БанковскийСчетКонтрагента,ХозяйственнаяОперация");
	КонецЕсли;
	
	// Заменяем свойства, которые получили из XDTO.
	ЗаполнитьСвойстваШапкиОбъекта(КонвертацияСвойств, ПолученныеДанные, ДанныеИБ);
	
	#КонецОбласти
	
	#Область РасшифровкаПлатежа
	
	// Мержевание расшифровки платежа.
	РасшифровкаПлатежаИсточник = ПолученныеДанные.РасшифровкаПлатежа;
	РасшифровкаПлатежаПриемник = ДанныеИБ.РасшифровкаПлатежа;
	
	Если РасшифровкаПлатежаИсточник.Количество() = РасшифровкаПлатежаПриемник.Количество() Тогда
		
		Для ИндексСтроки = 0 По РасшифровкаПлатежаИсточник.Количество() - 1 Цикл
			
			СтрокаИсточник = РасшифровкаПлатежаИсточник[ИндексСтроки];
			СтрокаПриемник = РасшифровкаПлатежаПриемник[ИндексСтроки];
			
			ЗаполнитьЗначенияСвойств(СтрокаПриемник, СтрокаИсточник,
				"Сумма,
				|СуммаВзаиморасчетов,
				|ВалютаВзаиморасчетов");
			
#Вставка
// Нет в исходниках
//#Удаление
//			Если ЗначениеЗаполнено(СтрокаИсточник.Заказ) Тогда
//				СтрокаПриемник.Заказ = СтрокаИсточник.Заказ;
//			КонецЕсли;
//
//#КонецУдаления
//#Вставка
//			Если ЗначениеЗаполнено(СтрокаПриемник.Заказ)
//				и ЗначениеЗаполнено(СтрокаИсточник.Заказ)
//				и ТипЗнч(СтрокаПриемник.Заказ) = ТипЗнч(СтрокаИсточник.Заказ) 
//				и СтрНайти(Строка(СтрокаИсточник.Заказ), "Объект не найден") = 0 Тогда
//				СтрокаПриемник.Заказ = СтрокаИсточник.Заказ;
//			КонецЕсли;
//
#КонецВставки
			Если ЗначениеЗаполнено(СтрокаИсточник.СтатьяРасходов) Тогда
				СтрокаПриемник.СтатьяРасходов = СтрокаИсточник.СтатьяРасходов;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаИсточник.СтатьяДвиженияДенежныхСредств) Тогда
				Если ОбщегоНазначения.СсылкаСуществует(СтрокаИсточник.СтатьяДвиженияДенежныхСредств) Тогда
					СтрокаПриемник.СтатьяДвиженияДенежныхСредств = СтрокаИсточник.СтатьяДвиженияДенежныхСредств;
				Иначе
					СтрокаПриемник.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
				КонецЕсли;
			КонецЕсли;
			
			// Изменение контрагента обновляет зависимую от него аналитику.
			Если ДанныеИБ.Контрагент <> ДанныеИБ_КонтрагентДоИзменения Тогда
				ЗаполнитьЗначенияСвойств(СтрокаПриемник, СтрокаИсточник, "Партнер");
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		ДанныеИБ.РасшифровкаПлатежа.Загрузить(ПолученныеДанные.РасшифровкаПлатежа.Выгрузить());
	КонецЕсли;
	
	// Синхронизация суммы в расшифровке и в шапке.
	Если ДанныеИБ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеДенежныхСредствНаДругойСчет Тогда
		
		Если ДанныеИБ.РасшифровкаПлатежа.Количество() = 1 Тогда
			ДанныеИБ.РасшифровкаПлатежа[0].Сумма = ДанныеИБ.СуммаДокумента;
		КонецЕсли; 
	
	КонецЕсли;
	
	#КонецОбласти
КонецПроцедуры

&ИзменениеИКонтроль("ПКО_Документ_РеализацияТоваровУслуг_Отправка_ПриОтправкеДанных")
Процедура vs_ПКО_Документ_РеализацияТоваровУслуг_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.10") Тогда
		УстановитьПравилоДляПКСТабЧасти(КомпонентыОбмена,
										"Документ_РеализацияТоваровУслуг_Отправка", 
										"Товары", 
										"НомерГТД",
										Истина,
										"Справочник_НомераГТД_Отправка");
	КонецЕсли;
	
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.17") Тогда
		УстановитьПравилоДляПКСТабЧасти(КомпонентыОбмена,
										"Документ_РеализацияТоваровУслуг_Отправка", 
										"Товары", 
										"СтавкаНДС",
										Истина,
										"СправочникСсылка_СтавкиНДС_Отправка");
		УстановитьПравилоДляПКСТабЧасти(КомпонентыОбмена,
										"Документ_РеализацияТоваровУслуг_Отправка", 
										"Услуги", 
										"СтавкаНДС",
										Истина,
										"СправочникСсылка_СтавкиНДС_Отправка");
	КонецЕсли;
	ВидОперацииСтрокой = "";
	
	Если Не ЗначениеЗаполнено(ДанныеИБ.ХозяйственнаяОперация) Тогда
		ВидОперацииСтрокой = "РеализацияКлиенту";
	ИначеЕсли ДанныеИБ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности Тогда
		
		Если ДанныеИБ.Статус = Перечисления.СтатусыРеализацийТоваровУслуг.ВПути Тогда
			ВидОперацииСтрокой = "ОтгрузкаБезПереходаПравСобственности_ВПути";
		Иначе
			ВидОперацииСтрокой = "ОтгрузкаБезПереходаПравСобственности_Реализовано"; 
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВидОперацииСтрокой <> "" Тогда
		ДанныеXDTO.Вставить("ВидОперации", ВидОперацииСтрокой); 
	Иначе
		ДанныеXDTO.Вставить("ВидОперации", "РеализацияКлиенту");
	КонецЕсли; 
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.15") Тогда
		ДанныеXDTO.Вставить("ЭтапГосконтрактаЕИС", ДанныеИБ.ЭтапГосконтрактаЕИС);    
	КонецЕсли; 
	СкладДляВыгрузки = СкладДляВыгрузки(ДанныеИБ.Склад, КомпонентыОбмена.ПараметрыКонвертации, Истина);
	ДанныеXDTO.Вставить("Склад", СкладДляВыгрузки);
	
	ДанныеXDTO.Вставить("ГлавныйБухгалтер", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеИБ.ГлавныйБухгалтер, "ФизическоеЛицо"));
	ДанныеXDTO.Вставить("Руководитель",     ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеИБ.Руководитель, "ФизическоеЛицо"));
	
#Удаление
	Если ДанныеИБ.РеализацияПоЗаказам И ЗначениеЗаполнено(ДанныеИБ.ЗаказКлиента) 
		И ТипЗнч(ДанныеИБ.ЗаказКлиента) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
#КонецУдаления
#Вставка
// Здесь можно описать новое поведение.
	Если ДанныеИБ.РеализацияПоЗаказам И ЗначениеЗаполнено(ДанныеИБ.ЗаказКлиента)
		И ТипЗнч(ДанныеИБ.ЗаказКлиента) = Тип("ДокументСсылка.ЗаказКлиента") 
		и ЗначениеЗаполнено(ДанныеИБ.ЗаказКлиента.НомерПоДаннымКлиента)	Тогда
#КонецВставки
		ДанныеXDTO.Вставить("Заказ", ДанныеИБ.ЗаказКлиента);
	Иначе
		ДанныеXDTO.Вставить("Заказ", Неопределено);
	КонецЕсли;
	
	ВыгрузитьПодразделениеИзРеквизитаДокумента(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, "Склад");
	ВыгрузитьНалогообложениеНДС(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, Ложь);
	ВыгрузитьДополнительныеРеквизитыИСведения(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO);
	ВыгрузитьПризнакКомплектПечатныхДокументовПодписан(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO);
	
	ВалютаРеглУчета = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(ДанныеИБ.Организация);
	
	// Дополнительные свойства для договора
	Если ЗначениеЗаполнено(ДанныеИБ.Договор) Тогда
		ДанныеXDTO.Вставить("Договор", ДанныеИБ.Договор);
	Иначе
		
		ПараметрыПоУмолчанию = Новый Структура(ДоговорФиксированнаяСтруктураКлючей());
		ЗаполнитьЗначенияСвойств(ПараметрыПоУмолчанию, ДанныеИБ);
		
		ПараметрыПоУмолчанию.ВидДоговора =
			?(ДанныеИБ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию, "СКомиссионером", "СПокупателем");
			
		Если ЗначениеЗаполнено(ДанныеИБ.Соглашение) Тогда
			ДанныеРасчетаУЕ          = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеИБ.Соглашение, "ВалютаВзаиморасчетов, ОплатаВВалюте, Организация");
			РасчетыВУсловныхЕдиницах = ВедетсяРасчетВУЕ(ДанныеРасчетаУЕ.ВалютаВзаиморасчетов, ДанныеРасчетаУЕ.ОплатаВВалюте, ДанныеРасчетаУЕ.Организация, КомпонентыОбмена);
		Иначе
			РасчетыВУсловныхЕдиницах = (ДанныеИБ.Валюта = ВалютаРеглУчета И ДанныеИБ.Валюта <> ДанныеИБ.ВалютаВзаиморасчетов);
		КонецЕсли;
		
		ПараметрыПоУмолчанию.РасчетыВУсловныхЕдиницах = РасчетыВУсловныхЕдиницах;
		
		Заказ = Новый Структура("Заказ, Соглашение, Сделка", ДанныеИБ.ЗаказКлиента, ДанныеИБ.Соглашение, ДанныеИБ.Сделка);
		Договор = ДоговорИнструкцияКонвертацииПоДаннымВзаиморасчетов(ПараметрыПоУмолчанию, КомпонентыОбмена, Заказ, ДанныеИБ);
		
		ДанныеXDTO.Вставить("Договор", Договор);
		
	КонецЕсли;
	
	// Данные шапки документа необходимы для вычисления
	// курса и кратности взаиморасчетов.
	ШапкаДокумента =
		"ВЫБРАТЬ
		|	ДанныеШапкиДокумента.Валюта КАК Валюта,
		|	ДанныеШапкиДокумента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
		|	ДанныеШапкиДокумента.КурсЧислитель КАК КурсВзаиморасчетов,
		|	ДанныеШапкиДокумента.КурсЗнаменатель КАК КратностьВзаиморасчетов
		|ПОМЕСТИТЬ ДанныеШапкиДокумента
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК ДанныеШапкиДокумента
		|ГДЕ
		|	ДанныеШапкиДокумента.Ссылка = &Ссылка
		|ИНДЕКСИРОВАТЬ ПО
		|	Валюта";
		
	Если ДанныеИБ.Валюта = ВалютаРеглУчета
		Или ДанныеИБ.ВалютаВзаиморасчетов = ВалютаРеглУчета Тогда
		
		ДанныеОперации =
			"ВЫБРАТЬ
			|	ДанныеШапкиДокумента.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
			|	ДанныеШапкиДокумента.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов
			|ИЗ
			|	ДанныеШапкиДокумента КАК ДанныеШапкиДокумента";
		
	Иначе
		
		ДанныеОперации =
			"ВЫБРАТЬ
			|	ЕСТЬNULL(КурсВалютыДокумента.КурсЧислитель, 1) КАК КурсВзаиморасчетов,
			|	ЕСТЬNULL(КурсВалютыДокумента.КурсЗнаменатель, 1) КАК КратностьВзаиморасчетов
			|ИЗ
			|	ДанныеШапкиДокумента КАК ДанныеШапкиДокумента
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(
			|				&Дата,
			|				Валюта В
			|					(ВЫБРАТЬ
			|						Док.Валюта
			|					ИЗ
			|						ДанныеШапкиДокумента КАК Док)
			|				И БазоваяВалюта = &БазоваяВалюта) КАК КурсВалютыДокумента
			|		ПО ДанныеШапкиДокумента.Валюта = КурсВалютыДокумента.Валюта";
		
	КонецЕсли;
	
	ТоварыИУслугиДокумента =
		"ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА Товары.Характеристика <> ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|			ТОГДА ВЫБОР
		|					КОГДА ХарактеристикаСпр.НаименованиеПолное = """"
		|						ТОГДА ХарактеристикаСпр.Наименование
		|					ИНАЧЕ ХарактеристикаСпр.НаименованиеПолное
		|				КОНЕЦ
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ХарактеристикаНаименование,
		|	ВЫБОР
		|		КОГДА НоменклатураСпр.НаименованиеПолное = """"
		|			ТОГДА НоменклатураСпр.Наименование
		|		ИНАЧЕ НоменклатураСпр.НаименованиеПолное
		|	КОНЕЦ КАК НоменклатураНаименование,
		|	Товары.Количество КАК Количество,
		|	Товары.Цена КАК Цена,
		|	Товары.Сумма КАК Сумма,
		|	Товары.СтавкаНДС КАК СтавкаНДС,
		|	Товары.СуммаНДС КАК СуммаНДС,
		|	Товары.Номенклатура.ТипНоменклатуры КАК НоменклатураТипНоменклатуры,
		|	Товары.НомерСтроки КАК НомерСтроки,
		|	Товары.ПроцентРучнойСкидки КАК ПроцентСкидки,
		|	Товары.СуммаРучнойСкидки КАК СуммаСкидки,
		|	Товары.СуммаБонусныхБалловКСписанию КАК СуммаБонусныхБаллов,
		|	Товары.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	Товары.Серия КАК Серия,
		|	ВЫБОР
		|		КОГДА &РеализацияПоЗаказам
		|				И &РеализацияПоНесколькимЗаказам
		|				И Товары.ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
		|			ТОГДА Товары.ЗаказКлиента
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Заказ
		|ПОМЕСТИТЬ ТаблицаТовары
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
		|		ПО (НоменклатураСпр.Ссылка = Товары.Номенклатура)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикаСпр
		|		ПО (ХарактеристикаСпр.Ссылка = Товары.Характеристика)
		|ГДЕ
		|	Товары.Ссылка = &Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВидыЗапасов.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ВидыЗапасов.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВидыЗапасов.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
		|	ВидыЗапасов.АналитикаУчетаНоменклатуры.Серия КАК Серия,
		|	ВидыЗапасов.Упаковка КАК Упаковка,
		|	ВидыЗапасов.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ВидыЗапасов.Количество КАК Количество,
		|	ВидыЗапасов.СтавкаНДС КАК СтавкаНДС,
		|	ВидыЗапасов.СуммаНДС КАК СуммаНДС,
		|	ВидыЗапасов.НомерГТД КАК НомерГТД,
		|	ВидыЗапасов.КоличествоПоРНПТ КАК КоличествоПоРНПТ,
		|	ВидыЗапасов.Ссылка.ВернутьМногооборотнуюТару КАК ВернутьМногооборотнуюТару,
		|	ВЫРАЗИТЬ(ВЫБОР
		|			КОГДА ВидыЗапасов.Ссылка.ЦенаВключаетНДС
		|				ТОГДА ВидыЗапасов.СуммаСНДС / ВидыЗапасов.Количество
		|			ИНАЧЕ (ВидыЗапасов.СуммаСНДС - ВидыЗапасов.СуммаНДС) / ВидыЗапасов.Количество
		|		КОНЕЦ КАК ЧИСЛО(31, 2)) КАК Цена,
		|	ВЫБОР
		|		КОГДА ВидыЗапасов.Ссылка.ЦенаВключаетНДС
		|			ТОГДА ВидыЗапасов.СуммаСНДС
		|		ИНАЧЕ ВидыЗапасов.СуммаСНДС - ВидыЗапасов.СуммаНДС
		|	КОНЕЦ КАК Сумма,
		|	ВЫБОР
		|		КОГДА ВидыЗапасов.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
		|			ТОГДА ВЫРАЗИТЬ(""КомиссионныеТовары"" КАК СТРОКА(20))
		|		ИНАЧЕ ВЫРАЗИТЬ(&СобственныеТовары КАК СТРОКА(20))
		|	КОНЕЦ КАК ТипЗапасов,
		|	ВидыЗапасов.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ВЫБОР
		|		КОГДА ВидыЗапасов.СуммаРучнойСкидки > 0
		|			ТОГДА ВидыЗапасов.СуммаРучнойСкидки
		|		КОГДА ВидыЗапасов.СуммаАвтоматическойСкидки > 0
		|			ТОГДА ВидыЗапасов.СуммаАвтоматическойСкидки
		|	КОНЕЦ КАК СуммаСкидки,
		|	ВЫБОР
		|		КОГДА &РеализацияПоЗаказам
		|				И &РеализацияПоНесколькимЗаказам 
		|				И ВидыЗапасов.ЗаказКлиента ССЫЛКА Документ.ЗаказКлиента
		|			ТОГДА ВидыЗапасов.ЗаказКлиента
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Заказ
		|ПОМЕСТИТЬ ВидыЗапасов
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.ВидыЗапасов КАК ВидыЗапасов
		|ГДЕ
		|	ВидыЗапасов.Ссылка = &Ссылка
		|	И ВидыЗапасов.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
		|	И ВидыЗапасов.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		ТаблицаТовары.Номенклатура КАК Номенклатура,
		|		ТаблицаТовары.Характеристика КАК Характеристика,
		|		МАКСИМУМ(ТаблицаТовары.ПроцентСкидки) КАК ПроцентСкидки,
		|		МАКСИМУМ(ТаблицаТовары.СуммаСкидки) КАК СуммаСкидки,
		|		МАКСИМУМ(ТаблицаТовары.СуммаБонусныхБаллов) КАК СуммаБонусныхБаллов,
		|		ТаблицаТовары.Серия КАК Серия
		|	ПОМЕСТИТЬ ВТ_БонусыИСкидки
		|	ИЗ
		|		ТаблицаТовары КАК ТаблицаТовары
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ТаблицаТовары.Номенклатура,
		|		ТаблицаТовары.Характеристика,
		|		ТаблицаТовары.Серия
		|	;
	  	|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТовары.Номенклатура КАК Номенклатура,
		|	ТаблицаТовары.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ТаблицаТовары.ХарактеристикаНаименование = """"
		|			ТОГДА ТаблицаТовары.НоменклатураНаименование
		|		ИНАЧЕ ТаблицаТовары.НоменклатураНаименование + "" ("" + ТаблицаТовары.ХарактеристикаНаименование + "")""
		|	КОНЕЦ КАК Содержание,
		|	ТаблицаТовары.Номенклатура.Принципал КАК ПринципалСсылка,
		|	ВЫБОР
		|		КОГДА ТаблицаТовары.Номенклатура.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ОрганизациейПоАгентскойСхеме)
		|				ИЛИ ТаблицаТовары.Номенклатура.ОсобенностьУчета = ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.Партнером)
		|			ТОГДА ""Агентские""
		|		ИНАЧЕ ""Собственные""
		|	КОНЕЦ КАК ТипУслуги,
		|	ТаблицаТовары.Количество КАК Количество,
		|	ТаблицаТовары.Заказ КАК Заказ,
		|	ТаблицаТовары.Цена КАК Цена,
		|	ТаблицаТовары.СтавкаНДС КАК СтавкаНДС,
		|	ТаблицаТовары.Сумма КАК Сумма,
		|	ТаблицаТовары.СуммаНДС КАК СуммаНДС,
		|	ТаблицаТовары.ПроцентСкидки КАК ПроцентСкидки,
		|	ТаблицаТовары.СуммаСкидки КАК СуммаСкидки,
		|	ТаблицаТовары.СуммаБонусныхБаллов КАК СуммаБонусныхБаллов,
		|	ТаблицаТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ТаблицаТовары.НомерСтроки КАК НомерСтрокиДокумента
		|ИЗ
		|	ТаблицаТовары КАК ТаблицаТовары
		|ГДЕ
		|	(ТаблицаТовары.НоменклатураТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
		|			ИЛИ ТаблицаТовары.НоменклатураТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТовары.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ТаблицаТовары.НомерСтроки) КАК НомерСтроки
		|ПОМЕСТИТЬ ТаблицыТоварыПоМаксСтроке
		|ИЗ
		|	ТаблицаТовары КАК ТаблицаТовары
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаТовары.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
		|	ВложенныйЗапрос.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	&ТекстЗапросаХарактеристика,
		|	&ТекстЗапросаСерия,
		|	&ТекстЗапросаУпаковка,
		|	&ТекстЗапросаРНПТ,
		|	&ТекстЗапросаГТД,
		|	ВложенныйЗапрос.СтавкаНДС КАК СтавкаНДС,
		|	ВложенныйЗапрос.ТипЗапасов КАК ТипЗапасов,
		|	ВложенныйЗапрос.НомерСтрокиДокумента КАК НомерСтрокиДокумента,
		|	ВложенныйЗапрос.Цена КАК Цена,
		|	ВложенныйЗапрос.Количество КАК Количество,
		|	ВложенныйЗапрос.Сумма КАК Сумма,
		|	ВложенныйЗапрос.СуммаНДС КАК СуммаНДС,
		|	ВложенныйЗапрос.СуммаСкидки КАК СуммаСкидки,
		|	ВТ_БонусыИСкидки.ПроцентСкидки КАК ПроцентСкидки,
		|	ВТ_БонусыИСкидки.СуммаБонусныхБаллов КАК СуммаБонусныхБаллов,
		|	ВложенныйЗапрос.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ВложенныйЗапрос.Заказ КАК Заказ
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВидыЗапасов.Номенклатура КАК Номенклатура,
		|		ВидыЗапасов.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|		ВидыЗапасов.Характеристика КАК Характеристика,
		|		ВидыЗапасов.Серия КАК Серия,
		|		ВидыЗапасов.Упаковка КАК Упаковка,
		|		ВидыЗапасов.КоличествоУпаковок КАК КоличествоУпаковок,
		|		ВидыЗапасов.СтавкаНДС КАК СтавкаНДС,
		|		ВидыЗапасов.НомерГТД КАК НомерГТД,
		|		ВЫБОР
		|			КОГДА ВидыЗапасов.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
		|					И ВидыЗапасов.ВернутьМногооборотнуюТару
		|				ТОГДА ""ВозвратнаяТара""
		|			ИНАЧЕ ВидыЗапасов.ТипЗапасов
		|		КОНЕЦ КАК ТипЗапасов,
		|		ЕСТЬNULL(ПорядокСтрокТаблицыТовары.НомерСтроки, 0) КАК НомерСтрокиДокумента,
		|		ВЫРАЗИТЬ(ВидыЗапасов.Цена КАК ЧИСЛО(31, 2)) КАК Цена,
		|		СУММА(ВидыЗапасов.Количество) КАК Количество,
		|		СУММА(ВидыЗапасов.КоличествоПоРНПТ) КАК КоличествоПоРНПТ,
		|		СУММА(ВЫРАЗИТЬ(ВидыЗапасов.Сумма КАК ЧИСЛО(31, 2))) КАК Сумма,
		|		СУММА(ВидыЗапасов.СуммаНДС) КАК СуммаНДС,
		|		ВидыЗапасов.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|		СУММА(ВидыЗапасов.СуммаСкидки) КАК СуммаСкидки,
		|		ВидыЗапасов.Заказ КАК Заказ
		|	ИЗ
		|		ВидыЗапасов КАК ВидыЗапасов
		|			ЛЕВОЕ СОЕДИНЕНИЕ ТаблицыТоварыПоМаксСтроке КАК ПорядокСтрокТаблицыТовары
		|			ПО ВидыЗапасов.Номенклатура = ПорядокСтрокТаблицыТовары.Номенклатура
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ВидыЗапасов.Номенклатура,
		|		ВидыЗапасов.Характеристика,
		|		ВидыЗапасов.ЕдиницаИзмерения,
		|		ВидыЗапасов.СтавкаНДС,
		|		ВидыЗапасов.Цена,
		|		ВидыЗапасов.НомерГТД,
		|		ВЫБОР
		|			КОГДА ВидыЗапасов.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
		|					И ВидыЗапасов.ВернутьМногооборотнуюТару
		|				ТОГДА ""ВозвратнаяТара""
		|			ИНАЧЕ ВидыЗапасов.ТипЗапасов
		|		КОНЕЦ,
		|		ЕСТЬNULL(ПорядокСтрокТаблицыТовары.НомерСтроки, 0),
		|		ВидыЗапасов.Серия,
		|		ВидыЗапасов.Упаковка,
		|		ВидыЗапасов.КоличествоУпаковок,
		|		ВидыЗапасов.Заказ,
		|		ВидыЗапасов.ИдентификаторСтроки) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_БонусыИСкидки КАК ВТ_БонусыИСкидки
		|		ПО (ВложенныйЗапрос.Номенклатура = ВТ_БонусыИСкидки.Номенклатура
		|				И ВложенныйЗапрос.Характеристика = ВТ_БонусыИСкидки.Характеристика
		|				И ВложенныйЗапрос.Серия = ВТ_БонусыИСкидки.Серия
		|				И ВТ_БонусыИСкидки.СуммаСкидки = ВложенныйЗапрос.СуммаСкидки)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтрокиДокумента";
	
	ЗаполнитьСобственныеТоварыВТексте(ТоварыИУслугиДокумента);
	
	ТоварыИУслугиДокумента = СтрЗаменить(ТоварыИУслугиДокумента, "&ТекстЗапросаХарактеристика",
		ПолучитьТекстЗапросаХарактеристики(КомпонентыОбмена, "ВложенныйЗапрос"));
		
	ТоварыИУслугиДокумента = СтрЗаменить(ТоварыИУслугиДокумента, "&ТекстЗапросаУпаковка",
		ПолучитьТекстЗапросаУпаковки(КомпонентыОбмена, "ВложенныйЗапрос"));
		
	ТоварыИУслугиДокумента = СтрЗаменить(ТоварыИУслугиДокумента, "&ТекстЗапросаСерия",
		ПолучитьТекстЗапросаСерии(КомпонентыОбмена, "ВложенныйЗапрос"));
	
	ТоварыИУслугиДокумента = СтрЗаменить(ТоварыИУслугиДокумента, "&ТекстЗапросаРНПТ",
		ПолучитьТекстЗапросаРНПТ(КомпонентыОбмена, "ВложенныйЗапрос"));
	
	ТоварыИУслугиДокумента = СтрЗаменить(ТоварыИУслугиДокумента, "&ТекстЗапросаГТД",
		ПолучитьТекстЗапросаГТД(КомпонентыОбмена, "ВложенныйЗапрос"));
	//++ Локализация
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.16") Тогда
		ИмяТаблицы = "Документ.РеализацияТоваровУслуг.ВидыЗапасов";
		ИдентификаторыИзВидовЗапасов = Истина;
		ПолучитьСведенияОПрослеживаемости(ИмяТаблицы, ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, ИдентификаторыИзВидовЗапасов);
	КонецЕсли;
	//-- Локализация	
	#Область МаркировкиУпаковки
	
	ТекстЗапросаМаркировкиУпаковки =
		"ВЫБРАТЬ
		|	РеализацияТоваровУслугШтрихкодыУпаковок.НомерСтроки КАК НомерСтрокиДокумента,
		//++ Локализация
		|	ШтрихкодыУпаковокТоваров.ТипУпаковки КАК ТипУпаковки,
		|	ШтрихкодыУпаковокТоваров.Номенклатура КАК Номенклатура,
		|	ШтрихкодыУпаковокТоваров.Характеристика КАК Характеристика,
		|	ШтрихкодыУпаковокТоваров.Серия КАК Серия,
		|	ШтрихкодыУпаковокТоваров.Упаковка КАК Упаковка,
		|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
		//-- Локализация
		|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки
		|ПОМЕСТИТЬ втШтрихкодыУпаковок
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.ШтрихкодыУпаковок КАК РеализацияТоваровУслугШтрихкодыУпаковок
		//++ Локализация
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
		|		ПО РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки = ШтрихкодыУпаковокТоваров.Ссылка
		//-- Локализация
		|ГДЕ
		|	&ВыгружатьШтрихкодыУпаковок
		|	И РеализацияТоваровУслугШтрихкодыУпаковок.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		//++ Локализация
		|	втШтрихкодыУпаковок.Номенклатура КАК Номенклатура,
		|	&ТекстЗапросаХарактеристикаАкцизныеМарки,
		|	&ТекстЗапросаСерияАкцизныеМарки,
		|	&ТекстЗапросаУпаковкаАкцизныеМарки,
		|	&ТипАкцизнойМарки,
		|	втШтрихкодыУпаковок.ЗначениеШтрихкода КАК НомерАкцизнойМарки,
		//-- Локализация
		|	втШтрихкодыУпаковок.НомерСтрокиДокумента КАК НомерСтрокиДокумента
		|ИЗ
		|	втШтрихкодыУпаковок КАК втШтрихкодыУпаковок
		//++ Локализация
		|ГДЕ
		|	втШтрихкодыУпаковок.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МаркированныйТовар)
		//-- Локализация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втШтрихкодыУпаковок.НомерСтрокиДокумента КАК НомерСтрокиДокумента,
		|	втШтрихкодыУпаковок.ШтрихкодУпаковки КАК МаркировкаУпаковки
		|ИЗ
		|	втШтрихкодыУпаковок КАК втШтрихкодыУпаковок
		//++ Локализация
		|ГДЕ
		|	НЕ втШтрихкодыУпаковок.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МаркированныйТовар)
		|	И НЕ втШтрихкодыУпаковок.ТипУпаковки = ЗНАЧЕНИЕ(Перечисление.ТипыУпаковок.МультитоварнаяУпаковка)
		//-- Локализация
		|";
	
	//++ Локализация
		ТекстЗапросаМаркировкиУпаковки = СтрЗаменить(ТекстЗапросаМаркировкиУпаковки, "&ТекстЗапросаХарактеристикаАкцизныеМарки",
			ПолучитьТекстЗапросаХарактеристики(КомпонентыОбмена, "втШтрихкодыУпаковок"));
			
		ТекстЗапросаМаркировкиУпаковки = СтрЗаменить(ТекстЗапросаМаркировкиУпаковки, "&ТекстЗапросаСерияАкцизныеМарки",
			ПолучитьТекстЗапросаСерии(КомпонентыОбмена, "втШтрихкодыУпаковок"));
			
		ТекстЗапросаМаркировкиУпаковки = СтрЗаменить(ТекстЗапросаМаркировкиУпаковки, "&ТекстЗапросаУпаковкаАкцизныеМарки",
			ПолучитьТекстЗапросаУпаковки(КомпонентыОбмена, "втШтрихкодыУпаковок", Ложь));
		
		ТекстЗапросаМаркировкиУпаковки = СтрЗаменить(ТекстЗапросаМаркировкиУпаковки, "&ТипАкцизнойМарки",
				ПолучитьТекстЗапросаТипАкцизнойМарки(КомпонентыОбмена, "втШтрихкодыУпаковок"));	
	//-- Локализация
	#КонецОбласти
	
	Запрос = Новый Запрос;
	Запрос.Текст = ШапкаДокумента + ОбщегоНазначения.РазделительПакетаЗапросов() 
		+ ДанныеОперации + ОбщегоНазначения.РазделительПакетаЗапросов() 
		+ ТоварыИУслугиДокумента + ОбщегоНазначения.РазделительПакетаЗапросов()
		+ ТекстЗапросаМаркировкиУпаковки;
		
	Запрос.УстановитьПараметр("Ссылка",                     ДанныеИБ.Ссылка);
	Запрос.УстановитьПараметр("Дата",                       ДанныеИБ.Дата);
	Запрос.УстановитьПараметр("БазоваяВалюта",              ВалютаРеглУчета);
	Запрос.УстановитьПараметр("ВыгружатьШтрихкодыУпаковок", ВыгружатьШтрихкодыУпаковок(КомпонентыОбмена)); 
	Запрос.УстановитьПараметр("РеализацияПоЗаказам", ДанныеИБ.РеализацияПоЗаказам);
	Запрос.УстановитьПараметр("РеализацияПоНесколькимЗаказам", ДанныеИБ.РеализацияПоЗаказам
		И Не ЗначениеЗаполнено(ДанныеИБ.ЗаказКлиента));
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеОперации = РезультатыЗапроса[1].Выбрать();
	
	Если ДанныеОперации.Следующий() Тогда
		ДанныеXDTO.Вставить("КурсВзаиморасчетов",      ДанныеОперации.КурсВзаиморасчетов);
		ДанныеXDTO.Вставить("КратностьВзаиморасчетов", ДанныеОперации.КратностьВзаиморасчетов);
	КонецЕсли;
	
	ТабУслуги = РезультатыЗапроса[5].Выгрузить();
	ТабТовары = РезультатыЗапроса[7].Выгрузить();
	ЗаполнитьХарактеристикуУпаковкуВТЧ(КомпонентыОбмена, ТабТовары);
	ТаблицаУслугЗаполнитьПринципала(КомпонентыОбмена, ТабУслуги);
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) < ВерсияФорматаЧислом("1.17") Тогда   
		 ПереопределитьСтавкуНДСДляСтарыхФорматов(ТабТовары, Ложь);
		 ПереопределитьСтавкуНДСДляСтарыхФорматов(ТабУслуги, Ложь);
	КонецЕсли;
	
	ДанныеXDTO.Вставить("Товары", ТабТовары);
	ДанныеXDTO.Вставить("Услуги", ТабУслуги);
	
	//++ Локализация
	ПроверитьНеобходимостьВыгрузкиПатента(ДанныеXDTO, ДанныеИБ.Организация, ДанныеИБ.Подразделение, ДанныеИБ.НалогообложениеНДС, КомпонентыОбмена, ДанныеИБ.Ссылка);
	
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.7") Тогда
		АкцизныеМарки = РезультатыЗапроса[РезультатыЗапроса.Количество() - 2].Выгрузить();
		ЗаполнитьХарактеристикуУпаковкуВТЧ(КомпонентыОбмена, АкцизныеМарки);
		ДанныеXDTO.Вставить("АкцизныеМарки", АкцизныеМарки);
	КонецЕсли;
	
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.7") Тогда
		МаркировкиУпаковок = РезультатыЗапроса[РезультатыЗапроса.Количество() - 1].Выгрузить();
		ДанныеXDTO.Вставить("МаркировкиУпаковок", МаркировкиУпаковок);
	КонецЕсли;
	//-- Локализация
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.17") Тогда
		ЗаполнитьСерииПоДокументу(ДанныеИБ.Ссылка, "Документ.РеализацияТоваровУслуг.Серии", ДанныеXDTO);
	КонецЕсли;
КонецПроцедуры

&ИзменениеИКонтроль("ОтложеннаяОбработка_ХарактеристикиНоменклатуры")
Процедура vs_ОтложеннаяОбработка_ХарактеристикиНоменклатуры(Объект, КомпонентыОбмена)
	#Область ОбработкаВладельца

	ВладелецХарактеристики = Неопределено;
	Если ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.Номенклатура") Тогда
		ИспользованиеХарактеристик = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Владелец, "ИспользованиеХарактеристик");
		Если ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать
			ИЛИ НЕ ЗначениеЗаполнено(ИспользованиеХарактеристик) Тогда

			ВладелецХарактеристики = Объект.Владелец.ПолучитьОбъект();
#Удаление
			ВладелецХарактеристики.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры;
#КонецУдаления
#Вставка
			Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры") Тогда
				ВладелецХарактеристики.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.ИндивидуальныеДляНоменклатуры;
			Иначе
				ВладелецХарактеристики.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать;
			КонецЕсли;
#КонецВставки

		КонецЕсли;
	ИначеЕсли ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.ВидыНоменклатуры")
		И ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.7") Тогда

		ДанныеВладельца = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Владелец,
		"ИспользованиеХарактеристик, ИспользоватьХарактеристики");
		Если НЕ ДанныеВладельца.ИспользоватьХарактеристики
			Или НЕ ЗначениеЗаполнено(ДанныеВладельца.ИспользованиеХарактеристик)
			Или ДанныеВладельца.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать Тогда

			ВладелецХарактеристики = Объект.Владелец.ПолучитьОбъект();
#Удаление
			ВладелецХарактеристики.ИспользоватьХарактеристики = Истина;
			ВладелецХарактеристики.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры;

#КонецУдаления
#Вставка
			Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры") Тогда
				ВладелецХарактеристики.ИспользоватьХарактеристики = Истина;
				ВладелецХарактеристики.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.ОбщиеДляВидаНоменклатуры;
			Иначе
				ВладелецХарактеристики.ИспользоватьХарактеристики = Ложь;
				ВладелецХарактеристики.ИспользованиеХарактеристик = Перечисления.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать;
			КонецЕсли;
#КонецВставки
		КонецЕсли;
	КонецЕсли;

	Если НЕ ВладелецХарактеристики = Неопределено Тогда
		ВладелецХарактеристики.ОбменДанными.Загрузка = Истина;
		Попытка
			ВладелецХарактеристики.Записать();
		Исключение
			ЗаписатьОшибкуВЖурналРегистрации(ВладелецХарактеристики.Ссылка,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), КомпонентыОбмена);
		КонецПопытки;
	КонецЕсли;

	#КонецОбласти

	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = Объект.НаименованиеПолное;
	КонецЕсли;
КонецПроцедуры

&ИзменениеИКонтроль("ДобавитьПКО_Справочник_Номенклатура_Получение")
Процедура vs_ДобавитьПКО_Справочник_Номенклатура_Получение(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО                       = "Справочник_Номенклатура_Получение";
	ПравилоКонвертации.ОбъектДанных                 = Метаданные.Справочники.Номенклатура;
	ПравилоКонвертации.ОбъектФормата                = "Справочник.Номенклатура"; //@NON-NLS-1
	ПравилоКонвертации.ПриКонвертацииДанныхXDTO     = "ПКО_Справочник_Номенклатура_Получение_ПриКонвертацииДанныхXDTO";
	ПравилоКонвертации.ПередЗаписьюПолученныхДанных = "ПКО_Справочник_Номенклатура_Получение_ПередЗаписьюПолученныхДанных";
	ПравилоКонвертации.ПослеЗагрузкиВсехДанных      = "ОтложеннаяОбработка_Номенклатура";
	ПравилоКонвертации.ВариантИдентификации         = "ПоУникальномуИдентификатору";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "АлкогольнаяПродукция",                        "АлкогольнаяПродукция");
	ДобавитьПКС(СвойстваШапки, "Артикул",                                     "Артикул");
	ДобавитьПКС(СвойстваШапки, "ВесИспользовать",                             "Весовой");
	ДобавитьПКС(СвойстваШапки, "ВидАлкогольнойПродукции",                     "", 1);
	ДобавитьПКС(СвойстваШапки, "ВидНоменклатуры",                             "ВидНоменклатуры", , "Справочник_ВидыНоменклатуры");
	ДобавитьПКС(СвойстваШапки, "ГруппаАналитическогоУчета",                   "", 1);
	ДобавитьПКС(СвойстваШапки, "ЕдиницаИзмерения",                            "ЕдиницаИзмерения", , "Справочник_ЕдиницыИзмерения");
	ДобавитьПКС(СвойстваШапки, "ИмпортнаяАлкогольнаяПродукция",               "ИмпортнаяАлкогольнаяПродукция");
	ДобавитьПКС(СвойстваШапки, "Код",                                         "КодВПрограмме");
	ДобавитьПКС(СвойстваШапки, "КодВидаНоменклатурнойКлассификации",          "", 1);
	ДобавитьПКС(СвойстваШапки, "КодОКВЭД",                                    "", 1);
	ДобавитьПКС(СвойстваШапки, "КодОКП",                                      "", 1);
	ДобавитьПКС(СвойстваШапки, "КодТНВЭД",                                    "", 1);
	ДобавитьПКС(СвойстваШапки, "КодТРУ",                                      "КодТРУ");
	ДобавитьПКС(СвойстваШапки, "Крепость",                                    "Крепость");
	ДобавитьПКС(СвойстваШапки, "Марка",                                       "", 1, "Справочник_МаркиНоменклатуры");
	ДобавитьПКС(СвойстваШапки, "Наименование",                                "Наименование");
	ДобавитьПКС(СвойстваШапки, "НаименованиеВидаНоменклатурнойКлассификации", "", 1);
	ДобавитьПКС(СвойстваШапки, "НаименованиеПолное",                          "НаименованиеПолное");
	ДобавитьПКС(СвойстваШапки, "ОбъемДАЛ",                                    "ОбъемДАЛ");
	ДобавитьПКС(СвойстваШапки, "Описание",                                    "Описание");
	ДобавитьПКС(СвойстваШапки, "ОсобенностьУчета",                            "ВидПродукцииИС", , "ВидыПродукцииИС");
	ДобавитьПКС(СвойстваШапки, "ПодакцизныйТовар",                            "", 1);
	ДобавитьПКС(СвойстваШапки, "Производитель",                               "Производитель", , "Справочник_Производители");
	ДобавитьПКС(СвойстваШапки, "ПроизводительИмпортерКонтрагент",             "ПроизводительИмпортер", , "Справочник_Контрагенты_Получение");
	ДобавитьПКС(СвойстваШапки, "ПрослеживаемыйТовар",                         "ПрослеживаемыйТовар");
#Удаление
	ДобавитьПКС(СвойстваШапки, "Родитель",                                    "Группа", , "Справочник_НоменклатураГруппа");
#КонецУдаления
	ДобавитьПКС(СвойстваШапки, "СрокГодности",                                "", 1);
	ДобавитьПКС(СвойстваШапки, "СтавкаНДС",                                   "", 1);
	ДобавитьПКС(СвойстваШапки, "СтранаПроисхождения",                         "СтранаПроисхождения", , "Справочник_СтраныМира");
	ДобавитьПКС(СвойстваШапки, "ТипНоменклатуры",                             "ТипНоменклатуры", , "Перечисление_ТипыНоменклатуры");
	ДобавитьПКС(СвойстваШапки, "ФайлКартинки",                                "ОсновнаяКартинка", , "Справочник_НоменклатураПрисоединенныеФайлы_Получен");
	ДобавитьПКС(СвойстваШапки, "ЦеноваяГруппа",                               "ЦеноваяГруппа", , "Справочник_ЦеновыеГруппы");
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "ДополнительныеРеквизиты", "");
	ДобавитьПКС(СвойстваТЧ, "Значение", "", 1);
	ДобавитьПКС(СвойстваТЧ, "Свойство", "", 1, "Справочник_ДополнительныеРеквизиты");

#Удаление
	ПравилоКонвертации.ПоляПоиска.Добавить("Артикул,Наименование,Родитель");
#КонецУдаления
#Вставка
	ПравилоКонвертации.ПоляПоиска.Добавить("Артикул,Наименование");
#КонецВставки
КонецПроцедуры

&ИзменениеИКонтроль("Мержевание_ПБДС")
Процедура vs_Мержевание_ПБДС(ПолученныеДанные, ДанныеИБ, КонвертацияСвойств, КомпонентыОбмена)
	Если ДанныеИБ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеИБ_КонтрагентДоИзменения = ДанныеИБ.Контрагент;
	
	#Область Шапка
	ДополнительныеСвойства = ПолученныеДанные.ДополнительныеСвойства;
		
	Если ТипЗнч(ПолученныеДанные) = Тип("ДокументОбъект.ПоступлениеБезналичныхДенежныхСредств") Тогда
	     Если ДополнительныеСвойства.Свойство("Договор") Тогда
		      ПолученныеДанные.Договор = ДополнительныеСвойства.Договор;
		 КонецЕсли;
	КонецЕсли;
	// Заполнение контрагента, если он не заполнен.
	Если Не ЗначениеЗаполнено(ПолученныеДанные.Контрагент) Тогда
		Если ЗначениеЗаполнено(ДанныеИБ.Контрагент) Тогда
			ПолученныеДанные.Контрагент = ДанныеИБ.Контрагент;
		Иначе
			ЗаполнитьКонтрагентаНашеПредприятие(ПолученныеДанные, КомпонентыОбмена.ПараметрыКонвертации);
		КонецЕсли;
	КонецЕсли;
	
	// При операциях "интеркампани", некоторые реквизиты объекта ИБ имеют больший приоритет.
	Если ДанныеИБ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзДругойОрганизации Тогда
		ЗаполнитьЗначенияСвойств(ПолученныеДанные, ДанныеИБ,
			"Контрагент,БанковскийСчетКонтрагента,ХозяйственнаяОперация");
	ИначеЕсли ДанныеИБ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтАрендодателя Тогда
		ЗаполнитьЗначенияСвойств(ПолученныеДанные, ДанныеИБ,
		"Контрагент,БанковскийСчетКонтрагента,ХозяйственнаяОперация");
	КонецЕсли;
	
	// Заменяем свойства, которые получили из XDTO.
	ЗаполнитьСвойстваШапкиОбъекта(КонвертацияСвойств, ПолученныеДанные, ДанныеИБ);
	
	#КонецОбласти
	
	#Область РасшифровкаПлатежа
	
	// Мержевание расшифровки платежа.
	РасшифровкаПлатежаИсточник = ПолученныеДанные.РасшифровкаПлатежа;
	РасшифровкаПлатежаПриемник = ДанныеИБ.РасшифровкаПлатежа;
	
	Если РасшифровкаПлатежаИсточник.Количество() = РасшифровкаПлатежаПриемник.Количество() Тогда
		
		Для ИндексСтроки = 0 По РасшифровкаПлатежаИсточник.Количество() - 1 Цикл
			
			СтрокаИсточник = РасшифровкаПлатежаИсточник[ИндексСтроки];
			СтрокаПриемник = РасшифровкаПлатежаПриемник[ИндексСтроки];
			
			ЗаполнитьЗначенияСвойств(СтрокаПриемник, СтрокаИсточник,
				"Сумма,
				|СуммаВзаиморасчетов,
				|ВалютаВзаиморасчетов");
				
#Вставка
// В исходнике нет...
//#Удаление
//			Если ЗначениеЗаполнено(СтрокаИсточник.Заказ) Тогда
//				СтрокаПриемник.Заказ = СтрокаИсточник.Заказ;
//			КонецЕсли;
//
//#КонецУдаления
//			Если ЗначениеЗаполнено(СтрокаПриемник.Заказ)
//				и ЗначениеЗаполнено(СтрокаИсточник.Заказ)
//				и ТипЗнч(СтрокаПриемник.Заказ) = ТипЗнч(СтрокаИсточник.Заказ) 
//				и СтрНайти(Строка(СтрокаИсточник.Заказ), "Объект не найден") = 0 Тогда
//				СтрокаПриемник.Заказ = СтрокаИсточник.Заказ;
//			КонецЕсли;
//
#КонецВставки
			Если ЗначениеЗаполнено(СтрокаИсточник.СтатьяДоходов) Тогда
				СтрокаПриемник.СтатьяДоходов = СтрокаИсточник.СтатьяДоходов;
			КонецЕсли;
					
			Если ЗначениеЗаполнено(СтрокаИсточник.СтатьяДвиженияДенежныхСредств) Тогда
				СтрокаПриемник.СтатьяДвиженияДенежныхСредств = СтрокаИсточник.СтатьяДвиженияДенежныхСредств;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаИсточник.Подразделение) Тогда
				СтрокаПриемник.Подразделение = СтрокаИсточник.Подразделение;
			КонецЕсли;
				
			// Изменение контрагента обновляет зависимую от него аналитику.
			Если ДанныеИБ.Контрагент <> ДанныеИБ_КонтрагентДоИзменения Тогда
				ЗаполнитьЗначенияСвойств(СтрокаПриемник, СтрокаИсточник,
					"Партнер");
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		ДанныеИБ.РасшифровкаПлатежа.Загрузить(ПолученныеДанные.РасшифровкаПлатежа.Выгрузить());
	КонецЕсли;
	
	#КонецОбласти
КонецПроцедуры

&ИзменениеИКонтроль("ПКО_Документ_ВнутреннееПотребление_ВПроизводство_Отпр_ПриОтправкеДанных")
Процедура vs_ПКО_Документ_ВнутреннееПотребление_ВПроизводство_Отпр_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.10") Тогда
		УстановитьПравилоДляПКСТабЧасти(КомпонентыОбмена,
										"Документ_ВнутреннееПотребление_ВПроизводство_Отпр", 
										"Товары", 
										"НомерГТД",
										Истина,
										"Справочник_НомераГТД_Отправка");
	КонецЕсли;
	
	Префикс = "IN";
	//++ Локализация
	Префикс = "ВН";
	//-- Локализация
	
	НомерДок = Лев(ДанныеИБ.Номер, 5) + Префикс + Сред(ДанныеИБ.Номер, 8);
	ДанныеXDTO.КлючевыеСвойства.Вставить("Номер", НомерДок);
	
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	
	СкладДляВыгрузки = СкладДляВыгрузки(ДанныеИБ.Склад, КомпонентыОбмена.ПараметрыКонвертации);
	ДанныеXDTO.Вставить("Склад", СкладДляВыгрузки);
	
	ВыгрузитьПодразделениеИзРеквизитаДокумента(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, "Склад");
	
	ВыгрузитьНалогообложениеНДС(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, Ложь, Ложь);
	
#Удаление
	ВыгрузитьДополнительныеРеквизитыИСведения(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO);
#КонецУдаления
#Вставка
	ВыгрузитьДополнительныеРеквизитыИСведения(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, Истина);
#КонецВставки
	
	ДанныеXDTO.Вставить("Товары", ДанныеИБ.ДополнительныеСвойства.СобственныеТовары);
	//++ Локализация
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.16") Тогда
		ИмяТаблицы = "Документ.ВнутреннееПотребление.ВидыЗапасов"; 
		ИдентификаторыИзВидовЗапасов = Истина;
		ПолучитьСведенияОПрослеживаемости(ИмяТаблицы, ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, ИдентификаторыИзВидовЗапасов); 
	КонецЕсли;
	//-- Локализация
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.17") Тогда
		ЗаполнитьСерииПоДокументу(ДанныеИБ.Ссылка, "Документ.ВнутреннееПотребление.Серии", ДанныеXDTO);
	КонецЕсли;
КонецПроцедуры

&ИзменениеИКонтроль("ПКО_Документ_ВнутреннееПотребление_ВСписаниеЗапас_Отпр_ПриОтправкеДанных")
Процедура vs_ПКО_Документ_ВнутреннееПотребление_ВСписаниеЗапас_Отпр_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.10") Тогда
		УстановитьПравилоДляПКСТабЧасти(КомпонентыОбмена,
										"Документ_ВнутреннееПотребление_ВСписаниеЗапас_Отпр", 
										"Товары", 
										"НомерГТД",
										Истина,
										"Справочник_НомераГТД_Отправка");
	КонецЕсли;
	
	Префикс = "I";
	//++ Локализация
	Префикс = "В";
	//-- Локализация
	
	НомерДок = Лев(ДанныеИБ.Номер, 5) + Префикс + Сред(ДанныеИБ.Номер, 7);
	ДанныеXDTO.КлючевыеСвойства.Вставить("Номер", НомерДок);
	
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	
	СкладДляВыгрузки = СкладДляВыгрузки(ДанныеИБ.Склад, КомпонентыОбмена.ПараметрыКонвертации);
	ДанныеXDTO.Вставить("Склад", СкладДляВыгрузки);
	
	ВыгрузитьПодразделениеИзРеквизитаДокумента(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, "Склад");
	ВыгрузитьНалогообложениеНДС(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, Ложь, Ложь);
	
	ДанныеXDTO.Вставить("Основание", Строка(ДанныеИБ));
#Удаление
	ВыгрузитьДополнительныеРеквизитыИСведения(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO);
#КонецУдаления
#Вставка
	ВыгрузитьДополнительныеРеквизитыИСведения(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, Истина);
#КонецВставки
	
	ДанныеXDTO.Вставить("Товары", ДанныеИБ.ДополнительныеСвойства.КомиссионныеТовары);
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.17") Тогда
		ЗаполнитьСерииПоДокументу(ДанныеИБ.Ссылка, "Документ.ВнутреннееПотребление.Серии", ДанныеXDTO);
	КонецЕсли;
КонецПроцедуры

&ИзменениеИКонтроль("ПКО_Документ_ПередачаМатериаловВПроизводство_Отправка_ПриОтправкеДанных")
Процедура vs_ПКО_Документ_ПередачаМатериаловВПроизводство_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.10") Тогда
		УстановитьПравилоДляПКСТабЧасти(КомпонентыОбмена,
										"Документ_ПередачаМатериаловВПроизводство_Отправка", 
										"Товары", 
										"НомерГТД",
										Истина,
										"Справочник_НомераГТД_Отправка");
	КонецЕсли;
	
	ВыгрузитьПодразделение(ДанныеИБ, ДанныеXDTO);
	
	СкладДляВыгрузки = СкладДляВыгрузки(ДанныеИБ.Склад, КомпонентыОбмена.ПараметрыКонвертации);
	ДанныеXDTO.Вставить("Склад", СкладДляВыгрузки);
	
	СтруктураДанныеИБ = Новый Структура("Организация, Склад, НаправлениеДеятельности, Дата");
	ЗаполнитьЗначенияСвойств(СтруктураДанныеИБ, ДанныеИБ);
	СтруктураДанныеИБ.Вставить("НалогообложениеНДС", ДанныеИБ.ПотреблениеДляДеятельности);
	ВыгрузитьНалогообложениеНДС(КомпонентыОбмена, СтруктураДанныеИБ, ДанныеXDTO, Ложь, Ложь);
	
#Удаление
	ВыгрузитьДополнительныеРеквизитыИСведения(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO);
#КонецУдаления
#Вставка
	ВыгрузитьДополнительныеРеквизитыИСведения(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, Истина);
#КонецВставки
	
	ТабСобственныеТовары = ДанныеИБ.ДополнительныеСвойства.СобственныеТовары;
	Если ЗначениеЗаполнено(КомпонентыОбмена.ПараметрыКонвертации.СчетЗатратПередачаМатериаловВПроизводство) Тогда
		ТабСобственныеТовары.Колонки.Добавить("СчетЗатрат");
		ТабСобственныеТовары.ЗаполнитьЗначения(КомпонентыОбмена.ПараметрыКонвертации.СчетЗатратПередачаМатериаловВПроизводство, "СчетЗатрат");
	КонецЕсли;
	ДанныеXDTO.Вставить("Товары", ТабСобственныеТовары);
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.16") Тогда
		ИмяТаблицы = "Документ.ПередачаМатериаловВПроизводство.ВидыЗапасов"; 
		ИдентификаторыИзВидовЗапасов = Истина;
		ПолучитьСведенияОПрослеживаемости(ИмяТаблицы, ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, ИдентификаторыИзВидовЗапасов); 
	КонецЕсли;
КонецПроцедуры

&ИзменениеИКонтроль("ПКО_Документ_ПеремещениеТоваров_ВПроизв_Отправка_ПриОтправкеДанных")
Процедура vs_ПКО_Документ_ПеремещениеТоваров_ВПроизв_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Префикс = "T";
	//++ Локализация
	Префикс = "П";
	//-- Локализация
	НомерДок = Лев(ДанныеИБ.Номер, 5) + Префикс + Сред(ДанныеИБ.Номер, 7);
	
	Если СтекВыгрузки.Количество() > 1 Тогда
		ДанныеXDTO.Вставить("Номер", НомерДок);
		Возврат;
	КонецЕсли;
	
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.10") Тогда
		УстановитьПравилоДляПКСТабЧасти(КомпонентыОбмена,
										"Документ_ПеремещениеТоваров_ВПроизв_Отправка", 
										"Товары", 
										"НомерГТД",
										Истина,
										"Справочник_НомераГТД_Отправка");
	КонецЕсли;
	
	ДанныеXDTO.КлючевыеСвойства.Вставить("Номер", НомерДок);
	
	СкладДляВыгрузки = СкладДляВыгрузки(ДанныеИБ.СкладОтправитель, КомпонентыОбмена.ПараметрыКонвертации);
	ДанныеXDTO.Вставить("Склад", СкладДляВыгрузки);
	ВыгрузитьПодразделение(ДанныеИБ, ДанныеXDTO, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеИБ.СкладПолучатель, "Подразделение"));
	ВыгрузитьНалогообложениеНДС(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, Ложь, Ложь);
	
#Удаление
	ВыгрузитьДополнительныеРеквизитыИСведения(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO);
#КонецУдаления
#Вставка
	ВыгрузитьДополнительныеРеквизитыИСведения(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, Истина);
#КонецВставки
	
	ТабСобственныеТовары = ДанныеИБ.ДополнительныеСвойства.Товары;
	Если ЗначениеЗаполнено(КомпонентыОбмена.ПараметрыКонвертации.СчетЗатратПередачаМатериаловВПроизводство) Тогда
		ТабСобственныеТовары.Колонки.Добавить("СчетЗатрат");
		ТабСобственныеТовары.ЗаполнитьЗначения(КомпонентыОбмена.ПараметрыКонвертации.СчетЗатратПередачаМатериаловВПроизводство, "СчетЗатрат");
	КонецЕсли;
	ДанныеXDTO.Вставить("Товары", ТабСобственныеТовары);
КонецПроцедуры

&ИзменениеИКонтроль("ПКО_Документ_ПеремещениеТоваров_Отправка_ПриОтправкеДанных")
Процедура vs_ПКО_Документ_ПеремещениеТоваров_Отправка_ПриОтправкеДанных(ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, СтекВыгрузки)
	Если СтекВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.10") Тогда
		УстановитьПравилоДляПКСТабЧасти(КомпонентыОбмена,
										"Документ_ПеремещениеТоваров_Отправка", 
										"Товары", 
										"НомерГТД",
										Истина,
										"Справочник_НомераГТД_Отправка");
	КонецЕсли;
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.17") Тогда
		УстановитьПравилоДляПКСТабЧасти(КомпонентыОбмена,
										"Документ_ПеремещениеТоваров_Отправка", 
										"Товары", 
										"СтавкаНДСВРознице",
										Истина,
										"СправочникСсылка_СтавкиНДС_Отправка");
	КонецЕсли;
#Удаление
	ВыгрузитьДополнительныеРеквизитыИСведения(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO);
#КонецУдаления
#Вставка
	ВыгрузитьДополнительныеРеквизитыИСведения(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, Истина);
#КонецВставки
	
	ВыгрузитьНалогообложениеНДС(КомпонентыОбмена, ДанныеИБ, ДанныеXDTO, Ложь);
	
	// Подразделения.
	ДанныеXDTO.Вставить("ПодразделениеОтправитель", Неопределено);
	ДанныеXDTO.Вставить("ПодразделениеПолучатель",  Неопределено);
	
	Если ЗначениеЗаполнено(ДанныеИБ.Организация) Тогда
		
		СкладОтправитель                      = ДанныеИБ.СкладОтправитель;
		СкладПолучатель                       = ДанныеИБ.СкладПолучатель;
	    СоответствиеДляПолученияПодразделений = Неопределено;
	    ТекПодразделениеОтправитель           = Неопределено;
	    ТекПодразделениеПолучатель            = Неопределено;
	    ДополнитьСоответствие                 = Ложь;
	    
	    КомпонентыОбмена.ПараметрыКонвертации.Свойство("СоответствиеДляПолученияПодразделений", СоответствиеДляПолученияПодразделений);
	    
	    Если СоответствиеДляПолученияПодразделений = Неопределено Тогда
	    	СоответствиеДляПолученияПодразделений = Новый Соответствие;
	    	ДополнитьСоответствие = Истина;
	    Иначе 
	    	ТекПодразделениеОтправитель = СоответствиеДляПолученияПодразделений.Получить(СкладОтправитель);
	    	ТекПодразделениеПолучатель = СоответствиеДляПолученияПодразделений.Получить(СкладПолучатель);
	    КонецЕсли;
	
	    Если ТекПодразделениеОтправитель = Неопределено Тогда
	    	ТекПодразделениеОтправитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СкладОтправитель, "Подразделение");
	    	ДополнитьСоответствие = Истина;
	    КонецЕсли;
	
	    Если ТекПодразделениеПолучатель = Неопределено Тогда
	    	ТекПодразделениеПолучатель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СкладПолучатель, "Подразделение");
	    	ДополнитьСоответствие = Истина;
	    КонецЕсли;
	
	    Если ЗначениеЗаполнено(ТекПодразделениеОтправитель) Тогда
	
	    	РегистрацияПодразделенияВНалоговомОргане = ОпределитьРегистрациюВНалоговомОргане(ТекПодразделениеОтправитель, ДанныеИБ.Организация);
		
			СтруктураДанныеПодразделения = Новый Структура(
				"Наименование, РегистрацияПодразделенияВНалоговомОргане", 
				Строка(ТекПодразделениеОтправитель),
				РегистрацияПодразделенияВНалоговомОргане);
			
			Инструкция = Новый Структура(
				"Значение, ИмяПКО",
				СтруктураДанныеПодразделения,
				"Справочник_Подразделения_ИзСтруктуры");
			
			ДанныеXDTO.Вставить("ПодразделениеОтправитель", Инструкция);
	
	    КонецЕсли;
	
	    Если ЗначениеЗаполнено(ТекПодразделениеПолучатель) Тогда
	
	    	РегистрацияПодразделенияВНалоговомОргане = ОпределитьРегистрациюВНалоговомОргане(ТекПодразделениеПолучатель, ДанныеИБ.Организация);
		
			СтруктураДанныеПодразделения = Новый Структура(
				"Наименование, РегистрацияПодразделенияВНалоговомОргане", 
				Строка(ТекПодразделениеПолучатель),
				РегистрацияПодразделенияВНалоговомОргане);
			
			Инструкция = Новый Структура(
				"Значение, ИмяПКО",
				СтруктураДанныеПодразделения,
				"Справочник_Подразделения_ИзСтруктуры");
			
			ДанныеXDTO.Вставить("ПодразделениеПолучатель", Инструкция);
	
	    КонецЕсли;
	
		Если ДополнитьСоответствие Тогда
	
			СоответствиеДляПолученияПодразделений.Вставить(СкладОтправитель, ТекПодразделениеОтправитель);
			СоответствиеДляПолученияПодразделений.Вставить(СкладПолучатель, ТекПодразделениеПолучатель);
			КомпонентыОбмена.ПараметрыКонвертации.Вставить("СоответствиеДляПолученияПодразделений", СоответствиеДляПолученияПодразделений);
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДанныеИБ.Ссылка);
	
	ДанныеСкладаПолучателя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеИБ.СкладПолучатель, "ТипСклада,РозничныйВидЦены");
	
	Если ДанныеСкладаПолучателя.ТипСклада = Перечисления.ТипыСкладов.РозничныйМагазин
		И ЗначениеЗаполнено(ДанныеСкладаПолучателя.РозничныйВидЦены) Тогда
		
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ВидыЗапасов.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
			|	ВидыЗапасов.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
			|	ВидыЗапасов.АналитикаУчетаНоменклатуры.Серия КАК Серия,
			|	ВидыЗапасов.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ВидыЗапасов.Количество КАК Количество,
			|	ВидыЗапасов.НомерГТД КАК НомерГТД,
			|	ВидыЗапасов.КоличествоПоРНПТ КАК КоличествоПоРНПТ,
			|	ВЫБОР
			|		КОГДА ВидыЗапасов.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
			|			ТОГДА ""ВозвратнаяТара""
			|		КОГДА ВидыЗапасов.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
			|			ТОГДА ВЫРАЗИТЬ(""КомиссионныеТовары"" КАК СТРОКА(20))
			|		ИНАЧЕ ВЫРАЗИТЬ(&СобственныеТовары КАК СТРОКА(20))
			|	КОНЕЦ КАК ТипЗапасов,
			|	ВидыЗапасов.ИдентификаторСтроки КАК ИдентификаторСтроки
			|ПОМЕСТИТЬ ТаблицаТоваров
			|ИЗ
			|	Документ.ПеремещениеТоваров.ВидыЗапасов КАК ВидыЗапасов
			|ГДЕ
			|	ВидыЗапасов.Ссылка = &Ссылка
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура,
			|	Характеристика
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
			|	ТаблицаТоваров.Характеристика КАК Характеристика,
			|	ТаблицаТоваров.Серия КАК Серия,
			|	ТаблицаТоваров.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ТаблицаТоваров.Количество КАК Количество,
			|	ТаблицаТоваров.ТипЗапасов КАК ТипЗапасов,
			|	ТаблицаТоваров.НомерГТД КАК НомерГТД,
			|	ТаблицаТоваров.КоличествоПоРНПТ КАК КоличествоПоРНПТ,
			|	ЦеныНоменклатурыСрезПоследних.Цена / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) * ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки2, 1) * ВЫБОР
			|		КОГДА &Валюта <> ЦеныНоменклатурыСрезПоследних.Валюта
			|			ТОГДА ВЫБОР
			|					КОГДА ЕСТЬNULL(КурсыВалютыЦены.КурсЗнаменатель, 0) > 0
			|							И ЕСТЬNULL(КурсыВалютыЦены.КурсЧислитель, 0) > 0
			|							И ЕСТЬNULL(КурсыВалюты.КурсЗнаменатель, 0) > 0
			|							И ЕСТЬNULL(КурсыВалюты.КурсЧислитель, 0) > 0
			|						ТОГДА КурсыВалютыЦены.КурсЧислитель * КурсыВалюты.КурсЗнаменатель / (КурсыВалюты.КурсЧислитель * КурсыВалютыЦены.КурсЗнаменатель)
			|					ИНАЧЕ 0
			|				КОНЕЦ
			|		ИНАЧЕ 1
			|	КОНЕЦ КАК ЦенаВРознице,
			|	ТаблицаТоваров.ИдентификаторСтроки КАК ИдентификаторСтроки,
			|	&СтавкаНДС КАК СтавкаНДСВРознице
			|ПОМЕСТИТЬ ПервичныеДанные
			|ИЗ
			|	ТаблицаТоваров КАК ТаблицаТоваров
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
			|				&Дата,
			|				ВидЦены = &ВидЦен
			|					И Номенклатура В
			|						(ВЫБРАТЬ
			|							ТаблицаТоваров.Номенклатура
			|						ИЗ
			|							ТаблицаТоваров КАК ТаблицаТоваров)
			|					И (Характеристика В
			|							(ВЫБРАТЬ
			|								ТаблицаТоваров.Характеристика
			|							ИЗ
			|								ТаблицаТоваров КАК ТаблицаТоваров)
			|						ИЛИ Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))) КАК ЦеныНоменклатурыСрезПоследних
			|		ПО ТаблицаТоваров.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
			|			И ТаблицаТоваров.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&Дата, БазоваяВалюта = &БазоваяВалюта) КАК КурсыВалютыЦены
			|		ПО (ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютыЦены.Валюта)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&Дата, Валюта = &Валюта И БазоваяВалюта = &БазоваяВалюта) КАК КурсыВалюты
			|		ПО (ИСТИНА),
			|		#ТаблицыСтавкаНДС
			|ГДЕ
			|	(ТаблицаТоваров.ТипЗапасов = &СобственныеТовары
			|			ИЛИ ТаблицаТоваров.ТипЗапасов = ""ВозвратнаяТара"")
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ТаблицаТоваров.Номенклатура,
			|	ТаблицаТоваров.Характеристика,
			|	ТаблицаТоваров.Серия,
			|	ТаблицаТоваров.ЕдиницаИзмерения,
			|	ТаблицаТоваров.Количество,
			|	ТаблицаТоваров.ТипЗапасов,
			|	ТаблицаТоваров.НомерГТД,
			|	ТаблицаТоваров.КоличествоПоРНПТ,
			|	0,
			|	ТаблицаТоваров.ИдентификаторСтроки,
			|	NULL
			|ИЗ
			|	ТаблицаТоваров КАК ТаблицаТоваров
			|ГДЕ
			|	ТаблицаТоваров.ТипЗапасов = ""КомиссионныеТовары""
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПервичныеДанные.Номенклатура КАК Номенклатура,
			|	&ТекстЗапросаХарактеристика,
			|	&ТекстЗапросаСерия,
			|	&ТекстЗапросаРНПТ,
			|	&ТекстЗапросаГТД,
			|	ПервичныеДанные.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ПервичныеДанные.Количество КАК Количество,
			|	ПервичныеДанные.ТипЗапасов КАК ТипЗапасов,
			|	ВЫБОР
			|		КОГДА ПервичныеДанные.ЦенаВРознице < 0.01
			|			ТОГДА 0.01
			|		ИНАЧЕ ВЫРАЗИТЬ(ПервичныеДанные.ЦенаВРознице КАК ЧИСЛО(31, 2))
			|	КОНЕЦ КАК ЦенаВРознице,
			|	ПервичныеДанные.СтавкаНДСВРознице КАК СтавкаНДСВРознице,
			|	ПервичныеДанные.ИдентификаторСтроки КАК ИдентификаторСтроки,
			|	ВЫРАЗИТЬ(ВЫБОР
			|			КОГДА ПервичныеДанные.ЦенаВРознице < 0.01
			|				ТОГДА 0.01
			|			ИНАЧЕ ВЫРАЗИТЬ(ПервичныеДанные.ЦенаВРознице КАК ЧИСЛО(31, 2))
			|		КОНЕЦ * ПервичныеДанные.Количество КАК ЧИСЛО(31, 2)) КАК СуммаВРознице
			|ИЗ
			|	ПервичныеДанные КАК ПервичныеДанные";
		
		ЗаполнитьСобственныеТоварыВТексте(Запрос.Текст);
		ВерсияФормата17ИВыше = ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.17");
		ЗаполнитьСтавкуНДСВТексте(Запрос.Текст, "ТаблицаТоваров.Номенклатура", ВерсияФормата17ИВыше);
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"&ТекстЗапросаКоэффициентУпаковки1",
			Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"ЦеныНоменклатурыСрезПоследних.Упаковка",
			"ЦеныНоменклатурыСрезПоследних.Номенклатура"));
			
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"&ТекстЗапросаКоэффициентУпаковки2",
			Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"ТаблицаТоваров.ЕдиницаИзмерения",
			"ТаблицаТоваров.Номенклатура"));
			
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаХарактеристика",
			ПолучитьТекстЗапросаХарактеристики(КомпонентыОбмена, "ПервичныеДанные"));
			
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаСерия",
			ПолучитьТекстЗапросаСерии(КомпонентыОбмена, "ПервичныеДанные"));
	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаРНПТ",
			ПолучитьТекстЗапросаРНПТ_ПеремещениеТоваров(КомпонентыОбмена, "ПервичныеДанные"));
	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаГТД",
			ПолучитьТекстЗапросаГТД(КомпонентыОбмена, "ПервичныеДанные"));
		
		Запрос.УстановитьПараметр("Дата",	КонецДня(ДанныеИБ.Дата));
		Запрос.УстановитьПараметр("Валюта", ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(ДанныеИБ.Организация));
		Запрос.УстановитьПараметр("БазоваяВалюта", ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(ДанныеИБ.Организация));
		Запрос.УстановитьПараметр("ВидЦен", ДанныеСкладаПолучателя.РозничныйВидЦены);
		Запрос.УстановитьПараметр("СтранаРегистрации", ЗначениеНастроекКлиентСерверПовтИсп.СтранаРегистрацииОрганизации(ДанныеИБ.Организация));
		Запрос.УстановитьПараметр("Период", ДанныеИБ.Дата);
		
	Иначе
		
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ВидыЗапасов.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
			|	ВидыЗапасов.ИдентификаторСтроки КАК ИдентификаторСтроки,
			|	&ТекстЗапросаХарактеристика,
			|	&ТекстЗапросаСерия,
			|	&ТекстЗапросаРНПТ,
			|	&ТекстЗапросаГТД,
			|	ВидыЗапасов.АналитикаУчетаНоменклатуры.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	ВидыЗапасов.Количество КАК Количество,
			|	ВЫБОР
			|		КОГДА ВидыЗапасов.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
			|			ТОГДА ""ВозвратнаяТара""
			|		КОГДА ВидыЗапасов.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
			|			ТОГДА ВЫРАЗИТЬ(""КомиссионныеТовары"" КАК СТРОКА(20))
			|		ИНАЧЕ ВЫРАЗИТЬ(&СобственныеТовары КАК СТРОКА(20))
			|	КОНЕЦ КАК ТипЗапасов
			|ИЗ
			|	Документ.ПеремещениеТоваров.ВидыЗапасов КАК ВидыЗапасов
			|ГДЕ
			|	ВидыЗапасов.Ссылка = &Ссылка";
		
		ЗаполнитьСобственныеТоварыВТексте(Запрос.Текст);
		ВерсияФормата17ИВыше = ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.17");
		ЗаполнитьСтавкуНДСВТексте(Запрос.Текст, "ТаблицаТоваров.Номенклатура", ВерсияФормата17ИВыше);
	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаХарактеристика",
			ПолучитьТекстЗапросаХарактеристики(КомпонентыОбмена, "ВидыЗапасов.АналитикаУчетаНоменклатуры"));
			
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаСерия",
			ПолучитьТекстЗапросаСерии(КомпонентыОбмена, "ВидыЗапасов.АналитикаУчетаНоменклатуры"));
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаРНПТ",
			ПолучитьТекстЗапросаРНПТ_ПеремещениеТоваров(КомпонентыОбмена, "ВидыЗапасов", "ВидыЗапасов.АналитикаУчетаНоменклатуры"));
	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаГТД",
			ПолучитьТекстЗапросаГТД(КомпонентыОбмена, "ВидыЗапасов"));
				
	КонецЕсли;
	
	Товары = Запрос.Выполнить().Выгрузить();
	ЗаполнитьХарактеристикуУпаковкуВТЧ(КомпонентыОбмена, Товары, Истина, Ложь);
	ЗаполнитьВидДеятельностиНДСВТЧ(КомпонентыОбмена, ДанныеИБ, Товары, "ПеремещениеПодДеятельность", "ПеремещениеПодДеятельность");
	//Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) < ВерсияФорматаЧислом("1.17") Тогда   
	//	 ПереопределитьСтавкуНДСДляСтарыхФорматов(Товары, Ложь);
	//КонецЕсли;
	ДанныеXDTO.Вставить("Товары", Товары);
	//++ Локализация
	Если ВерсияФорматаЧислом(КомпонентыОбмена.ВерсияФорматаОбмена) >= ВерсияФорматаЧислом("1.16") Тогда
		ИмяТаблицы = "Документ.ПеремещениеТоваров.ВидыЗапасов"; 
		ИдентификаторыИзВидовЗапасов = Истина;
		ПолучитьСведенияОПрослеживаемости(ИмяТаблицы, ДанныеИБ, ДанныеXDTO, КомпонентыОбмена, ИдентификаторыИзВидовЗапасов); 
	КонецЕсли;  
	//-- Локализация
КонецПроцедуры

&ИзменениеИКонтроль("ДобавитьПКО_Документ_СборкаТоваров")
Процедура vs_ДобавитьПКО_Документ_СборкаТоваров(ПравилаКонвертации)
	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО            = "Документ_СборкаТоваров";
	ПравилоКонвертации.ОбъектДанных      = Метаданные.Документы.СборкаТоваров;
	ПравилоКонвертации.ОбъектФормата     = "Документ.СборкаТоваров"; //@NON-NLS-1
	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_СборкаТоваров_ПриОтправкеДанных";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "",                   "ВидОперации", 1);
	ДобавитьПКС(СвойстваШапки, "Дата",               "Дата");
	ДобавитьПКС(СвойстваШапки, "",                   "ЕдиницаИзмерения", 1, "Справочник_ЕдиницыИзмерения");
	ДобавитьПКС(СвойстваШапки, "Количество",         "Количество");
	ДобавитьПКС(СвойстваШапки, "КоличествоУпаковок", "КоличествоУпаковок");
	ДобавитьПКС(СвойстваШапки, "Комментарий",        "Комментарий");
	ДобавитьПКС(СвойстваШапки, "Номенклатура",       "Номенклатура", , "Справочник_Номенклатура_Отправка");
	ДобавитьПКС(СвойстваШапки, "Номер",              "Номер");
	ДобавитьПКС(СвойстваШапки, "Организация",        "Организация", , "Справочник_Организации_Отправка");
	ДобавитьПКС(СвойстваШапки, "Ответственный",      "Ответственный", , "Справочник_Пользователи");
	ДобавитьПКС(СвойстваШапки, "",                   "Подразделение", 1);
	ДобавитьПКС(СвойстваШапки, "",                   "Склад", 1, "Справочник_Склады_Отправка");
	ДобавитьПКС(СвойстваШапки, "",                   "ТипЗапасов", 1);
	ДобавитьПКС(СвойстваШапки, "",                   "Характеристика", 1);
#Вставка
// Здесь можно описать новое поведение.
	ДобавитьПКС(СвойстваШапки, "ПлановаяСтоимость",  "ПлановаяСтоимость");
    ДобавитьПКС(СвойстваШапки, "СуммаПлановая",      "СуммаПлановая");
#КонецВставки

	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "ДополнительныеРеквизиты");
	ДобавитьПКС(СвойстваТЧ, "", "ЗначениеСвойства", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Свойство", 1, "Справочник_ДополнительныеРеквизиты");

	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "СведенияРНПТ");
	ДобавитьПКС(СвойстваТЧ, "", "ЕдиницаИзмеренияРНПТ", 1, "Справочник_ЕдиницыИзмерения");
	ДобавитьПКС(СвойстваТЧ, "", "ИдентификаторСтроки", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Количество", 1);
	ДобавитьПКС(СвойстваТЧ, "", "КоличествоРНПТ", 1);
	ДобавитьПКС(СвойстваТЧ, "", "НаименованиеТовара", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Номенклатура", 1, "Справочник_Номенклатура_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "РНПТ", 1, "Справочник_НомераГТД_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "СуммаРНПТ", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Упаковка", 1, "Справочник_Упаковки");

	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "Товары");
	ДобавитьПКС(СвойстваТЧ, "", "ДоляСтоимости", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ЕдиницаИзмерения", 1, "Справочник_ЕдиницыИзмерения");
	ДобавитьПКС(СвойстваТЧ, "", "ЕдиницаИзмеренияПрослеживаемости", 1, "Справочник_ЕдиницыИзмерения");
	ДобавитьПКС(СвойстваТЧ, "", "ИдентификаторСтроки", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Количество", 1);
	ДобавитьПКС(СвойстваТЧ, "", "КоличествоРНПТ", 1);
	ДобавитьПКС(СвойстваТЧ, "", "КоличествоУпаковок", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Номенклатура", 1, "Справочник_Номенклатура_Отправка");
	ДобавитьПКС(СвойстваТЧ, "", "НомерГТД", 1);
	ДобавитьПКС(СвойстваТЧ, "", "ПрослеживаемыйТовар", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Серия", 1, "Справочник_СерииНоменклатуры");
	ДобавитьПКС(СвойстваТЧ, "", "СтранаПроисхождения", 1, "Справочник_СтраныМира");
	ДобавитьПКС(СвойстваТЧ, "", "ТипЗапасов", 1);
	ДобавитьПКС(СвойстваТЧ, "", "Упаковка", 1, "Справочник_Упаковки");
	ДобавитьПКС(СвойстваТЧ, "", "Характеристика", 1, "Справочник_ХарактеристикиНоменклатуры");

КонецПроцедуры

//&ИзменениеИКонтроль("ПКО_Документ_ПБДСПрочееПоступление_Получение_ПередЗаписьюПолученныхДанных")
//Процедура vs_ПКО_Документ_ПБДСПрочееПоступление_Получение_ПередЗаписьюПолученныхДанных(ПолученныеДанные, ДанныеИБ, КонвертацияСвойств, КомпонентыОбмена)
//	Если ЕстьИсправлениеИлиСторно(ДанныеИБ, ПолученныеДанные, КомпонентыОбмена) Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Если Не ДанныеИБ = Неопределено И ЗначениеЗаполнено(ДанныеИБ.Ссылка) И НЕ ДанныеИБ.Ссылка.Пустая()
//			И ДанныеИБ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратНалогов Тогда
//				ПолученныеДанные.ХозяйственнаяОперация = ДанныеИБ.ХозяйственнаяОперация;
//				ПолученныеДанные.ТипНалога = ДанныеИБ.ТипНалога;
//	КонецЕсли;
//	
//	ПередМержеванием_ПБДС(ПолученныеДанные, ДанныеИБ, КомпонентыОбмена);
//	Мержевание_ПБДС(ПолученныеДанные, ДанныеИБ, КонвертацияСвойств, КомпонентыОбмена);
//	ПослеМержевания_ПБДС(ПолученныеДанные, ДанныеИБ, КомпонентыОбмена);
//	
//	ПолученныеДанные = ?(ДанныеИБ = Неопределено, ПолученныеДанные, Неопределено);
//КонецПроцедуры

//&ИзменениеИКонтроль("ДобавитьПОД_Документ_ЗаказКлиента_Отправка")
//Процедура vs_ДобавитьПОД_Документ_ЗаказКлиента_Отправка(ПравилаОбработкиДанных)
//#Удаление
//	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
//	ПравилоОбработки.Имя                     = "Документ_ЗаказКлиента_Отправка";
//	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Документы.ЗаказКлиента;
//	ПравилоОбработки.ПриОбработке            = "ПОД_Документ_ЗаказКлиента_Отправка_ПриОбработке";
//	ПравилоОбработки.ОчисткаДанных           = Ложь;
//	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ЗаказКлиента_Отправка");
//#КонецУдаления
//КонецПроцедуры

//&ИзменениеИКонтроль("ДобавитьПКО_Документ_ЗаказКлиента_Отправка")
//Процедура vs_ДобавитьПКО_Документ_ЗаказКлиента_Отправка(ПравилаКонвертации)
//#Удаление

//	ПравилоКонвертации = ОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
//	ПравилоКонвертации.ИмяПКО            = "Документ_ЗаказКлиента_Отправка";
//	ПравилоКонвертации.ОбъектДанных      = Метаданные.Документы.ЗаказКлиента;
//	ПравилоКонвертации.ОбъектФормата     = "Документ.ЗаказКлиента";
//	ПравилоКонвертации.ПриОтправкеДанных = "ПКО_Документ_ЗаказКлиента_Отправка_ПриОтправкеДанных";

//	СвойстваШапки = ПравилоКонвертации.Свойства;
//	ДобавитьПКС(СвойстваШапки, "АдресДоставки",   "АдресДоставки");
//	ДобавитьПКС(СвойстваШапки, "БанковскийСчет",  "БанковскийСчетОрганизации", , "Справочник_БанковскиеСчетаОрганизаций_Отправка");
//	ДобавитьПКС(СвойстваШапки, "Валюта",          "Валюта", , "Справочник_Валюты");
//	ДобавитьПКС(СвойстваШапки, "Дата",            "Дата");
//	ДобавитьПКС(СвойстваШапки, "Контрагент",      "Контрагент", , "Справочник_Контрагенты");
//	ДобавитьПКС(СвойстваШапки, "Менеджер",        "Ответственный", , "Справочник_Пользователи");
//	ДобавитьПКС(СвойстваШапки, "Номер",           "Номер");
//	ДобавитьПКС(СвойстваШапки, "Организация",     "Организация", , "Справочник_Организации_Отправка");
//	ДобавитьПКС(СвойстваШапки, "СуммаДокумента",  "Сумма");
//	ДобавитьПКС(СвойстваШапки, "ЦенаВключаетНДС", "СуммаВключаетНДС");
//	ДобавитьПКС(СвойстваШапки, "",                "ВалютаВзаиморасчетов", 1, "Справочник_Валюты");
//	ДобавитьПКС(СвойстваШапки, "",                "ДатаВходящегоДокумента", 1);
//	ДобавитьПКС(СвойстваШапки, "",                "Договор", 1, "Справочник_ДоговорыКонтрагентов");
//	ДобавитьПКС(СвойстваШапки, "",                "Комментарий", 1);
//	ДобавитьПКС(СвойстваШапки, "",                "КонтактноеЛицоКонтрагента", 1, "Справочник_КонтактныеЛица");
//	ДобавитьПКС(СвойстваШапки, "",                "КратностьВзаиморасчетов", 1);
//	ДобавитьПКС(СвойстваШапки, "",                "КурсВзаиморасчетов", 1);
//	ДобавитьПКС(СвойстваШапки, "",                "НалогообложениеНДСПродавца", 1, "НалогообложениеНДСПродавца");
//	ДобавитьПКС(СвойстваШапки, "",                "НомерВходящегоДокумента", 1);
//	ДобавитьПКС(СвойстваШапки, "",                "ОжидаемаяДатаПоставки", 1);
//	ДобавитьПКС(СвойстваШапки, "",                "ОжидаемаяДатаПоступления", 1);
//	ДобавитьПКС(СвойстваШапки, "",                "ОтгружатьЗаказЦеликом", 1);
//	ДобавитьПКС(СвойстваШапки, "",                "Подразделение", 1);
//	ДобавитьПКС(СвойстваШапки, "",                "РасчетыВУсловныхЕдиницах", 1);
//	ДобавитьПКС(СвойстваШапки, "",                "Склад", 1, "Справочник_Склады_Отправка");
//	ДобавитьПКС(СвойстваШапки, "",                "СпособДоставки", 1, "СпособыДоставки");

//	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "ДополнительныеРеквизиты");
//	ДобавитьПКС(СвойстваТЧ, "", "ЗначениеСвойства", 1);
//	ДобавитьПКС(СвойстваТЧ, "", "Свойство", 1, "Справочник_ДополнительныеРеквизиты");

//	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "Товары");
//	ДобавитьПКС(СвойстваТЧ, "", "SKUКонтрагента", 1, "Справочник_НоменклатураПоставщиков_Отправка");
//	ДобавитьПКС(СвойстваТЧ, "", "ЕдиницаИзмерения", 1, "Справочник_ЕдиницыИзмерения");
//	ДобавитьПКС(СвойстваТЧ, "", "Количество", 1);
//	ДобавитьПКС(СвойстваТЧ, "", "КоличествоУпаковок", 1);
//	ДобавитьПКС(СвойстваТЧ, "", "Номенклатура", 1, "Справочник_Номенклатура_Отправка");
//	ДобавитьПКС(СвойстваТЧ, "", "НомерСтрокиДокумента", 1);
//	ДобавитьПКС(СвойстваТЧ, "", "ОжидаемаяДатаПоставки", 1);
//	ДобавитьПКС(СвойстваТЧ, "", "СтавкаНДС", 1, "Перечисление_СтавкиНДС");
//	ДобавитьПКС(СвойстваТЧ, "", "Сумма", 1);
//	ДобавитьПКС(СвойстваТЧ, "", "СуммаНДС", 1);
//	ДобавитьПКС(СвойстваТЧ, "", "ТипЗапасов", 1);
//	ДобавитьПКС(СвойстваТЧ, "", "Упаковка", 1, "Справочник_Упаковки");
//	ДобавитьПКС(СвойстваТЧ, "", "Характеристика", 1, "Справочник_ХарактеристикиНоменклатуры");
//	ДобавитьПКС(СвойстваТЧ, "", "Цена", 1);
//	ДобавитьПКС(СвойстваТЧ, "", "ЦенаЗаУпаковку", 1);
//	ДобавитьПКС(СвойстваТЧ, "", "Штрихкод", 1);

//	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "Услуги");
//	ДобавитьПКС(СвойстваТЧ, "", "SKUКонтрагента", 1, "Справочник_НоменклатураПоставщиков_Отправка");
//	ДобавитьПКС(СвойстваТЧ, "", "Количество", 1);
//	ДобавитьПКС(СвойстваТЧ, "", "Номенклатура", 1, "Справочник_Номенклатура_Отправка");
//	ДобавитьПКС(СвойстваТЧ, "", "НомерСтрокиДокумента", 1);
//	ДобавитьПКС(СвойстваТЧ, "", "ОжидаемаяДатаПоставки", 1);
//	ДобавитьПКС(СвойстваТЧ, "", "Содержание", 1);
//	ДобавитьПКС(СвойстваТЧ, "", "СтавкаНДС", 1, "Перечисление_СтавкиНДС");
//	ДобавитьПКС(СвойстваТЧ, "", "Сумма", 1);
//	ДобавитьПКС(СвойстваТЧ, "", "СуммаНДС", 1);
//	ДобавитьПКС(СвойстваТЧ, "", "Цена", 1);

//	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "", "ЭтапыОплаты");
//	ДобавитьПКС(СвойстваТЧ, "", "ВариантОплаты", 1, "Перечисление_ВариантыОплатыКлиентом");
//	ДобавитьПКС(СвойстваТЧ, "", "ДатаПлатежа", 1);
//	ДобавитьПКС(СвойстваТЧ, "", "КоличествоДнейОтсрочки", 1);
//	ДобавитьПКС(СвойстваТЧ, "", "ПроцентПлатежа", 1);
//	ДобавитьПКС(СвойстваТЧ, "", "СуммаПлатежа", 1);
//	ДобавитьПКС(СвойстваТЧ, "", "ФормаОплаты", 1, "ФормыОплаты");
//	
//#КонецУдаления
//КонецПроцедуры
