
&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура vs_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();

	// Для нового объекта выполняем код инициализации формы в ПриСозданииНаСервере.
	// Для существующего - в ПриЧтенииНаСервере.
	Если Объект.Ссылка.Пустая() Тогда
#Вставка
		Если ТипЗнч(Параметры) = Тип("ДанныеФормыСтруктура")
			и Параметры.Свойство("ОписаниеКоманды")
			и Параметры.ОписаниеКоманды.Свойство("ТипПараметра")
			и Параметры.ОписаниеКоманды.ТипПараметра = Новый ОписаниеТипов("ДокументСсылка.КоммерческоеПредложениеКлиенту") Тогда
			Объект.Наименование = СтрШаблон("Согласование документа КП №%1 от %2, сделка: %3",Параметры.Основание.Номер,Формат(Параметры.Основание.Дата,"ДЛФ=ДД"),Параметры.Основание.Сделка);
			Объект.ДатаЗавершения = ТекущаяДата() + 5*24*60*60; 
			Объект.СрокИсполнения = Объект.ДатаЗавершения - 10;
			Объект.Содержание = Объект.Наименование;
			РИЗ = РегистрыСведений.ИсполнителиЗадач.СоздатьНаборЗаписей();
			РИЗ.Отбор.РольИсполнителя.Значение = Справочники.РолиИсполнителей.СогласующийКоммерческиеУсловияПродаж;
			РИЗ.Отбор.РольИсполнителя.Использование = Истина;
			РИЗ.Прочитать();
			Объект.Исполнитель = РИЗ[0].Исполнитель; 
			Объект.НаПроверке = Истина;
			Объект.СрокПроверки =  ТекущаяДата() + 6*24*60*60;
		КонецЕсли;
#КонецВставки
		ИнициализироватьФорму();
	КонецЕсли;
	// СтандартныеПодсистемы.РаботаСФайлами
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		МодульРаботаСФайлами = ОбщегоНазначения.ОбщийМодуль("РаботаСФайлами");
		ГиперссылкаФайлов = МодульРаботаСФайлами.ГиперссылкаФайлов();
		ГиперссылкаФайлов.Размещение = "КоманднаяПанель";
		МодульРаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ГиперссылкаФайлов);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РаботаСФайлами

КонецПроцедуры
