
&После("НастроитьВариантыОтчетов")
Процедура vs_НастроитьВариантыОтчетов(Настройки)
	#Область vs_МатериальныйОтчет
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.vs_МатериальныйОтчет);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	//ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СправкаРасчетИзмененияПроцентовДисконтированияРезервовПредстоящихРасходов");
	//ОписаниеВарианта.Описание = НСтр("ru= 'Анализ изменения суммы процентных расходов дисконтирования объекта учета резервов.'");
	//ОписаниеВарианта.Включен = Истина;
	#КонецОбласти
	#Область vs_АнализПлановогоИФактическогоПотребленияМатериалов
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.vs_АнализПлановогоИФактическогоПотребленияМатериалов);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	//ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СправкаРасчетИзмененияПроцентовДисконтированияРезервовПредстоящихРасходов");
	//ОписаниеВарианта.Описание = НСтр("ru= 'Анализ изменения суммы процентных расходов дисконтирования объекта учета резервов.'");
	//ОписаниеВарианта.Включен = Истина;
	#КонецОбласти
	#Область vs_НевыполненныеОбязательстваПоЗаказуНаСборку
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.vs_НевыполненныеОбязательстваПоЗаказуНаСборку);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	//ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СправкаРасчетИзмененияПроцентовДисконтированияРезервовПредстоящихРасходов");
	//ОписаниеВарианта.Описание = НСтр("ru= 'Анализ изменения суммы процентных расходов дисконтирования объекта учета резервов.'");
	//ОписаниеВарианта.Включен = Истина;
	#КонецОбласти
КонецПроцедуры
