
&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура vs_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Для нового объекта выполняем код инициализации формы в ПриСозданииНаСервере.
	// Для существующего - в ПриЧтенииНаСервере.
	Если Объект.Ссылка.Пустая() Тогда
		ИнициализироватьФорму();
	КонецЕсли;

	ТекущийПользователь = Пользователи.ТекущийПользователь();

	// СтандартныеПодсистемы.РаботаСФайлами
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		МодульРаботаСФайлами = ОбщегоНазначения.ОбщийМодуль("РаботаСФайлами");
		ПараметрыГиперссылки = МодульРаботаСФайлами.ГиперссылкаФайлов();
		ПараметрыГиперссылки.Размещение = "КоманднаяПанель";
		ПараметрыГиперссылки.Заголовок = НСтр("ru = 'Файлы задания'");
		ПараметрыГиперссылки.Владелец = "Объект.БизнесПроцесс";
		МодульРаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыГиперссылки);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РаботаСФайлами
#Вставка
	Если ТипЗнч(Объект.Предмет) = Тип("ДокументСсылка.КоммерческоеПредложениеКлиенту") Тогда
		Объект.Наименование = стрЗаменить(Объект.Наименование, "Проверить:","Проверить результат:");
        Объект.Наименование = стрЗаменить(Объект.Наименование, "Коммерческое предложение клиенту","КП");
	КонецЕсли;
#КонецВставки

КонецПроцедуры
