#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//&После("ПередЗаписью")
//Процедура vs_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
//	Если ЗначениеЗаполнено(vs_СтатьяРасходов) Тогда
//		Массив = Товары.ВыгрузитьКолонку("СтатьяРасходов");
//		НаибольшийИндекс = Массив.ВГраница();
//		Если Не НаибольшийИндекс < 0 Тогда
//			Для Эл = 0 По НаибольшийИндекс Цикл
//				Массив.Установить(Эл, vs_СтатьяРасходов);	
//			КонецЦикла;
//			Товары.ЗагрузитьКолонку(Массив, "СтатьяРасходов");
//		КонецЕсли;
//	КонецЕсли;
//КонецПроцедуры

&После("ОбработкаПроверкиЗаполнения")
Процедура vs_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	МассивНепроверяемыхРеквизитов = Новый Массив;
	Если ЭтотОбъект.vs_ЭтоДоизготовление тогда
		МассивНепроверяемыхРеквизитов.Добавить("vs_СтатьяРасходов");
		МассивНепроверяемыхРеквизитов.Добавить("Товары");
		
		ПроверяемыеРеквизиты.Добавить("vs_Статус"); 
		ПроверяемыеРеквизиты.Добавить("vs_АктИзготовления");
		
		Ошибки = Неопределено;
		Для Каждого Стр из vs_Доизготовление Цикл
			Если Стр.Отказ > Стр.Количество 
				и Стр.Отказ - Стр.Количество > Стр.ТребуетсяДоизготовить Тогда
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, ЭтотОбъект, СтрШаблон("Отказ > Доизготовить и остаток к доизготовлению! Номенлатура %1", Стр.Номенклатура),,Стр.НомерСтроки); 
			ИначеЕсли (Стр.Отказ < Стр.Количество 
				или Стр.Отказ - Стр.Количество < Стр.ТребуетсяДоизготовить)
				и Справочники.ВидыНоменклатуры.НастройкиИспользованияСерий(Стр.Номенклатура.ВидНоменклатуры).ИспользоватьСерии и не значениеЗаполнено(Стр.Серия) Тогда
				ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, ЭтотОбъект, СтрШаблон("Не заполнена серия! Номенлатура %1", Стр.Номенклатура),,Стр.НомерСтроки); 
			КонецЕсли;
		КонецЦикла;
		Если Не Ошибки = Неопределено Тогда
			Модифицированность = истина;
			ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
			//Сообщить(Отказ);
		КонецЕсли;
	ИначеЕсли 	ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию 
			или ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВЭксплуатацию Тогда
		Если ЗначениеЗаполнено(vs_СтатьяРасходов) Тогда
			Массив = Товары.ВыгрузитьКолонку("СтатьяРасходов");
			НаибольшийИндекс = Массив.ВГраница();
			Если Не НаибольшийИндекс < 0 Тогда
				Для Эл = 0 По НаибольшийИндекс Цикл
					Массив.Установить(Эл, vs_СтатьяРасходов);	
				КонецЦикла;
				Товары.ЗагрузитьКолонку(Массив, "СтатьяРасходов");
			КонецЕсли;
		КонецЕсли;
	Иначе
		МассивНепроверяемыхРеквизитов.Добавить("vs_СтатьяРасходов");
	КонецЕсли;
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
КонецПроцедуры


&Перед("ПередЗаписью")
Процедура vs_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если vs_ЭтоДоизготовление 
		и РежимЗаписи = РежимЗаписиДокумента.Проведение 
		и Не vs_Статус = Перечисления.СтатусыСборокТоваров.СобраноРазобрано Тогда
		Ошибки = Неопределено;
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "vs_Статус", "Проведение доизготовлления возможно только в статусе ""Выполнено""");
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
		Возврат;		
	КонецЕсли;
	
	//Если ЭтотОбъект.vs_ЭтоДоизготовление тогда
	//	Товары.Очистить();
	//	Серии.Очистить();
	//	ИТБК_ЭтоДоизготовление	 = vs_ЭтоДоизготовление;
	//	ИТБК_АктИзготовления	 = vs_АктИзготовления;
	//	ИТБК_СтатьяРасходов		 = vs_СтатьяРасходов;
	//	ИТБК_Статус				 = vs_Статус;
	//	ИТБК_Доизготовление.Загрузить(vs_Доизготовление.Выгрузить());
	//	для Каждого стр из vs_Доизготовление Цикл
	//		
	//		Если стр.Количество > 0  тогда
	//			
	//			Если стр.Номенклатура.видноменклатуры.ИспользоватьСерии и стр.Серия.Пустая() тогда
	//				//ОбщегоНазначения.СообщитьПользователю("Не заполнена серия " + стр.Номенклатура,ЭтотОбъект,"","",Отказ); // begin fix Designer09.09.2021 4:04:42
	//				ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Не заполнена серия %1", стр.Номенклатура), ЭтотОбъект,"","",Отказ);// end fix Designer09.09.2021 4:04:53
	//			КонецЕсли;
	//			
	//			стрТовары = Товары.Добавить();
	//			стрТовары.Номенклатура = стр.Номенклатура;
	//			стрТовары.Характеристика = стр.Характеристика;     						// fix Designer 14.02.2023 16:45:13
	//			стрТовары.КоличествоУпаковок = стр.Количество;
	//			стрТовары.Количество = стр.Количество;
	//			стрТовары.СтатьяРасходов = стр.СтатьяРасходов;
	//			стрТовары.АналитикаРасходов = стр.АналитикаРасходов;
	//			стрТовары.Назначение = стр.Назначение;     								// fix Designer 14.02.2023 16:45:13
	//			
	//			Если ЗначениеЗаполнено(стр.Серия) тогда
	//				стрТовары.СтатусУказанияСерий  				= 4;
	//				стрТовары.СтатусУказанияСерийОтправитель 	= 4; 					// fix Designer 14.02.2023 16:45:13
	//				НовСтр                      				= ЭтотОбъект.Серии.Добавить();
	//				НовСтр.Номенклатура        					= стр.Номенклатура;
	//				НовСтр.Характеристика 						= стр.Характеристика;  	// fix Designer 14.02.2023 16:45:13
	//				НовСтр.Серия                				= стр.Серия;
	//				НовСтр.Назначение 							= стр.Назначение;     	// fix Designer 14.02.2023 16:45:13
	//				НовСтр.Количество           				= стр.Количество;
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;
	
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура vs_ОбработкаПроведения(Отказ, РежимПроведения)
	Если Не vs_ЭтоДоизготовление Тогда 
		Возврат;
	ИначеЕсли Не  Движения.vs_Доизготовление.Количество() ТОгда
		Ошибки = Неопределено;
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, ЭтотОбъект, СтрШаблон("Не заполнена ТЧ доизготовления %1",ЭтотОбъект));
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
		Возврат;
	КонецЕсли; // fix Designer09.09.2021 4:00:58
	
	Возврат;
	//для Каждого Движение из Движения цикл
	//	Движение.Очистить();
	//КонецЦикла;
	//// begin Suetin 2021/09/05
	////для Каждого  стр из ИТБК_Доизготовление цикл
	////	Если  стр.Количество > 0 тогда
	////		стрДвижения = набор.добавитьРасход();
	////		стрДвижения.Период = Дата;
	////		стрДвижения.АктИзготовления = ИТБК_АктИзготовления;
	////		стрДвижения.Номенклатура = стр.Номенклатура;
	////		стрДвижения.Доизготовить = стр.Количество;
	////	КонецЕсли;
	////	Если  стр.Отказ > 0 тогда
	////		стрДвижения = набор.добавитьПриход();
	////		стрДвижения.Период = Дата;
	////		стрДвижения.АктИзготовления = ИТБК_АктИзготовления;
	////		стрДвижения.Номенклатура = стр.Номенклатура;
	////		стрДвижения.Доизготовить = - стр.Отказ;
	////	КонецЕсли;
	////КонецЦикла;
	//ТекстЗапроса = 
	//"ВЫБРАТЬ
	//|	&vs_АктИзготовления КАК АктИзготовления,
	//|	ДДоизготовление.Номенклатура КАК Номенклатура,
	//|	ДДоизготовление.ТребуетсяДоизготовить КАК ТребуетсяДоизготовить,
	//|	ДДоизготовление.Количество КАК Количество,
	//|	ДДоизготовление.Отказ КАК Отказ
	//|ПОМЕСТИТЬ ДДокумента
	//|ИЗ
	//|	&ДДоизготовление КАК ДДоизготовление
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ДДокумента.АктИзготовления КАК АктИзготовления,
	//|	ДДокумента.Номенклатура КАК Номенклатура,
	//|	СУММА(ВЫБОР
	//|			КОГДА ЕСТЬNULL(vs_Доизготовление.ДоизготовитьОстаток, 0) > 0
	//|				ТОГДА ЕСТЬNULL(vs_Доизготовление.ДоизготовитьОстаток, 0)
	//|			ИНАЧЕ 0
	//|		КОНЕЦ) КАК ДоизготовитьОстаток,
	//|	СУММА(ДДокумента.ТребуетсяДоизготовить) КАК ТребуетсяДоизготовить,
	//|	СУММА(ДДокумента.Количество) КАК Количество,
	//|	СУММА(ДДокумента.Отказ) КАК Отказ
	//|ИЗ
	//|	ДДокумента КАК ДДокумента
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.vs_Доизготовление.Остатки(
	//|				&ДатаКон,
	//|				(АктИзготовления, Номенклатура) В
	//|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|						Т.АктИзготовления,
	//|						Т.Номенклатура
	//|					ИЗ
	//|						ДДокумента КАК Т)) КАК vs_Доизготовление
	//|		ПО ДДокумента.АктИзготовления = vs_Доизготовление.АктИзготовления
	//|			И ДДокумента.Номенклатура = vs_Доизготовление.Номенклатура
	//|
	//|СГРУППИРОВАТЬ ПО                                          
	//
	//|	ДДокумента.АктИзготовления,
	//|	ДДокумента.Номенклатура";
	//Запрос = Новый Запрос(ТекстЗапроса);
	//Запрос.УстановитьПараметр("ДатаКон"				, Новый Граница(Новый МоментВремени(Дата, Ссылка), ВидГраницы.Исключая));
	////Запрос.УстановитьПараметр("ДДоизготовление"	, ИТБК_Доизготовление.Выгрузить());
	//Т = vs_Доизготовление.Выгрузить();
	////Т.Свернуть("Номенклатура,ТребуетсяДоизготовить,Отказ","Количество");
	//Т.Свернуть("Номенклатура","Количество,ТребуетсяДоизготовить,Отказ");
	//Запрос.УстановитьПараметр("ДДоизготовление"		,Т);  // fix Suetin 4/10/2023 3:50:03 PM
	//Запрос.УстановитьПараметр("vs_АктИзготовления", vs_АктИзготовления);
	////Результат = Запрос.Выполнить();
	//Р=Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	//Результат=Р[1];
	//Ошибки = Неопределено;
	//Если Результат.Пустой() Тогда
	//	ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, ЭтотОбъект, СтрШаблон("Остатка нет для доизготовления %1",vs_АктИзготовления));
	//	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	//	Возврат;
	//КонецЕсли;
	//Набор = Движения.vs_Доизготовление; 
	//Набор1 = Движения.ИТБК_Доизготовление;
	//Выборка = Результат.Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	Если Выборка.Отказ>Выборка.ДоизготовитьОстаток Тогда
	//		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Отказ %1 > Остаток (Доизготовить) %2",Выборка.Отказ,Выборка.ДоизготовитьОстаток));
	//	КонецЕсли;
	//	ВыборкаОтказ = Мин(Выборка.Отказ, Выборка.ДоизготовитьОстаток);
	//	Доизготовить = Мин(Выборка.Количество,Выборка.ДоизготовитьОстаток-ВыборкаОтказ);
	//	Доизготовить = ?(Доизготовить<0,0,Доизготовить);
	//	
	//	Если Не Доизготовить > 0 и Не ВыборкаОтказ > 0 и Не Выборка.Количество > 0 Тогда
	//		Структ = Новый Структура("Номенклатура", Выборка.Номенклатура);
	//		НайденныеСтр = vs_Доизготовление.НайтиСтроки(Структ);
	//		
	//		//ОбщегоНазначения.СообщитьПользователю(НайденныеСтр.Количество());
	//		//ОбщегоНазначения.СообщитьПользователю(НайденныеСтр[0].НомерСтроки);
	//		//ОбщегоНазначения.СообщитьПользователю(НайденныеСтр[0].Номенклатура);
	//		
	//		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки,
	//			"Объект.vs_Доизготовление[%1].Номенклатура", 
	//			//СтрШаблон("Номенклатура %1 - Доизготовить %2, Отказ %3, Количество %4, Неправильно!", НайденныеСтр[0].Номенклатура, Доизготовить, ВыборкаОтказ, Выборка.Количество),
	//			СтрШаблон("Номенклатура %1 - Доизготовить %2, Отказ %3, Количество %4, Неправильно!", НайденныеСтр[0].Номенклатура, Доизготовить, ВыборкаОтказ, Выборка.Количество),
	//			Неопределено,НайденныеСтр[0].НомерСтроки-1);
	//			Продолжить;
	//	КонецЕсли;
	//	
	//	Если Доизготовить > 0 тогда
	//		стрДвижения 				= Набор.ДобавитьРасход();
	//		стрДвижения.Период 			= Дата;
	//		стрДвижения.АктИзготовления = Выборка.АктИзготовления;
	//		стрДвижения.Номенклатура 	= Выборка.Номенклатура;
	//		стрДвижения.Доизготовить 	= Доизготовить; 
	//		
	//		стрДвижения 				= Набор1.ДобавитьРасход();
	//		стрДвижения.Период 			= Дата;
	//		стрДвижения.АктИзготовления = Выборка.АктИзготовления;
	//		стрДвижения.Номенклатура 	= Выборка.Номенклатура;
	//		стрДвижения.Доизготовить 	= Доизготовить;
	//	КонецЕсли;
	//	Если ВыборкаОтказ > 0 тогда
	//		стрДвижения 				= Набор.ДобавитьПриход();
	//		стрДвижения.Период 			= Дата;
	//		стрДвижения.АктИзготовления = Выборка.АктИзготовления;
	//		стрДвижения.Номенклатура 	= Выборка.Номенклатура;
	//		стрДвижения.Доизготовить 	= - ВыборкаОтказ; 
	//		
	//		стрДвижения 				= Набор1.ДобавитьПриход();
	//		стрДвижения.Период 			= Дата;
	//		стрДвижения.АктИзготовления = Выборка.АктИзготовления;
	//		стрДвижения.Номенклатура 	= Выборка.Номенклатура;
	//		стрДвижения.Доизготовить 	= - ВыборкаОтказ;
	//	КонецЕсли;
	//	Если Не Доизготовить > 0 и Не ВыборкаОтказ > 0 и Выборка.Количество > 0 Тогда
	//		стрДвижения 				= Набор.ДобавитьПриход();
	//		стрДвижения.Период 			= Дата;
	//		стрДвижения.АктИзготовления = Выборка.АктИзготовления;
	//		стрДвижения.Номенклатура 	= Выборка.Номенклатура;
	//		стрДвижения.Доизготовить 	= Выборка.Количество;
	//		
	//		стрДвижения 				= Набор.ДобавитьРасход();
	//		стрДвижения.Период 			= Дата;
	//		стрДвижения.АктИзготовления = Выборка.АктИзготовления;
	//		стрДвижения.Номенклатура 	= Выборка.Номенклатура;
	//		стрДвижения.Доизготовить 	= Выборка.Количество; 
	//		
	//		
	//		стрДвижения 				= Набор1.ДобавитьПриход();
	//		стрДвижения.Период 			= Дата;
	//		стрДвижения.АктИзготовления = Выборка.АктИзготовления;
	//		стрДвижения.Номенклатура 	= Выборка.Номенклатура;
	//		стрДвижения.Доизготовить 	= Выборка.Количество;
	//		
	//		стрДвижения 				= Набор1.ДобавитьРасход();
	//		стрДвижения.Период 			= Дата;
	//		стрДвижения.АктИзготовления = Выборка.АктИзготовления;
	//		стрДвижения.Номенклатура 	= Выборка.Номенклатура;
	//		стрДвижения.Доизготовить 	= Выборка.Количество;
	//	КонецЕсли;
	//		
	//КонецЦикла;
	//
	//Если Не Ошибки = Неопределено 
	//	и Ошибки.СписокОшибок.Количество() = Т.Количество() Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	//	Возврат;
	//КонецЕсли;
	//// end Suetin 2021/09/05
	//Набор.Записывать = Истина;
	//Набор1.Записывать = Истина;
	//Движения.Записать();
	
КонецПроцедуры

//&После("ОбработкаПроверкиЗаполнения")
//Процедура ИТБК_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
//	
//	
//	МассивНепроверяемыхРеквизитов = новый Массив;
//	Если ЭтотОбъект.ИТБК_ЭтоДоизготовление тогда
//		МассивНепроверяемыхРеквизитов.Добавить("Товары")
//	КонецЕсли;
//	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
//	
//КонецПроцедуры

#КонецЕсли
