
&После("ФормаУзлаПриСозданииНаСервере")
Процедура vs_ФормаУзлаПриСозданииНаСервере(Форма, Отказ)
	Если Форма.ИмяФормы = "ПланОбмена.СинхронизацияДанныхЧерезУниверсальныйФормат.Форма.ФормаСинхронизации" Тогда
		//Реквизиты
		МассивДобавляемыхРеквизитов = Новый Массив;
		Реквизит = Новый РеквизитФормы("vs_ПравилоОтбораСтатьейРасходов",Новый ОписаниеТипов("Строка"));
		МассивДобавляемыхРеквизитов.Добавить(Реквизит);
		Реквизит = Новый РеквизитФормы("vs_РежимВыгрузкиСтатьейРасходов",Новый ОписаниеТипов("Число"));
		МассивДобавляемыхРеквизитов.Добавить(Реквизит);
		// begin fix Designer 2025.12.09
		Реквизит = Новый РеквизитФормы("vs_ПравилоОтбораПоВидамНоменклатуры",Новый ОписаниеТипов("Строка"));
		МассивДобавляемыхРеквизитов.Добавить(Реквизит);
		Реквизит = Новый РеквизитФормы("vs_РежимВыгрузкиПоВидамНоменклатуры",Новый ОписаниеТипов("Число"));
		МассивДобавляемыхРеквизитов.Добавить(Реквизит);
		// end fix Designer 2025.12.09
		Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
		
		Если Форма.Объект.vs_ИспользоватьОтборПоСтатьямРасходов Тогда
			Форма.vs_ПравилоОтбораСтатьейРасходов = "ОтборПоСтатьямРасходов";
			Форма.vs_РежимВыгрузкиСтатьейРасходов = 1;
		Иначе
			Форма.vs_ПравилоОтбораСтатьейРасходов = "БезОтбораПоСтатьямРасходов";
		КонецЕсли;
		// begin fix Designer 2025.12.09
		Если Форма.Объект.vs_ИспользоватьОтборПоВидамНоменклатурыДляСборкиТоваров Тогда
			Форма.vs_ПравилоОтбораПоВидамНоменклатуры = "ОтборПоВидамНоменклатуры";
			Форма.vs_РежимВыгрузкиПоВидамНоменклатуры = 1;
		Иначе
			Форма.vs_ПравилоОтбораПоВидамНоменклатуры = "БезОтбораПоВидамНоменклатуры";
		КонецЕсли;
		//Команды
		vs_Команда = Форма.Команды.Добавить("vs_ОткрытьСписокВыбранныхСтатьейРасходов");
		vs_Команда.Действие				= "vs_ОткрытьСписокВыбранныхСтатьейРасходов";
		vs_Команда.ИзменяетСохраняемыеДанные = Истина;

		vs_Команда = Форма.Команды.Добавить("vs_ОткрытьСписокВыбранныхВидовНоменклатуры");
		vs_Команда.Действие				= "vs_ОткрытьСписокВыбранныхВидовНоменклатуры";
		vs_Команда.ИзменяетСохраняемыеДанные = Истина;

		// end fix Designer 2025.12.09
		//Элементы
		ЭлементГр = Форма.Элементы.Вставить("vs_ГруппаСтраницыОтборПоСтатьямРасходов", Тип("ГруппаФормы"), Форма.Элементы.ГруппировкаОтборов);
		ЭлементГр.Вид 					= ВидГруппыФормы.Страницы;
		ЭлементГр.ОтображениеСтраниц	= ОтображениеСтраницФормы.Нет;
		
		ЭлементГр1 = Форма.Элементы.Вставить("vs_ГруппаСтраницаОтборПоСтатьямРасходов", Тип("ГруппаФормы"), ЭлементГр);
		ЭлементГр1.Вид 					= ВидГруппыФормы.Страница;
		ЭлементГр1.Группировка			= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная	;
		ЭлементГр1.ОтображатьЗаголовок 	= Ложь;
		
		ЭлементГр2 = Форма.Элементы.Вставить("vs_ГруппаВыборРежимаВыгрузкиСтатьейРасходов", Тип("ГруппаФормы"), ЭлементГр1);
		ЭлементГр2.Вид 					= ВидГруппыФормы.ОбычнаяГруппа;
		ЭлементГр2.Отображение 			= ОтображениеОбычнойГруппы.Нет;
		ЭлементГр2.ОтображатьЗаголовок 	= Ложь;  
		ЭлементГр2.Группировка			= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		
		НовыйЭлемент = Форма.Элементы.Вставить("vs_ПереключательРежимаВыгрузкиСтатьейРасходовБезОтбора",Тип("ПолеФормы"), ЭлементГр2);
		НовыйЭлемент.ПутьКДанным 		= "vs_РежимВыгрузкиСтатьейРасходов";
		НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеПереключателя;
		НовыйЭлемент.СписокВыбора.Добавить(0, "По всем статьям расходов");
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "vs_ПереключательРежимаВыгрузкиПоСтатьямРасходовБезОтбораПриИзменении");
		
		НовыйЭлемент = Форма.Элементы.Вставить("vs_ПереключательРежимаВыгрузкиСтатьейРасходовСОтбором",Тип("ПолеФормы"), ЭлементГр2);
		НовыйЭлемент.ПутьКДанным 		= "vs_РежимВыгрузкиСтатьейРасходов";
		НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеПереключателя;
		НовыйЭлемент.СписокВыбора.Добавить(1, "С отбором по статьям расходов");
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "vs_ПереключательРежимаВыгрузкиПоСтатьямРасходовСОтборомПриИзменении");
		
		НовыйЭлемент = Форма.Элементы.Вставить("vs_ОткрытьСписокВыбранныхСтатьейРасходов", Тип("КнопкаФормы"), ЭлементГр1);
		НовыйЭлемент.Вид 				= ВидКнопкиФормы.Гиперссылка;
		НовыйЭлемент.ИмяКоманды			= "vs_ОткрытьСписокВыбранныхСтатьейРасходов";
		НовыйЭлемент.Заголовок			= НСтр("ru = 'Открыть список статьей расходов'");
		// begin fix Designer 2025.12.09
		ЭлементГр = Форма.Элементы.Вставить("vs_ГруппаСтраницыОтборПоВидамНоменклатуры", Тип("ГруппаФормы"), Форма.Элементы.ГруппировкаОтборов);
		ЭлементГр.Вид 					= ВидГруппыФормы.Страницы;
		ЭлементГр.ОтображениеСтраниц	= ОтображениеСтраницФормы.Нет;
		
		ЭлементГр1 = Форма.Элементы.Вставить("vs_ГруппаСтраницаОтборПоВидамНоменклатуры", Тип("ГруппаФормы"), ЭлементГр);
		ЭлементГр1.Вид 					= ВидГруппыФормы.Страница;
		ЭлементГр1.Группировка			= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная	;
		ЭлементГр1.ОтображатьЗаголовок 	= Ложь;
		
		ЭлементГр2 = Форма.Элементы.Вставить("vs_ГруппаВыборРежимаВыгрузкиПоВидамНоменклатуры", Тип("ГруппаФормы"), ЭлементГр1);
		ЭлементГр2.Вид 					= ВидГруппыФормы.ОбычнаяГруппа;
		ЭлементГр2.Отображение 			= ОтображениеОбычнойГруппы.Нет;
		ЭлементГр2.ОтображатьЗаголовок 	= Ложь;  
		ЭлементГр2.Группировка			= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		
		НовыйЭлемент = Форма.Элементы.Вставить("vs_ПереключательРежимаВыгрузкиПоВидамНоменклатурыБезОтбора",Тип("ПолеФормы"), ЭлементГр2);
		НовыйЭлемент.ПутьКДанным 		= "vs_РежимВыгрузкиПоВидамНоменклатуры";
		НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеПереключателя;
		НовыйЭлемент.СписокВыбора.Добавить(0, "По всем видам номенклатуры");
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "vs_ПереключательРежимаВыгрузкиПоВидамНоменклатурыБезОтбораПриИзменении");
		
		НовыйЭлемент = Форма.Элементы.Вставить("vs_ПереключательРежимаВыгрузкиПоВидамНоменклатурыСОтбором",Тип("ПолеФормы"), ЭлементГр2);
		НовыйЭлемент.ПутьКДанным 		= "vs_РежимВыгрузкиПоВидамНоменклатуры";
		НовыйЭлемент.Вид 				= ВидПоляФормы.ПолеПереключателя;
		НовыйЭлемент.СписокВыбора.Добавить(1, "С отбором по видам номенклатуры");
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "vs_ПереключательРежимаВыгрузкиПоВидамНоменклатурыСОтборомПриИзменении");
		
		НовыйЭлемент = Форма.Элементы.Вставить("vs_ОткрытьСписокВыбранныхВидовНоменклатуры", Тип("КнопкаФормы"), ЭлементГр1);
		НовыйЭлемент.Вид 				= ВидКнопкиФормы.Гиперссылка;
		НовыйЭлемент.ИмяКоманды			= "vs_ОткрытьСписокВыбранныхВидовНоменклатуры";
		НовыйЭлемент.Заголовок			= НСтр("ru = 'Открыть список видов номенклатуры'");
		// end fix Designer 2025.12.09
	КонецЕсли;
КонецПроцедуры

&ИзменениеИКонтроль("ЗафиксироватьЗавершениеОбмена")
Процедура vs_ЗафиксироватьЗавершениеОбмена(СтруктураНастроекОбмена)
	
	// Статус "Неопределено" в конце обмена свидетельствует об успешном выполнении обмена.
	Если СтруктураНастроекОбмена.РезультатВыполненияОбмена = Неопределено Тогда
		СтруктураНастроекОбмена.РезультатВыполненияОбмена = Перечисления.РезультатыВыполненияОбмена.Выполнено;
	КонецЕсли;
	
	// Формируем итоговое сообщение для протокола.
	Если СтруктураНастроекОбмена.ЭтоОбменВРИБ Тогда
		СтрокаСообщения = НСтр("ru = '%1, %2'", ОбщегоНазначения.КодОсновногоЯзыка());
		СтрокаСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения,
							СтруктураНастроекОбмена.РезультатВыполненияОбмена,
							СтруктураНастроекОбмена.ДействиеПриОбмене);
	Иначе
		СтрокаСообщения = НСтр("ru = '%1, %2; Объектов обработано: %3'", ОбщегоНазначения.КодОсновногоЯзыка());
		СтрокаСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения,
							СтруктураНастроекОбмена.РезультатВыполненияОбмена,
							СтруктураНастроекОбмена.ДействиеПриОбмене,
							СтруктураНастроекОбмена.КоличествоОбъектовОбработано);
	КонецЕсли;
	
	СтруктураНастроекОбмена.ДатаОкончания = ТекущаяДатаСеанса();
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Фиксируем состояние обмена в РС.
	ЗафиксироватьЗавершениеОбменаВРегистреСведений(СтруктураНастроекОбмена);
	
	// Если обмен данными был успешно выполнен.
	Если РезультатВыполненияОбменаВыполнено(СтруктураНастроекОбмена.РезультатВыполненияОбмена) Тогда
		
		ЗафиксироватьУспешныйОбменДаннымиВРегистреСведений(СтруктураНастроекОбмена);
		
		РегистрыСведений.ОбщиеНастройкиУзловИнформационныхБаз.СнятьПризнакОтправкиДанных(СтруктураНастроекОбмена.УзелИнформационнойБазы);
		
#Вставка
		vs_СнятьФлагВыгрузкиПоНомеру = Ложь;
		Если СтруктураНастроекОбмена.УзелИнформационнойБазы.Код = "789de04a-6587-4688-91ec-407da6e6ba18" 
			и СтруктураНастроекОбмена.Свойство("vs_СнятьФлагВыгрузкиПоНомеру", vs_СнятьФлагВыгрузкиПоНомеру) 
			и vs_СнятьФлагВыгрузкиПоНомеру Тогда
			ПланыОбмена.УдалитьРегистрациюИзменений(СтруктураНастроекОбмена.УзелИнформационнойБазы, СтруктураНастроекОбмена.vs_НомерСообщения);
			Комментарий = СтрШаблон("Удаление регистрации изменений для узла %1 с кодом %2 и номером сообщения %3", 
				СтруктураНастроекОбмена.УзелИнформационнойБазы, 
				СтруктураНастроекОбмена.УзелИнформационнойБазы.Код, 
				СтруктураНастроекОбмена.vs_НомерСообщения);
			ЗаписьЖурналаРегистрацииОбменаДанными(Комментарий, СтруктураНастроекОбмена);
		Иначе
			Комментарий = СтрШаблон("Удаления регистрации изменений для узла %1 с кодом %2 не произошло", 
				СтруктураНастроекОбмена.УзелИнформационнойБазы, 
				СтруктураНастроекОбмена.УзелИнформационнойБазы.Код);
			ЗаписьЖурналаРегистрацииОбменаДанными(Комментарий, СтруктураНастроекОбмена);
		КонецЕсли;
#КонецВставки
	КонецЕсли;
	
	ЗаписьЖурналаРегистрацииОбменаДанными(СтрокаСообщения, СтруктураНастроекОбмена);
	
КонецПроцедуры
