
&НаСервере
&ИзменениеИКонтроль("ВидНоменклатурыПриИзмененииСервер")
Процедура vs_ВидНоменклатурыПриИзмененииСервер()
	
	ПараметрыШаблона = Неопределено;
	ВладелецСерий = Справочники.ВидыНоменклатуры.ПустаяСсылка();
	
#Удаление
	Если ЗначениеЗаполнено(ВидНоменклатуры) Тогда
		
		ПараметрыШаблона = Новый ФиксированнаяСтруктура(
			Справочники.ВидыНоменклатуры.НастройкиИспользованияСерий(ВидНоменклатуры)
		);
		
		ВладелецСерий = ПараметрыШаблона.ВладелецСерий;
		
		Для Каждого Описание Из ПараметрыШаблона.ОписанияИспользованияРеквизитовСерии Цикл
			
			Если ЗначениеЗаполнено(Описание.Формат)
				И Элементы.Найти(Описание.ИмяРеквизита) <> Неопределено Тогда
				Элементы[Описание.ИмяРеквизита].Формат = Описание.Формат;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
		"ВидНоменклатуры",
		ВладелецСерий,
		ВидСравненияКомпоновкиДанных.Равно,,
		Истина
	);
	
#КонецУдаления
#Вставка
	Если ЗначениеЗаполнено(Параметры.Номенклатура) Тогда
		ПараметрыШаблона = Новый ФиксированнаяСтруктура(
		Справочники.ВидыНоменклатуры.НастройкиИспользованияСерий(Параметры.Номенклатура.ВидНоменклатуры));

		ВладелецСерий = ПараметрыШаблона.ВладелецСерий;
	ИначеЕсли ЗначениеЗаполнено(ВидНоменклатуры) Тогда
		ПараметрыШаблона = Новый ФиксированнаяСтруктура(
		Справочники.ВидыНоменклатуры.НастройкиИспользованияСерий(ВидНоменклатуры));

		ВладелецСерий = ПараметрыШаблона.ВладелецСерий;
	КонецЕсли;

	Если Не Истина или ПараметрыШаблона.ВидНоменклатуры = ПараметрыШаблона.ВладелецСерий Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
		"ВидНоменклатуры",
		ВладелецСерий,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		Истина);
	ИначеЕсли Истина и Не ПараметрыШаблона.ВидНоменклатуры = ПараметрыШаблона.ВладелецСерий Тогда
		СписокВидовНоменклатуры = Новый Массив();
		СписокВидовНоменклатуры.Добавить(ПараметрыШаблона.ВидНоменклатуры);
		СписокВидовНоменклатуры.Добавить(ПараметрыШаблона.ВладелецСерий);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
		"ВидНоменклатуры",
		СписокВидовНоменклатуры,
		ВидСравненияКомпоновкиДанных.ВСписке,
		,
		Истина);
	КонецЕсли;
#КонецВставки
	НастроитьПоШаблону();
	
КонецПроцедуры

&НаСервере
Процедура vs_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	А = 0;
	//П = Параметры.Добавить();
КонецПроцедуры
