
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если НЕ ВнеоборотныеАктивы.ИспользуетсяУправлениеВНА_2_4() Тогда
		Элементы.СправкаРасчетАмортизации.Заголовок = НСтр("ru = 'Амортизация'");
	ИначеЕсли НЕ ПолучитьФункциональнуюОпцию("ОтображатьВнеоборотныеАктивы2_2") Тогда
		Элементы.СправкаРасчетАмортизацииОС24.Заголовок = НСтр("ru = 'Амортизация ОС'");
		Элементы.СправкаРасчетАмортизацииНМА24.Заголовок = НСтр("ru = 'Амортизация НМА'");
	КонецЕсли; 
	
	СтатусПримененияМетодовУчетаОН =
		НалогНаПрибыльБухгалтерскийУчет.ПолучитьСтатусПримененияМетодовУчетаОтложенногоНалогаПоВсемОрганизациям();
	
	Элементы.ГруппаРасчетПостоянныхИВременныхРазниц.Видимость                                      =
		СтатусПримененияМетодовУчетаОН.ЗатратныйМетод;
	Элементы.ГруппаСправкаРасчетПересчетСтоимостиОтложенныхНалоговыхАктивовИОбязательств.Видимость =
		СтатусПримененияМетодовУчетаОН.ЗатратныйМетод;
	Элементы.ГруппаСправкаРасчетОтложенногоНалога.Видимость                                        =
		СтатусПримененияМетодовУчетаОН.БалансовыйМетод;
	Элементы.ГруппаСправкаРасчетЭффектаИзмененияСтавокНалогаНаПрибыль.Видимость                    =
		СтатусПримененияМетодовУчетаОН.БалансовыйМетод;
	Элементы.ГруппаСправкаРасчетРасходаПоНалогуНаПрибыль.Видимость                                 =
		СтатусПримененияМетодовУчетаОН.БалансовыйМетод;
	Элементы.ГруппаСправкаРасчетНалогаНаПрибыльОтОперацийРезультатКоторыхНеВключаетсяВПрибыль.Видимость =
		СтатусПримененияМетодовУчетаОН.БалансовыйМетод;
	
	Если Не ПолучитьФункциональнуюОпцию("УчетДисконтированнойКредиторскойЗадолженностиПоставщикам") Тогда
		Элементы.ГруппаДисконтированиеКредиторскойЗадолженности.Видимость = Ложь;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ФормироватьРезервыПредстоящихРасходов") Тогда
		Элементы.ГруппаДисконтированиеРезервовПредстоящихРасходов.Видимость = Ложь;
	КонецЕсли;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("РазмещениеКомандСППР", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Элементы.ФормаКоманднаяПанель));
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка, ДопПараметры);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СправкаРасчетАмортизации(Команда)
	ОткрытьФорму("Отчет.СправкаРасчетАмортизации.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетАмортизацииОС24(Команда)
	ОткрытьФорму("Отчет.СправкаРасчетАмортизацииОС2_4.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетАмортизацииНМА24(Команда)
	ОткрытьФорму("Отчет.СправкаРасчетАмортизацииНМА2_4.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетАмортизационнойПремии(Команда)
	ОткрытьФорму("Отчет.СправкаРасчетАмортизационнойПремии.Форма.ФормаОтчета");
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетДолиНалоговойБазы(Команда)
	ОткрытьФорму("Отчет.СправкаРасчетДолиНалоговойБазы.Форма.ФормаОтчета");
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетЗемельногоНалога(Команда)
	ОткрытьФорму("Отчет.СправкаРасчетЗемельногоНалога.Форма.ФормаОтчета");
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетНалогаНаИмущество(Команда)
	ОткрытьФорму("Отчет.СправкаРасчетНалогаНаИмущество.Форма.ФормаОтчета");
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетНалогаНаПрибыль(Команда)
	ОткрытьФорму("Отчет.СправкаРасчетНалогаНаПрибыль.Форма.ФормаОтчета");
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетОтложенногоНалога(Команда)
	ОткрытьФорму("Отчет.СправкаРасчетОтложенногоНалога.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетРасходаПоНалогуНаПрибыль(Команда)
	ОткрытьФорму("Отчет.СправкаРасчетРасходаПоНалогуНаПрибыль.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура ВедомостьПоДисконтированнойЗадолженности(Команда)
	ОткрытьФорму("Отчет.ВедомостьПоДисконтированнойЗадолженности.ФормаОбъекта")
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетНачисленияПроцентныхРасходовДисконтирования(Команда)
	ОткрытьФорму("Отчет.СправкаРасчетНачисленияПроцентныхРасходовДисконтирования.ФормаОбъекта")
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетСписанияПроцентныхРасходовДисконтирования(Команда)
	ПараметрыФормы = Новый Структура("КлючВарианта");
	ПараметрыФормы.КлючВарианта = "СправкаРасчетСписанияПроцентныхРасходовДисконтирования";
	ОткрытьФорму("Отчет.СправкаРасчетСписанияПроцентныхРасходовДисконтирования.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетДисконтированиеРезервовПредстоящихРасходов(Команда)
	ПараметрыФормы = Новый Структура("КлючВарианта");
	ПараметрыФормы.КлючВарианта = "СправкаРасчетДисконтированиеРезервовПредстоящихРасходов";
	ОткрытьФорму("Отчет.СправкаРасчетДисконтированияРезервовПредстоящихРасходов.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетИзмененияПроцентовДисконтированияРезервовПредстоящихРасходов(Команда)
	ПараметрыФормы = Новый Структура("КлючВарианта");
	ПараметрыФормы.КлючВарианта = "СправкаРасчетИзмененияПроцентовДисконтированияРезервовПредстоящихРасходов";
	ОткрытьФорму("Отчет.СправкаРасчетИзмененияПроцентовДисконтированияРезервовПредстоящихРасходов.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетЭффектаИзмененияСтавокНалогаНаПрибыль(Команда)
	ОткрытьФорму("Отчет.СправкаРасчетЭффектаИзмененияСтавокНалогаНаПрибыль.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетНормированияРасходов(Команда)
	ОткрытьФорму("Отчет.СправкаРасчетНормированияРасходов.Форма.ФормаОтчета");
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетПересчетСтоимостиОтложенныхНалоговыхАктивовИОбязательств(Команда)
	ОткрытьФорму("Отчет.СправкаРасчетПересчетСтоимостиОтложенныхНалоговыхАктивовИОбязательств.Форма.ФормаОтчета");
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетПостоянныхИВременныхРазниц(Команда)
	ОткрытьФорму("Отчет.СправкаРасчетПостоянныхИВременныхРазниц.Форма.ФормаОтчета");
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетРезервыПоСомнительнымДолгам(Команда)
	ОткрытьФорму("Отчет.СправкаРасчетРезервыПоСомнительнымДолгам.Форма.ФормаОтчета");
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетТранспортногоНалога(Команда)
	ОткрытьФорму("Отчет.СправкаРасчетТранспортногоНалога.Форма.ФормаОтчета");
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетТранспортныхРасходов(Команда)
	ОткрытьФорму("Отчет.СправкаРасчетТранспортныхРасходов.Форма.ФормаОтчета");
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетРезервыОтпусков(Команда)
	ОткрытьФорму("Отчет.СправкаРасчетРезервыОтпусков.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетНалогаУСН(Команда)
	ОткрытьФорму("Отчет.СправкаРасчетНалогаУСН.Форма.ФормаОтчета");
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетТорговогоСбора(Команда)
	ОткрытьФорму("Отчет.СправкаРасчетТорговогоСбора.Форма.ФормаОтчета");
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетПризнаниеРасходовПоАрендованнымОС(Команда)
	
	ОткрытьФорму("Отчет.СправкаРасчетПризнаниеРасходовПоАрендованнымОС.ФормаОбъекта");
	
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетУбытковПрошлыхЛет(Команда)
	ОткрытьФорму("Отчет.СправкаРасчетУбытковПрошлыхЛет.Форма.ФормаОтчета");
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетПризнанияРасходовПоНИОКР(Команда)
	ОткрытьФорму("Отчет.СправкаРасчетПризнанияРасходовПоНИОКР.ФормаОбъекта");
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетПереоценкиВалютныхСредствНУ(Команда)
	ОткрытьФорму("Отчет.СправкаРасчетПереоценкиВалютныхСредствНУ.Форма.ФормаОтчета");
КонецПроцедуры

&НаКлиенте
Процедура СправкаРасчетНалогаНаПрибыльОтОперацийРезультатКоторыхНеВключаетсяВПрибыль(Команда)
	ОткрытьФорму("Отчет.СправкаРасчетНалогаНаПрибыльОтОперацийРезультатКоторыхНеВключаетсяВПрибыль.ФормаОбъекта");
КонецПроцедуры

#КонецОбласти