
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Отчет.Организация.Пустая() Тогда
		Отчет.Организация = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7718506660");
	КонецЕсли;
	
	Если Отчет.СкладЦеха.Пустая() Тогда
		Отчет.СкладЦеха   = Справочники.Склады.НайтиПоНаименованию("Кладовая (тех)", Истина);
	КонецЕсли;
	Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("КлючВарианта", "МатериальныйОтчет");
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура СформироватьДокументы(Команда)
	
	Если Отчет.Организация.Пустая() Тогда
		ПоказатьПредупреждение(, "Выберите организацию для формирования документов передачи!");
		Возврат;
	КонецЕсли;
	
	Если Отчет.СкладЦеха.Пустая() Тогда
		ПоказатьПредупреждение(, "Выберите цеховую кладовую для формирования документов передачи!");
		Возврат;
	КонецЕсли;
	
	Отчет.ФормироватьДокументы = Истина;
	
	Попытка
		СкомпоноватьРезультат(РежимКомпоновкиРезультата.Непосредственно);
		
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		Отчет.ФормироватьДокументы = Ложь;
		
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
	ПоказатьПредупреждение(, "Формирование документов завершено!");
	
КонецПроцедуры // СформироватьДокументы()
