//@strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Задает расширенные настройки отчета
//
// Параметры:
//   Настройки - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.Настройки.
//
Процедура НастроитьВариантыОтчета(Настройки) Экспорт
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ВедомостьПоРезервамПредстоящихРасходов);
	ОписаниеОтчета.Описание = НСтр("ru='Ведомость по резервам предстоящих расходов.'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "РезервыПредстоящихРасходов");
	ОписаниеВарианта.Наименование = НСтр("ru= 'Ведомость по резервам'");
	ОписаниеВарианта.Описание = НСтр("ru= 'Ведомость по резервам предстоящих расходов.'");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
