
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После("ОбработкаПолученияПолейПредставления")
Процедура vs_ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	Поля.Добавить("Номер");
	Поля.Добавить("Сделка");
КонецПроцедуры


&После("ОбработкаПолученияПредставления")
Процедура vs_ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Представление = СтрШаблон("%1 №%2 от %3%4", Данные.Наименование, Данные.Номер, Данные.Дата, Стршаблон("%1", ?(ЗначениеЗаполнено(Данные.Сделка), Стршаблон(" Сделка: %1", Данные.Сделка),"")));  
КонецПроцедуры

#КонецЕсли

