
&ИзменениеИКонтроль("ЕстьИзмененияИтоговНабора")
Функция vs_ЕстьИзмененияИтоговНабора(Набор) Экспорт
	
	Если НЕ Набор.Модифицированность() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЭтоРасчетыСКлиентами = 
		ТипЗнч(Набор) = Тип("РегистрНакопленияНаборЗаписей.РасчетыСКлиентами")
		ИЛИ ТипЗнч(Набор) = Тип("РегистрНакопленияНаборЗаписей.РасчетыСКлиентамиПоСрокам");
		
	Если ТипЗнч(Набор) = Тип("РегистрНакопленияНаборЗаписей.РасчетыСКлиентами")
		ИЛИ ТипЗнч(Набор) = Тип("РегистрНакопленияНаборЗаписей.РасчетыСПоставщиками") Тогда
		ТекстЗапроса = ТекстЗапросаРасчеты(ЭтоРасчетыСКлиентами);
		
	ИначеЕсли ТипЗнч(Набор) = Тип("РегистрНакопленияНаборЗаписей.РасчетыСКлиентамиПоСрокам")
		ИЛИ ТипЗнч(Набор) = Тип("РегистрНакопленияНаборЗаписей.РасчетыСПоставщикамиПоСрокам") Тогда
		ТекстЗапроса = ТекстЗапросаРасчетыПоСрокам(ЭтоРасчетыСКлиентами);
		
	Иначе
		ТекстОшибки = НСтр("ru = 'Не удалось определить таблицу для сравнения итогов набора записей.'");
		ВызватьИсключение(ТекстОшибки, КатегорияОшибки.ОшибкаКонфигурации);
	КонецЕсли;
	ПроблемныйРегистратор = Набор.Отбор.Регистратор.Значение;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Регистратор", ПроблемныйРегистратор);
	Запрос.УстановитьПараметр("НовыеДвижения", Набор.Выгрузить());
	РезультатСравнения = Запрос.Выполнить().Выгрузить();
	
	ЕстьИзменения = РезультатСравнения.Количество() > 0;
#Удаление
	Если ЕстьИзменения Тогда
		РезультатСравнения.Свернуть("Регистратор");
		Для Каждого Запись Из РезультатСравнения Цикл
			СтрокиТекста = Новый Массив;
			СтрокиТекста.Добавить(НСтр("ru = 'После обновления изменились итоги ресурсов в движениях документа. Обновление документа отменено.'"));
			СтрокиТекста.Добавить(ТекстПерепроведитеДокументВРучную());
			ТекстРекомендации = СтрСоединить(СтрокиТекста, Символы.ПС);
			ОбновлениеИнформационнойБазы.ЗарегистрироватьПроблемуСДанными(
				Запись.Регистратор,
				ТекстРекомендации);
		КонецЦикла;
	КонецЕсли;
#КонецУдаления
#Вставка
// Здесь можно описать новое поведение.
	ЕстьИзменения=False;

#КонецВставки
	
	Возврат ЕстьИзменения;
	
КонецФункции
