
&НаСервере
&После("ОбновитьЭлементыДополнительныхРеквизитов")
Процедура ИТБК_ОбновитьЭлементыДополнительныхРеквизитов(ОбновитьРеквизиты = Истина)
	
	ИспользоватьСерии = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ВидНоменклатуры, "ИспользоватьСерии");
	ИспользоватьСерии = ?(Не ТипЗнч(ИспользоватьСерии) = Тип("Булево"), Ложь, ИспользоватьСерии);	//  fix Designer
	//Если ИспользоватьСерии И ЭтаФорма.Свойства_ИспользоватьДопРеквизиты Тогда  
	Если ИспользоватьСерии И ОбновитьРеквизиты И ЭтотОбъект.Свойства_ИспользоватьДопРеквизиты Тогда
		СвойствоАвтоизготовление = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "Автоизготовление_feccce2b4e25489e8cd74e9e3fdba306");
		СтрокиСвойств = ЭтотОбъект.Свойства_ОписаниеДополнительныхРеквизитов.НайтиСтроки(Новый Структура("Свойство", СвойствоАвтоизготовление));
		
		Если СтрокиСвойств.Количество() > 0 Тогда
			ИмяРеквизита = СтрокиСвойств[0].ИмяРеквизитаЗначение;
			Элементы[ИмяРеквизита].Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИТБК_ПередЗаписьюНаСервереПеред(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ИспользоватьСерии = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ВидНоменклатуры, "ИспользоватьСерии");
	
	Если ИспользоватьСерии И ЭтотОбъект.Свойства_ИспользоватьДопРеквизиты Тогда
		СвойствоАвтоизготовление = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "Автоизготовление_feccce2b4e25489e8cd74e9e3fdba306");
		СтрокиСвойств = ЭтотОбъект.Свойства_ОписаниеДополнительныхРеквизитов.НайтиСтроки(Новый Структура("Свойство", СвойствоАвтоизготовление));
		
		Если СтрокиСвойств.Количество() > 0 Тогда
			ИмяРеквизита = СтрокиСвойств[0].ИмяРеквизитаЗначение;
			ЭтаФорма[ИмяРеквизита] = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//+++ Шаров 18.11.20
&НаСервере
Процедура ИТБК_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Элементы.Артикул.Заголовок = "Код СВУ";
	
	ИТБК_ОбновитьЭлементыДополнительныхРеквизитов(); 
	
КонецПроцедуры
//--- Шаров 18.11.20