
Процедура СоздатьСборки() Экспорт 
    
  
    ДокЗаказа = ЗаказНаСборку.ПолучитьОбъект();
    ДокЗаказа.Товары.Очистить();
    ДокЗаказа.Статус = Перечисления.СтатусыВнутреннихЗаказов.КВыполнению;
    Для Каждого СтрокаМатериалов из Материалы цикл
        Если СтрокаМатериалов.Количество > 0  тогда              
            НовСтр                      = ДокЗаказа.Товары.Добавить();
            НовСтр.Номенклатура         = СтрокаМатериалов.Номенклатура;
            НовСтр.Количество           = СтрокаМатериалов.Количество;
            НовСтр.КоличествоУпаковок   = СтрокаМатериалов.Количество;
            НовСтр.ВариантОбеспечения   = Перечисления.ВариантыОбеспечения.Отгрузить;
        КонецЕсли;
	КонецЦикла;
    ДокЗаказа.Товары.Свернуть("Номенклатура,ВариантОбеспечения","Количество,КоличествоУпаковок");
    ДокЗаказа.Записать(РежимЗаписиДокумента.Проведение); 
    
    ///создадим сборку сразу по сериям и доизготовления по главному заказу
    #Область СозданиеСборки 
    
    Документ                            = Документы.СборкаТоваров.СоздатьДокумент();
    ЗаполнитьЗначенияСвойств(Документ,  ЗаказНаСборку, ,"Номер");
	Документ.Заполнить(ЗаказНаСборку);
    Документ.ЗаказНаСборку              = ЗаказНаСборку;
    Документ.Дата                       = ?(ЗначениеЗаполнено(ЭтотОбъект.ДатаСборки),ЭтотОбъект.ДатаСборки,ТекущаяДата());
    Документ.Статус                     = Перечисления.СтатусыСборокТоваров.СобраноРазобрано;
	Документ.ИТБК_АктИзготовления		= ЗаказНаСборку; 
	Документ.vs_АктИзготовления			= ЗаказНаСборку;    //?????????????????????????????????????????
	
    //заполним товары по заказу( там коды строк)
    для Каждого  стр из ДокЗаказа.Товары цикл
        ЗаполнитьЗначенияСвойств(Документ.Товары.Добавить(),стр);
    КонецЦикла;
    
    //добавляем серии   и доизготовление
    Для Каждого СтрокаМатериалов из Материалы цикл
        Если СтрокаМатериалов.Количество > 0  тогда              
            Если ЗначениеЗаполнено(СтрокаМатериалов.Серия) тогда
                //проставим статус указания серий
                НовСтр                      = Документ.Серии.Добавить();
                НовСтр.Номенклатура         = СтрокаМатериалов.Номенклатура;
                НовСтр.Серия                = СтрокаМатериалов.Серия;
                НовСтр.Количество           = СтрокаМатериалов.Количество;
            КонецЕсли;
        КонецЕсли;
        Если  СтрокаМатериалов.Доизготовление > 0 тогда              
            НовСтр                      = Документ.ИТБК_Доизготовить.Добавить();
            НовСтр.Номенклатура         = СтрокаМатериалов.Номенклатура;
           // НовСтр.Серия                = СтрокаМатериалов.Серия;
            НовСтр.Количество           = СтрокаМатериалов.Доизготовление;
			
			НовСтр                      = Документ.vs_Доизготовить.Добавить();
            НовСтр.Номенклатура         = СтрокаМатериалов.Номенклатура;
           // НовСтр.Серия                = СтрокаМатериалов.Серия;
            НовСтр.Количество           = СтрокаМатериалов.Доизготовление;
        КонецЕсли;
    КонецЦикла;
    
    
    
    для Каждого  стр из Документ.Товары цикл
        Если стр.Номенклатура.ВидНоменклатуры.ИспользоватьСерии тогда
            СтрокиСерий =  Документ.Серии.НайтиСтроки(новый Структура(
            "Номенклатура",стр.Номенклатура));
            Количество =  0;
            
            для Каждого стрс из   СтрокиСерий Цикл 
                Количество = Количество + стрс.Количество;
            КонецЦикла;
            Если Количество =  стр.Количество тогда
                стр.СтатусУказанияСерий = 4;
            иначе
                стр.СтатусУказанияСерий = 3;
            КонецЕсли;
        КонецЕсли;
        
    КонецЦикла;
    
    Серия = Неопределено;
    для Каждого  стр из Серии цикл
        стр1 = Документ.серии.Добавить();
        стр1.серия = СоздатьСерию(стр.Серия );
		Серия = стр1.Серия;
        стр1.Номенклатура = ЗаказНаСборку.Номенклатура;
        стр1.количество = 1;
    КонецЦикла;
	
	ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(Документ, Документы.СборкаТоваров);
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Документ,ПараметрыУказанияСерий.Шапка);
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Документ,ПараметрыУказанияСерий.ТЧ);
	
	
	Документ.Серия = Серия;
	//сообщить("В документе серия """+Документ.Серия+"""");
	
	Документ.Записать();
	Попытка 
		Документ.Записать(РежимЗаписиДокумента.Проведение);
	Исключение  
	КонецПопытки;
	//сообщить("после записи В документе серия """+Документ.Серия+"""");

    #КонецОбласти  
    
    
    //ЗафиксироватьТранзакцию();
    
КонецПроцедуры


Функция СоздатьСерию(Имя)
	
	серия =  Справочники.СерииНоменклатуры.НайтиПоНаименованию(СокрЛП(имя),Истина) ;
	Если не серия.Пустая() тогда возврат серия КонецЕсли;
	
	серия = Справочники.СерииНоменклатуры.СоздатьЭлемент();
	серия.Номер = имя;
	серия.ВидНоменклатуры = ЗаказНаСборку.Номенклатура.видноменклатуры;
	серия.Записать();
	
	возврат серия.Ссылка
	
КонецФункции
