
//&После("ОбработкаПроведения")
//Процедура ИТБК_ОбработкаПроведения(Отказ, РежимПроведения)
//	
//	Набор = Движения.ИТБК_Доизготовление;
//	для Каждого  стр из ИТБК_Доизготовить цикл
//		Если  стр.Количество  > 0 тогда
//			стрДвижения = набор.добавитьПриход();
//			стрДвижения.Период = Дата;
//			стрДвижения.АктИзготовления = ИТБК_АктИзготовления;
//			стрДвижения.Номенклатура = стр.Номенклатура;
//			стрДвижения.Доизготовить = стр.Количество;
//		КонецЕсли;
//	КонецЦикла;
//	набор.записывать = Истина;
//	Набор.Записать();
//	
//КонецПроцедуры

//&Перед("ПередЗаписью")
//Процедура ИТБК_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
//	
//	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения тогда
//		отказ = ИТБК_ОбщийМодуль.ЕстьДоизготовления(ИТБК_АктИзготовления);
//	КонецЕсли;
//	// begin fix Designer29.09.2023 10:26:08
//	Если Не Отказ и Не РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения тогда
//		Если Дата = КонецДня(Дата) Тогда
//			Дата = Дата - 60*60+1;
//			//Сообщить(Дата);
//		КонецЕсли;
//	КонецЕсли;	
//КонецПроцедуры

//&После("ПередЗаписью")
//Процедура ИТБК_ПередЗаписью1(Отказ, РежимЗаписи, РежимПроведения)
//	
//	//никитина 28.09.20
//	//заполним серию
//	СтрокаСерии = Серии.Найти(Номенклатура,"Номенклатура");
//	Если СтрокаСерии <> Неопределено тогда
//		ИТБК_Серия = СтрокаСерии.Серия;	
//	иначе
//		ИТБК_Серия = Серия
//	КонецЕсли;

//КонецПроцедуры

//&Перед("ОбработкаПроверкиЗаполнения")
//Процедура ИТБК_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
//	
//	МассивНепроверяемыхРеквизитов = Новый Массив;
//	МассивНепроверяемыхРеквизитов.Добавить("ИТБК_Серия");
//	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

//КонецПроцедуры
