
&ИзменениеИКонтроль("СформироватьЗаголовокДокумента")
Функция vs_СформироватьЗаголовокДокумента(Шапка, Знач НазваниеДокумента, УдалитьТолькоЛидирующиеНулиИзНомераОбъекта)
	
	ДанныеДокумента = Новый Структура("Номер, Дата, Представление, НомерИсправляемогоДокумента, ДатаИсправляемогоДокумента");
	ЗаполнитьЗначенияСвойств(ДанныеДокумента, Шапка);
	ИсправительныйДокумент = ЗначениеЗаполнено(ДанныеДокумента.НомерИсправляемогоДокумента) 
								И ЗначениеЗаполнено(ДанныеДокумента.ДатаИсправляемогоДокумента);
	
	// Если название документа не передано, получим название по представлению документа
	Если ПустаяСтрока(НазваниеДокумента) И ЗначениеЗаполнено(ДанныеДокумента.Представление) Тогда
		НазваниеДокумента = ПредставлениеОбъектаИзПредставленияСсылки(ДанныеДокумента);
	КонецЕсли;

#Удаление
	Если УдалитьТолькоЛидирующиеНулиИзНомераОбъекта Тогда
#КонецУдаления
#Вставка
	Если 	НазваниеДокумента = "Счет на оплату"
		или
			ТипЗнч(Шапка) = Тип("Структура") и Шапка.Свойство("Синоним") и Шапка.Синоним = "Счет"
		или 
			ТипЗнч(Шапка) = Тип("ВыборкаИзРезультатаЗапроса") 
			и Не Шапка.Владелец().Колонки.Найти("Синоним") = Неопределено 
			и Шапка.Синоним = "Счет" Тогда
		НомерНаПечать = ДанныеДокумента.Номер;
	ИначеЕсли УдалитьТолькоЛидирующиеНулиИзНомераОбъекта Тогда
#КонецВставки
		НомерНаПечать = ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(ДанныеДокумента.Номер);
		Если ИсправительныйДокумент Тогда
			НомерИсправляемогоДокументаНаПечать = ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(
				ДанныеДокумента.НомерИсправляемогоДокумента);
		КонецЕсли;
	Иначе 
		// Кроме лидирующих нулей будут удалены также префикс организации и префикс информационной базы.
		НомерНаПечать = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеДокумента.Номер);
		Если ИсправительныйДокумент Тогда
			НомерИсправляемогоДокументаНаПечать = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(
				ДанныеДокумента.НомерИсправляемогоДокумента);
		КонецЕсли;
	КонецЕсли;
	
	Если ИсправительныйДокумент Тогда
		ЗаголовокДокумента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1 № %2 от %3 (исправление № %4 от %5)'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			НазваниеДокумента,
			НомерИсправляемогоДокументаНаПечать,
			Формат(ДанныеДокумента.ДатаИсправляемогоДокумента, "ДЛФ=DD"),
			НомерНаПечать,
			Формат(ДанныеДокумента.Дата, "ДЛФ=DD"));
	Иначе
		ЗаголовокДокумента = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1 № %2 от %3'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			НазваниеДокумента, НомерНаПечать, Формат(ДанныеДокумента.Дата, "ДЛФ=DD"));
	КонецЕсли;
	
	Возврат ЗаголовокДокумента;
	
КонецФункции
