
&НаСервере
Процедура ИТБК_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	НовыйЭлемент = Элементы.Вставить("ИТБК_ТехническийДокумент", Тип("ПолеФормы"), Элементы.ГруппаДополнительноПраво, Элементы.ГруппаДополнительныеРеквизиты);
	НовыйЭлемент.Заголовок = "Технический документ (ИТБК)";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "Объект.ИТБК_ТехническийДокумент";
	
	ТолькоПросмотр = Объект.ИТБК_ТехническийДокумент;
	
КонецПроцедуры // ИТБК_ПриСозданииНаСервереПеред() 

&НаСервере
Процедура ИТБК_ПриЧтенииНаСервереПеред(ТекущийОбъект)
	
	ТолькоПросмотр = Объект.ИТБК_ТехническийДокумент;
	
КонецПроцедуры // ИТБК_ПриЧтенииНаСервереПеред()

&НаКлиенте
Процедура ИТБК_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
	
	Если Объект.ИТБК_ТехническийДокумент Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Изменение технического документа запрещено!", Объект.Ссылка,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры // ИТБК_ПередЗаписьюПеред()
