
&Перед("ОбновитьЗависимостиДополнительныхРеквизитов")
Процедура vs_ОбновитьЗависимостиДополнительныхРеквизитов(Форма, Объект)
	Если Форма.ИмяФормы	= "Документ.ЗаказПоставщику.Форма.ФормаДокумента" Тогда
		ЗначениеДополнительногоРеквизита = vs_ПолучитьЗначениеДополнительногоРеквизитаНаФорме(Форма, "ОплатаПоДоговоруБезСчета_0a8b9b3ad54541998932dc50d98ccd96");
		Если ЗначениеДополнительногоРеквизита = Неопределено
			или ЗначениеДополнительногоРеквизита = Ложь Тогда
			Форма.Элементы.НомерВходящегоДокумента.АвтоОтметкаНезаполненного 	= Истина;
			Форма.Элементы.НомерВходящегоДокумента.ОтметкаНезаполненного     	= Истина;
			//Форма.Элементы.НомерВходящегоДокумента.Доступность			    = Истина;
			Форма.Элементы.ДатаВходящегоДокумента.АвтоОтметкаНезаполненного 	= Истина;	
			Форма.Элементы.ДатаВходящегоДокумента.ОтметкаНезаполненного 		= Истина;
			//Форма.Элементы.ДатаВходящегоДокумента.Доступность			     	= Истина;
		Иначе
			Если Объект = Неопределено Тогда
				ОписаниеОбъекта = Форма.Объект;
			Иначе
				ОписаниеОбъекта = Объект;
			КонецЕсли;
			Форма.Элементы.НомерВходящегоДокумента.АвтоОтметкаНезаполненного 	= Ложь;			
			Форма.Элементы.НомерВходящегоДокумента.ОтметкаНезаполненного     	= Ложь;
			//Форма.Элементы.НомерВходящегоДокумента.Доступность			    = Ложь;
			//ОписаниеОбъекта.НомерПоДаннымПоставщика                           = "";
			Форма.Элементы.ДатаВходящегоДокумента.АвтоОтметкаНезаполненного 	= Ложь;
			Форма.Элементы.ДатаВходящегоДокумента.ОтметкаНезаполненного 		= Ложь;
			//ОписаниеОбъекта.ДатаПоДаннымПоставщика                            = Дата(1,1,1);
			//Форма.Элементы.ДатаВходящегоДокумента.Доступность			     	= Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция vs_ПолучитьПолеДополнительногоРеквизитаНаФорме(Форма, ИмяРеквизита) 
	
	Список = Форма.Свойства_ОписаниеДополнительныхРеквизитов;
	
	Свойство = ОбщегоНазначенияУТВызовСервера.vs_ПолучитьСвойствоПВХПоИмени(ИмяРеквизита);
	
	Если ЗначениеЗаполнено(Свойство) Тогда
	    НайденныеСтроки = Список.НайтиСтроки(Новый Структура("Свойство", Свойство));
		Если НайденныеСтроки.Количество() > 0 Тогда
			Возврат НайденныеСтроки[0];		
		КонецЕсли; 		
	КонецЕсли;
	Возврат(Неопределено);
КонецФункции

Функция vs_ПолучитьЗначениеДополнительногоРеквизитаНаФорме(Форма, ИмяРеквизита)
	Перем ЗначениеРеквизита;
	
	ПолеДополнительногоРеквизитаНаФорме = vs_ПолучитьПолеДополнительногоРеквизитаНаФорме(Форма, ИмяРеквизита);
	
	Если не ПолеДополнительногоРеквизитаНаФорме = Неопределено Тогда
		Возврат Форма[ПолеДополнительногоРеквизитаНаФорме.ИмяРеквизитаЗначение];
	КонецЕсли;
	Возврат(Неопределено);
КонецФункции