
//&Перед("ПередЗаписью")
//Процедура ИТБК_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
//	
//	Если ИТБК_ЭтоДоизготовление и РежимЗаписи = РежимЗаписиДокумента.Проведение и ИТБК_Статус = Перечисления.СтатусыСборокТоваров.ВРаботе тогда
//		Отказ = Истина;
//		Сообщить("Проведение доизготовлления возможно только в статусе ""Выполнено""");
//		Возврат;
//	КонецЕсли;
//	
//	Если ЭтотОбъект.ИТБК_ЭтоДоизготовление тогда
//		Товары.Очистить();
//		Серии.Очистить();
//		для Каждого стр из ИТБК_Доизготовление Цикл
//			
//			Если стр.Количество > 0  тогда
//				
//				Если стр.Номенклатура.видноменклатуры.ИспользоватьСерии и стр.Серия.Пустая() тогда
//					//ОбщегоНазначения.СообщитьПользователю("Не заполнена серия " + стр.Номенклатура,ЭтотОбъект,"","",Отказ); // begin fix Designer09.09.2021 4:04:42
//					ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Не заполнена серия %1", стр.Номенклатура), ЭтотОбъект,"","",Отказ);// end fix Designer09.09.2021 4:04:53
//				КонецЕсли;
//				
//				стрТовары = Товары.Добавить();
//				стрТовары.Номенклатура = стр.Номенклатура;
//				стрТовары.Характеристика = стр.Характеристика;     						// fix Designer 14.02.2023 16:45:13
//				стрТовары.КоличествоУпаковок = стр.Количество;
//				стрТовары.Количество = стр.Количество;
//				стрТовары.СтатьяРасходов = стр.СтатьяРасходов;
//				стрТовары.АналитикаРасходов = стр.АналитикаРасходов;
//				стрТовары.Назначение = стр.Назначение;     								// fix Designer 14.02.2023 16:45:13
//				
//				Если ЗначениеЗаполнено(стр.Серия) тогда
//					стрТовары.СтатусУказанияСерий  				= 4;
//					стрТовары.СтатусУказанияСерийОтправитель 	= 4; 					// fix Designer 14.02.2023 16:45:13
//					НовСтр                      				= ЭтотОбъект.Серии.Добавить();
//					НовСтр.Номенклатура        					= стр.Номенклатура;
//					НовСтр.Характеристика 						= стр.Характеристика;  	// fix Designer 14.02.2023 16:45:13
//					НовСтр.Серия                				= стр.Серия;
//					НовСтр.Назначение 							= стр.Назначение;     	// fix Designer 14.02.2023 16:45:13
//					НовСтр.Количество           				= стр.Количество;
//				КонецЕсли;
//			КонецЕсли;
//		КонецЦикла;
//	КонецЕсли;
//	
//КонецПроцедуры

//&После("ОбработкаПроведения")
//Процедура ИТБК_ОбработкаПроведения(Отказ, РежимПроведения)
//	Если Не ИТБК_ЭтоДоизготовление Тогда Возврат; КонецЕсли; // fix Designer09.09.2021 4:00:58
//	
//	для Каждого Движение из Движения цикл
//		Движение.Очистить();
//	КонецЦикла;
//	// begin Suetin 2021/09/05
//	//для Каждого  стр из ИТБК_Доизготовление цикл
//	//	Если  стр.Количество > 0 тогда
//	//		стрДвижения = набор.добавитьРасход();
//	//		стрДвижения.Период = Дата;
//	//		стрДвижения.АктИзготовления = ИТБК_АктИзготовления;
//	//		стрДвижения.Номенклатура = стр.Номенклатура;
//	//		стрДвижения.Доизготовить = стр.Количество;
//	//	КонецЕсли;
//	//	Если  стр.Отказ > 0 тогда
//	//		стрДвижения = набор.добавитьПриход();
//	//		стрДвижения.Период = Дата;
//	//		стрДвижения.АктИзготовления = ИТБК_АктИзготовления;
//	//		стрДвижения.Номенклатура = стр.Номенклатура;
//	//		стрДвижения.Доизготовить = - стр.Отказ;
//	//	КонецЕсли;
//	//КонецЦикла;
//	ТекстЗапроса = 
//	"ВЫБРАТЬ
//	|	&ИТБК_АктИзготовления КАК АктИзготовления,
//	|	ДДоизготовление.Номенклатура КАК Номенклатура,
//	|	ДДоизготовление.ТребуетсяДоизготовить КАК ТребуетсяДоизготовить,
//	|	ДДоизготовление.Количество КАК Количество,
//	|	ДДоизготовление.Отказ КАК Отказ
//	|ПОМЕСТИТЬ ДДокумента
//	|ИЗ
//	|	&ДДоизготовление КАК ДДоизготовление
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ДДокумента.АктИзготовления КАК АктИзготовления,
//	|	ДДокумента.Номенклатура КАК Номенклатура,
//	|	СУММА(ВЫБОР
//	|			КОГДА ЕСТЬNULL(ИТБК_Доизготовление.ДоизготовитьОстаток, 0) > 0
//	|				ТОГДА ЕСТЬNULL(ИТБК_Доизготовление.ДоизготовитьОстаток, 0)
//	|			ИНАЧЕ 0
//	|		КОНЕЦ) КАК ДоизготовитьОстаток,
//	|	СУММА(ДДокумента.ТребуетсяДоизготовить) КАК ТребуетсяДоизготовить,
//	|	СУММА(ДДокумента.Количество) КАК Количество,
//	|	СУММА(ДДокумента.Отказ) КАК Отказ
//	|ИЗ
//	|	ДДокумента КАК ДДокумента
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ИТБК_Доизготовление.Остатки(
//	|				&ДатаКон,
//	|				(АктИзготовления, Номенклатура) В
//	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|						Т.АктИзготовления,
//	|						Т.Номенклатура
//	|					ИЗ
//	|						ДДокумента КАК Т)) КАК ИТБК_Доизготовление
//	|		ПО ДДокумента.АктИзготовления = ИТБК_Доизготовление.АктИзготовления
//	|			И ДДокумента.Номенклатура = ИТБК_Доизготовление.Номенклатура
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ДДокумента.АктИзготовления,
//	|	ДДокумента.Номенклатура";
//	Запрос = Новый Запрос(ТекстЗапроса);
//	Запрос.УстановитьПараметр("ДатаКон"				, Новый Граница(Новый МоментВремени(Дата, Ссылка), ВидГраницы.Исключая));
//	//Запрос.УстановитьПараметр("ДДоизготовление"	, ИТБК_Доизготовление.Выгрузить());
//	Т = ИТБК_Доизготовление.Выгрузить();
//	//Т.Свернуть("Номенклатура,ТребуетсяДоизготовить,Отказ","Количество");
//	Т.Свернуть("Номенклатура","Количество,ТребуетсяДоизготовить,Отказ");
//	Запрос.УстановитьПараметр("ДДоизготовление"		,Т);  // fix Suetin 4/10/2023 3:50:03 PM
//	Запрос.УстановитьПараметр("ИТБК_АктИзготовления", ИТБК_АктИзготовления);
//	//Результат = Запрос.Выполнить();
//	Р=Запрос.ВыполнитьПакетСПромежуточнымиДанными();
//	Результат=Р[1];
//	Если Результат.Пустой() Тогда
//		Возврат;
//	КонецЕсли;
//	Набор = Движения.ИТБК_Доизготовление;
//	Выборка = Результат.Выбрать();
//	Пока Выборка.Следующий() Цикл
//		Если Выборка.Отказ>Выборка.ДоизготовитьОстаток Тогда
//			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Отказ %1 > Остаток (Доизготовить) %2",Выборка.Отказ,Выборка.ДоизготовитьОстаток));
//		КонецЕсли;
//		ВыборкаОтказ = Мин(Выборка.Отказ, Выборка.ДоизготовитьОстаток);
//		Доизготовить = Мин(Выборка.Количество,Выборка.ДоизготовитьОстаток-ВыборкаОтказ);
//		Доизготовить = ?(Доизготовить<0,0,Доизготовить);
//		
//		Если Доизготовить > 0 тогда
//			стрДвижения 				= Набор.ДобавитьРасход();
//			стрДвижения.Период 			= Дата;
//			стрДвижения.АктИзготовления = Выборка.АктИзготовления;
//			стрДвижения.Номенклатура 	= Выборка.Номенклатура;
//			стрДвижения.Доизготовить 	= Доизготовить;
//		КонецЕсли;
//		Если ВыборкаОтказ > 0 тогда
//			стрДвижения 				= Набор.ДобавитьПриход();
//			стрДвижения.Период 			= Дата;
//			стрДвижения.АктИзготовления = Выборка.АктИзготовления;
//			стрДвижения.Номенклатура 	= Выборка.Номенклатура;
//			стрДвижения.Доизготовить 	= - ВыборкаОтказ;
//		КонецЕсли;
//	КонецЦикла;
//	// end Suetin 2021/09/05
//	Набор.Записывать = Истина;
//	Движения.Записать();
//	
//КонецПроцедуры

//&После("ОбработкаПроверкиЗаполнения")
//Процедура ИТБК_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
//	
//	
//	МассивНепроверяемыхРеквизитов = новый Массив;
//	Если ЭтотОбъект.ИТБК_ЭтоДоизготовление тогда
//		МассивНепроверяемыхРеквизитов.Добавить("Товары")
//	КонецЕсли;
//	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
//	
//КонецПроцедуры
