
&Перед("ПередЗаписью")
Процедура vs_ПередЗаписью(Форма, Отказ, ПараметрыЗаписи)
	Если Форма.ИмяФормы	= "Документ.ПередачаМатериаловВПроизводство.Форма.ФормаДокумента" Тогда  	// begin fix Designer27.10.2020 2:01:05
		Если Форма.Объект.ИТБК_ТехническийДокумент Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиент.СообщитьПользователю("Изменение технического документа запрещено! (Мат.Отчет)", Форма.Объект.Ссылка,,, Отказ);
		КонецЕсли;
	КонецЕсли;                                                                   					// end fix Designer27.10.2020 1:57:39
КонецПроцедуры
