
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После("ОбработкаПолученияПолейПредставления")
Процедура vs_ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Номер"); 
	Поля.Добавить("Дата");
	Поля.Добавить("Сделка");
КонецПроцедуры


&После("ОбработкаПолученияПредставления")
Процедура vs_ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Представление = СтрШаблон("Согласование документа №%1 от %2%3", Данные.Номер, Данные.Дата, СтрШаблон("%1", ?(ЗначениеЗаполнено(Данные.Сделка), СтрШаблон(" Сделка: %1", Данные.Сделка),"")));  
КонецПроцедуры

#КонецЕсли

