#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "РабочиеМестаОхраныТрудаСотрудников");
	НастройкиВарианта.Описание = НСтр("ru = 'Информация о рабочих местах охраны труда, назначенных сотрудникам.'");
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.ОхранаТруда") Тогда
		МодульОхранаТруда = ОбщегоНазначения.ОбщийМодуль("ОхранаТруда");
		МодульОхранаТруда.НастроитьВариантОтчетаРабочиеМестаОхраныТрудаСотрудников(НастройкиВарианта);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли