
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура vs_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ЗадачаОбъект.ЗадачаИсполнителя") Тогда
#Удаление
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, 
		"БизнесПроцесс,ТочкаМаршрута,Наименование,Исполнитель,РольИсполнителя,ОсновнойОбъектАдресации," 
		+ "ДополнительныйОбъектАдресации,Важность,ДатаИсполнения,Автор,Описание,СрокИсполнения," 
		+ "ДатаНачала,РезультатВыполнения,Предмет");
#КонецУдаления
#Вставка
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, 
		"БизнесПроцесс,ТочкаМаршрута,Наименование,Исполнитель,РольИсполнителя,ОсновнойОбъектАдресации," 
		+ "ДополнительныйОбъектАдресации,Важность,ДатаИсполнения,Автор,Описание,СрокИсполнения," 
		+ "ДатаНачала,РезультатВыполнения,Предмет,Сделка");
#КонецВставки
		Дата = ТекущаяДатаСеанса();
#Вставка
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("БизнесПроцессОбъект.Задание") 
		или ТипЗнч(ДанныеЗаполнения) = Тип("БизнесПроцессОбъект.СогласованиеПродажи") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, 
		"Предмет,Сделка");
		Дата = ТекущаяДатаСеанса(); 
		ОбщегоНазначения.СообщитьПользователю(ДанныеЗаполнения.Сделка);
		ОбщегоНазначения.СообщитьПользователю(Сделка);
#КонецВставки
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Важность) Тогда
		Важность = Перечисления.ВариантыВажностиЗадачи.Обычная;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(СостояниеБизнесПроцесса) Тогда
		СостояниеБизнесПроцесса = Перечисления.СостоянияБизнесПроцессов.Активен;
	КонецЕсли;

КонецПроцедуры

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли