#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - См. ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	Настройки.РазрешеноИзменятьВарианты = Ложь;
	
	Настройки.События.ПередЗагрузкойВариантаНаСервере = Истина;
	
КонецПроцедуры

// Вызывается в одноименном обработчике формы отчета после выполнения кода формы.
//
// Подробнее - см. ОтчетыПереопределяемый.ПередЗагрузкойВариантаНаСервере
//
Процедура ПередЗагрузкойВариантаНаСервере(ЭтаФорма, НовыеНастройкиКД) Экспорт
	
	Отчет = ЭтаФорма.Отчет;
	КомпоновщикНастроекФормы = Отчет.КомпоновщикНастроек; // КомпоновщикНастроекКомпоновкиДанных - 
	
	//Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьПроизводство") Тогда
	//	ЗначениеПоиска = Новый ПараметрКомпоновкиДанных("Номенклатура");
	//	Для каждого ЭлементПараметр Из КомпоновщикНастроекФормы.Настройки.ПараметрыДанных.Элементы Цикл
	//		Если ЭлементПараметр.Параметр = ЗначениеПоиска Тогда
	//			ЭлементПараметр.ПредставлениеПользовательскойНастройки = НСтр("ru = 'Комплект'");
	//			Прервать;
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;
	
	НовыеНастройкиКД = КомпоновщикНастроекФормы.Настройки;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НастройкиОсновнойСхемы = КомпоновщикНастроек.ПолучитьНастройки();
	
	ОтборПериод = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НастройкиОсновнойСхемы, "Период").Значение;
	
	Если НЕ ЗначениеЗаполнено(ОтборПериод) Тогда
		ТекстСообщения = НСтр("ru = 'Поле ""Период"" не заполнено.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,, Отказ); 
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДокументРезультат.Очистить();
	
	#Область Инициализация
	НастройкиОсновнойСхемы = КомпоновщикНастроек.ПолучитьНастройки();
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("НачалоПериода", КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НастройкиОсновнойСхемы, "Период").Значение.ДатаНачала);
	ПараметрыОтчета.Вставить("КонецПериода", КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НастройкиОсновнойСхемы, "Период").Значение.ДатаОкончания);
	
	ПревышенЛимитСтрок = Ложь;
	СтруктураСерииДерево = СтруктураСерииНоменклатуры(ПараметрыОтчета, ПревышенЛимитСтрок);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Отчет.vs_ОтчетПоДокументамЗаПериод.ПФ_MXL_СтруктураОтчетаПоДокументамЗаПериод");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПараметры = Макет.ПолучитьОбласть("Параметры");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
	ОбластьПредупреждение = Макет.ПолучитьОбласть("Предупреждение");
	#КонецОбласти
	
	// Вывод области Заголовок
	#Область ОбластьЗаголовок
	ПараметрыОбласти = Новый Структура("ТекстЗаголовка", НСтр("ru = 'Отчет по документам за период (vssoft)'", ОбщегоНазначения.КодОсновногоЯзыка()));
	ОбластьЗаголовок.Параметры.Заполнить(ПараметрыОбласти);
	ДокументРезультат.Вывести(ОбластьЗаголовок);
	#КонецОбласти
	
	// Вывод области Предупреждение
	#Область ОбластьПредупреждение
	Если ПревышенЛимитСтрок Тогда
		ПараметрыОбласти = Новый Структура("КоличествоСтрок", ЛимитСтрок());
		ОбластьПредупреждение.Параметры.Заполнить(ПараметрыОбласти);
		ДокументРезультат.Вывести(ОбластьПредупреждение);
	КонецЕсли;
	#КонецОбласти
	
	// Вывод области Параметры
	#Область ОбластьПараметры
	ПараметрыОбласти = Новый Структура;
	ПараметрыОбласти.Вставить("НачалоПериода", ПараметрыОтчета.НачалоПериода);
	ПараметрыОбласти.Вставить("ОкончаниеПериода", ПараметрыОтчета.ОкончаниеПериода);
	//ОбластьПараметры.Параметры.Заполнить(ПараметрыОбласти);
	ОбластьПараметры.Параметры.Заполнить(ПараметрыОбласти);
	ДокументРезультат.НачатьАвтогруппировкуСтрок();
	ДокументРезультат.Вывести(ОбластьПустаяСтрока, 1,, Истина);
	ДокументРезультат.Вывести(ОбластьПараметры, 2,, Истина);
	ДокументРезультат.ЗакончитьАвтогруппировкуСтрок();
	
	ДокументРезультат.Вывести(ОбластьПустаяСтрока);
	#КонецОбласти
	
	// Вывод области Шапка
	#Область ОбластьШапка
	//ПараметрыОбласти = Новый Структура;
	//Если ИспользоватьПроизводство Тогда
	//	ПараметрыОбласти.Вставить("ТекстМатериал", НСтр("ru = 'Полуфабрикат или материал'", ОбщегоНазначения.КодОсновногоЯзыка()));
	//	ПараметрыОбласти.Вставить("ТекстИзрасходовано", НСтр("ru = 'Израсходовано'", ОбщегоНазначения.КодОсновногоЯзыка()));
	//Иначе
	//	ПараметрыОбласти.Вставить("ТекстМатериал", НСтр("ru = 'Комплектующая'", ОбщегоНазначения.КодОсновногоЯзыка()));
	//	ПараметрыОбласти.Вставить("ТекстИзрасходовано", НСтр("ru = 'Израсходовано'", ОбщегоНазначения.КодОсновногоЯзыка()));
	//КонецЕсли;
	//ОбластьШапка.Параметры.Заполнить(ПараметрыОбласти);
	ДокументРезультат.Вывести(ОбластьШапка);
	#КонецОбласти
	
	ДокументРезультат.НачатьАвтогруппировкуСтрок();
	ЗаполнитьСтрокиРекурсивно(СтруктураСерииДерево, ОбластьСтрока, 0, ДокументРезультат);
	ДокументРезультат.ЗакончитьАвтогруппировкуСтрок();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтруктураСерииНоменклатуры(Параметры, ПревышенЛимитСтрок)
	
	СтруктураСерииНоменклатурыДерево = Новый ДеревоЗначений;
	СтруктураСерииНоменклатурыДерево.Колонки.Добавить("ТипДокумента", Новый ОписаниеТипов("Строка"));
	СтруктураСерииНоменклатурыДерево.Колонки.Добавить("Операция", Новый ОписаниеТипов("Строка"));
	СтруктураСерииНоменклатурыДерево.Колонки.Добавить("ТабличнаяЧасть", Новый ОписаниеТипов("Строка"));
	СтруктураСерииНоменклатурыДерево.Колонки.Добавить("Автор", Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	СтруктураСерииНоменклатурыДерево.Колонки.Добавить("КоличествоДокументов", Новый ОписаниеТипов("Число"));
	СтруктураСерииНоменклатурыДерево.Колонки.Добавить("КоличествоРеквизитов", Новый ОписаниеТипов("Число"));
	СтруктураСерииНоменклатурыДерево.Колонки.Добавить("КоличествоСтрок", Новый ОписаниеТипов("Число"));
	СтруктураСерииНоменклатурыДерево.Колонки.Добавить("КоличествоРеквизитовСтрок", Новый ОписаниеТипов("Число"));
	
	СтруктураСерииКоллекция = СтруктураСерииНоменклатурыДерево.Строки;
	
	СписокНоменклатуры = Новый ТаблицаЗначений; // см. ПроизводствоСервер.СлужебнаяСтруктураТаблицыЗначений
	СписокНоменклатуры.Колонки.Добавить("ТипДокумента", Новый ОписаниеТипов("Строка"));
	//СписокНоменклатуры.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	//СписокНоменклатуры.Колонки.Добавить("Серия", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	СписокНоменклатуры.Колонки.Добавить("Строки");
	
	НоваяСтрока = СписокНоменклатуры.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Параметры);
	НоваяСтрока.Строки = СтруктураСерииКоллекция;
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураПоиска = Новый Структура("ТипДкументаСписка");
	КоличествоСтрок = 0;
	ЛимитСтрок = ЛимитСтрок();
	
	Пока СписокНоменклатуры.Количество() <> 0 Цикл
		
		НовыйСписокНоменклатуры = СписокНоменклатуры.СкопироватьКолонки();
		
		ИспользованныеСерии = ИспользованныеСерии(Параметры.НачалоПериода, Параметры.КонецПериода);
		ИспользованныеСерии.Индексы.Добавить("ТипДкументаСписка");
		
		//Если НЕ ОтборПоХарактеристике Тогда
		//	
		//	ОтборПоХарактеристике = Истина;
		//	
		//	СписокНоменклатуры.Очистить();
		//	
		//	Колонки = "ТипДкументаСписка";
		//	ИспользованныеСерииКопия = ИспользованныеСерии.Скопировать(, Колонки);
		//	ИспользованныеСерииКопия.Свернуть(Колонки);
		//	
		//	Для каждого Строка Из ИспользованныеСерииКопия Цикл
		//		
		//		НоваяСтрока = СписокНоменклатуры.Добавить();
		//		НоваяСтрока.ТипДкумента = Строка.ТипДкументаСписка;
		//		НоваяСтрока.Строки = СтруктураСерииКоллекция;
		//		
		//	КонецЦикла;
		//	
		//КонецЕсли;
		
		Для каждого СтрокаНоменклатура Из СписокНоменклатуры Цикл
			
			СтруктураПоиска.ТипДкументаСписка = СтрокаНоменклатура.ТипДкумента;
			
			Для каждого СтрокаСерияМатериала Из ИспользованныеСерии.НайтиСтроки(СтруктураПоиска) Цикл
				
				КоличествоСтрок = КоличествоСтрок + 1;
				Если КоличествоСтрок > ЛимитСтрок Тогда
					ПревышенЛимитСтрок = Истина;
					Прервать;
				КонецЕсли;
				
				НоваяСерия = СтрокаНоменклатура.Строки.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСерия, СтрокаСерияМатериала);
					
				Если ЗначениеЗаполнено(НоваяСерия.Серия) Тогда
					
					// Контроль зацикливания
					ЕстьЗацикливание = Ложь;
					
					Родитель = НоваяСерия.Родитель;
					Пока Родитель <> Неопределено Цикл
						Если Родитель.ТипДкумента = НоваяСерия.ТипДкумента Тогда
							ЕстьЗацикливание = Истина;
							Прервать;
						КонецЕслИ;
						Родитель = Родитель.Родитель;
					КонецЦикла;
					
					Если Не ЕстьЗацикливание Тогда
						НоваяНоменклатура = НовыйСписокНоменклатуры.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяНоменклатура, НоваяСерия);
						НоваяНоменклатура.Строки = НоваяСерия.Строки;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла; 
			Если КоличествоСтрок > ЛимитСтрок Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если КоличествоСтрок > ЛимитСтрок Тогда
			Прервать;
		КонецЕсли;
		
		СписокНоменклатуры = НовыйСписокНоменклатуры.Скопировать();
		
	КонецЦикла; 
	
	Возврат СтруктураСерииНоменклатурыДерево;
	
КонецФункции

Функция ИспользованныеСерии(НачалоПериода, ОкончаниеПериода)

	ТекстыЗапроса = Новый Массив;
	
	Для Каждого Док Из Метаданные.Документы Цикл
		ТекстыЗапроса.Добавить(
		"ВЫБРАТЬ
		|	ТИПЗНАЧЕНИЯ(Д.Ссылка) КАК ТипДокумента,
		|	"+?(Не Док.Реквизиты.Найти("ХозяйственнаяОперация") = Неопределено,"Д.ХозяйственнаяОперация","Неопределено") +" КАК ХозяйственнаяОперация,
		|	"+?(Не Док.Реквизиты.Найти("Автор") = Неопределено,"Д.Автор","Неопределено") +" КАК Автор,
		|	Д.Дата КАК Дата,
		|	КОЛИЧЕСТВО(*) КАК КоличествоДокументов
		|"+?(ТекстыЗапроса.Количество()=0,"ПОМЕСТИТЬ СписокНоменклатуры","")+"
		|ИЗ
		|	" + Док.ПолноеИмя() + " КАК Д
		|ГДЕ
		|	Д.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|СГРУППИРОВАТЬ ПО
		|	ТИПЗНАЧЕНИЯ(Д.Ссылка),
		|	"+?(Не Док.Реквизиты.Найти("ХозяйственнаяОперация") = Неопределено,"Д.ХозяйственнаяОперация","Неопределено") +",
		|	"+?(Не Док.Реквизиты.Найти("Автор") = Неопределено,"Д.Автор","Неопределено") +",
		|	Д.Дата
		|
		//|ИНДЕКСИРОВАТЬ ПО
		//|	ТипДокумента
		|");
	
	КонецЦикла;
	
	Разделитель = 
	"
	|;
	|/////////////////////////////////////////////////////////////
	|";
	ТекстЗапроса = СтрСоединить(ТекстыЗапроса, Разделитель);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", ОкончаниеПериода);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ЗаполнитьСтрокиРекурсивно(СтруктураСерииДерево, ОбластьСтрока, Уровень, ДокументРезультат)

	Для каждого СтрокаДерева Из СтруктураСерииДерево.Строки Цикл
		
//#Удаление
//		ПараметрыОбласти = Новый Структура("Номенклатура,Серия,НоменклатураПредставление,
//		|СерияПредставление,ЕдиницаИзмерения,Израсходовано");
//#КонецУдаления
//#Вставка
		ПараметрыОбласти = Новый Структура("НоменклатураКод,Номенклатура,Серия,НоменклатураПредставление,
		|СерияПредставление,ЕдиницаИзмерения,Израсходовано");
//#КонецВставки
		ЗаполнитьЗначенияСвойств(ПараметрыОбласти, СтрокаДерева);
		
		СтруктураРасшифровки = Новый Структура("Номенклатура,Характеристика,Серия");
		ЗаполнитьЗначенияСвойств(СтруктураРасшифровки, СтрокаДерева);
		ПараметрыОбласти.Вставить("СтруктураРасшифровки", СтруктураРасшифровки);
		
		ОбластьСтрока.Параметры.Заполнить(ПараметрыОбласти);
		ДокументРезультат.Вывести(ОбластьСтрока, Уровень,, Истина);
		
		ЗаполнитьСтрокиРекурсивно(СтрокаДерева, ОбластьСтрока, Уровень + 1, ДокументРезультат);
		
	КонецЦикла; 
	
КонецПроцедуры

Функция ЛимитСтрок()
	Возврат 100000;
КонецФункции
	
#КонецОбласти

#КонецЕсли