
&ИзменениеИКонтроль("ПредставлениеНомераОбъектаУчета")
Функция vs_ПредставлениеНомераОбъектаУчета(Номер)

	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПрефиксацияОбъектов") Тогда
		МодульПрефиксацияОбъектовКлиентСервер = ОбщегоНазначения.ОбщийМодуль("ПрефиксацияОбъектовКлиентСервер");
#Удаление
		Возврат МодульПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Номер);
#КонецУдаления
#Вставка
		Возврат МодульПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Номер,Истина,Истина);
#КонецВставки
	КонецЕсли;

	Возврат Номер;

КонецФункции
