////////////////////////////////////////////////////////////////////////////////
//
// ЗатратыСервер: Распределение производственных затрат и затрат незавершенного производства.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Процедура проверяет дату документа на соответствие дате перехода на партионный учет версии 2.2.
// Проверка выполняется для документов нового производства.
//
// Параметры:
//	Объект - ДокументОбъект.ЭтапПроизводства2_2, ДокументОбъект.ДвижениеПродукцииИМатериалов - проверяемый документ,
//	Дата - Дата - дата, на которую выполняется проверка,
//	Отказ - Булево - устанавливается в ИСТИНА, если дата перехода на новый партионный учет больше переданной даты.
//
Процедура ПроверитьИспользованиеПартионногоУчета22(Объект, Дата, Отказ) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("БазоваяВерсия")
		И (Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию
		Или Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОтКомиссионера
		Или Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеНедостачЗаСчетКомитента
		Или Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОприходованиеИзлишковТоваровВПользуКомитента) Тогда
		Возврат;
	КонецЕсли;
	
	ДатаПереходаНаПартионныйУчетВерсии22 = РасчетСебестоимостиПовтИсп.ДатаПереходаНаПартионныйУчетВерсии22();
	
	ТекстОшибки = Неопределено;
	
	Если НЕ РасчетСебестоимостиПовтИсп.ПартионныйУчетВерсии22() Тогда
		
		ТекстОшибки = НСтр("ru='Для операций, доступных с версии 2.2, требуется установить соответствующий режим партионного учета.'");
		
	ИначеЕсли ДатаПереходаНаПартионныйУчетВерсии22 > НачалоМесяца(Дата) Тогда
		
		ТекстОшибки = НСтр("ru='Регистрация операций, доступных с версии 2.2, раньше даты перехода на партионный учет версии 2.2 недоступна.
								|Требуется изменить дату операции (%1) или дату перехода на партионный учет 2.2 (%2).'");
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ТекстОшибки,
			Формат(Дата, "ДЛФ=D"),
			Формат(ДатаПереходаНаПартионныйУчетВерсии22, "ДЛФ=D"));
			
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Объект,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры

//++ НЕ УТ

// Устанавливает параметры выбора для правила распределения в зависимости от способа учета производственных затрат.
//
// Параметры:
//	Подразделение - СправочникСсылка.СтруктураПредприятия - подразделение, в котором выполняется распределение
//	ВариантРаспределения - ПеречислениеСсылка.СпособыРаспределенияСтатейРасходов - вариант распределения
//	ЭлементПравилоРаспределения - ПолеФормы - Поле для ввода правила распределения
//	Назначение - СправочникСсылка.Назначения - Назначение расхода.
//
Процедура НастроитьПараметрыВыбораПравилРаспределения(Подразделение, ВариантРаспределения, ЭлементПравилоРаспределения, Назначение) Экспорт
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.НазначениеПравила", Назначение));
	
	Если ЗначениеЗаполнено(Подразделение)
		И (ВариантРаспределения = Перечисления.СпособыРаспределенияСтатейРасходов.ПоЭтапамПоПравилуВДанномПодразделении Или ВариантРаспределения = Неопределено) Тогда
		
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Подразделение, "ПроизводствоПоЗаказам, ИспользуетсяСписаниеЗатратНаВыпуск");
		
		Если Не Реквизиты.ПроизводствоПоЗаказам И Не Реквизиты.ИспользуетсяСписаниеЗатратНаВыпуск Тогда
			
			МассивБазРаспределения = Новый Массив;
			МассивБазРаспределения.Добавить(Перечисления.ТипыБазыРаспределенияРасходов.КоличествоПродукции);
			МассивБазРаспределения.Добавить(Перечисления.ТипыБазыРаспределенияРасходов.ВесПродукции);
			МассивБазРаспределения.Добавить(Перечисления.ТипыБазыРаспределенияРасходов.ОбъемПродукции);
			МассивБазРаспределения.Добавить(Перечисления.ТипыБазыРаспределенияРасходов.ПлановаяСтоимостьПродукции);
			МассивБазРаспределения.Добавить(Перечисления.ТипыБазыРаспределенияРасходов.КоличествоУказанныхМатериалов);
			МассивБазРаспределения.Добавить(Перечисления.ТипыБазыРаспределенияРасходов.ВесУказанныхМатериалов);
			МассивБазРаспределения.Добавить(Перечисления.ТипыБазыРаспределенияРасходов.ОбъемУказанныхМатериалов);
			МассивБазРаспределения.Добавить(Перечисления.ТипыБазыРаспределенияРасходов.НормативРасходаМатериала);
			МассивБазРаспределения.Добавить(Перечисления.ТипыБазыРаспределенияРасходов.КоличествоРаботУказанныхВидов);
			
			МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.БазаРаспределения", Новый ФиксированныйМассив(МассивБазРаспределения)));
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЭлементПравилоРаспределения.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
	
КонецПроцедуры

// Функция формирует таблицу выполненных этапов производства.
//
// Параметры:
//	Параметры - Структура - Структура передаваемых параметров:
//		* НачалоПериода - Дата - начало периода анализа этапов производства.
//		* ОкончаниеПериода - Дата - конец периода анализа этапов производства.
//		* Подразделение - СправочникСсылка.СтруктураПредприятия - отбор по подразделению.
//		* Назначение - СправочникСсылка.Назначения - отбор по назначению.
//		* ГруппаПродукции - СправочникСсылка.ГруппыАналитическогоУчетаНоменклатуры - отбор по группе продукции.
//		* ТолькоТекущийМесяц - Булево - признак получения этапов, выполнявшихся только в передеанном периоде.
//		* Заказ - ДокументСсылка.ЗаказНаПроизводство2_2 - отбор по заказу на производство.
//		* ИсключатьПроизводствоНаСтороне - Булево - не показывать этапы, выполняющиеся на стороне.
//
// Возвращаемое значение:
//	ТаблицаЗначений - таблица этапов производства.
//
Функция ЭтапыПроизводстваДляРаспределенияЗатрат(Параметры) Экспорт
	
	Запрос = Новый Запрос("
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Распоряжение.Распоряжение КАК ЗаказНаПроизводство,
	|	ДД.Распоряжение.КодСтроки КАК КодСтроки
	|ПОМЕСТИТЬ втВыпускиПродукции
	|ИЗ
	|	РегистрНакопления.ВыпускПродукции.Обороты(&ПериодНачало, &ПериодОкончание) КАК ДД
	|ГДЕ
	|	&ПартионныйУчетВерсии22
	|;
	|
	//++ Устарело_Переработка24
	|ВЫБРАТЬ
	|	Заказы.ЗаказПоставщику КАК ЗаказПоставщику,
	|	Заказы.Номенклатура КАК Номенклатура,
	|	Заказы.КодСтроки КАК КодСтроки,
	|	Заказы.КОформлениюНачальныйОстаток КАК НачальныйОстаток,
	|	Заказы.КОформлениюПриход КАК Приход
	|ПОМЕСТИТЬ ВТВТЗаказыПереработчикамВрем
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.ОстаткиИОбороты(&ПериодНачало,
	|									   &ПериодОкончание, , ,
	|									   ТИПЗНАЧЕНИЯ(ЗаказПоставщику) = ТИП(Документ.ЗаказПереработчику)
	|									   И (ЗаказПоставщику = &Заказ ИЛИ &ПоВсемЗаказам)) КАК Заказы
	|ГДЕ
	|	НЕ &ПартионныйУчетВерсии22
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Заказы.ЗаказПоставщику
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таб.ЗаказПоставщику,
	|	Таб.КодСтроки
	|
	|ПОМЕСТИТЬ ВТЗаказыПереработчикам
	|
	|ИЗ ВТВТЗаказыПереработчикамВрем КАК Таб
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПереработчику КАК ДокЗаказ
	|	ПО Таб.ЗаказПоставщику = ДокЗаказ.Ссылка
	|		И ДокЗаказ.Организация = &Организация
	|		И (ДокЗаказ.Подразделение = &Подразделение ИЛИ &ПоВсемПодразделениям)
	|		И (ДокЗаказ.Назначение = &Назначение ИЛИ &ПоВсемНазначениям)
	|		И (ДокЗаказ.Назначение.НаправлениеДеятельности = &НаправлениеДеятельности ИЛИ &ПоВсемНаправлениямДеятельности)
	|		И (&НеТолькоТекущийМесяц ИЛИ Таб.НачальныйОстаток = 0)
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|	ПО Таб.Номенклатура = СпрНоменклатура.Ссылка
	|		И (&ПоВсемГруппамПродукции ИЛИ СпрНоменклатура.ГруппаАналитическогоУчета = &ГруппаПродукции)
	|ГДЕ
	|	НЕ &ПартионныйУчетВерсии22
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Таб.ЗаказПоставщику,
	|	Таб.КодСтроки
	|
	|;
	//-- Устарело_Переработка24
	|/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Заказы.ЗаказПоставщику КАК ЗаказНаПроизводство,
	|	Заказы.КодСтроки КАК КодСтрокиПродукция,
	|	НЕОПРЕДЕЛЕНО КАК Этап,
	|	НЕОПРЕДЕЛЕНО КАК Спецификация,
	|	0 КАК ЗапланированоЗаказом,
	|	0 КАК Выполнено
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам КАК Заказы
	|ГДЕ
	|	ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|
	|	Заказы.ЗаказПоставщику,
	|	Заказы.КодСтроки
	//++ Устарело_Переработка24
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Заказы.ЗаказПоставщику КАК ЗаказНаПроизводство,
	|	Заказы.КодСтроки КАК КодСтрокиПродукция,
	|	НЕОПРЕДЕЛЕНО КАК Этап,
	|	НЕОПРЕДЕЛЕНО КАК Спецификация,
	|	СУММА(ВЫБОР 
	|				КОГДА Заказы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА Заказы.КОформлению
	|				ИНАЧЕ 0
	|			   КОНЕЦ) КАК ЗапланированоЗаказом,
	|	СУММА(ВЫБОР 
	|				КОГДА Заказы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА Заказы.КОформлению
	|				ИНАЧЕ 0
	|			   КОНЕЦ) КАК Выполнено
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам КАК Заказы
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗаказыПереработчикам КАК ВТЗаказы
	|	ПО Заказы.ЗаказПоставщику = ВТЗаказы.ЗаказПоставщику
	|		И Заказы.КодСтроки = ВТЗаказы.КодСтроки
	|		И (Заказы.Период >= &ПериодНачало)
	|		И (&НеТолькоТекущийМесяц
	|			ИЛИ Заказы.Период МЕЖДУ &ПериодНачало И &ПериодОкончание)
	|		И Заказы.Активность
	|ГДЕ
	|	НЕ &ПартионныйУчетВерсии22
	|
	|СГРУППИРОВАТЬ ПО
	|
	|	Заказы.ЗаказПоставщику,
	|	Заказы.КодСтроки
	//-- Устарело_Переработка24

	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказНаПроизводство");
	
	Назначение = Неопределено;
	НаправлениеДеятельности = Неопределено;
	Подразделение = Неопределено;
	ГруппаПродукции = Неопределено;
	Заказ = Неопределено;
	Параметры.Свойство("Назначение", Назначение);
	Параметры.Свойство("НаправлениеДеятельности", НаправлениеДеятельности);
	Параметры.Свойство("Подразделение", Подразделение);
	Параметры.Свойство("ГруппаПродукции", ГруппаПродукции);
	Параметры.Свойство("Заказ", Заказ);
	
	Запрос.УстановитьПараметр("ПериодНачало",	 Параметры.ПериодНачало);
	Запрос.УстановитьПараметр("ПериодОкончание", Параметры.ПериодОкончание);
	Запрос.УстановитьПараметр("Организация",     Параметры.Организация);
	Запрос.УстановитьПараметр("Назначение",       Назначение);
	Запрос.УстановитьПараметр("ПоВсемНазначениям", Не ЗначениеЗаполнено(Назначение));
	Запрос.УстановитьПараметр("НаправлениеДеятельности",        НаправлениеДеятельности);
	Запрос.УстановитьПараметр("ПоВсемНаправлениямДеятельности", Не ЗначениеЗаполнено(НаправлениеДеятельности));
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("ПоВсемПодразделениям", Не ЗначениеЗаполнено(Подразделение));
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("ПоВсемЗаказам", Не ЗначениеЗаполнено(Заказ));
	Запрос.УстановитьПараметр("ГруппаПродукции", ГруппаПродукции);
	Запрос.УстановитьПараметр("ПоВсемГруппамПродукции", Не ЗначениеЗаполнено(ГруппаПродукции));
	Запрос.УстановитьПараметр("НеТолькоТекущийМесяц", НЕ Параметры.ТолькоТекущийМесяц);
	Запрос.УстановитьПараметр("ПартионныйУчетВерсии22", Параметры.ПартионныйУчетВерсии22);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

//++ Устарело_Производство21

// Процедура используется для выполнения регламентного задания по формированию документов
// "Списание затрат на выпуск".
Процедура СписатьЗатратыНаВыпуск() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.СписаниеЗатратНаВыпуск);
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьПроизводство") Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьБлокировкуВходящихДанныхПриОбновленииИБ(НСтр("ru='Списание затрат на выпуск без заказов'"));
	
	Документы.СписаниеЗатратНаВыпуск.ДокументыПоПараметрам(Новый Структура, , Истина);
	
КонецПроцедуры
//-- Устарело_Производство21

// Функция формирует таблицу партий производства.
//
// Параметры:
//	Отборы - Структура - Структура передаваемых параметров:
//		* НачалоПериода - Дата - начало периода анализа этапов производства.
//		* ОкончаниеПериода - Дата - конец периода анализа этапов производства.
//		* Организация - СправочникСсылка.Организации, Массив из СправочникСсылка.Организации - отбор по организации. Может отсутствовать.
//		* НаправлениеДеятельности - СправочникСсылка.НаправленияДеятельности - отбор по направлению деятельности. Может отсутствовать.
//		* Подразделение - СправочникСсылка.СтруктураПредприятия - отбор по подразделению. Может отсутствовать.
//		* Назначение - СправочникСсылка.Назначения - отбор по назначению. Может отсутствовать.
//		* ТолькоТекущийМесяц - Булево - признак получения этапов, выполнявшихся только в передеанном периоде.
//		* ДетализироватьПоЭтапам - Булево - детализировать по промежуточным этапам или по продукции. Может отсутствовать.
//		* ЗаказНаПроизводство - ДокументСсылка.ЗаказНаПроизводство2_2 - отбор по заказу на производство. Может отсутствовать.
//		* ИсключатьПроизводствоНаСтороне - Булево - не показывать этапы, выполняющиеся на стороне. Может отсутствовать.
//
// Возвращаемое значение:
//	ТаблицаЗначений - таблица партий производства.
//
Функция ПартииПроизводстваДляРаспределенияЗатрат(Отборы) Экспорт
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Организация = Неопределено;
	Отборы.Свойство("Организация", Организация);
	
	
	ТекстыЗапроса = Новый Массив;
	
	
	ТекстыЗапроса.Добавить(
	"
	// Партии производства без заказа
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокумента.Организация								КАК Организация,
	|	СпрПартииПроизводства.Ссылка							КАК ПартияПроизводства,
	|	ДанныеДокумента.Подразделение							КАК Подразделение,
	|	ДанныеДокумента.Ссылка									КАК Этап,
	|	СпрПартииПроизводства.ОсновноеИзделиеНоменклатура		КАК Номенклатура,
	|	СпрПартииПроизводства.ОсновноеИзделиеХарактеристика	КАК Характеристика,
	|	СпрПартииПроизводства.Спецификация						КАК Спецификация,
	|	СпрПартииПроизводства.Назначение						КАК Назначение,
	|	СпрПартииПроизводства.НаправлениеДеятельности			КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО											КАК ЗаказНаПроизводство,
	|	ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода КАК ЭтапТекущегоМесяца,
	|	ЛОЖЬ													КАК ПроизводствоНаСтороне
	|ПОМЕСТИТЬ ВтЭтапы
	|ИЗ
	|	Документ.ПроизводствоБезЗаказа КАК ДанныеДокумента
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа.ВыходныеИзделия КАК ТаблицаВыходныеИзделия
	|	ПО ТаблицаВыходныеИзделия.Ссылка = ДанныеДокумента.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|	ПО СпрПартииПроизводства.Документ = ТаблицаВыходныеИзделия.Ссылка
	|	И СпрПартииПроизводства.Код = ТаблицаВыходныеИзделия.НомерГруппыЗатрат
	|	И НЕ СпрПартииПроизводства.ПометкаУдаления
	|	
	// Исключаем документы по которым введена корректировка или сторнирование в текущем периоде
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК Реестр
	|	ПО Реестр.СторнируемыйДокумент = ДанныеДокумента.Ссылка
	|	И Реестр.СторноИсправление
	|	И Реестр.ДатаДокументаИБ <= КОНЕЦПЕРИОДА(ДанныеДокумента.Дата, МЕСЯЦ)
	|	И Реестр.Проведен
	|
	|ГДЕ
	|	(&ПоВсемОрганизациям
	|		ИЛИ ДанныеДокумента.Организация В(&Организация))
	|	И ДанныеДокумента.Проведен
	|	И ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И КОНЕЦПЕРИОДА(ДобавитьКДате(&ОкончаниеПериода, МЕСЯЦ, 1), МЕСЯЦ)
	// Исключаем документы по которым введена корректировка или сторнирование в текущем периоде
	|	И Реестр.Ссылка ЕСТЬ NULL
	|	И &ВсеЗаказыНаПроизводство
	|	И (&ВсеПодразделения ИЛИ ДанныеДокумента.Подразделение = &Подразделение)
	|	И (&ЭтапыЗаВесьПериод ИЛИ ДанныеДокумента.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода)
	|	И (&ВсеНазначения ИЛИ СпрПартииПроизводства.Назначение = &Назначение)
	|	И (&ВсеНаправленияДеятельности ИЛИ СпрПартииПроизводства.НаправлениеДеятельности = &НаправлениеДеятельности)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДокумента.Организация,
	|	ДанныеДокумента.Ссылка,
	|	СпрПартииПроизводства.Ссылка,
	|	СпрПартииПроизводства.Номенклатура,
	|	СпрПартииПроизводства.Характеристика,
	|	СпрПартииПроизводства.Спецификация,
	|	СпрПартииПроизводства.Назначение,
	|	СпрПартииПроизводства.НаправлениеДеятельности
	|
	//++ Устарело_Переработка24
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Реквизиты.Организация								КАК Организация,
	|	СпрПартииПроизводства.Ссылка						КАК ПартияПроизводства,
	|	Реквизиты.Подразделение								КАК Подразделение,
	|	Реквизиты.Ссылка									КАК Этап,
	|	СпрПартииПроизводства.ОсновноеИзделиеНоменклатура	КАК Номенклатура,
	|	СпрПартииПроизводства.ОсновноеИзделиеХарактеристика	КАК Характеристика,
	|	СпрПартииПроизводства.Спецификация					КАК Спецификация,
	|	СпрПартииПроизводства.Назначение					КАК Назначение,
	|	СпрПартииПроизводства.НаправлениеДеятельности		КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО										КАК ЗаказНаПроизводство,
	|	ИСТИНА												КАК ЭтапТекущегоМесяца,
	|	ИСТИНА												КАК ПроизводствоНаСтороне
	|ИЗ
	|	Документ.ОтчетПереработчика КАК Реквизиты
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетПереработчика.Продукция КАК ТаблицаТовары
	|	ПО Реквизиты.Ссылка = ТаблицаТовары.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|	ПО СпрПартииПроизводства.Документ = ТаблицаТовары.Ссылка
	|	И СпрПартииПроизводства.Код = ТаблицаТовары.НомерГруппыЗатрат
	|	И НЕ СпрПартииПроизводства.ПометкаУдаления
	|
	|ГДЕ
	|	(&ПоВсемОрганизациям
	|		ИЛИ Реквизиты.Организация В(&Организация))
	|	И Реквизиты.Проведен
	|	И Реквизиты.ГруппировкаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоЭтапамПроизводства)
	|	И Реквизиты.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|	И &ВсеЗаказыНаПроизводство
	|	И (&ВсеПодразделения ИЛИ Реквизиты.Подразделение = &Подразделение)
	|	И (&ВсеНазначения ИЛИ СпрПартииПроизводства.Назначение = &Назначение)
	|	И (&ВсеНаправленияДеятельности ИЛИ СпрПартииПроизводства.НаправлениеДеятельности = &НаправлениеДеятельности)
	|	И (НЕ &ИсключатьПроизводствоНаСтороне)
	|
	|СГРУППИРОВАТЬ ПО
	|	Реквизиты.Ссылка,
	|	СпрПартииПроизводства.Ссылка,
	|	СпрПартииПроизводства.Номенклатура,
	|	СпрПартииПроизводства.Характеристика,
	|	СпрПартииПроизводства.Спецификация,
	|	СпрПартииПроизводства.Назначение,
	|	СпрПартииПроизводства.НаправлениеДеятельности
	//-- Устарело_Переработка24
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Реквизиты.Организация								КАК Организация,
	|	СпрПартииПроизводства.Ссылка						КАК ПартияПроизводства,
	|	Реквизиты.Подразделение								КАК Подразделение,
	|	Реквизиты.Ссылка									КАК Этап,
	|	СпрПартииПроизводства.ОсновноеИзделиеНоменклатура	КАК Номенклатура,
	|	СпрПартииПроизводства.ОсновноеИзделиеХарактеристика	КАК Характеристика,
	|	СпрПартииПроизводства.Спецификация					КАК Спецификация,
	|	СпрПартииПроизводства.Назначение					КАК Назначение,
	|	СпрПартииПроизводства.НаправлениеДеятельности		КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО										КАК ЗаказНаПроизводство,
	|	ИСТИНА												КАК ЭтапТекущегоМесяца,
	|	ИСТИНА												КАК ПроизводствоНаСтороне
	|ИЗ
	|	Документ.ОтчетПереработчика2_5 КАК Реквизиты
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетПереработчика2_5.ВыходныеИзделия КАК ТаблицаТовары
	|	ПО Реквизиты.Ссылка = ТаблицаТовары.Ссылка
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|	ПО СпрПартииПроизводства.Документ = ТаблицаТовары.Ссылка
	|	И СпрПартииПроизводства.Код = ТаблицаТовары.НомерГруппыЗатрат
	|	И НЕ СпрПартииПроизводства.ПометкаУдаления
	|
	|ГДЕ
	|	(&ПоВсемОрганизациям
	|		ИЛИ Реквизиты.Организация В(&Организация))
	|	И Реквизиты.Проведен
	|	И Реквизиты.ГруппировкаЗатрат <> ЗНАЧЕНИЕ(Перечисление.ГруппировкиЗатратВЗаказеПереработчику.ПоЭтапамПроизводства)
	|	И Реквизиты.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|	И &ВсеЗаказыНаПроизводство
	|	И (&ВсеПодразделения ИЛИ Реквизиты.Подразделение = &Подразделение)
	|	И (&ВсеНазначения ИЛИ СпрПартииПроизводства.Назначение = &Назначение)
	|	И (&ВсеНаправленияДеятельности ИЛИ СпрПартииПроизводства.НаправлениеДеятельности = &НаправлениеДеятельности)
	|	И (НЕ &ИсключатьПроизводствоНаСтороне)
	|
	|СГРУППИРОВАТЬ ПО
	|	Реквизиты.Ссылка,
	|	СпрПартииПроизводства.Ссылка,
	|	СпрПартииПроизводства.Номенклатура,
	|	СпрПартииПроизводства.Характеристика,
	|	СпрПартииПроизводства.Спецификация,
	|	СпрПартииПроизводства.Назначение,
	|	СпрПартииПроизводства.НаправлениеДеятельности
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЭтапТекущегоМесяца,
	|	Подразделение,
	|	Назначение,
	|	НаправлениеДеятельности
	|");
	
	
	ТекстыЗапроса.Добавить(
	"ВЫБРАТЬ
	|	ВтЭтапы.Организация                    КАК Организация,
	|	ВтЭтапы.ПартияПроизводства             КАК ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА &ТекстСтатусЗавершена
	|	КОНЕЦ                                  КАК Статус,
	|	ВтЭтапы.Подразделение                  КАК Подразделение,
	|	ВтЭтапы.Этап                           КАК Этап,
	|	ВтЭтапы.Номенклатура                   КАК Номенклатура,
	|	ВтЭтапы.Характеристика                 КАК Характеристика,
	|	ВтЭтапы.Спецификация                   КАК Спецификация,
	|	ВтЭтапы.Назначение                     КАК Назначение,
	|	ВтЭтапы.НаправлениеДеятельности        КАК НаправлениеДеятельности,
	|	ВтЭтапы.ЗаказНаПроизводство            КАК ЗаказНаПроизводство,
	|	ВтЭтапы.ЭтапТекущегоМесяца             КАК ЭтапТекущегоМесяца
	|ИЗ
	|	ВтЭтапы КАК ВтЭтапы
	|	
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтЭтапы.Организация,
	|	ВтЭтапы.Характеристика,
	|	ВтЭтапы.ПартияПроизводства,
	|	ВтЭтапы.Этап,
	|	ВтЭтапы.ЭтапТекущегоМесяца,
	|	ВтЭтапы.Спецификация,
	|	ВтЭтапы.Номенклатура,
	|	ВтЭтапы.Назначение,
	|	ВтЭтапы.НаправлениеДеятельности,
	|	ВтЭтапы.ЗаказНаПроизводство,
	|	ВтЭтапы.Подразделение
	|");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = СтрСоединить(ТекстыЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	Подразделение       = Неопределено;
	Назначение          = Неопределено;
	ЗаказНаПроизводство = Неопределено;

	НаправлениеДеятельности = Неопределено;
	ИсключатьПроизводствоНаСтороне = Отборы.Свойство("ИсключатьПроизводствоНаСтороне") И Отборы.ИсключатьПроизводствоНаСтороне;
	
	Отборы.Свойство("Подразделение",           Подразделение);
	Отборы.Свойство("Назначение",              Назначение);

	Отборы.Свойство("ЗаказНаПроизводство",     ЗаказНаПроизводство);
	Отборы.Свойство("НаправлениеДеятельности", НаправлениеДеятельности);
	
	Запрос.УстановитьПараметр("НачалоПериода",                Отборы.НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода",             Отборы.ОкончаниеПериода);
	
	Запрос.УстановитьПараметр("Организация",                  Организация);
	Запрос.УстановитьПараметр("ПоВсемОрганизациям",           Не ЗначениеЗаполнено(Организация));
	
	Запрос.УстановитьПараметр("Подразделение",                Подразделение);
	Запрос.УстановитьПараметр("ВсеПодразделения",             Не ЗначениеЗаполнено(Подразделение));
	
	Запрос.УстановитьПараметр("Назначение",                   Назначение);
	Запрос.УстановитьПараметр("ВсеНазначения",                Не ЗначениеЗаполнено(Назначение));

	Запрос.УстановитьПараметр("ЗаказНаПроизводство",          ЗаказНаПроизводство);
	Запрос.УстановитьПараметр("ВсеЗаказыНаПроизводство",      Не ЗначениеЗаполнено(ЗаказНаПроизводство));
	
	Запрос.УстановитьПараметр("НаправлениеДеятельности",      НаправлениеДеятельности);
	Запрос.УстановитьПараметр("ВсеНаправленияДеятельности",   Не ЗначениеЗаполнено(НаправлениеДеятельности));
	
	Запрос.УстановитьПараметр("ДетализироватьПоЭтапам",       Отборы.ДетализироватьПоЭтапам);
	Запрос.УстановитьПараметр("ЭтапыЗаВесьПериод",            Не Отборы.ТолькоТекущийМесяц);
	
	Запрос.УстановитьПараметр("ИсключатьПроизводствоНаСтороне", ИсключатьПроизводствоНаСтороне);
	
	
	Запрос.УстановитьПараметр("ТекстСтатусЗавершена", Справочники.ПартииПроизводства.ТекстСтатусаЗавершена());
	Запрос.УстановитьПараметр("ТекстСтатусВРаботе",   Справочники.ПартииПроизводства.ТекстСтатусаВРаботе());
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции


// Процедура заполняет характеристики основного изделия в коллекции для партии производства.
//
// Параметры:
//	Коллекция - ТаблицаЗначений - Таблица, в которой необходимо заполнить характеристики основного изделия.
//
Процедура ЗаполнитьХарактеристикиИзделийПоПартииПроизводства(Коллекция) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Коллекция.НомерСтроки,
	|	Коллекция.ПартияПроизводства
	|ПОМЕСТИТЬ Коллекция
	|ИЗ
	|	&Коллекция КАК Коллекция
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Коллекция.НомерСтроки									КАК Индекс,
	|	СпрПартииПроизводства.ОсновноеИзделиеНоменклатура		КАК Номенклатура,
	|	СпрПартииПроизводства.ОсновноеИзделиеХарактеристика		КАК Характеристика,
	|	СпрПартииПроизводства.Спецификация						КАК Спецификация,
	|	СпрПартииПроизводства.Назначение						КАК Назначение
	|ИЗ
	|	Коллекция КАК Коллекция
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = Коллекция.ПартияПроизводства
	|
	|УПОРЯДОЧИТЬ ПО
	|	Индекс");
	
	Запрос.УстановитьПараметр("Коллекция",	Коллекция.Выгрузить(, "НомерСтроки, ПартияПроизводства"));
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Для Номер = 0 По Коллекция.Количество() - 1 Цикл
		Выборка.Следующий(); // Количество строк в выборке по запросу всегда равно количеству строк в ТЧ
		ЗаполнитьЗначенияСвойств(Коллекция[Номер], Выборка);
	КонецЦикла;
	
КонецПроцедуры

// Текст запроса производственные затраты ТМЦ.
// 
// Возвращаемое значение:
//  Структура -  Текст запроса и набор ресурсов:
// * ТекстЗапроса - Строка - Текст запроса
// * Ресурсы - Массив из Строка - Набор ресурсов запроса
Функция ТекстЗапросаПроизводственныеЗатратыТМЦ() Экспорт
	
	Если НЕ ПравоДоступа("Чтение", Метаданные.Справочники.ДоговорыКонтрагентов) Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	НЕОПРЕДЕЛЕНО КАК Ссылка
		|ПОМЕСТИТЬ ВТОтборДоговорыКонтрагентов";
		
	Иначе
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Т.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТОтборДоговорыКонтрагентов
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК Т
		|ГДЕ
		|	(Т.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПереработчиком2_5)
		|	ИЛИ Т.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПереработчиком2_5_ЕАЭС))
		|{ГДЕ 
		|	(Т.Организация) КАК Организация}
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка";
	
	КонецЕсли;
	
	ТекстЗапроса = ТекстЗапроса + "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|" + "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Т.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТОтборАналитикиНоменклатуры
	|ИЗ
	|	Справочник.КлючиАналитикиУчетаНоменклатуры КАК Т
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТОтборДоговорыКонтрагентов КАК Отбор
	|		ПО Т.Договор = Отбор.Ссылка
	|ГДЕ
	|	(Т.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
	|	ИЛИ (Т.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.ДоговорКонтрагента)
	|		И НЕ Отбор.Ссылка ЕСТЬ NULL)
	|	ИЛИ Т.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|	ИЛИ Т.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Партнер))
	|	И Т.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|	{ГДЕ
	|		Т.Характеристика КАК Характеристика,
	|		Т.Номенклатура КАК Номенклатура}
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	ДД.Склад КАК Склад,
	|	ДД.ПредварительноеПодразделение КАК ПредварительноеПодразделение,
	|	ДД.ЭтоСкладНеЦеховаяКладовая КАК ЭтоСкладНеЦеховаяКладовая
	|ПОМЕСТИТЬ СкладыПодразделения
	|ИЗ
	|	(ВЫБРАТЬ
	|		Т.Ссылка КАК Склад,
	|		Т.Подразделение КАК ПредварительноеПодразделение,
	|		НЕ Т.ЦеховаяКладовая КАК ЭтоСкладНеЦеховаяКладовая
	|	ИЗ
	|		Справочник.Склады КАК Т
	|	ГДЕ
	|		Т.ЦеховаяКладовая
	|	{ГДЕ
	|		Т.Подразделение КАК ПредварительноеПодразделение}
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Т.Ссылка КАК Склад,
	|		НЕОПРЕДЕЛЕНО КАК ПредварительноеПодразделение,
	|		ИСТИНА КАК ЭтоСкладНеЦеховаяКладовая
	|	ИЗ
	|		Справочник.Склады КАК Т
	|	ГДЕ
	|		НЕ Т.ЦеховаяКладовая
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Т.Ссылка КАК Склад,
	|		Т.Ссылка КАК ПредварительноеПодразделение,
	|		ЛОЖЬ КАК ЭтоСкладНеЦеховаяКладовая
	|	ИЗ
	|		Справочник.СтруктураПредприятия КАК Т
	|	{ГДЕ
	|		Т.Ссылка КАК ПредварительноеПодразделение}
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДД.АналитикаУчетаНоменклатуры.МестоХранения КАК Склад,
	|		НЕОПРЕДЕЛЕНО КАК ПредварительноеПодразделение,
	|		ЛОЖЬ КАК ЭтоСкладНеЦеховаяКладовая
	|	ИЗ
	|		РегистрНакопления.СебестоимостьТоваров.ОстаткиИОбороты(
	|			&НачалоПериода, 
	|			&ОкончаниеПериода, , , 
	|			АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Партнер)
	|			{Организация КАК Организация}
	|		) КАК ДД
	|	ГДЕ
	|		(ДД.КоличествоНачальныйОстаток <> 0
	|			ИЛИ ДД.КоличествоКонечныйОстаток <> 0
	|			ИЛИ ДД.КоличествоПриход <> 0
	|			ИЛИ ДД.КоличествоРасход <> 0)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДД.АналитикаУчетаНоменклатуры.МестоХранения КАК Склад,
	|		НЕОПРЕДЕЛЕНО КАК ПредварительноеПодразделение,
	|		ЛОЖЬ КАК ЭтоСкладНеЦеховаяКладовая
	|	ИЗ
	|		РегистрНакопления.СебестоимостьТоваров.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&ОкончаниеПериода,,,
	|			АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.ДоговорКонтрагента)
	|			И АналитикаУчетаНоменклатуры.Договор В (ВЫБРАТЬ Отбор.Ссылка ИЗ ВТОтборДоговорыКонтрагентов КАК Отбор) 
	|			{Организация КАК Организация}
	|			) КАК ДД
	|	ГДЕ
	|		ДД.КоличествоНачальныйОстаток <> 0
	|			ИЛИ ДД.КоличествоКонечныйОстаток <> 0
	|			ИЛИ ДД.КоличествоПриход <> 0
	|			ИЛИ ДД.КоличествоРасход <> 0
	|	) КАК ДД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&Материалы											   КАК Таблица,
	|	ДД.Содержание                                          КАК Содержание,
	|	ДД.Организация                                         КАК Организация,
	|	ДД.Подразделение                                       КАК Подразделение,
	|	ДД.Отправитель                                         КАК Отправитель,
	|	ДД.Получатель                                          КАК Получатель,
	|	ДД.СкладПодразделение                                  КАК СкладПодразделение,
	|	ДД.Регистратор                                         КАК Регистратор,
	|	ДД.АналитикаУчетаНоменклатуры                          КАК АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов                                          КАК ВидЗапасов,
	|	ДД.АналитикаФинансовогоУчета                           КАК АналитикаФинансовогоУчета,
	|	ДД.АналитикаУчетаПартий                                КАК АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС                                  КАК ВидДеятельностиНДС,
	|	ДД.Номенклатура                                        КАК Номенклатура,
	|	ДД.Характеристика                                      КАК Характеристика,
	|	ДД.Серия                                               КАК Серия,
	|	ДД.Назначение                                          КАК Назначение,
	|	ДД.НаправлениеДеятельности                             КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции                                   КАК СтатьяКалькуляции,
	|	ДД.Партия                                              КАК Партия,
	|	ДД.ПартияПроизводства                                  КАК ПартияПроизводства,
	|	ДД.ЗаказНаПроизводство                                 КАК ЗаказНаПроизводство,
	|	СУММА(ДД.НачальныйОстатокКоличество)                  КАК НачальныйОстатокКоличество,
	|	СУММА(ДД.НачальныйОстатокСтоимость)                   КАК НачальныйОстатокСтоимость,
	|	СУММА(ДД.НачальныйОстатокПР)                          КАК НачальныйОстатокПР,
	|	СУММА(ДД.НачальныйОстатокВР)                          КАК НачальныйОстатокВР,
	|	СУММА(ДД.НачальныйОстатокЗабалансовая)                КАК НачальныйОстатокЗабалансовая,
	|	СУММА(ДД.ПоступилоКоличество) КАК ПоступилоКоличество,
	|	СУММА(ДД.ПоступилоСтоимость) КАК ПоступилоСтоимость,
	|	СУММА(ДД.ПоступилоПР) КАК ПоступилоПР,
	|	СУММА(ДД.ПоступилоВР) КАК ПоступилоВР,
	|	СУММА(ДД.ПоступилоЗабалансовая) КАК ПоступилоЗабалансовая,
	|	СУММА(ДД.ПриобретеноКоличество) КАК ПриобретеноКоличество,
	|	СУММА(ДД.ПриобретеноСтоимость) КАК ПриобретеноСтоимость,
	|	СУММА(ДД.ПриобретеноПР) КАК ПриобретеноПР,
	|	СУММА(ДД.ПриобретеноВР) КАК ПриобретеноВР,
	|	СУММА(ДД.ПриобретеноЗабалансовая) КАК ПриобретеноЗабалансовая,
	|	СУММА(ДД.ПеремещенияКоличество) КАК ПеремещенияКоличество,
	|	СУММА(ДД.ПеремещенияСтоимость) КАК ПеремещенияСтоимость,
	|	СУММА(ДД.ПеремещенияПР) КАК ПеремещенияПР,
	|	СУММА(ДД.ПеремещенияВР) КАК ПеремещенияВР,
	|	СУММА(ДД.ПеремещенияЗабалансовая) КАК ПеремещенияЗабалансовая,
	|	СУММА(ДД.ВключениеИсключениеНДС) КАК ВключениеИсключениеНДС,
	|	СУММА(ДД.ИзрасходованоНаПроизводствоКоличество) КАК ИзрасходованоНаПроизводствоКоличество,
	|	СУММА(ДД.ИзрасходованоНаПроизводствоСтоимость) КАК ИзрасходованоНаПроизводствоСтоимость,
	|	СУММА(ДД.ИзрасходованоНаПроизводствоПР) КАК ИзрасходованоНаПроизводствоПР,
	|	СУММА(ДД.ИзрасходованоНаПроизводствоВР) КАК ИзрасходованоНаПроизводствоВР,
	|	СУММА(ДД.ИзрасходованоНаПроизводствоЗабалансовая) КАК ИзрасходованоНаПроизводствоЗабалансовая,
	|	СУММА(ДД.СписаноКоличество) КАК СписаноКоличество,
	|	СУММА(ДД.СписаноСтоимость) КАК СписаноСтоимость,
	|	СУММА(ДД.СписаноПР) КАК СписаноПР,
	|	СУММА(ДД.СписаноВР) КАК СписаноВР,
	|	СУММА(ДД.СписаноЗабалансовая) КАК СписаноЗабалансовая,
	|	СУММА(ДД.КонечныйОстатокКоличество) КАК КонечныйОстатокКоличество,
	|	СУММА(ДД.КонечныйОстатокСтоимость) КАК КонечныйОстатокСтоимость,
	|	СУММА(ДД.КонечныйОстатокПР) КАК КонечныйОстатокПР,
	|	СУММА(ДД.КонечныйОстатокВР) КАК КонечныйОстатокВР,
	|	СУММА(ДД.КонечныйОстатокЗабалансовая) КАК КонечныйОстатокЗабалансовая,
	|	СУММА(ДД.ПереданоКоличество) КАК ПереданоКоличество,
	|	СУММА(ДД.ПереданоСтоимость) КАК ПереданоСтоимость,
	|	СУММА(ДД.ПереданоПР) КАК ПереданоПР,
	|	СУММА(ДД.ПереданоВР) КАК ПереданоВР,
	|	СУММА(ДД.ПереданоЗабалансовая) КАК ПереданоЗабалансовая,
	|	СУММА(ДД.ПроизведеноКоличество) КАК ПроизведеноКоличество,
	|	СУММА(ДД.ПроизведеноСтоимость) КАК ПроизведеноСтоимость,
	|	СУММА(ДД.ПроизведеноПР) КАК ПроизведеноПР,
	|	СУММА(ДД.ПроизведеноВР) КАК ПроизведеноВР,
	|	СУММА(ДД.ПроизведеноЗабалансовая) КАК ПроизведеноЗабалансовая
	|{ВЫБРАТЬ
	|Таблица,
	|Содержание,
	|Организация.*,
	|Подразделение.*,
	|Отправитель.*,
	|Получатель.*,
	|СкладПодразделение.*,
	|Регистратор.*,
	|АналитикаУчетаНоменклатуры.*,
	|ВидЗапасов.*,
	|АналитикаФинансовогоУчета.*,
	|АналитикаУчетаПартий.*,
	|ВидДеятельностиНДС.*,
	|Номенклатура.*,
	|Характеристика.*,
	|Серия.*,
	|Назначение.*,
	|НаправлениеДеятельности.*,
	|СтатьяКалькуляции.*,
	|Партия.*,
	|ПартияПроизводства.*,
	|ЗаказНаПроизводство.*,
	|НачальныйОстатокКоличество,
	|НачальныйОстатокСтоимость,
	|НачальныйОстатокПР,
	|НачальныйОстатокВР,
	|НачальныйОстатокЗабалансовая,
	|ПоступилоКоличество,
	|ПоступилоСтоимость,
	|ПоступилоПР,
	|ПоступилоВР,
	|ПоступилоЗабалансовая,
	|ПриобретеноКоличество,
	|ПриобретеноСтоимость,
	|ПриобретеноПР,
	|ПриобретеноВР,
	|ПриобретеноЗабалансовая,
	|ПеремещенияКоличество,
	|ПеремещенияСтоимость,
	|ПеремещенияПР,
	|ПеремещенияВР,
	|ПеремещенияЗабалансовая,
	|ВключениеИсключениеНДС,
	|ИзрасходованоНаПроизводствоКоличество,
	|ИзрасходованоНаПроизводствоСтоимость,
	|ИзрасходованоНаПроизводствоПР,
	|ИзрасходованоНаПроизводствоВР,
	|ИзрасходованоНаПроизводствоЗабалансовая,
	|СписаноКоличество,
	|СписаноСтоимость,
	|СписаноПР,
	|СписаноВР,
	|СписаноЗабалансовая,
	|КонечныйОстатокКоличество,
	|КонечныйОстатокСтоимость,
	|КонечныйОстатокПР,
	|КонечныйОстатокВР,
	|КонечныйОстатокЗабалансовая,
	|ПереданоКоличество,
	|ПереданоСтоимость,
	|ПереданоПР,
	|ПереданоВР,
	|ПереданоЗабалансовая,
	|ПроизведеноКоличество,
	|ПроизведеноСтоимость,
	|ПроизведеноПР,
	|ПроизведеноВР,
	|ПроизведеноЗабалансовая}
	|ИЗ
	|
	|(ВЫБРАТЬ
	|	&НачальныйОстаток                                      КАК Содержание,
	|	ДД.Организация                                         КАК Организация,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Аналитика.МестоХранения) = ТИП(Справочник.Склады)
	|				И СкладыПодразделения.ЭтоСкладНеЦеховаяКладовая
	|				И ДД.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|			ТОГДА Аналитика.Назначение.Договор.Подразделение
	|		ИНАЧЕ СкладыПодразделения.ПредварительноеПодразделение
	|	КОНЕЦ                                                  КАК Подразделение,
	|	НЕОПРЕДЕЛЕНО                                           КАК Отправитель,
	|	НЕОПРЕДЕЛЕНО                                           КАК Получатель,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Аналитика.МестоХранения) = ТИП(Справочник.Склады)
	|		 И НЕ Аналитика.МестоХранения.ЦеховаяКладовая
	|		 И ДД.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|			ТОГДА ДД.ВидЗапасов.Договор.Подразделение
	|		ИНАЧЕ Аналитика.МестоХранения
	|	КОНЕЦ                                                  КАК СкладПодразделение,
	|	НЕОПРЕДЕЛЕНО                                           КАК Регистратор,
	|	ДД.АналитикаУчетаНоменклатуры                          КАК АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов                                          КАК ВидЗапасов,
	|	ДД.АналитикаФинансовогоУчета                           КАК АналитикаФинансовогоУчета,
	|	ДД.АналитикаУчетаПартий                                КАК АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС                                  КАК ВидДеятельностиНДС,
	|	Аналитика.Номенклатура                                 КАК Номенклатура,
	|	Аналитика.Характеристика                               КАК Характеристика,
	|	Аналитика.Серия                                        КАК Серия,
	|	Аналитика.Назначение                                   КАК Назначение,
	|	Аналитика.Назначение.НаправлениеДеятельности           КАК НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции                            КАК СтатьяКалькуляции,
	|	ДД.Партия                                              КАК Партия,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ                                                  КАК ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ                                                  КАК ЗаказНаПроизводство,
	|	ДД.КоличествоОстаток                                   КАК НачальныйОстатокКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток + ДД.ДопРасходыОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеСНДСОстаток + ДД.ПостатейныеПеременныеСНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДСОстаток + ДД.ДопРасходыБезНДСОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеБезНДСОстаток + ДД.ПостатейныеПеременныеБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпрОстаток + ДД.ДопРасходыУпрОстаток + ДД.ТрудозатратыУпрОстаток + ДД.ПостатейныеПостоянныеУпрОстаток + ДД.ПостатейныеПеременныеУпрОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток + ДД.ДопРасходыРеглОстаток + ДД.ТрудозатратыРеглОстаток + ДД.ПостатейныеПостоянныеРеглОстаток + ДД.ПостатейныеПеременныеРеглОстаток
	|		ИНАЧЕ	
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДСОстаток + ДД.ДопРасходыБезНДСОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеБезНДСОстаток + ДД.ПостатейныеПеременныеБезНДСОстаток
	|			ИНАЧЕ
	|				ДД.СтоимостьУпрОстаток + ДД.ДопРасходыУпрОстаток + ДД.ТрудозатратыУпрОстаток + ДД.ПостатейныеПостоянныеУпрОстаток + ДД.ПостатейныеПеременныеУпрОстаток
	|			КОНЕЦ
	|	КОНЕЦ                                                  КАК НачальныйОстатокСтоимость,
	|	ДД.ПостояннаяРазницаОстаток                            КАК НачальныйОстатокПР,
	|	ДД.ВременнаяРазницаОстаток                             КАК НачальныйОстатокВР,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансоваяОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРеглОстаток
	|	КОНЕЦ                                                  КАК НачальныйОстатокЗабалансовая,
	|	0 КАК ПоступилоКоличество,
	|	0 КАК ПоступилоСтоимость,
	|	0 КАК ПоступилоПР,
	|	0 КАК ПоступилоВР,
	|	0 КАК ПоступилоЗабалансовая,
	|	0 КАК ПриобретеноКоличество,
	|	0 КАК ПриобретеноСтоимость,
	|	0 КАК ПриобретеноПР,
	|	0 КАК ПриобретеноВР,
	|	0 КАК ПриобретеноЗабалансовая,
	|	0 КАК ПеремещенияКоличество,
	|	0 КАК ПеремещенияСтоимость,
	|	0 КАК ПеремещенияПР,
	|	0 КАК ПеремещенияВР,
	|	0 КАК ПеремещенияЗабалансовая,
	|	0 КАК ВключениеИсключениеНДС,
	|	0 КАК ИзрасходованоНаПроизводствоКоличество,
	|	0 КАК ИзрасходованоНаПроизводствоСтоимость,
	|	0 КАК ИзрасходованоНаПроизводствоПР,
	|	0 КАК ИзрасходованоНаПроизводствоВР,
	|	0 КАК ИзрасходованоНаПроизводствоЗабалансовая,
	|	0 КАК СписаноКоличество,
	|	0 КАК СписаноСтоимость,
	|	0 КАК СписаноПР,
	|	0 КАК СписаноВР,
	|	0 КАК СписаноЗабалансовая,
	|	0 КАК КонечныйОстатокКоличество,
	|	0 КАК КонечныйОстатокСтоимость,
	|	0 КАК КонечныйОстатокПР,
	|	0 КАК КонечныйОстатокВР,
	|	0 КАК КонечныйОстатокЗабалансовая,
	|	0 КАК ПереданоКоличество,
	|	0 КАК ПереданоСтоимость,
	|	0 КАК ПереданоПР,
	|	0 КАК ПереданоВР,
	|	0 КАК ПереданоЗабалансовая,
	|	0 КАК ПроизведеноКоличество,
	|	0 КАК ПроизведеноСтоимость,
	|	0 КАК ПроизведеноПР,
	|	0 КАК ПроизведеноВР,
	|	0 КАК ПроизведеноЗабалансовая
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(
	|			{(&НачалоПериода)},
	|			НЕ &БезОтбораПоПериоду
	|				И АналитикаУчетаНоменклатуры В (ВЫБРАТЬ Отбор.Ссылка ИЗ ВТОтборАналитикиНоменклатуры КАК Отбор)
	|					И НЕ РазделУчета В (
	|						ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию),
	|						ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссию)
	|					)
	|					И (АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад) 
	|						И (АналитикаУчетаНоменклатуры.МестоХранения.ЦеховаяКладовая 
	|							ИЛИ ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|							)
	|						ИЛИ АналитикаУчетаНоменклатуры.ТипМестаХранения <> ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
	|					)
	|			{(Организация) КАК Организация}) КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК СкладыПодразделения
	|		ПО (Аналитика.МестоХранения = СкладыПодразделения.Склад)
	|			И (СкладыПодразделения.ЭтоСкладНеЦеховаяКладовая
	|				И ДД.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|					ИЛИ НЕ СкладыПодразделения.ЭтоСкладНеЦеховаяКладовая)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ПоступилоСоСклада КАК Содержание,
	|	ВЫБОР
	|		КОГДА ДД.КорОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ДД.Организация
	|		ИНАЧЕ ДД.КорОрганизация
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(КорАналитика.МестоХранения) = ТИП(Справочник.Склады)
	|				И КорСкладыПодразделения.ЭтоСкладНеЦеховаяКладовая
	|				И ДД.КорВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|			ТОГДА КорАналитика.Назначение.Договор.Подразделение
	|		ИНАЧЕ КорСкладыПодразделения.ПредварительноеПодразделение
	|	КОНЕЦ,
	|	Аналитика.МестоХранения,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(КорАналитика.МестоХранения) = ТИП(Справочник.Склады)
	|		 И НЕ КорАналитика.МестоХранения.ЦеховаяКладовая
	|		 И ДД.КорВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|			ТОГДА ДД.КорВидЗапасов.Договор.Подразделение
	|		ИНАЧЕ КорАналитика.МестоХранения
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(КорАналитика.МестоХранения) = ТИП(Справочник.Склады)
	|		 И НЕ КорАналитика.МестоХранения.ЦеховаяКладовая
	|		 И ДД.КорВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|			ТОГДА ДД.КорВидЗапасов.Договор.Подразделение
	|		ИНАЧЕ КорАналитика.МестоХранения
	|	КОНЕЦ,
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.КорАналитикаУчетаНоменклатуры,
	|	ДД.КорВидЗапасов,
	|	ДД.КорАналитикаФинансовогоУчета,
	|	ДД.КорАналитикаУчетаПартий,
	|	ДД.КорВидДеятельностиНДС,
	|	КорАналитика.Номенклатура,
	|	КорАналитика.Характеристика,
	|	КорАналитика.Серия,
	|	КорАналитика.Назначение,
	|	КорАналитика.Назначение.НаправлениеДеятельности,
	|	КорАналитика.СтатьяКалькуляции,
	|	ДД.Партия,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	// Начальный остаток
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// Поступление
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.ПредварительноеПодразделение <> КорСкладыПодразделения.ПредварительноеПодразделение
	|				ИЛИ СкладыПодразделения.ПредварительноеПодразделение ЕСТЬ NULL
	|			ТОГДА ДД.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.ПредварительноеПодразделение <> КорСкладыПодразделения.ПредварительноеПодразделение
	|				ИЛИ СкладыПодразделения.ПредварительноеПодразделение ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеПоСебестоимости = 1
	|						ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|					КОГДА &ДанныеПоСебестоимости = 2
	|						ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|					КОГДА &ДанныеПоСебестоимости = 3
	|						ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|					КОГДА &ДанныеПоСебестоимости = 4
	|						ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|					ИНАЧЕ	
	|						ВЫБОР КОГДА &ПоПредприятию
	|							ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|						ИНАЧЕ
	|							ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.ПредварительноеПодразделение <> КорСкладыПодразделения.ПредварительноеПодразделение
	|				ИЛИ СкладыПодразделения.ПредварительноеПодразделение ЕСТЬ NULL
	|			ТОГДА ДД.ПостояннаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.ПредварительноеПодразделение <> КорСкладыПодразделения.ПредварительноеПодразделение
	|				ИЛИ СкладыПодразделения.ПредварительноеПодразделение ЕСТЬ NULL
	|			ТОГДА ДД.ВременнаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.ПредварительноеПодразделение <> КорСкладыПодразделения.ПредварительноеПодразделение
	|				ИЛИ СкладыПодразделения.ПредварительноеПодразделение ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеПоСебестоимости = 1
	|						ТОГДА 0
	|					КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|						ТОГДА СтоимостьЗабалансовая
	|					КОГДА &ДанныеПоСебестоимости = 4
	|						ТОГДА СтоимостьЗабалансоваяРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	// Приобретено
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// Перемещение
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.ПредварительноеПодразделение = КорСкладыПодразделения.ПредварительноеПодразделение
	|			И НЕ СкладыПодразделения.ПредварительноеПодразделение = НЕОПРЕДЕЛЕНО
	|			ТОГДА ДД.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.ПредварительноеПодразделение = КорСкладыПодразделения.ПредварительноеПодразделение
	|			И НЕ СкладыПодразделения.ПредварительноеПодразделение = НЕОПРЕДЕЛЕНО
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеПоСебестоимости = 1
	|						ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|					КОГДА &ДанныеПоСебестоимости = 2
	|						ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|					КОГДА &ДанныеПоСебестоимости = 3
	|						ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|					КОГДА &ДанныеПоСебестоимости = 4
	|						ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|					ИНАЧЕ	
	|						ВЫБОР КОГДА &ПоПредприятию
	|							ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|						ИНАЧЕ
	|							ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.ПредварительноеПодразделение = КорСкладыПодразделения.ПредварительноеПодразделение
	|			И НЕ СкладыПодразделения.ПредварительноеПодразделение = НЕОПРЕДЕЛЕНО
	|			И &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ПостояннаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.ПредварительноеПодразделение = КорСкладыПодразделения.ПредварительноеПодразделение
	|			И НЕ СкладыПодразделения.ПредварительноеПодразделение = НЕОПРЕДЕЛЕНО
	|			И &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ВременнаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СкладыПодразделения.ПредварительноеПодразделение = КорСкладыПодразделения.ПредварительноеПодразделение
	|			И НЕ СкладыПодразделения.ПредварительноеПодразделение = НЕОПРЕДЕЛЕНО
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеПоСебестоимости = 1
	|						ТОГДА 0
	|					КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|						ТОГДА ДД.СтоимостьЗабалансовая
	|					КОГДА &ДанныеПоСебестоимости = 4
	|						ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	// Включение/исключение НДС в стоимость
	|	0 КАК ВключениеИсключениеНДС,
	// Израсходовано на производство
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// Списано
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// Конечный остаток
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// Передано
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// Произведено
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитика
	|		ПО ДД.КорАналитикаУчетаНоменклатуры = КорАналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК КорСкладыПодразделения
	|		ПО (КорАналитика.МестоХранения = КорСкладыПодразделения.Склад)
	|			И (КорСкладыПодразделения.ЭтоСкладНеЦеховаяКладовая
	|				И ДД.КорВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|					ИЛИ НЕ КорСкладыПодразделения.ЭтоСкладНеЦеховаяКладовая)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК СкладыПодразделения
	|		ПО (Аналитика.МестоХранения = СкладыПодразделения.Склад)
	|			И (СкладыПодразделения.ЭтоСкладНеЦеховаяКладовая
	|				И ДД.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|					ИЛИ НЕ СкладыПодразделения.ЭтоСкладНеЦеховаяКладовая)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборАналитикиНоменклатуры КАК ОтборАналитики
	|		ПО ДД.КорАналитикаУчетаНоменклатуры = ОтборАналитики.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И Аналитика.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И (&ДанныеПоСебестоимости < 3 
	// При формировании отчета по организациям
	// Передача товара между организациями это Не перемещение, для передающей организации это продажа,
	// для принимающей организации это приобретение
	|		ИЛИ ДД.КорОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|		ИЛИ ДД.Организация = ДД.КорОрганизация
	|	)
	|	И (КорАналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад) 
	|		И (КорАналитика.МестоХранения.ЦеховаяКладовая 
	|			ИЛИ ДД.КорВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|			)
	|		ИЛИ КорАналитика.ТипМестаХранения <> ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
	|	)
	|{ГДЕ 
	|	ВЫБОР
	|		КОГДА ДД.КорОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ДД.Организация
	|		ИНАЧЕ ДД.КорОрганизация
	|	КОНЕЦ КАК Организация,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(КорАналитика.МестоХранения) = ТИП(Справочник.Склады)
	|				И КорСкладыПодразделения.ЭтоСкладНеЦеховаяКладовая
	|				И ДД.КорВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|			ТОГДА КорАналитика.Назначение.Договор.Подразделение
	|		ИНАЧЕ КорСкладыПодразделения.ПредварительноеПодразделение
	|	КОНЕЦ КАК Подразделение,
	|	КорАналитика.Номенклатура КАК Номенклатура,
	|	КорАналитика.Характеристика КАК Характеристика}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ПоступилоВНЗП КАК Содержание,
	|	ДД.Организация,
	|	КорСкладыПодразделения.ПредварительноеПодразделение,
	|	Аналитика.МестоХранения,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(КорАналитика.МестоХранения) = ТИП(Справочник.Склады)
	|		 И НЕ КорАналитика.МестоХранения.ЦеховаяКладовая
	|		 И ДД.КорВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|			ТОГДА ДД.КорВидЗапасов.Договор.Подразделение
	|		ИНАЧЕ КорАналитика.МестоХранения
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(КорАналитика.МестоХранения) = ТИП(Справочник.Склады)
	|		 И НЕ КорАналитика.МестоХранения.ЦеховаяКладовая
	|		 И ДД.КорВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|			ТОГДА ДД.КорВидЗапасов.Договор.Подразделение
	|		ИНАЧЕ КорАналитика.МестоХранения
	|	КОНЕЦ,
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.КорАналитикаУчетаНоменклатуры,
	|	ДД.КорВидЗапасов,
	|	ДД.КорАналитикаФинансовогоУчета,
	|	ДД.КорАналитикаУчетаПартий,
	|	ДД.КорВидДеятельностиНДС,
	|	КорАналитика.Номенклатура,
	|	КорАналитика.Характеристика,
	|	КорАналитика.Серия,
	|	КорАналитика.Назначение,
	|	КорАналитика.Назначение.НаправлениеДеятельности,
	|	КорАналитика.СтатьяКалькуляции,
	|	ДД.Партия,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	// Начальный остаток
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// Поступление
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|		ИНАЧЕ	
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА СтоимостьЗабалансоваяРегл
	|	КОНЕЦ,
	// Приобретено
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// Перемещение
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// Включение/исключение НДС в стоимость
	|	0 КАК ВключениеИсключениеНДС,
	// Израсходовано на производство
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|		ИНАЧЕ	
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА СтоимостьЗабалансоваяРегл
	|	КОНЕЦ,
	// Списано
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// Конечный остаток
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// Передано
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// Произведено
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитика
	|		ПО ДД.КорАналитикаУчетаНоменклатуры = КорАналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК КорСкладыПодразделения
	|		ПО (КорАналитика.МестоХранения = КорСкладыПодразделения.Склад)
	|			И (КорСкладыПодразделения.ЭтоСкладНеЦеховаяКладовая
	|				И ДД.КорВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|					ИЛИ НЕ КорСкладыПодразделения.ЭтоСкладНеЦеховаяКладовая)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК СкладыПодразделения
	|		ПО (Аналитика.МестоХранения = СкладыПодразделения.Склад)
	|			И (СкладыПодразделения.ЭтоСкладНеЦеховаяКладовая
	|				И ДД.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|					ИЛИ НЕ СкладыПодразделения.ЭтоСкладНеЦеховаяКладовая)
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И НЕ КорАналитика.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|	И Аналитика.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|	И НЕ Аналитика.СкладскаяТерритория.ЦеховаяКладовая
	|	И Аналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И (КорАналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад) 
	|		И (КорАналитика.МестоХранения.ЦеховаяКладовая 
	|			ИЛИ ДД.КорВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|			)
	|		ИЛИ КорАналитика.ТипМестаХранения <> ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад))
	|
	|{ГДЕ 
	|	(ДД.Организация) КАК Организация,
	|	КорСкладыПодразделения.ПредварительноеПодразделение КАК Подразделение,
	|	КорАналитика.Номенклатура КАК Номенклатура,
	|	КорАналитика.Характеристика КАК Характеристика}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Расходы КАК Содержание,
	|	ДД.Организация,
	|	СкладыПодразделения.ПредварительноеПодразделение,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Аналитика.МестоХранения) = ТИП(Справочник.Склады)
	|		 И НЕ Аналитика.МестоХранения.ЦеховаяКладовая
	|		 И ДД.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|			ТОГДА ДД.ВидЗапасов.Договор.Подразделение
	|		ИНАЧЕ Аналитика.МестоХранения
	|	КОНЕЦ,
	|	КорАналитика.МестоХранения,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Аналитика.МестоХранения) = ТИП(Справочник.Склады)
	|		 И НЕ Аналитика.МестоХранения.ЦеховаяКладовая
	|		 И ДД.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|			ТОГДА ДД.ВидЗапасов.Договор.Подразделение
	|		ИНАЧЕ Аналитика.МестоХранения
	|	КОНЕЦ,
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	Аналитика.Номенклатура,
	|	Аналитика.Характеристика,
	|	Аналитика.Серия,
	|	Аналитика.Назначение,
	|	Аналитика.Назначение.НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции,
	|	ДД.Партия,
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства)
	|			ТОГДА ДД.КорПартия
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	// начальный остаток
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// поступило
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// Приобретено
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// перемещения
	|	ВЫБОР
	|		КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА 0
	|		КОГДА СкладыПодразделения.ПредварительноеПодразделение = КорСкладыПодразделения.ПредварительноеПодразделение
	|			И НЕ СкладыПодразделения.ПредварительноеПодразделение = НЕОПРЕДЕЛЕНО
	|			И НЕ ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|											ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства),
	|											ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
	|											)
	|			И (&ДанныеПоСебестоимости < 3 
	|				ИЛИ ДД.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию))
	|			ТОГДА -1 * ДД.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА 0
	|		КОГДА СкладыПодразделения.ПредварительноеПодразделение = КорСкладыПодразделения.ПредварительноеПодразделение
	|			И НЕ СкладыПодразделения.ПредварительноеПодразделение = НЕОПРЕДЕЛЕНО
	|			И НЕ ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|											ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства),
	|											ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
	|											)
	|			И (&ДанныеПоСебестоимости < 3 
	|				ИЛИ ДД.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию))
	|			ТОГДА -1 * ВЫБОР
	|					КОГДА &ДанныеПоСебестоимости = 1
	|						ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|					КОГДА &ДанныеПоСебестоимости = 2
	|						ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|					КОГДА &ДанныеПоСебестоимости = 3
	|						ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|					КОГДА &ДанныеПоСебестоимости = 4
	|						ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|					ИНАЧЕ	
	|						ВЫБОР КОГДА &ПоПредприятию
	|							ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|						ИНАЧЕ
	|							ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА 0
	|		КОГДА СкладыПодразделения.ПредварительноеПодразделение = КорСкладыПодразделения.ПредварительноеПодразделение
	|			И НЕ СкладыПодразделения.ПредварительноеПодразделение = НЕОПРЕДЕЛЕНО
	|			И НЕ ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|											ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства),
	|											ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
	|											)
	|			И (&ДанныеПоСебестоимости < 3 
	|				ИЛИ ДД.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию))
	|			ТОГДА -1 * ДД.ПостояннаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА 0
	|		КОГДА СкладыПодразделения.ПредварительноеПодразделение = КорСкладыПодразделения.ПредварительноеПодразделение
	|			И НЕ СкладыПодразделения.ПредварительноеПодразделение = НЕОПРЕДЕЛЕНО
	|			И НЕ ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|											ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства),
	|											ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
	|											)
	|			И (&ДанныеПоСебестоимости < 3 
	|				ИЛИ ДД.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию))
	|			ТОГДА -1 * ДД.ВременнаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА 0
	|		КОГДА СкладыПодразделения.ПредварительноеПодразделение = КорСкладыПодразделения.ПредварительноеПодразделение
	|			И НЕ СкладыПодразделения.ПредварительноеПодразделение = НЕОПРЕДЕЛЕНО
	|			И НЕ ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|											ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства),
	|											ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию)
	|											)
	|			И (&ДанныеПоСебестоимости < 3 
	|				ИЛИ ДД.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию))
	|			ТОГДА -1 * ВЫБОР
	|					КОГДА &ДанныеПоСебестоимости = 1
	|						ТОГДА 0
	|					КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|						ТОГДА ДД.СтоимостьЗабалансовая
	|					КОГДА &ДанныеПоСебестоимости = 4
	|						ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	// Включение/исключение НДС в стоимость
	|	0 КАК ВключениеИсключениеНДС,
	// Израсходовано на производство
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства))
	|			ТОГДА ДД.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства))
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеПоСебестоимости = 1
	|						ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|					КОГДА &ДанныеПоСебестоимости = 2
	|						ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|					КОГДА &ДанныеПоСебестоимости = 3
	|						ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|					КОГДА &ДанныеПоСебестоимости = 4
	|						ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|					ИНАЧЕ	
	|						ВЫБОР КОГДА &ПоПредприятию
	|							ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|						ИНАЧЕ
	|							ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства))
	|			ТОГДА ДД.ПостояннаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства))
	|			ТОГДА ДД.ВременнаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства))
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеПоСебестоимости = 1
	|						ТОГДА 0
	|					КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|						ТОГДА ДД.СтоимостьЗабалансовая
	|					КОГДА &ДанныеПоСебестоимости = 4
	|						ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	// списание
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// конечный остаток
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// передача на склад, в другие подразделения, реализовано	
	|	ВЫБОР
	|		КОГДА (СкладыПодразделения.ПредварительноеПодразделение <> КорСкладыПодразделения.ПредварительноеПодразделение
	|				ИЛИ ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ИЛИ КорСкладыПодразделения.ПредварительноеПодразделение ЕСТЬ NULL
	|				ИЛИ ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноРеализации)
	|				ИЛИ (&ДанныеПоСебестоимости > 2 
	|					И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию))
	|				)
	|				И ДД.ХозяйственнаяОперация НЕ В(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства))
	|			ТОГДА ДД.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ * ВЫБОР 
	|		КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (СкладыПодразделения.ПредварительноеПодразделение <> КорСкладыПодразделения.ПредварительноеПодразделение
	|				ИЛИ ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ИЛИ КорСкладыПодразделения.ПредварительноеПодразделение ЕСТЬ NULL
	|				ИЛИ ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноРеализации)
	|				ИЛИ (&ДанныеПоСебестоимости > 2 
	|					И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию))
	|				)
	|					И ДД.ХозяйственнаяОперация НЕ В(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства))
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеПоСебестоимости = 1
	|						ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|					КОГДА &ДанныеПоСебестоимости = 2
	|						ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|					КОГДА &ДанныеПоСебестоимости = 3
	|						ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|					КОГДА &ДанныеПоСебестоимости = 4
	|						ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|					ИНАЧЕ	
	|						ВЫБОР КОГДА &ПоПредприятию
	|							ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|						ИНАЧЕ
	|							ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|						КОНЕЦ
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ * ВЫБОР 
	|		КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (СкладыПодразделения.ПредварительноеПодразделение <> КорСкладыПодразделения.ПредварительноеПодразделение
	|				ИЛИ ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ИЛИ КорСкладыПодразделения.ПредварительноеПодразделение ЕСТЬ NULL
	|				ИЛИ ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноРеализации)
	|				ИЛИ (&ДанныеПоСебестоимости > 2 
	|					И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию))
	|				)
	|					И ДД.ХозяйственнаяОперация НЕ В(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства))
	|			ТОГДА ДД.ПостояннаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ * ВЫБОР 
	|		КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (СкладыПодразделения.ПредварительноеПодразделение <> КорСкладыПодразделения.ПредварительноеПодразделение
	|				ИЛИ ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ИЛИ КорСкладыПодразделения.ПредварительноеПодразделение ЕСТЬ NULL
	|				ИЛИ ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноРеализации)
	|				ИЛИ (&ДанныеПоСебестоимости > 2 
	|					И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию))
	|				)
	|					И ДД.ХозяйственнаяОперация НЕ В(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства))
	|			ТОГДА ДД.ВременнаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ * ВЫБОР 
	|		КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА (СкладыПодразделения.ПредварительноеПодразделение <> КорСкладыПодразделения.ПредварительноеПодразделение
	|				ИЛИ ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ИЛИ КорСкладыПодразделения.ПредварительноеПодразделение ЕСТЬ NULL
	|				ИЛИ ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СторноРеализации)
	|				ИЛИ (&ДанныеПоСебестоимости > 2 
	|					И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию))
	|				)
	|					И ДД.ХозяйственнаяОперация НЕ В(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеРасходовНаПартииПроизводства),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПартииПроизводства))
	|			ТОГДА ВЫБОР
	|					КОГДА &ДанныеПоСебестоимости = 1
	|						ТОГДА 0
	|					КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|						ТОГДА ДД.СтоимостьЗабалансовая
	|					КОГДА &ДанныеПоСебестоимости = 4
	|						ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ * ВЫБОР 
	|		КОГДА ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА -1
	|		ИНАЧЕ 1
	|	КОНЕЦ,
	// Произведено
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитика
	|		ПО ДД.КорАналитикаУчетаНоменклатуры = КорАналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК КорСкладыПодразделения
	|		ПО (КорАналитика.МестоХранения = КорСкладыПодразделения.Склад)
	|			И (КорСкладыПодразделения.ЭтоСкладНеЦеховаяКладовая
	|				И ДД.КорВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|					ИЛИ НЕ КорСкладыПодразделения.ЭтоСкладНеЦеховаяКладовая)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК СкладыПодразделения
	|		ПО (Аналитика.МестоХранения = СкладыПодразделения.Склад)
	|			И (СкладыПодразделения.ЭтоСкладНеЦеховаяКладовая
	|				И ДД.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|					ИЛИ НЕ СкладыПодразделения.ЭтоСкладНеЦеховаяКладовая)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборАналитикиНоменклатуры КАК ОтборАналитики
	|		ПО ДД.АналитикаУчетаНоменклатуры = ОтборАналитики.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И (ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ИЛИ ТИПЗНАЧЕНИЯ(ДД.Регистратор) = ТИП(Документ.КорректировкаРеализации))
	|	И НЕ (ДД.ХозяйственнаяОперация В
	|			(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВСоставНМА),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВСоставОС),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНаРасходыФиксированнаяСтоимость),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровУПереработчика),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыкупТоваровПереработчиком))
	|		ИЛИ ДД.СтатьяРасходовСписания =
	|				ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПогрешностьРасчетаСебестоимости))
	|	И (Аналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад) 
	|		И (Аналитика.МестоХранения.ЦеховаяКладовая 
	|			ИЛИ ДД.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|			)
	|		ИЛИ Аналитика.ТипМестаХранения <> ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад))
	|
	|{ГДЕ 
	|	(ДД.Организация) КАК Организация,
	|	СкладыПодразделения.ПредварительноеПодразделение КАК Подразделение,
	|	Аналитика.Номенклатура КАК Номенклатура,
	|	Аналитика.Характеристика КАК Характеристика}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ВключениеИсключениеНДС КАК Содержание,
	|	ДД.Организация,
	|	СкладыПодразделения.ПредварительноеПодразделение,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Аналитика.МестоХранения) = ТИП(Справочник.Склады)
	|		 И НЕ Аналитика.МестоХранения.ЦеховаяКладовая
	|		 И ДД.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|			ТОГДА ДД.ВидЗапасов.Договор.Подразделение
	|		ИНАЧЕ Аналитика.МестоХранения
	|	КОНЕЦ,
	|	КорАналитика.МестоХранения,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Аналитика.МестоХранения) = ТИП(Справочник.Склады)
	|		 И НЕ Аналитика.МестоХранения.ЦеховаяКладовая
	|		 И ДД.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|			ТОГДА ДД.ВидЗапасов.Договор.Подразделение
	|		ИНАЧЕ Аналитика.МестоХранения
	|	КОНЕЦ,
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	Аналитика.Номенклатура,
	|	Аналитика.Характеристика,
	|	Аналитика.Серия,
	|	Аналитика.Назначение,
	|	Аналитика.Назначение.НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции,
	|	ДД.Партия,
	|	0,
	|	0,
	// начальный остаток
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// поступило
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// Приобретено
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// перемещения
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// Включение/исключение НДС в стоимость
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр
	|			КОНЕЦ
	|	КОНЕЦ КАК ВключениеИсключениеНДС,
	// Израсходовано на производство
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// списание
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// конечный остаток
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// передача на склад, в другие подразделения, реализовано	
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// Произведено
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитика
	|		ПО ДД.КорАналитикаУчетаНоменклатуры = КорАналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК КорСкладыПодразделения
	|		ПО (КорАналитика.МестоХранения = КорСкладыПодразделения.Склад)
	|			И (КорСкладыПодразделения.ЭтоСкладНеЦеховаяКладовая
	|				И ДД.КорВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|					ИЛИ НЕ КорСкладыПодразделения.ЭтоСкладНеЦеховаяКладовая)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК СкладыПодразделения
	|		ПО (Аналитика.МестоХранения = СкладыПодразделения.Склад)
	|			И (СкладыПодразделения.ЭтоСкладНеЦеховаяКладовая
	|				И ДД.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|					ИЛИ НЕ СкладыПодразделения.ЭтоСкладНеЦеховаяКладовая)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборАналитикиНоменклатуры КАК ОтборАналитики
	|		ПО ДД.АналитикаУчетаНоменклатуры = ОтборАналитики.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты)
	|	И ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВключениеИсключениеНДСВСтоимости)
	|	И (Аналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад) 
	|		И (Аналитика.МестоХранения.ЦеховаяКладовая 
	|			ИЛИ ДД.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|			)
	|		ИЛИ Аналитика.ТипМестаХранения <> ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад))
	|
	|{ГДЕ 
	|	(ДД.Организация) КАК Организация,
	|	СкладыПодразделения.ПредварительноеПодразделение КАК Подразделение,
	|	Аналитика.Номенклатура КАК Номенклатура,
	|	Аналитика.Характеристика КАК Характеристика}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&СписанияНаРасходы КАК Содержание,
	|	ДД.Организация,
	|	СкладыПодразделения.ПредварительноеПодразделение,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Аналитика.МестоХранения) = ТИП(Справочник.Склады)
	|		 И НЕ Аналитика.МестоХранения.ЦеховаяКладовая
	|		 И ДД.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|			ТОГДА ДД.ВидЗапасов.Договор.Подразделение
	|		ИНАЧЕ Аналитика.МестоХранения
	|	КОНЕЦ,
	|	ДД.СтатьяРасходовСписания,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Аналитика.МестоХранения) = ТИП(Справочник.Склады)
	|		 И НЕ Аналитика.МестоХранения.ЦеховаяКладовая
	|		 И ДД.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|			ТОГДА ДД.ВидЗапасов.Договор.Подразделение
	|		ИНАЧЕ Аналитика.МестоХранения
	|	КОНЕЦ,
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	Аналитика.Номенклатура,
	|	Аналитика.Характеристика,
	|	Аналитика.Серия,
	|	Аналитика.Назначение,
	|	Аналитика.Назначение.НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции,
	|	ДД.Партия,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	// начальный остаток
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// поступило
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// Приобретено
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// перемещения
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// Включение/исключение НДС в стоимость
	|	0 КАК ВключениеИсключениеНДС,
	// Израсходовано на производство
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// списание
	|	ДД.Количество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|		ИНАЧЕ	
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|	КОНЕЦ,
	// конечный остаток
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// передача на склад
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// Произведено
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитика
	|		ПО ДД.КорАналитикаУчетаНоменклатуры = КорАналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК КорСкладыПодразделения
	|		ПО (КорАналитика.МестоХранения = КорСкладыПодразделения.Склад)
	|			И (КорСкладыПодразделения.ЭтоСкладНеЦеховаяКладовая
	|				И ДД.КорВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|					ИЛИ НЕ КорСкладыПодразделения.ЭтоСкладНеЦеховаяКладовая)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК СкладыПодразделения
	|		ПО (Аналитика.МестоХранения = СкладыПодразделения.Склад)
	|			И (СкладыПодразделения.ЭтоСкладНеЦеховаяКладовая
	|				И ДД.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|					ИЛИ НЕ СкладыПодразделения.ЭтоСкладНеЦеховаяКладовая)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборАналитикиНоменклатуры КАК ОтборАналитики
	|		ПО ДД.АналитикаУчетаНоменклатуры = ОтборАналитики.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И (ДД.ХозяйственнаяОперация В
	|			(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровПоТребованию),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВСоставНМА),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПередачаВСоставОС),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеТоваровУПереработчика),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНаРасходыФиксированнаяСтоимость),
	|			ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыкупТоваровПереработчиком))
	|		ИЛИ ДД.СтатьяРасходовСписания = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПогрешностьРасчетаСебестоимости))
	|	И (Аналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад) 
	|		И (Аналитика.МестоХранения.ЦеховаяКладовая 
	|			ИЛИ ДД.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|			)
	|		ИЛИ Аналитика.ТипМестаХранения <> ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад))
	|{ГДЕ 
	|	ДД.Организация КАК Организация,
	|	СкладыПодразделения.ПредварительноеПодразделение КАК Подразделение,
	|	Аналитика.Номенклатура КАК Номенклатура,
	|	Аналитика.Характеристика КАК Характеристика}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ПриходыОтПостащиков КАК Содержание,
	|	ДД.Организация,
	|	СкладыПодразделения.ПредварительноеПодразделение,
	|	ВЫБОР
	|		КОГДА РеквизитыПроизводстваБезЗаказа.Подразделение ЕСТЬ НЕ NULL
	|			ТОГДА РеквизитыПроизводстваБезЗаказа.Подразделение
	//++ Устарело_Переработка24
	|		КОГДА РеквизитыОтчетов.Подразделение ЕСТЬ НЕ NULL
	|			ТОГДА РеквизитыОтчетов.Подразделение
	//-- Устарело_Переработка24
	|		КОГДА РеквизитыОтчетов2_5.Подразделение ЕСТЬ НЕ NULL
	|			ТОГДА РеквизитыОтчетов2_5.Подразделение
	|		ИНАЧЕ СкладыПодразделения.ПредварительноеПодразделение
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Аналитика.МестоХранения) = ТИП(Справочник.Склады)
	|		 И НЕ Аналитика.МестоХранения.ЦеховаяКладовая
	|		 И ДД.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|			ТОГДА ДД.ВидЗапасов.Договор.Подразделение
	|		ИНАЧЕ Аналитика.МестоХранения
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Аналитика.МестоХранения) = ТИП(Справочник.Склады)
	|		 И НЕ Аналитика.МестоХранения.ЦеховаяКладовая
	|		 И ДД.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|			ТОГДА ДД.ВидЗапасов.Договор.Подразделение
	|		ИНАЧЕ Аналитика.МестоХранения
	|	КОНЕЦ,
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	Аналитика.Номенклатура,
	|	Аналитика.Характеристика,
	|	Аналитика.Серия,
	|	Аналитика.Назначение,
	|	Аналитика.Назначение.НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции,
	|	ДД.Партия,
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость))
	|			ТОГДА ДД.Партия
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	// начальный остаток
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// поступило
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// Приобретено
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость))
	|			ТОГДА 0
	|		ИНАЧЕ
	|			ДД.Количество
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость))
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|		ИНАЧЕ	
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость))
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ПостояннаяРазница
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость))
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ВременнаяРазница
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость))
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ,
	// перемещения
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// Включение/исключение НДС в стоимость
	|	0 КАК ВключениеИсключениеНДС,
	// Израсходовано на производство
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// списание
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// конечный остаток
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// передача на склад
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// Произведено
	|	ВЫБОР
	|		КОГДА НЕ ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость))
	|			ТОГДА 0
	|		ИНАЧЕ
	|			ДД.Количество
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость))
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|		ИНАЧЕ	
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость))
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ПостояннаяРазница
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость))
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ВременнаяРазница
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА НЕ ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|										ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость))
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|	КОНЕЦ
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК СкладыПодразделения
	|		ПО (Аналитика.МестоХранения = СкладыПодразделения.Склад)
	|			И (СкладыПодразделения.ЭтоСкладНеЦеховаяКладовая
	|				И ДД.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|					ИЛИ НЕ СкладыПодразделения.ЭтоСкладНеЦеховаяКладовая)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа КАК РеквизитыПроизводстваБезЗаказа
	|		ПО ДД.Регистратор = РеквизитыПроизводстваБезЗаказа.Ссылка
	//++ Устарело_Переработка24
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетПереработчика КАК РеквизитыОтчетов
	|		ПО ДД.Регистратор = РеквизитыОтчетов.Ссылка
	//-- Устарело_Переработка24
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетПереработчика2_5 КАК РеквизитыОтчетов2_5
	|		ПО ДД.Регистратор = РеквизитыОтчетов2_5.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОтборАналитикиНоменклатуры КАК ОтборАналитики
	|		ПО ДД.АналитикаУчетаНоменклатуры = ОтборАналитики.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И (ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|								ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость),
	|								ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаСебестоимость),
	//++ Устарело_Переработка24
	|								ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОтДавальца),
	//-- Устарело_Переработка24
	|								ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика))
	|		ИЛИ (&ДанныеПоСебестоимости > 2 
	// В случае формирования отчета по организациям, добавляем приходы по передаче в другие организации
	// и внутреннему поступлению работ.
	|				И ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию),
	|											ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВнутреннееПоступлениеРабот)))
	|	)
	|	И (Аналитика.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад) 
	|		И (Аналитика.МестоХранения.ЦеховаяКладовая 
	|			ИЛИ ДД.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|			)
	|		ИЛИ Аналитика.ТипМестаХранения <> ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
	|	)
	|{ГДЕ 
	|	ДД.Организация КАК Организация,
	|	СкладыПодразделения.ПредварительноеПодразделение КАК Подразделение,
	|	Аналитика.Номенклатура КАК Номенклатура,
	|	Аналитика.Характеристика КАК Характеристика}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&КонечныйОстаток КАК Содержание,
	|	ДД.Организация,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Аналитика.МестоХранения) = ТИП(Справочник.Склады)
	|				И СкладыПодразделения.ЭтоСкладНеЦеховаяКладовая
	|				И ДД.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|			ТОГДА Аналитика.Назначение.Договор.Подразделение
	|		ИНАЧЕ СкладыПодразделения.ПредварительноеПодразделение
	|	КОНЕЦ,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Аналитика.МестоХранения) = ТИП(Справочник.Склады)
	|		 И НЕ Аналитика.МестоХранения.ЦеховаяКладовая
	|		 И ДД.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|			ТОГДА ДД.ВидЗапасов.Договор.Подразделение
	|		ИНАЧЕ Аналитика.МестоХранения
	|	КОНЕЦ,
	|	НЕОПРЕДЕЛЕНО,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	Аналитика.Номенклатура,
	|	Аналитика.Характеристика,
	|	Аналитика.Серия,
	|	Аналитика.Назначение,
	|	Аналитика.Назначение.НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции,
	|	ДД.Партия,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	// начальный остаток
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// поступило
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// Приобретено
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// перемещения
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// Включение/исключение НДС в стоимость
	|	0 КАК ВключениеИсключениеНДС,
	// Израсходовано на производство
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// списание
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// конечный остаток
	|	ДД.КоличествоОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток + ДД.ДопРасходыОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеСНДСОстаток + ДД.ПостатейныеПеременныеСНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДСОстаток + ДД.ДопРасходыБезНДСОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеБезНДСОстаток + ДД.ПостатейныеПеременныеБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпрОстаток + ДД.ДопРасходыУпрОстаток + ДД.ТрудозатратыУпрОстаток + ДД.ПостатейныеПостоянныеУпрОстаток + ДД.ПостатейныеПеременныеУпрОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток + ДД.ДопРасходыРеглОстаток + ДД.ТрудозатратыРеглОстаток + ДД.ПостатейныеПостоянныеРеглОстаток + ДД.ПостатейныеПеременныеРеглОстаток
	|		ИНАЧЕ	
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДСОстаток + ДД.ДопРасходыБезНДСОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеБезНДСОстаток + ДД.ПостатейныеПеременныеБезНДСОстаток
	|			ИНАЧЕ
	|				ДД.СтоимостьУпрОстаток + ДД.ДопРасходыУпрОстаток + ДД.ТрудозатратыУпрОстаток + ДД.ПостатейныеПостоянныеУпрОстаток + ДД.ПостатейныеПеременныеУпрОстаток
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазницаОстаток,
	|	ДД.ВременнаяРазницаОстаток,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансоваяОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРеглОстаток
	|	КОНЕЦ,
	// передача на склад
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	// Произведено
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(
	|			{(&ОкончаниеПериодаГраница)},
	|				АналитикаУчетаНоменклатуры В (ВЫБРАТЬ Отбор.Ссылка ИЗ ВТОтборАналитикиНоменклатуры КАК Отбор)
	|					И НЕ РазделУчета В (
	|						ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию),
	|						ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссию)
	|					)
	|					И (АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад) 
	|						И (АналитикаУчетаНоменклатуры.МестоХранения.ЦеховаяКладовая 
	|							ИЛИ ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|							)
	|						ИЛИ АналитикаУчетаНоменклатуры.ТипМестаХранения <> ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
	|					)
	|			{(Организация) КАК Организация}) КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СкладыПодразделения КАК СкладыПодразделения
	|		ПО (Аналитика.МестоХранения = СкладыПодразделения.Склад)
	|			И (СкладыПодразделения.ЭтоСкладНеЦеховаяКладовая
	|				И ДД.ВидЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПолуфабрикатДавальца)
	|					ИЛИ НЕ СкладыПодразделения.ЭтоСкладНеЦеховаяКладовая)
	|) КАК ДД
	|
	|СГРУППИРОВАТЬ ПО
	|
	|	ДД.Содержание,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.Отправитель,
	|	ДД.Получатель,
	|	ДД.СкладПодразделение,
	|	ДД.Регистратор,
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.ВидЗапасов,
	|	ДД.АналитикаФинансовогоУчета,
	|	ДД.АналитикаУчетаПартий,
	|	ДД.ВидДеятельностиНДС,
	|	ДД.Номенклатура,
	|	ДД.Характеристика,
	|	ДД.Серия,
	|	ДД.Назначение,
	|	ДД.НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	ДД.Партия,
	|	ДД.ПартияПроизводства,
	|	ДД.ЗаказНаПроизводство
	|";
	
	Ресурсы = Новый Массив;
	
	Ресурсы.Добавить("НачальныйОстатокКоличество");
	Ресурсы.Добавить("НачальныйОстатокСтоимость");
	Ресурсы.Добавить("НачальныйОстатокПР");
	Ресурсы.Добавить("НачальныйОстатокВР");
	Ресурсы.Добавить("НачальныйОстатокЗабалансовая");
	
	Ресурсы.Добавить("ПоступилоКоличество");
	Ресурсы.Добавить("ПоступилоСтоимость");
	Ресурсы.Добавить("ПоступилоПР");
	Ресурсы.Добавить("ПоступилоВР");
	Ресурсы.Добавить("ПоступилоЗабалансовая");
	
	Ресурсы.Добавить("ПриобретеноКоличество");
	Ресурсы.Добавить("ПриобретеноСтоимость");
	Ресурсы.Добавить("ПриобретеноПР");
	Ресурсы.Добавить("ПриобретеноВР");
	Ресурсы.Добавить("ПриобретеноЗабалансовая");
	
	Ресурсы.Добавить("ПеремещенияКоличество");
	Ресурсы.Добавить("ПеремещенияСтоимость");
	Ресурсы.Добавить("ПеремещенияПР");
	Ресурсы.Добавить("ПеремещенияВР");
	Ресурсы.Добавить("ПеремещенияЗабалансовая");
	
	Ресурсы.Добавить("ВключениеИсключениеНДС");
	
	Ресурсы.Добавить("ИзрасходованоНаПроизводствоКоличество");
	Ресурсы.Добавить("ИзрасходованоНаПроизводствоСтоимость");
	Ресурсы.Добавить("ИзрасходованоНаПроизводствоПР");
	Ресурсы.Добавить("ИзрасходованоНаПроизводствоВР");
	Ресурсы.Добавить("ИзрасходованоНаПроизводствоЗабалансовая");
	
	Ресурсы.Добавить("СписаноКоличество");
	Ресурсы.Добавить("СписаноСтоимость");
	Ресурсы.Добавить("СписаноПР");
	Ресурсы.Добавить("СписаноВР");
	Ресурсы.Добавить("СписаноЗабалансовая");
	
	Ресурсы.Добавить("КонечныйОстатокКоличество");
	Ресурсы.Добавить("КонечныйОстатокСтоимость");
	Ресурсы.Добавить("КонечныйОстатокПР");
	Ресурсы.Добавить("КонечныйОстатокВР");
	Ресурсы.Добавить("КонечныйОстатокЗабалансовая");
	
	Ресурсы.Добавить("ПереданоКоличество");
	Ресурсы.Добавить("ПереданоСтоимость");
	Ресурсы.Добавить("ПереданоПР");
	Ресурсы.Добавить("ПереданоВР");
	Ресурсы.Добавить("ПереданоЗабалансовая");
	
	Ресурсы.Добавить("ПроизведеноКоличество");
	Ресурсы.Добавить("ПроизведеноСтоимость");
	Ресурсы.Добавить("ПроизведеноПР");
	Ресурсы.Добавить("ПроизведеноВР");
	Ресурсы.Добавить("ПроизведеноЗабалансовая");
	
	Возврат Новый Структура("ТекстЗапроса, Ресурсы", ТекстЗапроса, Ресурсы);
	
КонецФункции

// Текст запроса производственные затраты постатейные.
// 
// Возвращаемое значение:
//  Структура -  Текст запроса и набор ресурсов:
// * ТекстЗапроса - Строка - Текст запроса
// * Ресурсы - Массив из Строка - Набор ресурсов запроса
Функция ТекстЗапросаПроизводственныеЗатратыПостатейные() Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДД.Таблица                                             КАК Таблица,
	|	ДД.Содержание                                          КАК Содержание,
	|	ДД.Организация                                         КАК Организация,
	|	ДД.Подразделение                                       КАК Подразделение,
	|	ДД.Отправитель                                         КАК Отправитель,
	|	ДД.Получатель                                          КАК Получатель,
	|	ДД.Регистратор                                         КАК Регистратор,
	|	ДД.СтатьяРасходов                                      КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов                                   КАК АналитикаРасходов,
	|	ДД.НаправлениеДеятельности                             КАК НаправлениеДеятельности,
	|	ДД.ПартияПроизводства                                  КАК ПартияПроизводства,
	|	ДД.ЗаказНаПроизводство                                 КАК ЗаказНаПроизводство,
	|	СУММА(ДД.НачальныйОстатокСтоимость)                   КАК НачальныйОстатокСтоимость,
	|	СУММА(ДД.НачальныйОстатокПР)                          КАК НачальныйОстатокПР,
	|	СУММА(ДД.НачальныйОстатокВР)                          КАК НачальныйОстатокВР,
	|	СУММА(ДД.ПоступилоСтоимость)                          КАК ПоступилоСтоимость,
	|	СУММА(ДД.ПоступилоПР)                                 КАК ПоступилоПР,
	|	СУММА(ДД.ПоступилоВР)                                 КАК ПоступилоВР,
	|	СУММА(ДД.ИзрасходованоНаПроизводствоСтоимость)        КАК ИзрасходованоНаПроизводствоСтоимость,
	|	СУММА(ДД.ИзрасходованоНаПроизводствоПР)               КАК ИзрасходованоНаПроизводствоПР,
	|	СУММА(ДД.ИзрасходованоНаПроизводствоВР)               КАК ИзрасходованоНаПроизводствоВР,
	|	СУММА(ДД.ПрочееСписаниеСтоимость)               	   КАК ПрочееСписаниеСтоимость,
	|	СУММА(ДД.ПрочееСписаниеПР)               	           КАК ПрочееСписаниеПР,
	|	СУММА(ДД.ПрочееСписаниеВР)               	           КАК ПрочееСписаниеВР,
	|	СУММА(ДД.ТранзитМеждуОВЗСтоимость)               	   КАК ТранзитМеждуОВЗСтоимость,
	|	СУММА(ДД.ТранзитМеждуОВЗПР)               	           КАК ТранзитМеждуОВЗПР,
	|	СУММА(ДД.ТранзитМеждуОВЗВР)               	           КАК ТранзитМеждуОВЗВР,
	|	СУММА(ДД.КонечныйОстатокСтоимость)                    КАК КонечныйОстатокСтоимость,
	|	СУММА(ДД.КонечныйОстатокПР)                           КАК КонечныйОстатокПР,
	|	СУММА(ДД.КонечныйОстатокВР)                           КАК КонечныйОстатокВР
	|{ВЫБРАТЬ
	|Таблица,
	|Содержание,
	|Организация.*,
	|Подразделение.*,
	|Отправитель.*,
	|Получатель.*,
	|Регистратор.*,
	|СтатьяРасходов.*,
	|АналитикаРасходов.*,
	|НаправлениеДеятельности.*,
	|ПартияПроизводства.*,
	|ЗаказНаПроизводство.*,
	|НачальныйОстатокСтоимость,
	|НачальныйОстатокПР,
	|НачальныйОстатокВР,
	|ПоступилоСтоимость,
	|ПоступилоПР,
	|ПоступилоВР,
	|ИзрасходованоНаПроизводствоСтоимость,
	|ИзрасходованоНаПроизводствоПР,
	|ИзрасходованоНаПроизводствоВР,
	|ПрочееСписаниеСтоимость,
	|ПрочееСписаниеПР,
	|ПрочееСписаниеВР,
	|ТранзитМеждуОВЗСтоимость,
	|ТранзитМеждуОВЗПР,
	|ТранзитМеждуОВЗВР,
	|КонечныйОстатокСтоимость,
	|КонечныйОстатокПР,
	|КонечныйОстатокВР}
	|	
	|ИЗ
	|
	|(ВЫБРАТЬ
	|	&Постатейные                                           КАК Таблица,
	|	&НачальныйОстаток                                      КАК Содержание,
	|	ДД.Организация                                         КАК Организация,
	|	ДД.Подразделение                                       КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК Отправитель,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК Получатель,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ                                                  КАК Регистратор,
	|	ДД.СтатьяРасходов                                      КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов                                   КАК АналитикаРасходов,
	|	ДД.НаправлениеДеятельности                             КАК НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО                                           КАК ПартияПроизводства,
	|	НЕОПРЕДЕЛЕНО                                           КАК ЗаказНаПроизводство,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СуммаОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СуммаБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СуммаУпрОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СуммаРеглОстаток
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СуммаБезНДСОстаток
	|			ИНАЧЕ
	|				ДД.СуммаУпрОстаток
	|			КОНЕЦ
	|	КОНЕЦ                                                  КАК НачальныйОстатокСтоимость,
	|	ДД.ПостояннаяРазницаОстаток                            КАК НачальныйОстатокПР,
	|	ДД.ВременнаяРазницаОстаток                             КАК НачальныйОстатокВР,
	|	0                                                      КАК ПоступилоСтоимость,
	|	0                                                      КАК ПоступилоПР,
	|	0                                                      КАК ПоступилоВР,
	|	0                                                      КАК ИзрасходованоНаПроизводствоСтоимость,
	|	0                                                      КАК ИзрасходованоНаПроизводствоПР,
	|	0                                                      КАК ИзрасходованоНаПроизводствоВР,
	|	0                                                      КАК ПрочееСписаниеСтоимость,
	|	0                                                      КАК ПрочееСписаниеПР,
	|	0                                                      КАК ПрочееСписаниеВР,
	|	0                                                      КАК ТранзитМеждуОВЗСтоимость,
	|	0                                                      КАК ТранзитМеждуОВЗПР,
	|	0                                                      КАК ТранзитМеждуОВЗВР,
	|	0                                                      КАК КонечныйОстатокСтоимость,
	|	0                                                      КАК КонечныйОстатокПР,
	|	0                                                      КАК КонечныйОстатокВР
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы.Остатки(
	|		{(&НачалоПериода)},
	|		НЕ &БезОтбораПоПериодуНачало
	|		И (СтатьяРасходов В (
	|			ВЫБРАТЬ Ссылка 
	|			ИЗ ПланВидовХарактеристик.СтатьиРасходов КАК Настройка
	|			ГДЕ 
	|				Настройка.ВариантРаспределенияРасходовРегл 
	|					В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), 
	|						ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат),
	|						ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|				ИЛИ Настройка.ВариантРаспределенияРасходовУпр 
	|					В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), 
	|						ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат),
	|						ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|			)
	|		ИЛИ АналитикаРасходов В (
	|			ВЫБРАТЬ Ссылка 
	|			ИЗ Справочник.ОбъектыВозникновенияЗатрат КАК Настройка
	|			ГДЕ 
	|				Настройка.ВариантРаспределенияРасходовРегл 
	|					В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), 
	|						ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат),
	|						ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|				ИЛИ Настройка.ВариантРаспределенияРасходовУпр 
	|					В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), 
	|						ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат),
	|						ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|			)
	|		)
	|		{
	|			Организация,
	|			Подразделение,
	|			НаправлениеДеятельности,
	|			СтатьяРасходов,
	|			АналитикаРасходов
	|		}
	|	) КАК ДД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Постатейные КАК Таблица,
	|	&Регистрация КАК Содержание,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	ДД.Подразделение,
	|	ДД.Регистратор,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Сумма
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СуммаБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СуммаУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СуммаРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СуммаБезНДС
	|			ИНАЧЕ
	|				ДД.СуммаУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			И НЕ Статья.ПринятиеКНалоговомуУчету
	|			ТОГДА ДД.СуммаРегл
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			И Статья.ПринятиеКНалоговомуУчету
	|			ТОГДА ДД.СуммаРегл
	|		ИНАЧЕ
	|			0
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК Статья
	|		ПО ДД.СтатьяРасходов = Статья.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыВозникновенияЗатрат КАК ОВЗ
	|		ПО ДД.АналитикаРасходов = ОВЗ.Ссылка
	|ГДЕ
	|	(&БезОтбораПоПериоду ИЛИ (&БезОтбораПоПериодуНачало ИЛИ ДД.Период >= &НачалоПериода) И ДД.Период <= &ОкончаниеПериода)
	|	И	(ЕСТЬNULL(ОВЗ.ВариантРаспределенияРасходовРегл, Статья.ВариантРаспределенияРасходовРегл) 
	|			В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), 
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат), 
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|		ИЛИ ЕСТЬNULL(ОВЗ.ВариантРаспределенияРасходовУпр, Статья.ВариантРаспределенияРасходовУпр) 
	|			В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), 
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат), 
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|		)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|{ ГДЕ
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ДД.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов
	|}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Постатейные КАК Таблица,
	|	&Регистрация КАК Содержание,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	ДД.Подразделение,
	|	ДД.Регистратор,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			И НЕ Статья.ПринятиеКНалоговомуУчету
	|			ТОГДА ДД.ПостояннаяРазница - ДД.СуммаРегл
	|		ИНАЧЕ
	|			ДД.ПостояннаяРазница
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			И Статья.ПринятиеКНалоговомуУчету
	|			ТОГДА ДД.ВременнаяРазница - ДД.СуммаРегл
	|		ИНАЧЕ
	|			ДД.ВременнаяРазница
	|	КОНЕЦ,
	
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0,
	
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы КАК ДД
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК Статья
	|		ПО ДД.СтатьяРасходов = Статья.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыВозникновенияЗатрат КАК ОВЗ
	|		ПО ДД.АналитикаРасходов = ОВЗ.Ссылка
	|ГДЕ
	|	(&БезОтбораПоПериоду ИЛИ (&БезОтбораПоПериодуНачало ИЛИ ДД.Период >= &НачалоПериода) И ДД.Период <= &ОкончаниеПериода)
	|	И	(ЕСТЬNULL(ОВЗ.ВариантРаспределенияРасходовНУ, Статья.ВариантРаспределенияРасходовНУ) 
	|			В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), 
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат), 
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|		)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|{ ГДЕ
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ДД.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов
	|}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Постатейные КАК Таблица,
	|	&РаспределениеНаПроизводство КАК Содержание,
	|	ДД.Организация,
	|	Реквизиты.Подразделение,
	|	Реквизиты.Подразделение,
	|	ДД.Подразделение,
	|	ДД.Регистратор,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	Реквизиты.НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			ТОГДА ДД.ПартияПроизводства
	|		ИНАЧЕ ДД.ЗаказНаПроизводство
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Реквизиты
	|		ПО ДД.Регистратор = Реквизиты.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.ПартияПроизводства
	|
	|ГДЕ
	|	(&БезОтбораПоПериоду ИЛИ (&БезОтбораПоПериодуНачало ИЛИ ДД.Период >= &НачалоПериода) И ДД.Период <= &ОкончаниеПериода)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|{ ГДЕ
	|	ДД.Организация КАК Организация,
	|	Реквизиты.Подразделение КАК Подразделение,
	|	Реквизиты.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов
	|}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Постатейные КАК Таблица,
	|	&Выбытие КАК Содержание,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.Подразделение,
	|	ДД.КорСтатьяРасходов,
	|	ДД.Регистратор,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Сумма
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СуммаБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СуммаУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СуммаРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СуммаБезНДС
	|			ИНАЧЕ
	|				ДД.СуммаУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы КАК ДД
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыВозникновенияЗатрат КАК ОВЗ
	|		ПО ДД.АналитикаРасходов = ОВЗ.Ссылка
	|ГДЕ
	|	(&БезОтбораПоПериоду ИЛИ (&БезОтбораПоПериодуНачало ИЛИ ДД.Период >= &НачалоПериода) И ДД.Период <= &ОкончаниеПериода)
	|	И	(ЕСТЬNULL(ОВЗ.ВариантРаспределенияРасходовРегл, ДД.СтатьяРасходов.ВариантРаспределенияРасходовРегл) 
	|			В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), 
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства), 
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат))
	|		ИЛИ ЕСТЬNULL(ОВЗ.ВариантРаспределенияРасходовУпр, ДД.СтатьяРасходов.ВариантРаспределенияРасходовУпр) 
	|			В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), 
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства), 
	|				ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат))
	|		)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И НЕ ДД.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукции),
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ТранзитРасходовМеждуОВЗ))
	|{ ГДЕ
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ДД.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов
	|}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Постатейные КАК Таблица,
	|	&Перенос КАК Содержание,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.АналитикаРасходов,
	|	ДД.КорАналитикаРасходов,
	|	ДД.Регистратор,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Сумма
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СуммаБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СуммаУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СуммаРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СуммаБезНДС
	|			ИНАЧЕ
	|				ДД.СуммаУпр
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазница,
	|	ДД.ВременнаяРазница,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы КАК ДД
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыВозникновенияЗатрат КАК ОВЗ
	|		ПО ДД.АналитикаРасходов = ОВЗ.Ссылка
	|ГДЕ
	|	(&БезОтбораПоПериоду ИЛИ (&БезОтбораПоПериодуНачало ИЛИ ДД.Период >= &НачалоПериода) И ДД.Период <= &ОкончаниеПериода)
	|	И (ЕСТЬNULL(ОВЗ.ВариантРаспределенияРасходовРегл, ДД.СтатьяРасходов.ВариантРаспределенияРасходовРегл) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат)
	|					ИЛИ ЕСТЬNULL(ОВЗ.ВариантРаспределенияРасходовУпр, ДД.СтатьяРасходов.ВариантРаспределенияРасходовУпр) = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат))
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ТранзитРасходовМеждуОВЗ)
	|{ ГДЕ
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ДД.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов
	|}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Постатейные КАК Таблица,
	|	&КонечныйОстаток КАК Содержание,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	НЕОПРЕДЕЛЕНО,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.НаправлениеДеятельности,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СуммаОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СуммаБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СуммаУпрОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СуммаРеглОстаток
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СуммаБезНДСОстаток
	|			ИНАЧЕ
	|				ДД.СуммаУпрОстаток
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДД.ПостояннаяРазницаОстаток,
	|	ДД.ВременнаяРазницаОстаток
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы.Остатки(
	|		{(&ОкончаниеПериодаГраница)},
	|		СтатьяРасходов В (
	|			ВЫБРАТЬ Ссылка 
	|			ИЗ ПланВидовХарактеристик.СтатьиРасходов КАК Настройка
	|			ГДЕ 
	|				Настройка.ВариантРаспределенияРасходовРегл 
	|					В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), 
	|						ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат),
	|						ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|				ИЛИ Настройка.ВариантРаспределенияРасходовУпр 
	|					В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), 
	|						ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат),
	|						ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|			)
	|		ИЛИ АналитикаРасходов В (
	|			ВЫБРАТЬ Ссылка 
	|			ИЗ Справочник.ОбъектыВозникновенияЗатрат КАК Настройка
	|			ГДЕ 
	|				Настройка.ВариантРаспределенияРасходовРегл 
	|					В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), 
	|						ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат),
	|						ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|				ИЛИ Настройка.ВариантРаспределенияРасходовУпр 
	|					В (ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты), 
	|						ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат),
	|						ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства))
	|			)
	|	) КАК ДД
	|{ ГДЕ
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ДД.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов
	|}
	|) КАК ДД
	|
	|СГРУППИРОВАТЬ ПО
	|
	|	ДД.Таблица,
	|	ДД.Содержание,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.Отправитель,
	|	ДД.Получатель,
	|	ДД.Регистратор,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	ДД.НаправлениеДеятельности,
	|	ДД.ПартияПроизводства,
	|	ДД.ЗаказНаПроизводство";
	
	Ресурсы = Новый Массив;
	Ресурсы.Добавить("НачальныйОстатокСтоимость");
	Ресурсы.Добавить("НачальныйОстатокПР");
	Ресурсы.Добавить("НачальныйОстатокВР");
	
	Ресурсы.Добавить("ПоступилоСтоимость");
	Ресурсы.Добавить("ПоступилоПР");
	Ресурсы.Добавить("ПоступилоВР");
	
	Ресурсы.Добавить("ИзрасходованоНаПроизводствоСтоимость");
	Ресурсы.Добавить("ИзрасходованоНаПроизводствоПР");
	Ресурсы.Добавить("ИзрасходованоНаПроизводствоВР");
	
	Ресурсы.Добавить("ПрочееСписаниеСтоимость");
	Ресурсы.Добавить("ПрочееСписаниеПР");
	Ресурсы.Добавить("ПрочееСписаниеВР");
	
	Ресурсы.Добавить("ТранзитМеждуОВЗСтоимость");
	Ресурсы.Добавить("ТранзитМеждуОВЗПР");
	Ресурсы.Добавить("ТранзитМеждуОВЗВР");
	
	Ресурсы.Добавить("КонечныйОстатокСтоимость");
	Ресурсы.Добавить("КонечныйОстатокПР");
	Ресурсы.Добавить("КонечныйОстатокВР");
	
	Возврат Новый Структура("ТекстЗапроса, Ресурсы", ТекстЗапроса, Ресурсы);
	
КонецФункции

// Текст запроса производственные затраты по партиям производства.
// 
// Возвращаемое значение:
//  Структура -  Текст запроса и набор ресурсов:
// * ТекстЗапроса - Строка - Текст запроса
// * Ресурсы - Массив из Строка - Набор ресурсов запроса
//
Функция ТекстЗапросаПроизводственныеЗатратыПоПартиямПроизводства() Экспорт
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.НастройкаХозяйственнойОперации КАК НастройкаХозяйственнойОперации,
	|	ДД.ИдентификаторФинЗаписи КАК ИдентификаторФинЗаписи,
	|	КорАналитика.СтатьяКалькуляции.ТипЗатрат КАК ТипЗатрат,
	|	СпрОрганизации.Ссылка КАК Организация,
	|	КорАналитика.МестоХранения КАК Подразделение,
	|	Аналитика.МестоХранения КАК ПодразделениеОтправитель,
	|	ДД.Регистратор КАК Регистратор,
	|	ЕСТЬNULL(СпрПартииПроизводства.НаправлениеДеятельности, КорАналитика.Назначение.НаправлениеДеятельности) КАК НаправлениеДеятельности,
	|	КорАналитика.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	ДД.КорАналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	КорАналитика.Номенклатура КАК Номенклатура,
	|	КорАналитика.Характеристика КАК Характеристика,
	|	КорАналитика.Серия КАК Серия,
	|	КорАналитика.Назначение КАК Назначение,
	|	ДД.КорПартия КАК ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство
	|ПОМЕСТИТЬ ВтАналитикиДляПоступленийВНЗП
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК СпрОрганизации
	|			ПО ВЫБОР КОГДА ДД.КорОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|					ТОГДА ДД.Организация = СпрОрганизации.Ссылка
	|					ИНАЧЕ ДД.КорОрганизация = СпрОрганизации.Ссылка
	|				КОНЕЦ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО (ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитика
	|		ПО (ДД.КорАналитикаУчетаНоменклатуры = КорАналитика.Ссылка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО (СпрПартииПроизводства.Ссылка = ДД.КорПартия)
	|			И (СпрПартииПроизводства.Организация = СпрОрганизации.Ссылка ИЛИ НЕ &ПоПредприятию)
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И КорАналитика.СтатьяКалькуляции <> ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|{ГДЕ
	|	(СпрОрганизации.Ссылка) КАК Организация,
	|	КорАналитика.МестоХранения КАК Подразделение,
	|	КорАналитика.Номенклатура КАК Номенклатура,
	|	КорАналитика.Характеристика КАК Характеристика}  
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	ИдентификаторФинЗаписи,
	|	НастройкаХозяйственнойОперации,
	|	Организация
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДД.Таблица                                КАК Таблица,
	|	ДД.Содержание                             КАК Содержание,
	|	ДД.ТипЗатрат                              КАК ТипЗатрат,
	|	ДД.ВидЗатрат                              КАК ВидЗатрат,
	|	ДД.Организация                            КАК Организация,
	|	ДД.Подразделение                          КАК Подразделение,
	|	ДД.ПодразделениеОтправитель               КАК ПодразделениеОтправитель,
	|	ДД.Регистратор                            КАК Регистратор,
	|	ДД.НаправлениеДеятельности                КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции                      КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.АналитикаУчетаНоменклатуры             КАК АналитикаУчетаНоменклатуры,
	|	ДД.Номенклатура                           КАК Номенклатура,
	|	ДД.Характеристика                         КАК Характеристика,
	|	ДД.Серия                                  КАК Серия,
	|	ДД.Назначение                             КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот                               КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов                         КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов                      КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ДД.АналитикаУчетаПродукции                КАК АналитикаУчетаПродукции,
	|	ДД.Продукция                              КАК Продукция,
	|	ДД.ХарактеристикаПродукции                КАК ХарактеристикаПродукции,
	|	ДД.СерияПродукции                         КАК СерияПродукции,
	|	ДД.НазначениеПродукции                    КАК НазначениеПродукции,
	|	
	|	ДД.ПартияПроизводства                     КАК ПартияПроизводства,
	|	ДД.ЗаказНаПроизводство                    КАК ЗаказНаПроизводство,
	|	СУММА(ДД.НачальныйОстатокКоличество)     КАК НачальныйОстатокКоличество,
	|	СУММА(ДД.НачальныйОстатокСтоимость)      КАК НачальныйОстатокСтоимость,
	|	СУММА(ДД.НачальныйОстатокПР)             КАК НачальныйОстатокПР,
	|	СУММА(ДД.НачальныйОстатокВР)             КАК НачальныйОстатокВР,
	|	СУММА(ДД.НачальныйОстатокЗабалансовая)   КАК НачальныйОстатокЗабалансовая,
	|	
	|	СУММА(ДД.ИзрасходованоНаПроизводствоКоличество) КАК ИзрасходованоНаПроизводствоКоличество,
	|	СУММА(ДД.ИзрасходованоНаПроизводствоСтоимость)  КАК ИзрасходованоНаПроизводствоСтоимость,
	|	СУММА(ДД.ИзрасходованоНаПроизводствоПР)         КАК ИзрасходованоНаПроизводствоПР,
	|	СУММА(ДД.ИзрасходованоНаПроизводствоВР)         КАК ИзрасходованоНаПроизводствоВР,
	|	СУММА(ДД.ИзрасходованоНаПроизводствоЗабалансовая) КАК ИзрасходованоНаПроизводствоЗабалансовая,
	|	
	|	СУММА(ДД.ВключениеИсключениеНДС)         КАК ВключениеИсключениеНДС,
	|	
	|	СУММА(ДД.РасходНаПроизводствоКоличество) КАК РасходНаПроизводствоКоличество,
	|	СУММА(ДД.РасходНаПроизводствоСтоимость)  КАК РасходНаПроизводствоСтоимость,
	|	СУММА(ДД.РасходНаПроизводствоПР)         КАК РасходНаПроизводствоПР,
	|	СУММА(ДД.РасходНаПроизводствоВР)         КАК РасходНаПроизводствоВР,
	|	СУММА(ДД.РасходНаПроизводствоЗабалансовая)КАК РасходНаПроизводствоЗабалансовая,
	|	
	|	СУММА(ДД.КонечныйОстатокКоличество)      КАК КонечныйОстатокКоличество,
	|	СУММА(ДД.КонечныйОстатокСтоимость)       КАК КонечныйОстатокСтоимость,
	|	СУММА(ДД.КонечныйОстатокПР)              КАК КонечныйОстатокПР,
	|	СУММА(ДД.КонечныйОстатокВР)              КАК КонечныйОстатокВР,
	|	СУММА(ДД.КонечныйОстатокЗабалансовая)    КАК КонечныйОстатокЗабалансовая
	|{ВЫБРАТЬ
	|Таблица,
	|Содержание,
	|ТипЗатрат.*,
	|ВидЗатрат,
	|Организация.*,
	|Подразделение.*,
	|ПодразделениеОтправитель.*,
	|Регистратор.*,
	|НаправлениеДеятельности.*,
	|СтатьяКалькуляции.*,
	|АналитикаУчетаНоменклатуры.*,
	|Номенклатура.*,
	|Характеристика.*,
	|Серия.*,
	|Назначение.*,
	|ВидРабот.*,
	|СтатьяРасходов.*,
	|АналитикаРасходов.*,
	|АналитикаУчетаПродукции.*,
	|Продукция.*,
	|ХарактеристикаПродукции.*,
	|СерияПродукции.*,
	|НазначениеПродукции.*,
	|ПартияПроизводства.*,
	|ЗаказНаПроизводство.*,
	|НачальныйОстатокКоличество,
	|НачальныйОстатокСтоимость,
	|НачальныйОстатокПР,
	|НачальныйОстатокВР,
	|НачальныйОстатокЗабалансовая,
	|ИзрасходованоНаПроизводствоКоличество,
	|ИзрасходованоНаПроизводствоСтоимость,
	|ИзрасходованоНаПроизводствоПР,
	|ИзрасходованоНаПроизводствоВР,
	|ИзрасходованоНаПроизводствоЗабалансовая,
	|ВключениеИсключениеНДС,
	|РасходНаПроизводствоКоличество,
	|РасходНаПроизводствоСтоимость,
	|РасходНаПроизводствоПР,
	|РасходНаПроизводствоВР,
	|РасходНаПроизводствоЗабалансовая,
	|КонечныйОстатокКоличество,
	|КонечныйОстатокСтоимость,
	|КонечныйОстатокПР,
	|КонечныйОстатокВР,
	|КонечныйОстатокЗабалансовая}
	|ИЗ
	// материалы
	|(ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&НачальныйОстаток КАК Содержание,
	|	Аналитика.СтатьяКалькуляции.ТипЗатрат КАК ТипЗатрат,
	|	ВЫБОР 
	|		КОГДА Аналитика.СтатьяКалькуляции.ТипЗатрат В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗатрат.Материальные),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗатрат.ВозвратныеОтходы))
	|			ТОГДА &Материальные
	|		ИНАЧЕ
	|			&Услуги
	|	КОНЕЦ КАК ВидЗатрат,
	|	ДД.Организация КАК Организация,
	|	Аналитика.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеОтправитель,
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	ЕСТЬNULL(СпрПартииПроизводства.НаправлениеДеятельности,
	|		Аналитика.Назначение.НаправлениеДеятельности) КАК НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Аналитика.Номенклатура КАК Номенклатура,
	|	Аналитика.Характеристика КАК Характеристика,
	|	Аналитика.Серия КАК Серия,
	|	Аналитика.Назначение КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|	
	|	ДД.Партия КАК ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	ДД.КоличествоОстаток        КАК НачальныйОстатокКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток + ДД.ДопРасходыОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеСНДСОстаток + ДД.ПостатейныеПеременныеСНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДСОстаток + ДД.ДопРасходыБезНДСОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеБезНДСОстаток + ДД.ПостатейныеПеременныеБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпрОстаток + ДД.ДопРасходыУпрОстаток + ДД.ТрудозатратыУпрОстаток + ДД.ПостатейныеПостоянныеУпрОстаток + ДД.ПостатейныеПеременныеУпрОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток + ДД.ДопРасходыРеглОстаток + ДД.ТрудозатратыРеглОстаток + ДД.ПостатейныеПостоянныеРеглОстаток + ДД.ПостатейныеПеременныеРеглОстаток
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДСОстаток + ДД.ДопРасходыБезНДСОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеБезНДСОстаток + ДД.ПостатейныеПеременныеБезНДСОстаток
	|			ИНАЧЕ
	|				ДД.СтоимостьУпрОстаток + ДД.ДопРасходыУпрОстаток + ДД.ТрудозатратыУпрОстаток + ДД.ПостатейныеПостоянныеУпрОстаток + ДД.ПостатейныеПеременныеУпрОстаток
	|			КОНЕЦ
	|	КОНЕЦ                       КАК НачальныйОстатокСтоимость,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ПостояннаяРазницаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	КАК НачальныйОстатокПР,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ВременнаяРазницаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ
	|	КАК НачальныйОстатокВР,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансоваяОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРеглОстаток
	|	КОНЕЦ                       КАК НачальныйОстатокЗабалансовая,
	|	
	|	0 КАК ИзрасходованоНаПроизводствоКоличество,
	|	0 КАК ИзрасходованоНаПроизводствоСтоимость,
	|	0 КАК ИзрасходованоНаПроизводствоПР,
	|	0 КАК ИзрасходованоНаПроизводствоВР,
	|	0 КАК ИзрасходованоНаПроизводствоЗабалансовая,
	|	
	|	0 КАК ВключениеИсключениеНДС,
	|	
	|	0 КАК РасходНаПроизводствоКоличество,
	|	0 КАК РасходНаПроизводствоСтоимость,
	|	0 КАК РасходНаПроизводствоПР,
	|	0 КАК РасходНаПроизводствоВР,
	|	0 КАК РасходНаПроизводствоЗабалансовая,
	|	
	|	0 КАК КонечныйОстатокКоличество,
	|	0 КАК КонечныйОстатокСтоимость,
	|	0 КАК КонечныйОстатокПР,
	|	0 КАК КонечныйОстатокВР,
	|	0 КАК КонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(
	|			{(&НачалоПериода)},
	|			НЕ &БезОтбораПоПериоду
	|				И АналитикаУчетаНоменклатуры.ТипМестаХранения В (
	|					ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение),
	|					ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.ДоговорКонтрагента))
	|				И (АналитикаУчетаНоменклатуры.СтатьяКалькуляции <> ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|			)
	|			{
	|				Организация КАК Организация,
	|				АналитикаУчетаНоменклатуры.Подразделение КАК Подразделение,
	|				АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|				АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика
	|			}
	|			) КАК ДД
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.Партия
	|			И (СпрПартииПроизводства.Организация = ДД.Организация ИЛИ НЕ &ПоПредприятию)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&ПоступилоМатериалы22 КАК Содержание,
	|	ДД.ТипЗатрат КАК ТипЗатрат,
	|	&Материальные КАК ВидЗатрат,
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ДД.ПодразделениеОтправитель КАК ПодразделениеОтправитель,
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|
	|	// аналитика материала
	|	ДД.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	ДД.Номенклатура КАК Номенклатура,
	|	ДД.Характеристика КАК Характеристика,
	|	ДД.Серия КАК Серия,
	|	ДД.Назначение КАК Назначение,
	|
	|	// аналитика трудозатрат
	|	ЗНАЧЕНИЕ(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|
	|	// аналитика постатейного расхода
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|	ДД.ПартияПроизводства КАК ПартияПроизводства,
	|	ДД.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|
	|	0 КАК НачальныйОстатокКоличество,
	|	0 КАК НачальныйОстатокСтоимость,
	|	0 КАК НачальныйОстатокПР,
	|	0 КАК НачальныйОстатокВР,
	|	0 КАК НачальныйОстатокЗабалансовая,
	|	ДвиженияПриход.Количество КАК ИзрасходованоНаПроизводствоКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДвиженияПриход.Стоимость + ДвиженияПриход.ДопРасходы + ДвиженияПриход.Трудозатраты + ДвиженияПриход.ПостатейныеПостоянныеСНДС + ДвиженияПриход.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДвиженияПриход.СтоимостьБезНДС + ДвиженияПриход.ДопРасходыБезНДС + ДвиженияПриход.Трудозатраты + ДвиженияПриход.ПостатейныеПостоянныеБезНДС + ДвиженияПриход.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДвиженияПриход.СтоимостьУпр + ДвиженияПриход.ДопРасходыУпр + ДвиженияПриход.ТрудозатратыУпр + ДвиженияПриход.ПостатейныеПостоянныеУпр + ДвиженияПриход.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДвиженияПриход.СтоимостьРегл + ДвиженияПриход.ДопРасходыРегл + ДвиженияПриход.ТрудозатратыРегл + ДвиженияПриход.ПостатейныеПостоянныеРегл + ДвиженияПриход.ПостатейныеПеременныеРегл
	|		ИНАЧЕ ВЫБОР
	|				КОГДА &ПоПредприятию
	|					ТОГДА ДвиженияПриход.СтоимостьБезНДС + ДвиженияПриход.ДопРасходыБезНДС + ДвиженияПриход.Трудозатраты + ДвиженияПриход.ПостатейныеПостоянныеБезНДС + ДвиженияПриход.ПостатейныеПеременныеБезНДС
	|				ИНАЧЕ ДвиженияПриход.СтоимостьУпр + ДвиженияПриход.ДопРасходыУпр + ДвиженияПриход.ТрудозатратыУпр + ДвиженияПриход.ПостатейныеПостоянныеУпр + ДвиженияПриход.ПостатейныеПеременныеУпр
	|			КОНЕЦ
	|	КОНЕЦ КАК ИзрасходованоНаПроизводствоСтоимость,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДвиженияПриход.ПостояннаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИзрасходованоНаПроизводствоПР,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДвиженияПриход.ВременнаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИзрасходованоНаПроизводствоВР,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2
	|				ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДвиженияПриход.СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДвиженияПриход.СтоимостьЗабалансоваяРегл
	|	КОНЕЦ КАК ИзрасходованоНаПроизводствоЗабалансовая,
	|	0 КАК ВключениеИсключениеНДС,
	|	0 КАК РасходНаПроизводствоКоличество,
	|	0 КАК РасходНаПроизводствоСтоимость,
	|	0 КАК РасходНаПроизводствоПР,
	|	0 КАК РасходНаПроизводствоВР,
	|	0 КАК РасходНаПроизводствоЗабалансовая,
	|	0 КАК КонечныйОстатокКоличество,
	|	0 КАК КонечныйОстатокСтоимость,
	|	0 КАК КонечныйОстатокПР,
	|	0 КАК КонечныйОстатокВР,
	|	0 КАК КонечныйОстатокЗабалансовая
	|ИЗ
	|	ВтАналитикиДляПоступленийВНЗП КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров КАК ДвиженияПриход
	|		ПО ДД.Регистратор = ДвиженияПриход.Регистратор
	|			И ДД.ИдентификаторФинЗаписи = ДвиженияПриход.ИдентификаторФинЗаписи
	|			И ДД.НастройкаХозяйственнойОперации = ДвиженияПриход.НастройкаХозяйственнойОперации
	|			И (ДвиженияПриход.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	|			И (ДД.Организация = ДвиженияПриход.Организация)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&ВключениеИсключениеНДС КАК Содержание,
	|	Аналитика.СтатьяКалькуляции.ТипЗатрат КАК ТипЗатрат,
	|	&Материальные КАК ВидЗатрат,
	|	ДД.Организация КАК Организация,
	|	Аналитика.МестоХранения КАК Подразделение,
	|	Аналитика.МестоХранения КАК ПодразделениеОтправитель,
	|	ДД.Регистратор КАК Регистратор,
	|	ЕСТЬNULL(СпрПартииПроизводства.НаправлениеДеятельности,
	|		Аналитика.Назначение.НаправлениеДеятельности) КАК НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Аналитика.Номенклатура КАК Номенклатура,
	|	Аналитика.Характеристика КАК Характеристика,
	|	Аналитика.Серия КАК Серия,
	|	Аналитика.Назначение КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.Партия КАК ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	
	|	0 КАК НачальныйОстатокКоличество,
	|	0 КАК НачальныйОстатокСтоимость,
	|	0 КАК НачальныйОстатокПР,
	|	0 КАК НачальныйОстатокВР,
	|	0 КАК НачальныйОстатокЗабалансовая,
	|	
	|	0 КАК ИзрасходованоНаПроизводствоКоличество,
	|	0 КАК ИзрасходованоНаПроизводствоСтоимость,
	|	0 КАК ИзрасходованоНаПроизводствоПР,
	|	0 КАК ИзрасходованоНаПроизводствоВР,
	|	0 КАК ИзрасходованоНаПроизводствоЗабалансовая,
	|	
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр
	|			КОНЕЦ
	|	КОНЕЦ КАК ВключениеИсключениеНДС,
	|	
	|	0 КАК РасходНаПроизводствоКоличество,
	|	0 КАК РасходНаПроизводствоСтоимость,
	|	0 КАК РасходНаПроизводствоПР,
	|	0 КАК РасходНаПроизводствоВР,
	|	0 КАК РасходНаПроизводствоЗабалансовая,
	|	
	|	0 КАК КонечныйОстатокКоличество,
	|	0 КАК КонечныйОстатокСтоимость,
	|	0 КАК КонечныйОстатокПР,
	|	0 КАК КонечныйОстатокВР,
	|	0 КАК КонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|			ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.Партия
	|
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ДД.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
	|	И ДД.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВключениеИсключениеНДСВСтоимости)
	|	И (НЕ &ПоПредприятию
	|		ИЛИ СпрПартииПроизводства.Организация ЕСТЬ NULL
	|		ИЛИ СпрПартииПроизводства.Организация = ДД.Организация)
	|{ ГДЕ
	|	ДД.Организация КАК Организация,
	|	Аналитика.МестоХранения КАК Подразделение,
	|	Аналитика.Номенклатура КАК Номенклатура,
	|	Аналитика.Характеристика КАК Характеристика
	|}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&ВключениеИсключениеНДС КАК Содержание,
	|	ДД.СтатьяКалькуляции.ТипЗатрат КАК ТипЗатрат,
	|	&Постатейные КАК ВидЗатрат,
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	Реквизиты.Подразделение КАК ПодразделениеОтправитель,
	|	ДД.Регистратор КАК Регистратор,
	|	СпрПартииПроизводства.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			ТОГДА ДД.ПартияПроизводства
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	
	|	0 КАК НачальныйОстатокКоличество,
	|	0 КАК НачальныйОстатокСтоимость,
	|	0 КАК НачальныйОстатокПР,
	|	0 КАК НачальныйОстатокВР,
	|	0 КАК НачальныйОстатокЗабалансовая,
	|	
	|	0 КАК ИзрасходованоНаПроизводствоКоличество,
	|	0 КАК ИзрасходованоНаПроизводствоСтоимость,
	|	0 КАК ИзрасходованоНаПроизводствоПР,
	|	0 КАК ИзрасходованоНаПроизводствоВР,
	|	0 КАК ИзрасходованоНаПроизводствоЗабалансовая,
	|	
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр
	|			КОНЕЦ
	|	КОНЕЦ КАК ВключениеИсключениеНДС,
	|	
	|	0 КАК РасходНаПроизводствоКоличество,
	|	0 КАК РасходНаПроизводствоСтоимость,
	|	0 КАК РасходНаПроизводствоПР,
	|	0 КАК РасходНаПроизводствоВР,
	|	0 КАК РасходНаПроизводствоЗабалансовая,
	|	
	|	0 КАК КонечныйОстатокКоличество,
	|	0 КАК КонечныйОстатокСтоимость,
	|	0 КАК КонечныйОстатокПР,
	|	0 КАК КонечныйОстатокВР,
	|	0 КАК КонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.ПартияПроизводства
	|			И (СпрПартииПроизводства.Организация = ДД.Организация ИЛИ НЕ &ПоПредприятию)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Реквизиты
	|		ПО ДД.Регистратор = Реквизиты.Ссылка
	|
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ДД.НастройкаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВключениеИсключениеНДСВСтоимости)
	|{ГДЕ
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов
	|}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&ПоступилоМатериалы21 КАК Содержание,
	|	КорАналитика.СтатьяКалькуляции.ТипЗатрат КАК ТипЗатрат,
	|	&Материальные КАК ВидЗатрат,
	|	ДД.Организация КАК Организация,
	|	КорАналитика.МестоХранения КАК Подразделение,
	|	Аналитика.МестоХранения КАК ПодразделениеОтправитель,
	|	ДД.Регистратор КАК Регистратор,
	|	КорАналитика.Назначение.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	КорАналитика.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.КорАналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	КорАналитика.Номенклатура КАК Номенклатура,
	|	КорАналитика.Характеристика КАК Характеристика,
	|	КорАналитика.Серия КАК Серия,
	|	КорАналитика.Назначение КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.КорПартия КАК ПартияПроизводства,
	|	ДД.КорПартия КАК ЗаказНаПроизводство,
	|	
	|	0 КАК НачальныйОстатокКоличество,
	|	0 КАК НачальныйОстатокСтоимость,
	|	0 КАК НачальныйОстатокПР,
	|	0 КАК НачальныйОстатокВР,
	|	0 КАК НачальныйОстатокЗабалансовая,
	|	
	|	ДД.Количество КАК ИзрасходованоНаПроизводствоКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|			КОНЕЦ
	|	КОНЕЦ КАК ИзрасходованоНаПроизводствоСтоимость,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ПостояннаяРазница
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ИзрасходованоНаПроизводствоПР,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ВременнаяРазница
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ИзрасходованоНаПроизводствоВР,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|	КОНЕЦ КАК ИзрасходованоНаПроизводствоЗабалансовая,
	|	
	|	0 КАК ВключениеИсключениеНДС,
	|	
	|	0 КАК РасходНаПроизводствоКоличество,
	|	0 КАК РасходНаПроизводствоСтоимость,
	|	0 КАК РасходНаПроизводствоПР,
	|	0 КАК РасходНаПроизводствоВР,
	|	0 КАК РасходНаПроизводствоЗабалансовая,
	|	
	|	0 КАК КонечныйОстатокКоличество,
	|	0 КАК КонечныйОстатокСтоимость,
	|	0 КАК КонечныйОстатокПР,
	|	0 КАК КонечныйОстатокВР,
	|	0 КАК КонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|			ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитика
	|			ПО ДД.КорАналитикаУчетаНоменклатуры = КорАналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|			ПО СпрПартииПроизводства.Ссылка = ДД.КорПартия
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И (
	|		(ДД.Регистратор Ссылка Документ.РаспределениеПроизводственныхЗатрат И НЕ ВЫРАЗИТЬ(ДД.Регистратор КАК Документ.РаспределениеПроизводственныхЗатрат).НовоеПроизводство)
	//++ Устарело_Производство21
	|		ИЛИ  (ДД.Регистратор Ссылка Документ.ВыпускПродукции И НЕ ВЫРАЗИТЬ(ДД.Регистратор КАК Документ.ВыпускПродукции).ВыпускПоРаспоряжениям)

	//-- Устарело_Производство21
	|		)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И (НЕ &ПоПредприятию
	|		ИЛИ СпрПартииПроизводства.Организация ЕСТЬ NULL
	|		ИЛИ СпрПартииПроизводства.Организация = ДД.Организация)
	|	
	|{ ГДЕ
	|	ДД.Организация КАК Организация,
	|	КорАналитика.МестоХранения КАК Подразделение,
	|	КорАналитика.Номенклатура КАК Номенклатура,
	|	КорАналитика.Характеристика КАК Характеристика
	|}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&ПоступилоОтходы КАК Содержание,
	|	Аналитика.СтатьяКалькуляции.ТипЗатрат КАК ТипЗатрат,
	|	&Материальные КАК ВидЗатрат,
	|	ДД.Организация КАК Организация,
	|	Аналитика.МестоХранения КАК Подразделение,
	|	КорАналитика.МестоХранения КАК ПодразделениеОтправитель,
	|	ДД.Регистратор КАК Регистратор,
	|	ЕСТЬNULL(СпрПартииПроизводства.НаправлениеДеятельности,
	|		Аналитика.Назначение.НаправлениеДеятельности) КАК НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Аналитика.Номенклатура КАК Номенклатура,
	|	Аналитика.Характеристика КАК Характеристика,
	|	Аналитика.Серия КАК Серия,
	|	Аналитика.Назначение КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.Партия КАК ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	
	|	0 КАК НачальныйОстатокКоличество,
	|	0 КАК НачальныйОстатокСтоимость,
	|	0 КАК НачальныйОстатокПР,
	|	0 КАК НачальныйОстатокВР,
	|	0 КАК НачальныйОстатокЗабалансовая,
	|	
	|	ДД.Количество КАК ИзрасходованоНаПроизводствоКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|			КОНЕЦ
	|	КОНЕЦ КАК ИзрасходованоНаПроизводствоСтоимость,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ПостояннаяРазница
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ИзрасходованоНаПроизводствоПР,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ВременнаяРазница
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ИзрасходованоНаПроизводствоВР,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|	КОНЕЦ КАК ИзрасходованоНаПроизводствоЗабалансовая,
	|	
	|	0 КАК ВключениеИсключениеНДС,
	|	
	|	0 КАК РасходНаПроизводствоКоличество,
	|	0 КАК РасходНаПроизводствоСтоимость,
	|	0 КАК РасходНаПроизводствоПР,
	|	0 КАК РасходНаПроизводствоВР,
	|	0 КАК РасходНаПроизводствоЗабалансовая,
	|	
	|	0 КАК КонечныйОстатокКоличество,
	|	0 КАК КонечныйОстатокСтоимость,
	|	0 КАК КонечныйОстатокПР,
	|	0 КАК КонечныйОстатокВР,
	|	0 КАК КонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|			ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорАналитика
	|			ПО ДД.КорАналитикаУчетаНоменклатуры = КорАналитика.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.Партия
	|			И (НЕ &ПоПредприятию ИЛИ СпрПартииПроизводства.Организация = ДД.Организация)
	|
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И Аналитика.СтатьяКалькуляции <> ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииФиксированнаяСтоимость)
	|{ ГДЕ
	|	ДД.Организация КАК Организация,
	|	Аналитика.МестоХранения КАК Подразделение,
	|	Аналитика.Номенклатура КАК Номенклатура,
	|	Аналитика.Характеристика КАК Характеристика
	|}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&ПоступилоУслуги22 КАК Содержание,
	|	Аналитика.СтатьяКалькуляции.ТипЗатрат КАК ТипЗатрат,
	|	&Услуги КАК ВидЗатрат,
	|	ДД.Организация КАК Организация,
	|	Аналитика.МестоХранения КАК Подразделение,
	|	Аналитика.МестоХранения КАК ПодразделениеОтправитель,
	|	ДД.Регистратор КАК Регистратор,
	|	ЕСТЬNULL(СпрПартииПроизводства.НаправлениеДеятельности,
	|		Аналитика.Назначение.НаправлениеДеятельности) КАК НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Аналитика.Номенклатура КАК Номенклатура,
	|	Аналитика.Характеристика КАК Характеристика,
	|	Аналитика.Серия КАК Серия,
	|	Аналитика.Назначение КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.Партия КАК ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	
	|	0 КАК НачальныйОстатокКоличество,
	|	0 КАК НачальныйОстатокСтоимость,
	|	0 КАК НачальныйОстатокПР,
	|	0 КАК НачальныйОстатокВР,
	|	0 КАК НачальныйОстатокЗабалансовая,
	|	
	|	ДД.Количество КАК ИзрасходованоНаПроизводствоКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|			КОНЕЦ
	|	КОНЕЦ КАК ИзрасходованоНаПроизводствоСтоимость,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ПостояннаяРазница
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ИзрасходованоНаПроизводствоПР,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ВременнаяРазница
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ИзрасходованоНаПроизводствоВР,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|	КОНЕЦ КАК ИзрасходованоНаПроизводствоЗабалансовая,
	|	
	|	0 КАК ВключениеИсключениеНДС,
	|	
	|	0 КАК РасходНаПроизводствоКоличество,
	|	0 КАК РасходНаПроизводствоСтоимость,
	|	0 КАК РасходНаПроизводствоПР,
	|	0 КАК РасходНаПроизводствоВР,
	|	0 КАК РасходНаПроизводствоЗабалансовая,
	|	
	|	0 КАК КонечныйОстатокКоличество,
	|	0 КАК КонечныйОстатокСтоимость,
	|	0 КАК КонечныйОстатокПР,
	|	0 КАК КонечныйОстатокВР,
	|	0 КАК КонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|			И Аналитика.СтатьяКалькуляции <> ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка) 
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.Партия
	|			И (СпрПартииПроизводства.Организация = ДД.Организация ИЛИ НЕ &ПоПредприятию)
	|
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) 
	|	И ДД.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика)
	|{ ГДЕ
	|	ДД.Организация КАК Организация,
	|	Аналитика.МестоХранения КАК Подразделение,
	|	Аналитика.Номенклатура КАК Номенклатура,
	|	Аналитика.Характеристика КАК Характеристика
	|}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&Расход22 КАК Содержание,
	|	Аналитика.СтатьяКалькуляции.ТипЗатрат КАК ТипЗатрат,
	|	&Материальные КАК ВидЗатрат,
	|	ДД.Организация КАК Организация,
	|	Аналитика.МестоХранения КАК Подразделение,
	|	Аналитика.МестоХранения КАК ПодразделениеОтправитель,
	|	ДД.Регистратор КАК Регистратор,
	|	ЕСТЬNULL(СпрПартииПроизводства.НаправлениеДеятельности,
	|		Аналитика.Назначение.НаправлениеДеятельности) КАК НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Аналитика.Номенклатура КАК Номенклатура,
	|	Аналитика.Характеристика КАК Характеристика,
	|	Аналитика.Серия КАК Серия,
	|	Аналитика.Назначение КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ДД.КорАналитикаУчетаНоменклатуры КАК АналитикаУчетаПродукции,
	|	АналитикаПродукции.Номенклатура КАК Продукция,
	|	АналитикаПродукции.Характеристика КАК ХарактеристикаПродукции,
	|	АналитикаПродукции.Серия КАК СерияПродукции,
	|	АналитикаПродукции.Назначение КАК НазначениеПродукции,
	|	
	|	ДД.Партия КАК ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	0 КАК НачальныйОстатокКоличество,
	|	0 КАК НачальныйОстатокСтоимость,
	|	0 КАК НачальныйОстатокПР,
	|	0 КАК НачальныйОстатокВР,
	|	0 КАК НачальныйОстатокЗабалансовая,
	|	0 КАК ИзрасходованоНаПроизводствоКоличество,
	|	0 КАК ИзрасходованоНаПроизводствоСтоимость,
	|	0 КАК ИзрасходованоНаПроизводствоПР,
	|	0 КАК ИзрасходованоНаПроизводствоВР,
	|	0 КАК ИзрасходованоНаПроизводствоЗабалансовая,
	|	0 КАК ВключениеИсключениеНДС,
	|	
	|	ДД.Количество КАК РасходНаПроизводствоКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|			КОНЕЦ
	|	КОНЕЦ КАК РасходНаПроизводствоСтоимость,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ПостояннаяРазница
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК РасходНаПроизводствоПР,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ВременнаяРазница
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК РасходНаПроизводствоВР,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|	КОНЕЦ КАК РасходНаПроизводствоЗабалансовая,
	|	0 КАК КонечныйОстатокКоличество,
	|	0 КАК КонечныйОстатокСтоимость,
	|	0 КАК КонечныйОстатокПР,
	|	0 КАК КонечныйОстатокВР,
	|	0 КАК КонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|			И Аналитика.СтатьяКалькуляции <> ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.Партия
	|			И (СпрПартииПроизводства.Организация = ДД.Организация ИЛИ НЕ &ПоПредприятию)
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаПродукции
	|		ПО ДД.КорАналитикаУчетаНоменклатуры = АналитикаПродукции.Ссылка
	|
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|{ ГДЕ
	|	ДД.Организация КАК Организация,
	|	Аналитика.МестоХранения КАК Подразделение,
	|	Аналитика.Номенклатура КАК Номенклатура,
	|	Аналитика.Характеристика КАК Характеристика
	|}
	//++ Устарело_Производство21
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&Расход21 КАК Содержание,
	|	Аналитика.СтатьяКалькуляции.ТипЗатрат КАК ТипЗатрат,
	|	&Материальные КАК ВидЗатрат,
	|	ДД.Организация КАК Организация,
	|	Аналитика.МестоХранения КАК Подразделение,
	|	Аналитика.МестоХранения КАК ПодразделениеОтправитель,
	|	ДД.Регистратор КАК Регистратор,
	|	Аналитика.Назначение.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Аналитика.Номенклатура КАК Номенклатура,
	|	Аналитика.Характеристика КАК Характеристика,
	|	Аналитика.Серия КАК Серия,
	|	Аналитика.Назначение КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ДД.КорАналитикаУчетаНоменклатуры КАК АналитикаУчетаПродукции,
	|	АналитикаПродукции.Номенклатура КАК Продукция,
	|	АналитикаПродукции.Характеристика КАК ХарактеристикаПродукции,
	|	АналитикаПродукции.Серия КАК СерияПродукции,
	|	АналитикаПродукции.Назначение КАК НазначениеПродукции,
	|	
	|	ДД.Партия КАК ПартияПроизводства,
	|	ДД.Партия КАК ЗаказНаПроизводство,
	|	0 КАК НачальныйОстатокКоличество,
	|	0 КАК НачальныйОстатокСтоимость,
	|	0 КАК НачальныйОстатокПР,
	|	0 КАК НачальныйОстатокВР,
	|	0 КАК НачальныйОстатокЗабалансовая,
	|	0 КАК ИзрасходованоНаПроизводствоКоличество,
	|	0 КАК ИзрасходованоНаПроизводствоСтоимость,
	|	0 КАК ИзрасходованоНаПроизводствоПР,
	|	0 КАК ИзрасходованоНаПроизводствоВР,
	|	0 КАК ИзрасходованоНаПроизводствоЗабалансовая,
	|	0 КАК ВключениеИсключениеНДС,
	|	
	|	ДД.Количество КАК РасходНаПроизводствоКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость + ДД.ДопРасходы + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеСНДС + ДД.ПостатейныеПеременныеСНДС
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл + ДД.ДопРасходыРегл + ДД.ТрудозатратыРегл + ДД.ПостатейныеПостоянныеРегл + ДД.ПостатейныеПеременныеРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС + ДД.ДопРасходыБезНДС + ДД.Трудозатраты + ДД.ПостатейныеПостоянныеБезНДС + ДД.ПостатейныеПеременныеБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр + ДД.ДопРасходыУпр + ДД.ТрудозатратыУпр + ДД.ПостатейныеПостоянныеУпр + ДД.ПостатейныеПеременныеУпр
	|			КОНЕЦ
	|	КОНЕЦ КАК РасходНаПроизводствоСтоимость,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ПостояннаяРазница
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК РасходНаПроизводствоПР,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ВременнаяРазница
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК РасходНаПроизводствоВР,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансовая
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРегл
	|	КОНЕЦ КАК РасходНаПроизводствоЗабалансовая,
	|	0 КАК КонечныйОстатокКоличество,
	|	0 КАК КонечныйОстатокСтоимость,
	|	0 КАК КонечныйОстатокПР,
	|	0 КАК КонечныйОстатокВР,
	|	0 КАК КонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК ДД
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаПродукции
	|		ПО ДД.КорАналитикаУчетаНоменклатуры = АналитикаПродукции.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.Партия
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ДД.Регистратор Ссылка Документ.ВыпускПродукции
	|	И (НЕ &ПоПредприятию
	|		ИЛИ СпрПартииПроизводства.Организация ЕСТЬ NULL
	|		ИЛИ СпрПартииПроизводства.Организация = ДД.Организация)
	|
	|{ ГДЕ
	|	ДД.Организация КАК Организация,
	|	Аналитика.МестоХранения КАК Подразделение,
	|	Аналитика.Номенклатура КАК Номенклатура,
	|	Аналитика.Характеристика КАК Характеристика
	|}
	//-- Устарело_Производство21
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&КонечныйОстаток КАК Содержание,
	|	Аналитика.СтатьяКалькуляции.ТипЗатрат КАК ТипЗатрат,
	|	ВЫБОР 
	|		КОГДА Аналитика.СтатьяКалькуляции.ТипЗатрат В (
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗатрат.Материальные),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыЗатрат.ВозвратныеОтходы))
	|			ТОГДА &Материальные
	|		ИНАЧЕ
	|			&Услуги
	|	КОНЕЦ КАК ВидЗатрат,
	|	ДД.Организация КАК Организация,
	|	Аналитика.МестоХранения КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеОтправитель,
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	ЕСТЬNULL(СпрПартииПроизводства.НаправлениеДеятельности,
	|		Аналитика.Назначение.НаправлениеДеятельности) КАК НаправлениеДеятельности,
	|	Аналитика.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Аналитика.Номенклатура КАК Номенклатура,
	|	Аналитика.Характеристика КАК Характеристика,
	|	Аналитика.Серия КАК Серия,
	|	Аналитика.Назначение КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.Партия КАК ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	
	|	0 КАК НачальныйОстатокКоличество,
	|	0 КАК НачальныйОстатокСтоимость,
	|	0 КАК НачальныйОстатокПР,
	|	0 КАК НачальныйОстатокВР,
	|	0 КАК НачальныйОстатокЗабалансовая,
	|	
	|	0 КАК ИзрасходованоНаПроизводствоКоличество,
	|	0 КАК ИзрасходованоНаПроизводствоСтоимость,
	|	0 КАК ИзрасходованоНаПроизводствоПР,
	|	0 КАК ИзрасходованоНаПроизводствоВР,
	|	0 КАК ИзрасходованоНаПроизводствоЗабалансовая,
	|	
	|	0 КАК ВключениеИсключениеНДС,
	|	
	|	0 КАК РасходНаПроизводствоКоличество,
	|	0 КАК РасходНаПроизводствоСтоимость,
	|	0 КАК РасходНаПроизводствоПР,
	|	0 КАК РасходНаПроизводствоВР,
	|	0 КАК РасходНаПроизводствоЗабалансовая,
	|	
	|	ДД.КоличествоОстаток КАК КонечныйОстатокКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток + ДД.ДопРасходыОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеСНДСОстаток + ДД.ПостатейныеПеременныеСНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДСОстаток + ДД.ДопРасходыБезНДСОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеБезНДСОстаток + ДД.ПостатейныеПеременныеБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпрОстаток + ДД.ДопРасходыУпрОстаток + ДД.ТрудозатратыУпрОстаток + ДД.ПостатейныеПостоянныеУпрОстаток + ДД.ПостатейныеПеременныеУпрОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток + ДД.ДопРасходыРеглОстаток + ДД.ТрудозатратыРеглОстаток + ДД.ПостатейныеПостоянныеРеглОстаток + ДД.ПостатейныеПеременныеРеглОстаток
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДСОстаток + ДД.ДопРасходыБезНДСОстаток + ДД.ТрудозатратыОстаток + ДД.ПостатейныеПостоянныеБезНДСОстаток + ДД.ПостатейныеПеременныеБезНДСОстаток
	|			ИНАЧЕ
	|				ДД.СтоимостьУпрОстаток + ДД.ДопРасходыУпрОстаток + ДД.ТрудозатратыУпрОстаток + ДД.ПостатейныеПостоянныеУпрОстаток + ДД.ПостатейныеПеременныеУпрОстаток
	|			КОНЕЦ
	|	КОНЕЦ КАК КонечныйОстатокСтоимость,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ПостояннаяРазницаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК КонечныйОстатокПР,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ВременнаяРазницаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК КонечныйОстатокВР,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА 0
	|		КОГДА &ДанныеПоСебестоимости = 2 ИЛИ &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьЗабалансоваяОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьЗабалансоваяРеглОстаток
	|	КОНЕЦ КАК КонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(
	|			{(&ОкончаниеПериодаГраница)},
	|			АналитикаУчетаНоменклатуры.ТипМестаХранения В (
	|					ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение),
	|					ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.ДоговорКонтрагента)
	|				)
	|				И (АналитикаУчетаНоменклатуры.СтатьяКалькуляции <> ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка)
	|			)
	|			{
	|				Организация КАК Организация,
	|				АналитикаУчетаНоменклатуры.Подразделение КАК Подразделение,
	|				АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|				АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика
	|			}
	|			) КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.Партия
	|			И (СпрПартииПроизводства.Организация = ДД.Организация ИЛИ НЕ &ПоПредприятию)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ДД.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	// трудозатраты
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&НачальныйОстатокТрудозатраты22 КАК Содержание,
	|	ДД.СтатьяКалькуляции.ТипЗатрат КАК ТипЗатрат,
	|	&Трудозатраты КАК ВидЗатрат,
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеОтправитель,
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	СпрПартииПроизводства.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			ТОГДА ДД.ПартияПроизводства
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	
	|	ДД.КоличествоОстаток КАК НачальныйОстатокКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток
	|		ИНАЧЕ
	|			ДД.СтоимостьОстаток
	|	КОНЕЦ КАК НачальныйОстатокСтоимость,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ПостояннаяРазницаОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НачальныйОстатокПР,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ВременнаяРазницаОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НачальныйОстатокВР,
	|	0 КАК НачальныйОстатокЗабалансовая,
	|	
	|	0 КАК ИзрасходованоНаПроизводствоКоличество,
	|	0 КАК ИзрасходованоНаПроизводствоСтоимость,
	|	0 КАК ИзрасходованоНаПроизводствоПР,
	|	0 КАК ИзрасходованоНаПроизводствоВР,
	|	0 КАК ИзрасходованоНаПроизводствоЗабалансовая,
	|	
	|	0 КАК ВключениеИсключениеНДС,
	|	
	|	0 КАК РасходНаПроизводствоКоличество,
	|	0 КАК РасходНаПроизводствоСтоимость,
	|	0 КАК РасходНаПроизводствоПР,
	|	0 КАК РасходНаПроизводствоВР,
	|	0 КАК РасходНаПроизводствоЗабалансовая,
	|	
	|	0 КАК КонечныйОстатокКоличество,
	|	0 КАК КонечныйОстатокСтоимость,
	|	0 КАК КонечныйОстатокПР,
	|	0 КАК КонечныйОстатокВР,
	|	0 КАК КонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства.Остатки(
	|			{(&НачалоПериода)},
	|			ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			И (ПартияПроизводства.Организация = Организация ИЛИ НЕ &ПоПредприятию)
	|			И НЕ &БезОтбораПоПериоду
	|			{
	|				Организация,
	|				Подразделение
	|			}
	|	) КАК ДД
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.ПартияПроизводства
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&НачальныйОстатокТрудозатраты21 КАК Содержание,
	|	ДД.СтатьяКалькуляции.ТипЗатрат КАК ТипЗатрат,
	|	&Трудозатраты КАК ВидЗатрат,
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеОтправитель,
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ЗаказНаПроизводство КАК Партия,
	|	ДД.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	
	|	ДД.КоличествоОстаток КАК НачальныйОстатокКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток
	|		ИНАЧЕ
	|			ДД.СтоимостьОстаток
	|	КОНЕЦ КАК НачальныйОстатокСтоимость,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ПостояннаяРазницаОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НачальныйОстатокПР,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ВременнаяРазницаОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НачальныйОстатокВР,
	|	0 КАК НачальныйОстатокЗабалансовая,
	|	
	|	0 КАК ИзрасходованоНаПроизводствоКоличество,
	|	0 КАК ИзрасходованоНаПроизводствоСтоимость,
	|	0 КАК ИзрасходованоНаПроизводствоПР,
	|	0 КАК ИзрасходованоНаПроизводствоВР,
	|	0 КАК ИзрасходованоНаПроизводствоЗабалансовая,
	|	
	|	0 КАК ВключениеИсключениеНДС,
	|	
	|	0 КАК РасходНаПроизводствоКоличество,
	|	0 КАК РасходНаПроизводствоСтоимость,
	|	0 КАК РасходНаПроизводствоПР,
	|	0 КАК РасходНаПроизводствоВР,
	|	0 КАК РасходНаПроизводствоЗабалансовая,
	|	
	|	0 КАК КонечныйОстатокКоличество,
	|	0 КАК КонечныйОстатокСтоимость,
	|	0 КАК КонечныйОстатокПР,
	|	0 КАК КонечныйОстатокВР,
	|	0 КАК КонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства.Остатки(
	|			{(&НачалоПериода)},
	|			ПартияПроизводства = ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			И НЕ &БезОтбораПоПериоду
	|			{
	|				Организация,
	|				Подразделение
	|			}
	|			) КАК ДД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&ПоступилоТрудозатраты22 КАК Содержание,
	|	ДД.СтатьяКалькуляции.ТипЗатрат КАК ТипЗатрат,
	|	&Трудозатраты КАК ВидЗатрат,
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ДД.Подразделение КАК ПодразделениеОтправитель,
	|	ДД.Регистратор КАК Регистратор,
	|	СпрПартииПроизводства.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ПартияПроизводства КАК ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	
	|	0 КАК НачальныйОстатокКоличество,
	|	0 КАК НачальныйОстатокСтоимость,
	|	0 КАК НачальныйОстатокПР,
	|	0 КАК НачальныйОстатокВР,
	|	0 КАК НачальныйОстатокЗабалансовая,
	|	
	|	ДД.Количество КАК ИзрасходованоНаПроизводствоКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл
	|		ИНАЧЕ
	|			ДД.Стоимость
	|	КОНЕЦ КАК ИзрасходованоНаПроизводствоСтоимость,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ПостояннаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИзрасходованоНаПроизводствоПР,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ВременнаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИзрасходованоНаПроизводствоВР,
	|	0 КАК ИзрасходованоНаПроизводствоЗабалансовая,
	|	
	|	0 КАК ВключениеИсключениеНДС,
	|	
	|	0 КАК РасходНаПроизводствоКоличество,
	|	0 КАК РасходНаПроизводствоСтоимость,
	|	0 КАК РасходНаПроизводствоПР,
	|	0 КАК РасходНаПроизводствоВР,
	|	0 КАК РасходНаПроизводствоЗабалансовая,
	|	
	|	0 КАК КонечныйОстатокКоличество,
	|	0 КАК КонечныйОстатокСтоимость,
	|	0 КАК КонечныйОстатокПР,
	|	0 КАК КонечныйОстатокВР,
	|	0 КАК КонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.ПартияПроизводства
	|			И (СпрПартииПроизводства.Организация = ДД.Организация ИЛИ НЕ &ПоПредприятию)
	|
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|{ГДЕ
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение
	|}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&ПоступилоТрудозатраты21 КАК Содержание,
	|	ДД.СтатьяКалькуляции.ТипЗатрат КАК ТипЗатрат,
	|	&Трудозатраты КАК ВидЗатрат,
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ДД.Подразделение КАК ПодразделениеОтправитель,
	|	ДД.Регистратор КАК Регистратор,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ЗаказНаПроизводство КАК ПартияПроизводства,
	|	ДД.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	
	|	0 КАК НачальныйОстатокКоличество,
	|	0 КАК НачальныйОстатокСтоимость,
	|	0 КАК НачальныйОстатокПР,
	|	0 КАК НачальныйОстатокВР,
	|	0 КАК НачальныйОстатокЗабалансовая,
	|	
	|	ДД.Количество КАК ИзрасходованоНаПроизводствоКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл
	|		ИНАЧЕ
	|			ДД.Стоимость
	|	КОНЕЦ КАК ИзрасходованоНаПроизводствоСтоимость,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ПостояннаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИзрасходованоНаПроизводствоПР,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ВременнаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИзрасходованоНаПроизводствоВР,
	|	0 КАК ИзрасходованоНаПроизводствоЗабалансовая,
	|	
	|	0 КАК ВключениеИсключениеНДС,
	|	
	|	0 КАК РасходНаПроизводствоКоличество,
	|	0 КАК РасходНаПроизводствоСтоимость,
	|	0 КАК РасходНаПроизводствоПР,
	|	0 КАК РасходНаПроизводствоВР,
	|	0 КАК РасходНаПроизводствоЗабалансовая,
	|	
	|	0 КАК КонечныйОстатокКоличество,
	|	0 КАК КонечныйОстатокСтоимость,
	|	0 КАК КонечныйОстатокПР,
	|	0 КАК КонечныйОстатокВР,
	|	0 КАК КонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства КАК ДД
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ПартияПроизводства = ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|{ГДЕ
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение
	|}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&РасходТрудозатраты22 КАК Содержание,
	|	ДД.СтатьяКалькуляции.ТипЗатрат КАК ТипЗатрат,
	|	&Трудозатраты КАК ВидЗатрат,
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ДД.Подразделение КАК ПодразделениеОтправитель,
	|	ДД.Регистратор КАК Регистратор,
	|	СпрПартииПроизводства.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ДД.КорАналитикаУчетаПродукции КАК АналитикаУчетаПродукции,
	|	АналитикаПродукции.Номенклатура КАК Продукция,
	|	АналитикаПродукции.Характеристика КАК ХарактеристикаПродукции,
	|	АналитикаПродукции.Серия КАК СерияПродукции,
	|	АналитикаПродукции.Назначение КАК НазначениеПродукции,
	|
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			ТОГДА ДД.ПартияПроизводства
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	0 КАК НачальныйОстатокКоличество,
	|	0 КАК НачальныйОстатокСтоимость,
	|	0 КАК НачальныйОстатокПР,
	|	0 КАК НачальныйОстатокВР,
	|	0 КАК НачальныйОстатокЗабалансовая,
	|	
	|	0 КАК ИзрасходованоНаПроизводствоКоличество,
	|	0 КАК ИзрасходованоНаПроизводствоСтоимость,
	|	0 КАК ИзрасходованоНаПроизводствоПР,
	|	0 КАК ИзрасходованоНаПроизводствоВР,
	|	0 КАК ИзрасходованоНаПроизводствоЗабалансовая,
	|	
	|	0 КАК ВключениеИсключениеНДС,
	|	
	|	ДД.Количество КАК РасходНаПроизводствоКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл
	|		ИНАЧЕ
	|			ДД.Стоимость
	|	КОНЕЦ КАК РасходНаПроизводствоСтоимость,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ПостояннаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РасходНаПроизводствоПР,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ВременнаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РасходНаПроизводствоВР,
	|	0 КАК РасходНаПроизводствоЗабалансовая,
	|	0 КАК КонечныйОстатокКоличество,
	|	0 КАК КонечныйОстатокСтоимость,
	|	0 КАК КонечныйОстатокПР,
	|	0 КАК КонечныйОстатокВР,
	|	0 КАК КонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.ПартияПроизводства
	|			И (СпрПартииПроизводства.Организация = ДД.Организация ИЛИ НЕ &ПоПредприятию)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаПродукции
	|		ПО ДД.КорАналитикаУчетаПродукции = АналитикаПродукции.Ссылка
	|
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|{ГДЕ
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение
	|}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&РасходТрудозатраты21 КАК Содержание,
	|	ДД.СтатьяКалькуляции.ТипЗатрат КАК ТипЗатрат,
	|	&Трудозатраты КАК ВидЗатрат,
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ДД.Подразделение КАК ПодразделениеОтправитель,
	|	ДД.Регистратор КАК Регистратор,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|	КОНЕЦ КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ДД.КорАналитикаУчетаПродукции КАК АналитикаУчетаПродукции,
	|	АналитикаПродукции.Номенклатура КАК Продукция,
	|	АналитикаПродукции.Характеристика КАК ХарактеристикаПродукции,
	|	АналитикаПродукции.Серия КАК СерияПродукции,
	|	АналитикаПродукции.Назначение КАК НазначениеПродукции,
	|
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА ДД.ДокументВыпуска
	|	КОНЕЦ КАК Партия,
	|	ДД.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	0 КАК НачальныйОстатокКоличество,
	|	0 КАК НачальныйОстатокСтоимость,
	|	0 КАК НачальныйОстатокПР,
	|	0 КАК НачальныйОстатокВР,
	|	0 КАК НачальныйОстатокЗабалансовая,
	|	
	|	0 КАК ИзрасходованоНаПроизводствоКоличество,
	|	0 КАК ИзрасходованоНаПроизводствоСтоимость,
	|	0 КАК ИзрасходованоНаПроизводствоПР,
	|	0 КАК ИзрасходованоНаПроизводствоВР,
	|	0 КАК ИзрасходованоНаПроизводствоЗабалансовая,
	|	
	|	0 КАК ВключениеИсключениеНДС,
	|	
	|	ДД.Количество КАК РасходНаПроизводствоКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл
	|		ИНАЧЕ
	|			ДД.Стоимость
	|	КОНЕЦ КАК РасходНаПроизводствоСтоимость,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ПостояннаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РасходНаПроизводствоПР,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ВременнаяРазница
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РасходНаПроизводствоВР,
	|	0 КАК РасходНаПроизводствоЗабалансовая,
	|	0 КАК КонечныйОстатокКоличество,
	|	0 КАК КонечныйОстатокСтоимость,
	|	0 КАК КонечныйОстатокПР,
	|	0 КАК КонечныйОстатокВР,
	|	0 КАК КонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства КАК ДД
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаПродукции
	|	ПО ДД.КорАналитикаУчетаПродукции = АналитикаПродукции.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ПартияПроизводства = ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|{ГДЕ
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение
	|}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Производство КАК Таблицы,
	|	&КонечныйОстатокТрудозатраты22 КАК Содержание,
	|	ДД.СтатьяКалькуляции.ТипЗатрат КАК ТипЗатрат,
	|	&Трудозатраты КАК ВидЗатрат,
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеОтправитель,
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	СпрПартииПроизводства.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			ТОГДА ДД.ПартияПроизводства
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	
	|	0 КАК НачальныйОстатокКоличество,
	|	0 КАК НачальныйОстатокСтоимость,
	|	0 КАК НачальныйОстатокПР,
	|	0 КАК НачальныйОстатокВР,
	|	0 КАК НачальныйОстатокЗабалансовая,
	|	
	|	0 КАК ИзрасходованоНаПроизводствоКоличество,
	|	0 КАК ИзрасходованоНаПроизводствоСтоимость,
	|	0 КАК ИзрасходованоНаПроизводствоПР,
	|	0 КАК ИзрасходованоНаПроизводствоВР,
	|	0 КАК ИзрасходованоНаПроизводствоЗабалансовая,
	|	
	|	0 КАК ВключениеИсключениеНДС,
	|	
	|	0 КАК РасходНаПроизводствоКоличество,
	|	0 КАК РасходНаПроизводствоСтоимость,
	|	0 КАК РасходНаПроизводствоПР,
	|	0 КАК РасходНаПроизводствоВР,
	|	0 КАК РасходНаПроизводствоЗабалансовая,
	|	
	|	ДД.КоличествоОстаток КАК КонечныйОстатокКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток
	|		ИНАЧЕ
	|			ДД.СтоимостьОстаток
	|	КОНЕЦ КАК КонечныйОстатокСтоимость,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ПостояннаяРазницаОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КонечныйОстатокПР,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ВременнаяРазницаОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КонечныйОстатокВР,
	|	0 КАК КонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства.Остатки(
	|			{(&ОкончаниеПериодаГраница)},
	|			ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			И (ПартияПроизводства.Организация = Организация ИЛИ НЕ &ПоПредприятию)
	|			{
	|				Организация КАК Организация,
	|				Подразделение КАК Подразделение
	|			}
	|	) КАК ДД
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.ПартияПроизводства
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&КонечныйОстатокТрудозатраты21 КАК Содержание,
	|	ДД.СтатьяКалькуляции.ТипЗатрат КАК ТипЗатрат,
	|	&Трудозатраты КАК ВидЗатрат,
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеОтправитель,
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	Значение(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	НЕОПРЕДЕЛЕНО КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ЗаказНаПроизводство КАК ПартияПроизводства,
	|	ДД.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	
	|	0 КАК НачальныйОстатокКоличество,
	|	0 КАК НачальныйОстатокСтоимость,
	|	0 КАК НачальныйОстатокПР,
	|	0 КАК НачальныйОстатокВР,
	|	0 КАК НачальныйОстатокЗабалансовая,
	|	
	|	0 КАК ИзрасходованоНаПроизводствоКоличество,
	|	0 КАК ИзрасходованоНаПроизводствоСтоимость,
	|	0 КАК ИзрасходованоНаПроизводствоПР,
	|	0 КАК ИзрасходованоНаПроизводствоВР,
	|	0 КАК ИзрасходованоНаПроизводствоЗабалансовая,
	|	
	|	0 КАК ВключениеИсключениеНДС,
	|	
	|	0 КАК РасходНаПроизводствоКоличество,
	|	0 КАК РасходНаПроизводствоСтоимость,
	|	0 КАК РасходНаПроизводствоПР,
	|	0 КАК РасходНаПроизводствоВР,
	|	0 КАК РасходНаПроизводствоЗабалансовая,
	|	
	|	ДД.КоличествоОстаток КАК КонечныйОстатокКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток
	|		ИНАЧЕ
	|			ДД.СтоимостьОстаток
	|	КОНЕЦ КАК КонечныйОстатокСтоимость,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ПостояннаяРазницаОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КонечныйОстатокПР,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ВременнаяРазницаОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КонечныйОстатокВР,
	|	0 КАК КонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства.Остатки(
	|			{(&ОкончаниеПериодаГраница)},
	|			ПартияПроизводства = ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			{
	|				Организация КАК Организация,
	|				Подразделение КАК Подразделение
	|			}
	|			) КАК ДД
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	// постатейные
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&НачальныйОстатокПостатейные22 КАК Содержание,
	|	ДД.СтатьяКалькуляции.ТипЗатрат КАК ТипЗатрат,
	|	&Постатейные КАК ВидЗатрат,
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеОтправитель,
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	СпрПартииПроизводства.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			ТОГДА ДД.ПартияПроизводства
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	
	|	0                            КАК НачальныйОстатокКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпрОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДСОстаток
	|			ИНАЧЕ
	|				ДД.СтоимостьУпрОстаток
	|			КОНЕЦ
	|	КОНЕЦ КАК НачальныйОстатокСтоимость,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ПостояннаяРазницаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК НачальныйОстатокПР,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ВременнаяРазницаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК НачальныйОстатокВР,
	|	0                            КАК НачальныйОстатокЗабалансовая,
	|	
	|	0 КАК ПоступилоКоличество,
	|	0 КАК ПоступилоСтоимость,
	|	0 КАК ПоступилоПР,
	|	0 КАК ПоступилоВР,
	|	0 КАК ПоступилоЗабалансовая,
	|	
	|	0 КАК ВключениеИсключениеНДС,
	|	
	|	0 КАК РасходНаПроизводствоКоличество,
	|	0 КАК РасходНаПроизводствоСтоимость,
	|	0 КАК РасходНаПроизводствоПР,
	|	0 КАК РасходНаПроизводствоВР,
	|	0 КАК РасходНаПроизводствоЗабалансовая,
	|	
	|	0 КАК КонечныйОстатокКоличество,
	|	0 КАК КонечныйОстатокСтоимость,
	|	0 КАК КонечныйОстатокПР,
	|	0 КАК КонечныйОстатокВР,
	|	0 КАК КонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства.Остатки(
	|			{(&НачалоПериода)},
	|			ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			И (ПартияПроизводства.Организация = Организация ИЛИ НЕ &ПоПредприятию)
	|			И НЕ &БезОтбораПоПериоду
	|			{
	|				Организация,
	|				Подразделение,
	|				СтатьяРасходов,
	|				АналитикаРасходов,
	|				ПартияПроизводства.Документ КАК ЗаказНаПроизводство
	|			}
	|			) КАК ДД
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.ПартияПроизводства
	|			
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|	
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&НачальныйОстатокПостатейные21 КАК Содержание,
	|	ДД.СтатьяКалькуляции.ТипЗатрат КАК ТипЗатрат,
	|	&Постатейные КАК ВидЗатрат,
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеОтправитель,
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	ДД.ЗаказНаПроизводство.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ЗаказНаПроизводство КАК ПартияПроизводства,
	|	ДД.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	
	|	0                            КАК НачальныйОстатокКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпрОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДСОстаток
	|			ИНАЧЕ
	|				ДД.СтоимостьУпрОстаток
	|			КОНЕЦ
	|	КОНЕЦ КАК НачальныйОстатокСтоимость,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ПостояннаяРазницаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК НачальныйОстатокПР,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ВременнаяРазницаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК НачальныйОстатокВР,
	|	0                            КАК НачальныйОстатокЗабалансовая,
	|	
	|	0 КАК ПоступилоКоличество,
	|	0 КАК ПоступилоСтоимость,
	|	0 КАК ПоступилоПР,
	|	0 КАК ПоступилоВР,
	|	0 КАК ПоступилоЗабалансовая,
	|	
	|	0 КАК ВключениеИсключениеНДС,
	|	
	|	0 КАК РасходНаПроизводствоКоличество,
	|	0 КАК РасходНаПроизводствоСтоимость,
	|	0 КАК РасходНаПроизводствоПР,
	|	0 КАК РасходНаПроизводствоВР,
	|	0 КАК РасходНаПроизводствоЗабалансовая,
	|	
	|	0 КАК КонечныйОстатокКоличество,
	|	0 КАК КонечныйОстатокСтоимость,
	|	0 КАК КонечныйОстатокПР,
	|	0 КАК КонечныйОстатокВР,
	|	0 КАК КонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства.Остатки(
	|			{(&НачалоПериода)},
	|			ПартияПроизводства = ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			И НЕ &БезОтбораПоПериоду
	|			{
	|				Организация,
	|				Подразделение,
	|				СтатьяРасходов,
	|				АналитикаРасходов,
	|				ПартияПроизводства.Документ КАК ЗаказНаПроизводство
	|			}
	|			) КАК ДД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&ПоступилоПостатейные22 КАК Содержание,
	|	ДД.СтатьяКалькуляции.ТипЗатрат КАК ТипЗатрат,
	|	&Постатейные КАК ВидЗатрат,
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	Реквизиты.Подразделение КАК ПодразделениеОтправитель,
	|	ДД.Регистратор КАК Регистратор,
	|	СпрПартииПроизводства.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			ТОГДА ДД.ПартияПроизводства
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	
	|	0 КАК НачальныйОстатокКоличество,
	|	0 КАК НачальныйОстатокСтоимость,
	|	0 КАК НачальныйОстатокПР,
	|	0 КАК НачальныйОстатокВР,
	|	0 КАК НачальныйОстатокЗабалансовая,
	|	
	|	0 КАК ИзрасходованоНаПроизводствоКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр
	|			КОНЕЦ
	|	КОНЕЦ КАК ИзрасходованоНаПроизводствоСтоимость,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ПостояннаяРазница
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ИзрасходованоНаПроизводствоПР,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ВременнаяРазница
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ИзрасходованоНаПроизводствоВР,
	|	0 КАК ИзрасходованоНаПроизводствоЗабалансовая,
	|	
	|	0 КАК ВключениеИсключениеНДС,
	|	
	|	0 КАК РасходНаПроизводствоКоличество,
	|	0 КАК РасходНаПроизводствоСтоимость,
	|	0 КАК РасходНаПроизводствоПР,
	|	0 КАК РасходНаПроизводствоВР,
	|	0 КАК РасходНаПроизводствоЗабалансовая,
	|	
	|	0 КАК КонечныйОстатокКоличество,
	|	0 КАК КонечныйОстатокСтоимость,
	|	0 КАК КонечныйОстатокПР,
	|	0 КАК КонечныйОстатокВР,
	|	0 КАК КонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.ПартияПроизводства
	|			И (СпрПартииПроизводства.Организация = ДД.Организация ИЛИ НЕ &ПоПредприятию)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Реквизиты
	|		ПО ДД.Регистратор = Реквизиты.Ссылка
	|
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ДД.НастройкаХозяйственнойОперации <> ЗНАЧЕНИЕ(Справочник.НастройкиХозяйственныхОпераций.ВключениеИсключениеНДСВСтоимости)
	|{ГДЕ
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов
	|}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&ПоступилоПостатейные21 КАК Содержание,
	|	ДД.СтатьяКалькуляции.ТипЗатрат КАК ТипЗатрат,
	|	&Постатейные КАК ВидЗатрат,
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	Реквизиты.Подразделение КАК ПодразделениеОтправитель,
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.ЗаказНаПроизводство.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ЗаказНаПроизводство КАК ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	
	|	0 КАК НачальныйОстатокКоличество,
	|	0 КАК НачальныйОстатокСтоимость,
	|	0 КАК НачальныйОстатокПР,
	|	0 КАК НачальныйОстатокВР,
	|	0 КАК НачальныйОстатокЗабалансовая,
	|	
	|	0 КАК ИзрасходованоНаПроизводствоКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр
	|			КОНЕЦ
	|	КОНЕЦ КАК ИзрасходованоНаПроизводствоСтоимость,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ПостояннаяРазница
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ИзрасходованоНаПроизводствоПР,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ВременнаяРазница
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ИзрасходованоНаПроизводствоВР,
	|	0 КАК ИзрасходованоНаПроизводствоЗабалансовая,
	|	
	|	0 КАК ВключениеИсключениеНДС,
	|	
	|	0 КАК РасходНаПроизводствоКоличество,
	|	0 КАК РасходНаПроизводствоСтоимость,
	|	0 КАК РасходНаПроизводствоПР,
	|	0 КАК РасходНаПроизводствоВР,
	|	0 КАК РасходНаПроизводствоЗабалансовая,
	|	
	|	0 КАК КонечныйОстатокКоличество,
	|	0 КАК КонечныйОстатокСтоимость,
	|	0 КАК КонечныйОстатокПР,
	|	0 КАК КонечныйОстатокВР,
	|	0 КАК КонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ДД
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеПрочихЗатрат КАК Реквизиты
	|		ПО ДД.Регистратор = Реквизиты.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ПартияПроизводства = ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|{ГДЕ
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов
	|}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&РасходПостатейные22 КАК Содержание,
	|	ДД.СтатьяКалькуляции.ТипЗатрат КАК ТипЗатрат,
	|	&Постатейные КАК ВидЗатрат,
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ДД.Подразделение КАК ПодразделениеОтправитель,
	|	ДД.Регистратор КАК Регистратор,
	|	СпрПартииПроизводства.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ДД.АналитикаУчетаПродукции КАК АналитикаУчетаПродукции,
	|	АналитикаПродукции.Номенклатура КАК Продукция,
	|	АналитикаПродукции.Характеристика КАК ХарактеристикаПродукции,
	|	АналитикаПродукции.Серия КАК СерияПродукции,
	|	АналитикаПродукции.Назначение КАК НазначениеПродукции,
	|
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			ТОГДА ДД.ПартияПроизводства
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	0 КАК НачальныйОстатокКоличество,
	|	0 КАК НачальныйОстатокСтоимость,
	|	0 КАК НачальныйОстатокПР,
	|	0 КАК НачальныйОстатокВР,
	|	0 КАК НачальныйОстатокЗабалансовая,
	|	
	|	0 КАК ИзрасходованоНаПроизводствоКоличество,
	|	0 КАК ИзрасходованоНаПроизводствоСтоимость,
	|	0 КАК ИзрасходованоНаПроизводствоПР,
	|	0 КАК ИзрасходованоНаПроизводствоВР,
	|	0 КАК ИзрасходованоНаПроизводствоЗабалансовая,
	|	
	|	0 КАК ВключениеИсключениеНДС,
	|	
	|	0 КАК РасходНаПроизводствоКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр
	|			КОНЕЦ
	|	КОНЕЦ КАК РасходНаПроизводствоСтоимость,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ПостояннаяРазница
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК РасходНаПроизводствоПР,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ВременнаяРазница
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК РасходНаПроизводствоВР,
	|	0 КАК РасходНаПроизводствоЗабалансовая,
	|	0 КАК КонечныйОстатокКоличество,
	|	0 КАК КонечныйОстатокСтоимость,
	|	0 КАК КонечныйОстатокПР,
	|	0 КАК КонечныйОстатокВР,
	|	0 КАК КонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ДД
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.ПартияПроизводства
	|			И (СпрПартииПроизводства.Организация = ДД.Организация ИЛИ НЕ &ПоПредприятию)
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаПродукции
	|		ПО ДД.АналитикаУчетаПродукции = АналитикаПродукции.Ссылка
	|
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|{ГДЕ
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов
	|}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&РасходПостатейные21 КАК Содержание,
	|	ДД.СтатьяКалькуляции.ТипЗатрат КАК ТипЗатрат,
	|	&Постатейные КАК ВидЗатрат,
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ДД.Подразделение КАК ПодразделениеОтправитель,
	|	ДД.Регистратор КАК Регистратор,
	|	ДД.ЗаказНаПроизводство.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ДД.АналитикаУчетаПродукции КАК АналитикаУчетаПродукции,
	|	АналитикаПродукции.Номенклатура КАК Продукция,
	|	АналитикаПродукции.Характеристика КАК ХарактеристикаПродукции,
	|	АналитикаПродукции.Серия КАК СерияПродукции,
	|	АналитикаПродукции.Назначение КАК НазначениеПродукции,
	|
	|	ДД.ЗаказНаПроизводство КАК ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	0 КАК НачальныйОстатокКоличество,
	|	0 КАК НачальныйОстатокСтоимость,
	|	0 КАК НачальныйОстатокПР,
	|	0 КАК НачальныйОстатокВР,
	|	0 КАК НачальныйОстатокЗабалансовая,
	|	
	|	0 КАК ИзрасходованоНаПроизводствоКоличество,
	|	0 КАК ИзрасходованоНаПроизводствоСтоимость,
	|	0 КАК ИзрасходованоНаПроизводствоПР,
	|	0 КАК ИзрасходованоНаПроизводствоВР,
	|	0 КАК ИзрасходованоНаПроизводствоЗабалансовая,
	|	
	|	0 КАК ВключениеИсключениеНДС,
	|	
	|	0 КАК РасходНаПроизводствоКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.Стоимость
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДС
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпр
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРегл
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДС
	|			ИНАЧЕ
	|				ДД.СтоимостьУпр
	|			КОНЕЦ
	|	КОНЕЦ КАК РасходНаПроизводствоСтоимость,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ПостояннаяРазница
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК РасходНаПроизводствоПР,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ВременнаяРазница
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК РасходНаПроизводствоВР,
	|	0 КАК РасходНаПроизводствоЗабалансовая,
	|	0 КАК КонечныйОстатокКоличество,
	|	0 КАК КонечныйОстатокСтоимость,
	|	0 КАК КонечныйОстатокПР,
	|	0 КАК КонечныйОстатокВР,
	|	0 КАК КонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ДД
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаПродукции
	|	ПО ДД.АналитикаУчетаПродукции = АналитикаПродукции.Ссылка
	|ГДЕ
	|	(ДД.Период МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|	И ДД.ПартияПроизводства = ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|	И ДД.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|{ГДЕ
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов
	|}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&КонечныйОстатокПостатейные22 КАК Содержание,
	|	ДД.СтатьяКалькуляции.ТипЗатрат КАК ТипЗатрат,
	|	&Постатейные КАК ВидЗатрат,
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеОтправитель,
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	СпрПартииПроизводства.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ВЫБОР
	|		КОГДА ДД.ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			ТОГДА ДД.ПартияПроизводства
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	
	|	0 КАК НачальныйОстатокКоличество,
	|	0 КАК НачальныйОстатокСтоимость,
	|	0 КАК НачальныйОстатокПР,
	|	0 КАК НачальныйОстатокВР,
	|	0 КАК НачальныйОстатокЗабалансовая,
	|	
	|	0 КАК ИзрасходованоНаПроизводствоКоличество,
	|	0 КАК ИзрасходованоНаПроизводствоСтоимость,
	|	0 КАК ИзрасходованоНаПроизводствоПР,
	|	0 КАК ИзрасходованоНаПроизводствоВР,
	|	0 КАК ИзрасходованоНаПроизводствоЗабалансовая,
	|	
	|	0 КАК ВключениеИсключениеНДС,
	|	
	|	0 КАК РасходНаПроизводствоКоличество,
	|	0 КАК РасходНаПроизводствоСтоимость,
	|	0 КАК РасходНаПроизводствоПР,
	|	0 КАК РасходНаПроизводствоВР,
	|	0 КАК РасходНаПроизводствоЗабалансовая,
	|	
	|	0 КАК КонечныйОстатокКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпрОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДСОстаток
	|			ИНАЧЕ
	|				ДД.СтоимостьУпрОстаток
	|			КОНЕЦ
	|	КОНЕЦ КАК КонечныйОстатокСтоимость,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ПостояннаяРазницаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК КонечныйОстатокПР,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ВременнаяРазницаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК КонечныйОстатокВР,
	|	0 КАК КонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства.Остатки(
	|			{(&ОкончаниеПериодаГраница)},
	|			ПартияПроизводства <> ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|				И (ПартияПроизводства.Организация = Организация ИЛИ НЕ &ПоПредприятию)
	|			{
	|				Организация,
	|				Подразделение,
	|				СтатьяРасходов,
	|				АналитикаРасходов,
	|				ПартияПроизводства.Документ КАК ЗаказНаПроизводство
	|			}
	|			) КАК ДД
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ДД.ПартияПроизводства
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Производство КАК Таблица,
	|	&КонечныйОстатокПостатейные21 КАК Содержание,
	|	ДД.СтатьяКалькуляции.ТипЗатрат КАК ТипЗатрат,
	|	&Постатейные КАК ВидЗатрат,
	|	ДД.Организация КАК Организация,
	|	ДД.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка) КАК ПодразделениеОтправитель,
	|	НЕОПРЕДЕЛЕНО КАК Регистратор,
	|	ДД.ЗаказНаПроизводство.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	Значение(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаНоменклатуры,
	|	Значение(Справочник.Номенклатура.ПустаяСсылка) КАК Номенклатура,
	|	Значение(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
	|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
	|	
	|	// аналитика трудозатрат
	|	Значение(Справочник.ВидыРаботСотрудников.ПустаяСсылка) КАК ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов КАК СтатьяРасходов,
	|	ДД.АналитикаРасходов КАК АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка) КАК АналитикаУчетаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК Продукция,
	|	НЕОПРЕДЕЛЕНО КАК ХарактеристикаПродукции,
	|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК СерияПродукции,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК НазначениеПродукции,
	|
	|	ДД.ЗаказНаПроизводство КАК ПартияПроизводства,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ЗаказНаПроизводство,
	|	
	|	0 КАК НачальныйОстатокКоличество,
	|	0 КАК НачальныйОстатокСтоимость,
	|	0 КАК НачальныйОстатокПР,
	|	0 КАК НачальныйОстатокВР,
	|	0 КАК НачальныйОстатокЗабалансовая,
	|	
	|	0 КАК ИзрасходованоНаПроизводствоКоличество,
	|	0 КАК ИзрасходованоНаПроизводствоСтоимость,
	|	0 КАК ИзрасходованоНаПроизводствоПР,
	|	0 КАК ИзрасходованоНаПроизводствоВР,
	|	0 КАК ИзрасходованоНаПроизводствоЗабалансовая,
	|	
	|	0 КАК ВключениеИсключениеНДС,
	|	
	|	0 КАК РасходНаПроизводствоКоличество,
	|	0 КАК РасходНаПроизводствоСтоимость,
	|	0 КАК РасходНаПроизводствоПР,
	|	0 КАК РасходНаПроизводствоВР,
	|	0 КАК РасходНаПроизводствоЗабалансовая,
	|	
	|	0 КАК КонечныйОстатокКоличество,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 1
	|			ТОГДА ДД.СтоимостьОстаток
	|		КОГДА &ДанныеПоСебестоимости = 2
	|			ТОГДА ДД.СтоимостьБезНДСОстаток
	|		КОГДА &ДанныеПоСебестоимости = 3
	|			ТОГДА ДД.СтоимостьУпрОстаток
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.СтоимостьРеглОстаток
	|		ИНАЧЕ
	|			ВЫБОР КОГДА &ПоПредприятию
	|				ТОГДА ДД.СтоимостьБезНДСОстаток
	|			ИНАЧЕ
	|				ДД.СтоимостьУпрОстаток
	|			КОНЕЦ
	|	КОНЕЦ КАК КонечныйОстатокСтоимость,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ПостояннаяРазницаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК КонечныйОстатокПР,
	|	ВЫБОР
	|		КОГДА &ДанныеПоСебестоимости = 4
	|			ТОГДА ДД.ВременнаяРазницаОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК КонечныйОстатокВР,
	|	0 КАК КонечныйОстатокЗабалансовая
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства.Остатки(
	|			{(&ОкончаниеПериодаГраница)},
	|			ПартияПроизводства = ЗНАЧЕНИЕ(Справочник.ПартииПроизводства.ПустаяСсылка)
	|			{
	|				Организация,
	|				Подразделение,
	|				ЗаказНаПроизводство.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|				СтатьяРасходов,
	|				АналитикаРасходов,
	|				ЗаказНаПроизводство КАК ЗаказНаПроизводство
	|			}
	|			) КАК ДД
	|) КАК ДД
	|
	|СГРУППИРОВАТЬ ПО
	|
	|	ДД.Таблица,
	|	ДД.Содержание,
	|	ДД.ТипЗатрат,
	|	ДД.ВидЗатрат,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.ПодразделениеОтправитель,
	|	ДД.Регистратор,
	|	ДД.НаправлениеДеятельности,
	|	ДД.СтатьяКалькуляции,
	|	
	|	// аналитика материала
	|	ДД.АналитикаУчетаНоменклатуры,
	|	ДД.Номенклатура,
	|	ДД.Характеристика,
	|	ДД.Серия,
	|	ДД.Назначение,
	|	
	|	// аналитика трудозатрат
	|	ДД.ВидРабот,
	|	
	|	// аналитика постатейного расхода
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	
	|	// аналитика продукции
	|	ДД.АналитикаУчетаПродукции,
	|	ДД.Продукция,
	|	ДД.ХарактеристикаПродукции,
	|	ДД.СерияПродукции,
	|	ДД.НазначениеПродукции,
	|	
	|	ДД.ПартияПроизводства,
	|	ДД.ЗаказНаПроизводство
	|";
	
	Ресурсы = Новый Массив;
	
	Ресурсы.Добавить("НачальныйОстатокКоличество");
	Ресурсы.Добавить("НачальныйОстатокСтоимость");
	Ресурсы.Добавить("НачальныйОстатокПР");
	Ресурсы.Добавить("НачальныйОстатокВР");
	Ресурсы.Добавить("НачальныйОстатокЗабалансовая");
	
	Ресурсы.Добавить("ИзрасходованоНаПроизводствоКоличество");
	Ресурсы.Добавить("ИзрасходованоНаПроизводствоСтоимость");
	Ресурсы.Добавить("ИзрасходованоНаПроизводствоПР");
	Ресурсы.Добавить("ИзрасходованоНаПроизводствоВР");
	Ресурсы.Добавить("ИзрасходованоНаПроизводствоЗабалансовая");

	Ресурсы.Добавить("РасходНаПроизводствоКоличество");
	Ресурсы.Добавить("РасходНаПроизводствоСтоимость");
	Ресурсы.Добавить("РасходНаПроизводствоПР");
	Ресурсы.Добавить("РасходНаПроизводствоВР");
	Ресурсы.Добавить("РасходНаПроизводствоЗабалансовая");

	Ресурсы.Добавить("КонечныйОстатокКоличество");
	Ресурсы.Добавить("КонечныйОстатокСтоимость");
	Ресурсы.Добавить("КонечныйОстатокПР");
	Ресурсы.Добавить("КонечныйОстатокВР");
	Ресурсы.Добавить("КонечныйОстатокЗабалансовая");
	
	Возврат Новый Структура("ТекстЗапроса, Ресурсы", ТекстЗапроса, Ресурсы);

КонецФункции

//-- НЕ УТ

// Добавляет отбор в набор данных схемы компоновки данных по переданным ресурсам.
// 
// Параметры:
// 	Ресурсы - Массив из Строка - имена ресурсов, на которые необходимо наложить отбор на "<> 0".
// 	НаборДанных - НаборДанныхЗапросМакетаКомпоновкиДанных  - корректируемый набор данных. 
Процедура ДобавитьОтборПоВыбраннымРесурсам(Ресурсы, НаборДанных) Экспорт
	
	Если СтрНайти(НаборДанных.Запрос, "ИМЕЮЩИЕ") > 0 Тогда
		// в запросе уже есть отбор
		Возврат;
	КонецЕсли;
	
	НачалоЗапроса = "
	|ИМЕЮЩИЕ
	|	СУММА(%1) <> 0";
	
	ШаблонРесурса = "
	|	ИЛИ СУММА(%1) <> 0";
	
	ТекстОтбора = "";

	Для Каждого ОписаниеПоля Из НаборДанных.Поля Цикл
		Если Ресурсы.Найти(ОписаниеПоля.Имя) <> Неопределено Тогда
			
			Если ТекстОтбора = "" Тогда
				ТекстОтбора = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НачалоЗапроса, ОписаниеПоля.Имя);
			Иначе
				ТекстОтбора = ТекстОтбора + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонРесурса, ОписаниеПоля.Имя);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	ПозицияУпорядочить = СтрНайти(НаборДанных.Запрос, "УПОРЯДОЧИТЬ", НаправлениеПоиска.СКонца);
	Если ПозицияУпорядочить > 0 Тогда
		НаборДанных.Запрос = Лев(НаборДанных.Запрос, ПозицияУпорядочить - 1) + ТекстОтбора + Символы.ПС + Сред(НаборДанных.Запрос, ПозицияУпорядочить);
	Иначе
		НаборДанных.Запрос = НаборДанных.Запрос + ТекстОтбора;
	КонецЕсли;
		
КонецПроцедуры

// Обрабатывает объекты Справочник.ПравилаРаспределенияРасходов и Документ.РаспределениеПрочихЗатрат при обновлении ИБ.
// Параметры:
//	Объект - СправочникОбъект.ПравилаРаспределенияРасходов, ДокументОбъект.РаспределениеПрочихЗатрат - объект для обновления.
//	МакетыБазРаспределений - Соответствие из КлючИЗначение- макеты баз распределения по имена базы распределения:
//		* Ключ - Строка - упрощенное имя базы распределения (материалы, продукция и т.д.).
//		* Значение - СхемаКомпоновкиДанных - схема на основании которой будут заполняться настройки.
Процедура ОбработатьЗаполнениеНастроекКомпоновки(Объект, МакетыБазРаспределений) Экспорт

	Если Объект.НастройкиНаправленияРаспределенияИзменены ИЛИ Объект.НастройкиБазыРаспределенияПоПартиямИзменены Тогда
		// Объекты уже обработаны
		Возврат;
	КонецЕсли;

	ТабличныеЧастиКОбработке = Новый Соответствие;
	ТабличныеЧастиКОбработке.Вставить("ОтборПоГруппамПродукции", "ГруппаПродукции");
	ТабличныеЧастиКОбработке.Вставить("ОтборПоМатериалам", "Материал");
	ТабличныеЧастиКОбработке.Вставить("ОтборПоВидамРабот", "ВидРабот");
	ТабличныеЧастиКОбработке.Вставить("ОтборПоПродукции", "Продукция");

	РеквизитНазначения = "НазначениеНастройкиРаспределения";
	Если ТипЗнч(Объект.Ссылка) = Тип("СправочникСсылка.ПравилаРаспределенияРасходов") Тогда
		РеквизитНазначения = "НазначениеПравила";
	КонецЕсли;
	
	Если Объект[РеквизитНазначения]= Перечисления.НазначениеПравилРаспределенияРасходов.РаспределениеСтатейРасходовПоЭтапамПроизводства
		И Не Объект.НаправлениеРаспределения = Перечисления.НаправлениеРаспределенияПоПодразделениям.ПустаяСсылка() Тогда
		
		НастройкиПоУмолчанию = МакетыБазРаспределений["НаправлениеРаспределения"].НастройкиПоУмолчанию; // НастройкиКомпоновкиДанных
		НастройкиПоУмолчанию.Отбор.Элементы.Очистить();
		
		ОтборПоПодразделению = НастройкиПоУмолчанию.Отбор.Элементы.Добавить(
			Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоПодразделению.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Подразделение");
		
		Если Объект.НаправлениеРаспределения = Перечисления.НаправлениеРаспределенияПоПодразделениям.Текущее
			И ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.РаспределениеПрочихЗатрат") Тогда
			
			ОтборПоПодразделению.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ПараметрыДанных.ТекущееПодразделение");
			ОтборПоПодразделению.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			Объект.НастройкиНаправленияРаспределенияИзменены = Истина;
				
		ИначеЕсли Объект.НаправлениеРаспределения = Перечисления.НаправлениеРаспределенияПоПодразделениям.Вышестоящее
			И ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.РаспределениеПрочихЗатрат") Тогда
			
			ОтборПоПодразделению.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ПараметрыДанных.ВышестоящееПодразделение");
			ОтборПоПодразделению.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			Объект.НастройкиНаправленияРаспределенияИзменены = Истина;
				
		ИначеЕсли Объект.НаправлениеРаспределения = Перечисления.НаправлениеРаспределенияПоПодразделениям.Нижестоящие
			И ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.РаспределениеПрочихЗатрат") Тогда
			
			ОтборПоПодразделению.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ПараметрыДанных.ТекущееПодразделение");
			ОтборПоПодразделению.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
			
			ОтборПоПодразделениюНеРавно = НастройкиПоУмолчанию.Отбор.Элементы.Добавить(
				Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборПоПодразделениюНеРавно.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Подразделение");
			ОтборПоПодразделениюНеРавно.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
			ОтборПоПодразделениюНеРавно.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ПараметрыДанных.ТекущееПодразделение");
			
			Объект.НастройкиНаправленияРаспределенияИзменены = Истина;
			
		ИначеЕсли Объект.НаправлениеРаспределения = Перечисления.НаправлениеРаспределенияПоПодразделениям.Указанные Тогда
			
			СписокПодразделений = Новый СписокЗначений();
			СписокПодразделений.ЗагрузитьЗначения(
				Объект.ОтборПоПодразделениям.ВыгрузитьКолонку("Подразделение"));
			ОтборПоПодразделению.ПравоеЗначение = СписокПодразделений;
			ОтборПоПодразделению.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			Объект.НастройкиНаправленияРаспределенияИзменены = Истина;

		КонецЕсли;

		Если Объект.НастройкиНаправленияРаспределенияИзменены Тогда
			ОтборПоПодразделению.Использование = Истина;
			Объект.НастройкиНаправленияРаспределения = Новый ХранилищеЗначения(НастройкиПоУмолчанию);
		КонецЕсли;
	
	КонецЕсли;

	ИмяСхемы = Перечисления.ТипыБазыРаспределенияРасходов.ИмяСхемыБазыРаспределения(Объект.БазаРаспределенияПоПартиям);
	Если ПустаяСтрока(ИмяСхемы) Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиПоУмолчанию = МакетыБазРаспределений[ИмяСхемы].НастройкиПоУмолчанию; // НастройкиКомпоновкиДанных
	НастройкиПоУмолчанию.Отбор.Элементы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Т.Ссылка КАК Материал,
		|	Т.ЭтоГруппа КАК ЭтоГруппа
		|ИЗ
		|	Справочник.Номенклатура КАК Т
		|ГДЕ
		|	Т.Ссылка В (&СписокМатериалов)";
	Запрос.УстановитьПараметр("СписокМатериалов", Объект.ОтборПоМатериалам.ВыгрузитьКолонку("Материал"));
	
	Для Каждого КлючИЗначение Из ТабличныеЧастиКОбработке Цикл
		
		Если Объект[КлючИЗначение.Ключ].Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Объект.НастройкиБазыРаспределенияПоПартиямИзменены = Истина;
		
		ЭлементыОтбора = Новый СписокЗначений;
		ГруппыОтбора = Новый СписокЗначений;
		
		Если КлючИЗначение.Ключ = "ОтборПоМатериалам" Тогда
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				Если Выборка.ЭтоГруппа Тогда
					ГруппыОтбора.Добавить(Выборка.Материал);
				Иначе
					ЭлементыОтбора.Добавить(Выборка.Материал);
				КонецЕсли;
			КонецЦикла;
			
		Иначе
			ЭлементыОтбора.ЗагрузитьЗначения(Объект[КлючИЗначение.Ключ].ВыгрузитьКолонку(КлючИЗначение.Значение));
		КонецЕсли;
		
		Отбор = Неопределено;
		Если ГруппыОтбора.Количество() = 0 Тогда
			
			Отбор = НастройкиПоУмолчанию.Отбор.Элементы.Добавить(
				Тип("ЭлементОтбораКомпоновкиДанных"));
			Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(КлючИЗначение.Значение);
			Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			Отбор.ПравоеЗначение = ЭлементыОтбора;
		
		Иначе
			
			ГруппаЭлементовОтбора = НастройкиПоУмолчанию.Отбор.Элементы.Добавить(
					Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
			
			ЭлементОтбораДляГрупп = ГруппаЭлементовОтбора.Элементы.Добавить(
				Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбораДляГрупп.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(КлючИЗначение.Значение);
			ЭлементОтбораДляГрупп.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
			ЭлементОтбораДляГрупп.ПравоеЗначение = ГруппыОтбора;
				
			ЭлементОтбораДляЭлементов = ГруппаЭлементовОтбора.Элементы.Добавить(
				Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбораДляЭлементов.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(КлючИЗначение.Значение);
			ЭлементОтбораДляЭлементов.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			ЭлементОтбораДляЭлементов.ПравоеЗначение = ЭлементыОтбора;
			
		КонецЕсли;
		
	КонецЦикла;

	Если Объект.НастройкиБазыРаспределенияПоПартиямИзменены Тогда
		Объект.НастройкиБазыРаспределенияПоПартиям = Новый ХранилищеЗначения(НастройкиПоУмолчанию);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиЭтаповЗакрытияМесяца

//++ НЕ УТ

#Область ИсправлениеОшибокВИсходныхДанных

Процедура ПроверкаКорректностиУказанияПартийПроизводства(ПараметрыПроверки) Экспорт
	
	ТекстЗапроса = " 
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Распределение.Ссылка.Организация КАК Организация,
	|	Распределение.Ссылка КАК ДокументРаспределения,
	|	Распределение.ПартияПроизводства.Документ КАК ПроизводствоБезЗаказа
	|
	|ПОМЕСТИТЬ ДокументыРаспределенияСНеактуальнымиПартиями
	|ИЗ
	|	Документ.РаспределениеПрочихЗатрат.ПартииПроизводства КАК Распределение
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа КАК ПроизводствоБезЗаказа
	|		ПО ПроизводствоБезЗаказа.Ссылка = Распределение.ПартияПроизводства.Документ
	|		
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сторно КАК ДокументСторно
	|		ПО ДокументСторно.СторнируемыйДокумент = ПроизводствоБезЗаказа.Ссылка
	|		И ДокументСторно.Дата МЕЖДУ НАЧАЛОПЕРИОДА(ПроизводствоБезЗаказа.Дата, МЕСЯЦ) И КОНЕЦПЕРИОДА(ПроизводствоБезЗаказа.Дата, МЕСЯЦ)
	|		И ДокументСторно.Проведен
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа КАК ДокументИсправления
	|		ПО ДокументИсправления.СторнируемыйДокумент = ПроизводствоБезЗаказа.Ссылка
	|		И ДокументИсправления.Дата МЕЖДУ НАЧАЛОПЕРИОДА(ПроизводствоБезЗаказа.Дата, МЕСЯЦ) И КОНЕЦПЕРИОДА(ПроизводствоБезЗаказа.Дата, МЕСЯЦ)
	|		И ДокументИсправления.Проведен
	|ГДЕ
	|	Распределение.Ссылка.Проведен
	|	И Распределение.Ссылка.Организация В(&МассивОрганизаций)
	|	И Распределение.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (НЕ ДокументСторно.Ссылка ЕСТЬ NULL
	|		ИЛИ НЕ ДокументИсправления.Ссылка ЕСТЬ NULL)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Распределение.Ссылка.Организация КАК Организация,
	|	Распределение.Ссылка КАК ДокументРаспределения,
	|	Распределение.ПартияПроизводства.Документ КАК ПроизводствоБезЗаказа
	|ИЗ
	|	Документ.РаспределениеПроизводственныхЗатрат.ПартииПроизводства КАК Распределение
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа КАК ПроизводствоБезЗаказа
	|		ПО ПроизводствоБезЗаказа.Ссылка = Распределение.ПартияПроизводства.Документ
	|		
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сторно КАК ДокументСторно
	|		ПО ДокументСторно.СторнируемыйДокумент = ПроизводствоБезЗаказа.Ссылка
	|		И ДокументСторно.Дата МЕЖДУ НАЧАЛОПЕРИОДА(ПроизводствоБезЗаказа.Дата, МЕСЯЦ) И КОНЕЦПЕРИОДА(ПроизводствоБезЗаказа.Дата, МЕСЯЦ)
	|		И ДокументСторно.Проведен
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа КАК ДокументИсправления
	|		ПО ДокументИсправления.СторнируемыйДокумент = ПроизводствоБезЗаказа.Ссылка
	|		И ДокументИсправления.Дата МЕЖДУ НАЧАЛОПЕРИОДА(ПроизводствоБезЗаказа.Дата, МЕСЯЦ) И КОНЕЦПЕРИОДА(ПроизводствоБезЗаказа.Дата, МЕСЯЦ)
	|		И ДокументИсправления.Проведен
	|ГДЕ
	|	Распределение.Ссылка.Проведен
	|	И Распределение.Ссылка.Организация В(&МассивОрганизаций)
	|	И Распределение.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (НЕ ДокументСторно.Ссылка ЕСТЬ NULL
	|		ИЛИ НЕ ДокументИсправления.Ссылка ЕСТЬ NULL)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Распределение.Ссылка.Организация КАК Организация,
	|	Распределение.Ссылка КАК ДокументРаспределения,
	|	Распределение.ПартияПроизводства.Документ КАК ПроизводствоБезЗаказа
	|ИЗ
	|	Документ.РаспределениеВозвратныхОтходов.ПартииПроизводства КАК Распределение
	|	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа КАК ПроизводствоБезЗаказа
	|		ПО ПроизводствоБезЗаказа.Ссылка = Распределение.ПартияПроизводства.Документ
	|		
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сторно КАК ДокументСторно
	|		ПО ДокументСторно.СторнируемыйДокумент = ПроизводствоБезЗаказа.Ссылка
	|		И ДокументСторно.Дата МЕЖДУ НАЧАЛОПЕРИОДА(ПроизводствоБезЗаказа.Дата, МЕСЯЦ) И КОНЕЦПЕРИОДА(ПроизводствоБезЗаказа.Дата, МЕСЯЦ)
	|		И ДокументСторно.Проведен
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа КАК ДокументИсправления
	|		ПО ДокументИсправления.СторнируемыйДокумент = ПроизводствоБезЗаказа.Ссылка
	|		И ДокументИсправления.Дата МЕЖДУ НАЧАЛОПЕРИОДА(ПроизводствоБезЗаказа.Дата, МЕСЯЦ) И КОНЕЦПЕРИОДА(ПроизводствоБезЗаказа.Дата, МЕСЯЦ)
	|		И ДокументИсправления.Проведен
	|ГДЕ
	|	Распределение.Ссылка.Проведен
	|	И Распределение.Ссылка.Организация В(&МассивОрганизаций)
	|	И Распределение.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (НЕ ДокументСторно.Ссылка ЕСТЬ NULL
	|		ИЛИ НЕ ДокументИсправления.Ссылка ЕСТЬ NULL)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПрочиеРасходы.Организация КАК Организация,
	|	ПрочиеРасходы.Регистратор КАК ДокументРаспределения,
	|	ПрочиеРасходы.АналитикаРасходов КАК ПартияПроизводства
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы КАК ПрочиеРасходы
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ПрочиеРасходы.АналитикаРасходов
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа КАК ПроизводствоБезЗаказа
	|		ПО ПроизводствоБезЗаказа.Ссылка = СпрПартииПроизводства.Документ
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сторно КАК ДокументСторно
	|		ПО ДокументСторно.СторнируемыйДокумент = ПроизводствоБезЗаказа.Ссылка
	|		И ДокументСторно.Дата МЕЖДУ НАЧАЛОПЕРИОДА(ПроизводствоБезЗаказа.Дата, МЕСЯЦ) И КОНЕЦПЕРИОДА(ПроизводствоБезЗаказа.Дата, МЕСЯЦ)
	|		И ДокументСторно.Проведен
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа КАК ДокументИсправления
	|		ПО ДокументИсправления.СторнируемыйДокумент = ПроизводствоБезЗаказа.Ссылка
	|		И ДокументИсправления.Дата МЕЖДУ НАЧАЛОПЕРИОДА(ПроизводствоБезЗаказа.Дата, МЕСЯЦ) И КОНЕЦПЕРИОДА(ПроизводствоБезЗаказа.Дата, МЕСЯЦ)
	|		И ДокументИсправления.Проведен
	|ГДЕ
	|	ПрочиеРасходы.Организация В(&МассивОрганизаций)
	|	И ПрочиеРасходы.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ПроизводствоБезЗаказа)
	|	И (НЕ ДокументСторно.Ссылка ЕСТЬ NULL
	|		ИЛИ НЕ ДокументИсправления.Ссылка ЕСТЬ NULL)
	|
	|";
	
	ИмяПоляОбъекта = "ДокументРаспределения";
	
	ИмяВременнойТаблицы = "ДокументыРаспределенияСНеактуальнымиПартиями";
	ШаблонТекстаОшибки  = НСтр("ru='Обнаружены документы, в которых указаны сторнированные или исправленные документы производства без заказов, по организации ""%1"" за период %2'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	СписокПолей = Новый СписокЗначений;
	СписокПолей.Добавить("Организация",  НСтр("ru='Организация'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить(ИмяПоляОбъекта, НСтр("ru='Документ распределения'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("ПроизводствоБезЗаказа", НСтр("ru='Партия производства'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	ПараметрыРегистрации = ЗакрытиеМесяцаСервер.ИнициализироватьПараметрыРегистрацииПроблемПроверки(ИмяВременнойТаблицы,
		ШаблонТекстаОшибки,
		СписокПолей,
		ИмяПоляОбъекта);
	
	ЗакрытиеМесяцаСервер.ЗарегистрироватьПроблемыВыполненияПроверки(ПараметрыПроверки, ПараметрыРегистрации, ТекстЗапроса);
	
КонецПроцедуры

Процедура ПроверкаАктуальностиУказанныхПартийПроизводства(ПараметрыПроверки) Экспорт
	
	ТекстЗапроса = " 
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Распределение.Ссылка.Организация КАК Организация,
	|	Распределение.Ссылка КАК ДокументРаспределения,
	|	Распределение.ПартияПроизводства КАК ПартияПроизводства
	|
	|ПОМЕСТИТЬ ДокументыРаспределенияСНеактуальнымиПартиями
	|ИЗ
	|	Документ.РаспределениеПрочихЗатрат.ПартииПроизводства КАК Распределение
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = Распределение.ПартияПроизводства
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа.ВыходныеИзделия КАК ПроизводствоБезЗаказа
	|		ПО ПроизводствоБезЗаказа.Ссылка = СпрПартииПроизводства.Документ
	|		И ПроизводствоБезЗаказа.НомерГруппыЗатрат = СпрПартииПроизводства.Код
	|		И НЕ СпрПартииПроизводства.ПометкаУдаления
	|		И ПроизводствоБезЗаказа.Ссылка.Проведен
	|ГДЕ
	|	Распределение.Ссылка.Проведен
	|	И Распределение.Ссылка.Организация В(&МассивОрганизаций)
	|	И Распределение.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ПроизводствоБезЗаказа)
	|	И ПроизводствоБезЗаказа.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Распределение.Ссылка.Организация КАК Организация,
	|	Распределение.Ссылка КАК ДокументРаспределения,
	|	Распределение.ПартияПроизводства КАК ПартияПроизводства
	|ИЗ
	|	Документ.РаспределениеПроизводственныхЗатрат.ПартииПроизводства КАК Распределение
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = Распределение.ПартияПроизводства
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа.ВыходныеИзделия КАК ПроизводствоБезЗаказа
	|		ПО ПроизводствоБезЗаказа.Ссылка = СпрПартииПроизводства.Документ
	|		И ПроизводствоБезЗаказа.НомерГруппыЗатрат = СпрПартииПроизводства.Код
	|		И НЕ СпрПартииПроизводства.ПометкаУдаления
	|		И ПроизводствоБезЗаказа.Ссылка.Проведен
	|ГДЕ
	|	Распределение.Ссылка.Проведен
	|	И Распределение.Ссылка.Организация В(&МассивОрганизаций)
	|	И Распределение.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ПроизводствоБезЗаказа)
	|	И ПроизводствоБезЗаказа.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Распределение.Ссылка.Организация КАК Организация,
	|	Распределение.Ссылка КАК ДокументРаспределения,
	|	Распределение.ПартияПроизводства КАК ПартияПроизводства
	|ИЗ
	|	Документ.РаспределениеВозвратныхОтходов.ПартииПроизводства КАК Распределение
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = Распределение.ПартияПроизводства
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа.ВыходныеИзделия КАК ПроизводствоБезЗаказа
	|		ПО ПроизводствоБезЗаказа.Ссылка = СпрПартииПроизводства.Документ
	|		И ПроизводствоБезЗаказа.НомерГруппыЗатрат = СпрПартииПроизводства.Код
	|		И НЕ СпрПартииПроизводства.ПометкаУдаления
	|		И ПроизводствоБезЗаказа.Ссылка.Проведен
	|ГДЕ
	|	Распределение.Ссылка.Проведен
	|	И Распределение.Ссылка.Организация В(&МассивОрганизаций)
	|	И Распределение.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ПроизводствоБезЗаказа)
	|	И ПроизводствоБезЗаказа.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПрочиеРасходы.Организация КАК Организация,
	|	ПрочиеРасходы.Регистратор КАК ДокументРаспределения,
	|	ПрочиеРасходы.АналитикаРасходов КАК ПартияПроизводства
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы КАК ПрочиеРасходы
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ПрочиеРасходы.АналитикаРасходов
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроизводствоБезЗаказа.ВыходныеИзделия КАК ПроизводствоБезЗаказа
	|		ПО ПроизводствоБезЗаказа.Ссылка = СпрПартииПроизводства.Документ
	|		И ПроизводствоБезЗаказа.НомерГруппыЗатрат = СпрПартииПроизводства.Код
	|		И НЕ СпрПартииПроизводства.ПометкаУдаления
	|		И ПроизводствоБезЗаказа.Ссылка.Проведен
	|ГДЕ
	|	ПрочиеРасходы.Организация В(&МассивОрганизаций)
	|	И ПрочиеРасходы.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ТИПЗНАЧЕНИЯ(СпрПартииПроизводства.Документ) = ТИП(Документ.ПроизводствоБезЗаказа)
	|	И ПроизводствоБезЗаказа.Ссылка ЕСТЬ NULL
	|
	|";
	
	ИмяПоляОбъекта = "ДокументРаспределения";
	
	ИмяВременнойТаблицы = "ДокументыРаспределенияСНеактуальнымиПартиями";
	ШаблонТекстаОшибки  = НСтр("ru='Обнаружены документы, в которых указаны неактуальные партии производства, по организации ""%1"" за период %2'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	СписокПолей = Новый СписокЗначений;
	СписокПолей.Добавить("Организация",  НСтр("ru='Организация'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить(ИмяПоляОбъекта, НСтр("ru='Документ'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("ПартияПроизводства", НСтр("ru='Партия производства'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	ПараметрыРегистрации = ЗакрытиеМесяцаСервер.ИнициализироватьПараметрыРегистрацииПроблемПроверки(ИмяВременнойТаблицы,
		ШаблонТекстаОшибки,
		СписокПолей,
		ИмяПоляОбъекта);
	
	ЗакрытиеМесяцаСервер.ЗарегистрироватьПроблемыВыполненияПроверки(ПараметрыПроверки, ПараметрыРегистрации, ТекстЗапроса);
	
КонецПроцедуры

Процедура ПроверкаПравильностиУказанияСтатейКалькуляцийДляПобочногоВыхода(ПараметрыПроверки) Экспорт
	
	ТекстЗапроса = " 
	|ВЫБРАТЬ
	|	Движения.Организация КАК Организация,
	|	Движения.Регистратор КАК ДокументВыпуска,
	|	Движения.АналитикаУчетаНоменклатуры.СтатьяКалькуляции КАК СтатьяКалькуляции
	|
	|ПОМЕСТИТЬ ДокументыСНеправильнымиСтатьямиКалькуляции
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Движения
	|ГДЕ
	|	Движения.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Движения.Организация В(&МассивОрганизаций)
	|	И Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Движения.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство)
	|	И Движения.Количество <> 0
	|	И Движения.АналитикаУчетаНоменклатуры.СтатьяКалькуляции <>
	|		ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПолуфабрикатыПроизводимыеВПроцессе)
	|	И НЕ Движения.РасчетПартий
	|	И НЕ Движения.РасчетСебестоимости
	|	И НЕ Движения.Сторно
	|	И НЕ ТИПЗНАЧЕНИЯ(Движения.Регистратор) = ТИП(Документ.КорректировкаПриобретения)
	|
	|СГРУППИРОВАТЬ ПО
	|	Движения.Организация,
	|	Движения.Регистратор,
	|	Движения.АналитикаУчетаНоменклатуры.СтатьяКалькуляции
	|
	|ИМЕЮЩИЕ
	|	СУММА(Движения.Количество) = 0
	|";
	
	ИмяПоляОбъекта = "ДокументВыпуска";
	
	ИмяВременнойТаблицы = "ДокументыСНеправильнымиСтатьямиКалькуляции";
	ШаблонТекстаОшибки  = НСтр("ru='Обнаружены документы, в которых указаны одинаковые статьи калькуляции для материалов и для побочного выхода по фиксированной стоимости, по организации ""%1"" за период %2.
		|Укажите статью калькуляции с типом затрат ""Возвратные отходы"" для побочного выхода по фиксированной стоимости.'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	СписокПолей = Новый СписокЗначений;
	СписокПолей.Добавить("Организация",  НСтр("ru='Организация'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить(ИмяПоляОбъекта, НСтр("ru='Документ'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("СтатьяКалькуляции", НСтр("ru='Статья калькуляции'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	ПараметрыРегистрации = ЗакрытиеМесяцаСервер.ИнициализироватьПараметрыРегистрацииПроблемПроверки(ИмяВременнойТаблицы,
		ШаблонТекстаОшибки,
		СписокПолей,
		ИмяПоляОбъекта);
	
	ЗакрытиеМесяцаСервер.ЗарегистрироватьПроблемыВыполненияПроверки(ПараметрыПроверки, ПараметрыРегистрации, ТекстЗапроса);
	
КонецПроцедуры

Процедура ПроверитьСоответствиеОтчетаПереработчикаИКорректировкиОтчетаПереработчика(ПараметрыПроверки) Экспорт
	
	ТекстЗапроса = " 
	|ВЫБРАТЬ
	|	КорректировкаПриобретенияРеквизиты.Организация КАК Организация,
	|	КорректировкаПриобретенияРеквизиты.Ссылка КАК КорректировкаПриобретения,
	|	КорректировкаПриобретенияРеквизиты.ДокументОснование КАК ОтчетПереработчика
	|
	|ПОМЕСТИТЬ КорректировкиПриобретенияНеСоответствующиеОтчетамПереработчика
	|ИЗ
	|	Документ.КорректировкаПриобретения КАК КорректировкаПриобретенияРеквизиты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаПриобретения.Расхождения КАК Корректировка
	|		ПО (КорректировкаПриобретенияРеквизиты.Проведен)
	|			И (КорректировкаПриобретенияРеквизиты.Организация В (&МассивОрганизаций))
	|			И (КорректировкаПриобретенияРеквизиты.Дата МЕЖДУ &НачалоПериода И &КонецПериода)
	|			И (КорректировкаПриобретенияРеквизиты.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаОтчетаПереработчика))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетПереработчика2_5.ВыходныеИзделия КАК ОтчетПереработчика25ВыходныеИзделия
	|		ПО (ОтчетПереработчика25ВыходныеИзделия.Ссылка = КорректировкаПриобретенияРеквизиты.ДокументОснование)
	|			И (ОтчетПереработчика25ВыходныеИзделия.НомерГруппыЗатрат = Корректировка.НомерГруппыЗатрат)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетПереработчика2_5.ПобочныеИзделия КАК ОтчетПереработчика25ПобочныеИзделия
	|		ПО (ОтчетПереработчика25ПобочныеИзделия.Ссылка = КорректировкаПриобретенияРеквизиты.ДокументОснование)
	|			И (ОтчетПереработчика25ПобочныеИзделия.НомерГруппыЗатрат = Корректировка.НомерГруппыЗатрат)
	|
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаПриобретенияРеквизиты.Организация,
	|	КорректировкаПриобретенияРеквизиты.Ссылка,
	|	КорректировкаПриобретенияРеквизиты.ДокументОснование
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(ОтчетПереработчика25ВыходныеИзделия.Ссылка) ЕСТЬ NULL И
	|	МАКСИМУМ(ОтчетПереработчика25ПобочныеИзделия.Ссылка) ЕСТЬ NULL
	|";
	
	ИмяПоляОбъекта = "КорректировкаПриобретения";
	
	ИмяВременнойТаблицы = "КорректировкиПриобретенияНеСоответствующиеОтчетамПереработчика";
	ШаблонТекстаОшибки  = НСтр("ru='Обнаружены корректировки отчета переработчика не соответствующие заполнению отчета переработчика по организации ""%1"" за период %2.
		|Требуется перезаполнить корректировку'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	СписокПолей = Новый СписокЗначений;
	СписокПолей.Добавить("Организация",  НСтр("ru='Организация'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить(ИмяПоляОбъекта, НСтр("ru='Корректировка отчета переработчика'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("ОтчетПереработчика", НСтр("ru='Отчет переработчика'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	ПараметрыРегистрации = ЗакрытиеМесяцаСервер.ИнициализироватьПараметрыРегистрацииПроблемПроверки(ИмяВременнойТаблицы,
		ШаблонТекстаОшибки,
		СписокПолей,
		ИмяПоляОбъекта);
	
	ЗакрытиеМесяцаСервер.ЗарегистрироватьПроблемыВыполненияПроверки(ПараметрыПроверки, ПараметрыРегистрации, ТекстЗапроса);
	
КонецПроцедуры

Процедура ПроверкаПравильностиУказанияГруппПродукцииВПартияхПроизводства(ПараметрыПроверки) Экспорт
	
	ТекстЗапроса = " 
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПрочиеРасходыНЗП.Организация КАК Организация,
	|	ПрочиеРасходыНЗП.Регистратор КАК Документ,
	|	ПрочиеРасходыНЗП.ПартияПроизводства КАК ПартияПроизводства
	|
	|ПОМЕСТИТЬ ПартииСУказаниемГруппПродукции
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ПрочиеРасходыНЗП
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПартииПроизводства КАК СпрПартииПроизводства
	|		ПО СпрПартииПроизводства.Ссылка = ПрочиеРасходыНЗП.ПартияПроизводства
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыАналитическогоУчетаНоменклатуры КАК ГруппыПродукции
	|		ПО ПартияПроизводства.ГруппаПродукции = ГруппыПродукции.Ссылка
	|ГДЕ
	|	ПрочиеРасходыНЗП.Активность
	|	И ПрочиеРасходыНЗП.Организация В(&МассивОрганизаций)
	|	И ПрочиеРасходыНЗП.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ ГруппыПродукции.Ссылка ЕСТЬ NULL";
	
	ИмяПоляОбъекта = "Документ";
	
	ИмяВременнойТаблицы = "ПартииСУказаниемГруппПродукции";
	ШаблонТекстаОшибки  = НСтр("ru='Обнаружены партии производства, использующие группы продукции, несмотря на отключенную опцию учета по группам продукции в организации ""%1"" за период %2'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	СписокПолей = Новый СписокЗначений;
	СписокПолей.Добавить("Организация",  НСтр("ru='Организация'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить(ИмяПоляОбъекта, НСтр("ru='Документ'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("ПартияПроизводства", НСтр("ru='Партия производства'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	ПараметрыРегистрации = ЗакрытиеМесяцаСервер.ИнициализироватьПараметрыРегистрацииПроблемПроверки(ИмяВременнойТаблицы,
		ШаблонТекстаОшибки,
		СписокПолей,
		ИмяПоляОбъекта);
	
	ЗакрытиеМесяцаСервер.ЗарегистрироватьПроблемыВыполненияПроверки(ПараметрыПроверки, ПараметрыРегистрации, ТекстЗапроса);
	
КонецПроцедуры

#КонецОбласти

//-- НЕ УТ

#Область НастройкаРаспределенияРасходов

// Добавляет этап в таблицу этапов закрытия месяца.
// Элементы данной таблицы являются элементами второго уровня в дереве этапов в форме закрытия месяца.
// 
// Параметры:
// 	ТаблицаЭтапов - см. Обработки.ОперацииЗакрытияМесяца.ЗаполнитьОписаниеЭтаповЗакрытияМесяца
// 	ТекущийРодитель - Строка - идентификатор группы.
Процедура ДобавитьЭтап_НастройкаРаспределенияРасходов(ТаблицаЭтапов,ТекущийРодитель) Экспорт
	НоваяСтрока = ЗакрытиеМесяцаСервер.ДобавитьЭтапВТаблицу(ТаблицаЭтапов, ТекущийРодитель,
		Перечисления.ОперацииЗакрытияМесяца.НастройкаРаспределенияРасходов);
	НоваяСтрока.ТекстВыполнить = НСтр("ru='Выполнить'");
	НоваяСтрока.ТекстПодробнее = ЗакрытиеМесяцаСервер.ТекстПодробнееПоУмолчанию();
	НоваяСтрока.ДействиеИспользование = ЗакрытиеМесяцаСервер.ОписаниеДействия_СервернаяПроцедура(
		"ЗатратыСервер.Использование_НастройкаРаспределенияРасходов");
	НоваяСтрока.ДействиеВыполнить  = ЗакрытиеМесяцаСервер.ОписаниеДействия_ВыполнитьРасчет(
		"ЗатратыСервер.Выполнить_НастройкаРаспределенияРасходов");
	НоваяСтрока.ДействиеПодробнее = ЗакрытиеМесяцаСервер.ОписаниеДействия_ОткрытьФорму(
		Метаданные.Документы.РаспределениеПрочихЗатрат.Формы.ФормаРабочееМесто.ПолноеИмя());
	// Доп. параметры формы.
	НоваяСтрока.ДействиеПодробнее.ПараметрыФормы.Вставить("Подразделение", Справочники.СтруктураПредприятия.ПустаяСсылка());
	НоваяСтрока.ДействиеПодробнее.ПараметрыФормы.Вставить("Состояние", Перечисления.СостоянияРаспределенияРасходов.ТребуетсяСформироватьДокумент);
	НоваяСтрока.ВыполняетсяПриПредварительномЗакрытииМесяца = Истина;
КонецПроцедуры

// Обработчики этапа.

Процедура Использование_НастройкаРаспределенияРасходов(ПараметрыОбработчика) Экспорт
	
	Запрос = Новый Запрос;
	ЗакрытиеМесяцаСервер.ИнициализироватьЗапрос(Запрос, ПараметрыОбработчика);
	
	ВариантыРаспределения = Новый Массив();
	//++ НЕ УТ
	Если ПараметрыОбработчика.ПараметрыРасчета.РежимЗакрытияМесяца <> Перечисления.РежимыЗакрытияМесяца.ПредварительноеЗакрытие Тогда
		ВариантыРаспределения.Добавить(Перечисления.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты);
		ВариантыРаспределения.Добавить(Перечисления.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства);
		Если (ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОбъектамВозникновенияЗатрат")) Тогда
			ВариантыРаспределения.Добавить(Перечисления.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат);
		КонецЕсли;
	КонецЕсли;
	//-- НЕ УТ
	Если РасчетСебестоимостиПовтИсп.ПартионныйУчетВерсии22(ПараметрыОбработчика.ПараметрыРасчета.ПериодРегистрации)
	 И (ЗакрытиеМесяцаСервер.ОбщиеПараметрыЗакрытияМесяца().РаспределениеДопРасходовМеждуПартиямиИТоварами
	 	ИЛИ ПараметрыОбработчика.ПараметрыРасчета.РежимЗакрытияМесяца <> Перечисления.РежимыЗакрытияМесяца.ПредварительноеЗакрытие) Тогда
		ВариантыРаспределения.Добавить(Перечисления.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров);
	КонецЕсли;
	
	Если ВариантыРаспределения.Количество() = 0 Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеТребуется(
			ПараметрыОбработчика,
			НСтр("ru='Нет данных для распределения расходов.'", ОбщегоНазначения.КодОсновногоЯзыка()));
		
		Возврат;
	
	КонецЕсли;

	ПараметрыЗапроса = Документы.РаспределениеПрочихЗатрат.ОписаниеПараметровЗапросаПолученияДанныхДляРаспределения();
	ПараметрыЗапроса.Состояние = Перечисления.СостоянияРаспределенияРасходов.ТребуетсяСформироватьДокумент;
	ПараметрыЗапроса.ВариантРаспределения = ВариантыРаспределения;
	ПараметрыЗапроса.ИсключитьТранспортныеРасходы = Истина;
	Документы.РаспределениеПрочихЗатрат.ИнициализироватьЗапросПолученияДанныхДляРаспределения(Запрос, ПараметрыЗапроса);
	
	Запрос.Текст = Документы.РаспределениеПрочихЗатрат.ТекстЗапросаДанныеДляРаспределения(, Истина);
	
	Запрос.Выполнить();	
	
	РазмерыВременныхТаблиц = ЗакрытиеМесяцаСервер.РазмерыВременныхТаблиц(Запрос, ПараметрыОбработчика);
	
	Если РазмерыВременныхТаблиц.ВТДанныеДляРаспределения = 0 Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеТребуется(
			ПараметрыОбработчика,
			НСтр("ru='Нет данных для распределения расходов.'", ОбщегоНазначения.КодОсновногоЯзыка()));
		
		Возврат;
		
	КонецЕсли;
	
	Если РазмерыВременныхТаблиц.СостояниеРаспределенияРасходов = 0 Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеТребуется(
			ПараметрыОбработчика,
			НСтр("ru='Все расходы полностью распределены.'", ОбщегоНазначения.КодОсновногоЯзыка()));
		
	КонецЕсли;
	
КонецПроцедуры

Процедура Выполнить_НастройкаРаспределенияРасходов(ПараметрыОбработчика) Экспорт
	
	ПараметрыРасчета = ПараметрыОбработчика.ПараметрыРасчета;
	
	ВариантыРаспределения = Новый Массив;
	//++ НЕ УТ
	Если ПараметрыОбработчика.ПараметрыРасчета.РежимЗакрытияМесяца <> Перечисления.РежимыЗакрытияМесяца.ПредварительноеЗакрытие Тогда
		ВариантыРаспределения.Добавить(Перечисления.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты);
		ВариантыРаспределения.Добавить(Перечисления.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства);
		Если (ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОбъектамВозникновенияЗатрат")) Тогда
			ВариантыРаспределения.Добавить(Перечисления.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат);
		КонецЕсли;
	КонецЕсли;
	//-- НЕ УТ
	Если РасчетСебестоимостиПовтИсп.ПартионныйУчетВерсии22(ПараметрыРасчета.ПериодРегистрации) Тогда
		ВариантыРаспределения.Добавить(Перечисления.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров);
	КонецЕсли;
	
	Если ВариантыРаспределения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	СтатьиКРаспределению = Документы.РаспределениеПрочихЗатрат.СтатьиКРаспределению(
		ПараметрыРасчета.ПериодРегистрации,
		ПараметрыРасчета.МассивОрганизаций,
		Новый Массив,
		Перечисления.СостоянияРаспределенияРасходов.ТребуетсяСформироватьДокумент,
		ВариантыРаспределения);
		
	Если СтатьиКРаспределению.Количество() = 0 Тогда // нет данных для распределения
		Возврат;
	КонецЕсли;
	
	СтатьиКРаспределению.Колонки.Добавить("Дата", Новый ОписаниеТипов("Дата"));
	СтатьиКРаспределению.Колонки.Добавить("ИДСтроки", Новый ОписаниеТипов("Число"));
	СтатьиКРаспределению.ЗаполнитьЗначения(КонецМесяца(ПараметрыРасчета.ПериодРегистрации), "Дата");
	
	ПараметрыРаспределения = Новый Структура("ПараметрыРасходов", СтатьиКРаспределению);
	ПараметрыРаспределения.Вставить("МассивОрганизаций", ПараметрыРасчета.МассивОрганизаций);
	ПараметрыРаспределения.Вставить("ПериодРегистрации", ПараметрыРасчета.ПериодРегистрации);
	
	// Формирование документов распределения так же выполняется в процедуре РасчетСебестоимости.РассчитатьПредварительнуюСебестоимость().
	// При изменении процедуры Выполнить_НастройкаРаспределенияРасходов() нужно проверить код в РасчетСебестоимости.РассчитатьПредварительнуюСебестоимость().
	
	Попытка
		РезультатыФормирования = Документы.РаспределениеПрочихЗатрат.СформироватьДокументы(ПараметрыРаспределения, Неопределено);
	Исключение
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Не удалось создать документы распределения за период %1. Необходимость возникла из-за ошибки:
				|%2'", ОбщегоНазначения.КодОсновногоЯзыка()),
			РасчетСебестоимостиПротоколРасчета.ПредставлениеПериодаРасчета(ПараметрыРасчета.ПериодРегистрации),
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗакрытиеМесяцаСервер.ЗафиксироватьНаличиеПроблемыПриВыполненииРасчета(
			ПараметрыОбработчика,
			ТекстОшибки);
		
	КонецПопытки;
	
	Для Каждого РезультатПоОрганизации Из РезультатыФормирования Цикл
		
		ДетализацияФормирования = РезультатПоОрганизации.Значение;
		
		Если Не ДетализацияФормирования.ОписаниеОшибок.Количество() Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ОписаниеОшибки Из ДетализацияФормирования.ОписаниеОшибок Цикл
			ЗакрытиеМесяцаСервер.ЗафиксироватьНаличиеПроблемыПриВыполненииРасчета(
				ПараметрыОбработчика,
				ОписаниеОшибки.ТекстОшибки,
				РезультатПоОрганизации.Ключ,
				,
				,
				ОписаниеОшибки.СтатьяРасходов);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

// Проверки состояния системы, относящиеся к этапу.

Процедура ОписаниеПроверок_НастройкаРаспределенияРасходов(ТаблицаПроверок) Экспорт
	
	// Настройка распределения расходов.
	ОписаниеПроверки = ЗакрытиеМесяцаСервер.ДобавитьОписаниеНовойПроверки(ТаблицаПроверок,
		"НеВыполненаНастройкаРаспределенияРасходов",
		Перечисления.ОперацииЗакрытияМесяца.НастройкаРаспределенияРасходов,
		Перечисления.МоментЗапускаПроверкиОперацииЗакрытияМесяца.ДоИПослеРасчета,
		"ЗатратыСервер.ПроверкаНеобходимостиНастройкиРаспределенияРасходов");
	
	ЗакрытиеМесяцаСервер.ЗаполнитьПредставлениеНовойПроверки(ОписаниеПроверки,
		НСтр("ru='Не выполненные настройки распределения расходов'", ОбщегоНазначения.КодОсновногоЯзыка()),
		НСтр("ru='Все расходы должны быть распределены.'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
КонецПроцедуры

// Проверка необходимости настройки распределения расходов.
//
// Параметры:
//	ПараметрыПроверки - см. АудитСостоянияСистемы.ИнициализироватьПараметрыПроверки
//
Процедура ПроверкаНеобходимостиНастройкиРаспределенияРасходов(ПараметрыПроверки) Экспорт
	
	Если НЕ ЗакрытиеМесяцаСервер.ПроверкаВыполняетсяМеханизмомЗакрытияМесяца(ПараметрыПроверки) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыПроверки.ДополнительныеПараметры.АвтоматическоеТестирование Тогда
		Возврат;
	КонецЕсли;
	
	СписокПолей = Новый СписокЗначений;
	СписокПолей.Добавить("Организация", 			НСтр("ru='Организация'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("Подразделение", 			НСтр("ru='Подразделение'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("НаправлениеДеятельности", НСтр("ru='Направление деятельности'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("СтатьяРасходов", 			НСтр("ru='Статья расходов'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("АналитикаРасходов", 		НСтр("ru='Аналитика расходов'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	ПараметрыРегистрации = ЗакрытиеМесяцаСервер.ИнициализироватьПараметрыРегистрацииПроблемПроверки(
		"СостояниеРаспределенияРасходов",
		НСтр("ru='Требуется сформировать документы распределения расходов по организации ""%1"" в периоде %2'", ОбщегоНазначения.КодОсновногоЯзыка()),
		СписокПолей);
	
	ЗакрытиеМесяцаСервер.ЗарегистрироватьПроблемыВыполненияПроверки(
	 	ПараметрыПроверки,
		ПараметрыРегистрации);
		
КонецПроцедуры

#КонецОбласти

#Область НастройкаРаспределенияРасходовВручную

// Добавляет этап в таблицу этапов закрытия месяца.
// Элементы данной таблицы являются элементами второго уровня в дереве этапов в форме закрытия месяца.
// 
// Параметры:
// 	ТаблицаЭтапов - см. Обработки.ОперацииЗакрытияМесяца.ЗаполнитьОписаниеЭтаповЗакрытияМесяца
// 	ТекущийРодитель - Строка - идентификатор группы.
Процедура ДобавитьЭтап_НастройкаРаспределенияРасходовВручную(ТаблицаЭтапов,ТекущийРодитель) Экспорт
	НоваяСтрока = ЗакрытиеМесяцаСервер.ДобавитьЭтапВТаблицу(ТаблицаЭтапов, ТекущийРодитель,
		Перечисления.ОперацииЗакрытияМесяца.НастройкаРаспределенияРасходовВручную);
	НоваяСтрока.ВыполняетсяВручную = Истина;
	НоваяСтрока.ТекстВыполнить = НСтр("ru='Ввести'");
	НоваяСтрока.ТекстПодробнее = ЗакрытиеМесяцаСервер.ТекстПодробнееПоУмолчанию();
	НоваяСтрока.ДействиеИспользование = ЗакрытиеМесяцаСервер.ОписаниеДействия_СервернаяПроцедура(
		"ЗатратыСервер.Использование_НастройкаРаспределенияРасходовВручную");
	НоваяСтрока.ДействиеВыполнить = ЗакрытиеМесяцаСервер.ОписаниеДействия_ОткрытьФорму(
		Метаданные.Документы.РаспределениеПрочихЗатрат.Формы.ФормаРабочееМесто.ПолноеИмя());
	// Доп. параметры формы.
	НоваяСтрока.ДействиеВыполнить.ПараметрыФормы.Вставить("Подразделение", Справочники.СтруктураПредприятия.ПустаяСсылка());
	НоваяСтрока.ДействиеВыполнить.ПараметрыФормы.Вставить("Состояние", Перечисления.СостоянияРаспределенияРасходов.ТребуетсяРучнойВводДокумента);

	НоваяСтрока.ДействиеПодробнее = ЗакрытиеМесяцаСервер.ОписаниеДействия_ОткрытьФорму(
		Метаданные.Документы.РаспределениеПрочихЗатрат.Формы.ФормаРабочееМесто.ПолноеИмя());
	// Доп. параметры формы.
	НоваяСтрока.ДействиеПодробнее.ПараметрыФормы.Вставить("Подразделение", Справочники.СтруктураПредприятия.ПустаяСсылка());
	НоваяСтрока.ДействиеПодробнее.ПараметрыФормы.Вставить("Состояние", Перечисления.СостоянияРаспределенияРасходов.ТребуетсяРучнойВводДокумента);
КонецПроцедуры

// Обработчики этапа.

Процедура Использование_НастройкаРаспределенияРасходовВручную(ПараметрыОбработчика) Экспорт
	
	Запрос = Новый Запрос;
	ЗакрытиеМесяцаСервер.ИнициализироватьЗапрос(Запрос, ПараметрыОбработчика);
	
	ВариантыРаспределения = Новый Массив();
	//++ НЕ УТ
	ВариантыРаспределения.Добавить(Перечисления.ВариантыРаспределенияРасходов.НаПроизводственныеЗатраты);
	ВариантыРаспределения.Добавить(Перечисления.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства);
	Если (ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОбъектамВозникновенияЗатрат")) Тогда
		ВариантыРаспределения.Добавить(Перечисления.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат);
	КонецЕсли;
	//-- НЕ УТ
	Если РасчетСебестоимостиПовтИсп.ПартионныйУчетВерсии22(ПараметрыОбработчика.ПараметрыРасчета.ПериодРегистрации) Тогда
		ВариантыРаспределения.Добавить(Перечисления.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров);
	КонецЕсли;
	
	Если ВариантыРаспределения.Количество() = 0 Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеТребуется(
			ПараметрыОбработчика,
			НСтр("ru='Нет данных для распределения расходов.'", ОбщегоНазначения.КодОсновногоЯзыка()));
		
		Возврат;
	
	КонецЕсли;

	ПараметрыЗапроса = Документы.РаспределениеПрочихЗатрат.ОписаниеПараметровЗапросаПолученияДанныхДляРаспределения();
	ПараметрыЗапроса.Состояние = Перечисления.СостоянияРаспределенияРасходов.ТребуетсяРучнойВводДокумента;
	ПараметрыЗапроса.ВариантРаспределения = ВариантыРаспределения;
	ПараметрыЗапроса.ИсключитьТранспортныеРасходы = Истина;
	Документы.РаспределениеПрочихЗатрат.ИнициализироватьЗапросПолученияДанныхДляРаспределения(Запрос, ПараметрыЗапроса);
	
	Запрос.Текст = Документы.РаспределениеПрочихЗатрат.ТекстЗапросаДанныеДляРаспределения(, Истина);
	
	Запрос.Выполнить();	
	
	РазмерыВременныхТаблиц = ЗакрытиеМесяцаСервер.РазмерыВременныхТаблиц(Запрос, ПараметрыОбработчика);
	
	Если РазмерыВременныхТаблиц.ВТДанныеДляРаспределения = 0 Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеТребуется(
			ПараметрыОбработчика,
			НСтр("ru='Нет данных для распределения расходов.'", ОбщегоНазначения.КодОсновногоЯзыка()));
		
		Возврат;
		
	КонецЕсли;
	
	Если РазмерыВременныхТаблиц.СостояниеРаспределенияРасходов = 0 Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеТребуется(
			ПараметрыОбработчика,
			НСтр("ru='Все производственные расходы полностью распределены по статьям калькуляции.'", ОбщегоНазначения.КодОсновногоЯзыка()));
		
	КонецЕсли;
	
КонецПроцедуры

// Проверки состояния системы, относящиеся к этапу.

Процедура ОписаниеПроверок_НастройкаРаспределенияРасходовВручную(ТаблицаПроверок) Экспорт
	
	// Настройка распределения расходов.
	ОписаниеПроверки = ЗакрытиеМесяцаСервер.ДобавитьОписаниеНовойПроверки(ТаблицаПроверок,
		"НеВыполненаНастройкаРаспределенияРасходовВручную",
		Перечисления.ОперацииЗакрытияМесяца.НастройкаРаспределенияРасходовВручную,
		Перечисления.МоментЗапускаПроверкиОперацииЗакрытияМесяца.ДоРасчета,
		"ЗатратыСервер.ПроверкаНеобходимостиНастройкиРаспределенияРасходовВручную");
	
	ЗакрытиеМесяцаСервер.ЗаполнитьПредставлениеНовойПроверки(ОписаниеПроверки,
		НСтр("ru='Не внесены настройки распределения расходов, требующие ручной ввод'", ОбщегоНазначения.КодОсновногоЯзыка()),
		НСтр("ru='Все производственные расходы должны быть полностью распределены'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
КонецПроцедуры

Процедура ПроверкаНеобходимостиНастройкиРаспределенияРасходовВручную(ПараметрыПроверки) Экспорт
	
	Если НЕ ЗакрытиеМесяцаСервер.ПроверкаВыполняетсяМеханизмомЗакрытияМесяца(ПараметрыПроверки) Тогда
		Возврат;
	КонецЕсли;
	
	СписокПолей = Новый СписокЗначений;
	СписокПолей.Добавить("Организация", 			НСтр("ru='Организация'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("Подразделение", 			НСтр("ru='Подразделение'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("НаправлениеДеятельности", НСтр("ru='Направление деятельности'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("СтатьяРасходов", 			НСтр("ru='Статья расходов'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("АналитикаРасходов", 		НСтр("ru='Аналитика расходов'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	ПараметрыРегистрации = ЗакрытиеМесяцаСервер.ИнициализироватьПараметрыРегистрацииПроблемПроверки(
		"СостояниеРаспределенияРасходов",
		НСтр("ru='Обнаружены статьи расходов, требующие ручной настройки распределения, по организации ""%1"" на конец периода %2'", ОбщегоНазначения.КодОсновногоЯзыка()),
		СписокПолей);
	
	ЗакрытиеМесяцаСервер.ЗарегистрироватьПроблемыВыполненияПроверки(
	 	ПараметрыПроверки,
		ПараметрыРегистрации);
		
КонецПроцедуры

#КонецОбласти

//++ НЕ УТ

#Область РаспределениеМатериаловИРаботНаСебестоимостьПродукции22

// Добавляет этап в таблицу этапов закрытия месяца.
// Элементы данной таблицы являются элементами второго уровня в дереве этапов в форме закрытия месяца.
// 
// Параметры:
// 	ТаблицаЭтапов - см. Обработки.ОперацииЗакрытияМесяца.ЗаполнитьОписаниеЭтаповЗакрытияМесяца
// 	ТекущийРодитель - Строка - идентификатор группы.
Процедура ДобавитьЭтап_РаспределениеМатериаловИРаботНаСебестоимостьПродукции22(ТаблицаЭтапов,ТекущийРодитель) Экспорт
	НоваяСтрока = ЗакрытиеМесяцаСервер.ДобавитьЭтапВТаблицу(ТаблицаЭтапов, ТекущийРодитель,
		Перечисления.ОперацииЗакрытияМесяца.РаспределениеМатериаловИРаботНаСебестоимостьПродукции22);
	НоваяСтрока.ВыполняетсяВручную = Истина;
	НоваяСтрока.ДействиеОформление = ЗакрытиеМесяцаСервер.ОписаниеДействия_СервернаяПроцедура(
		"ЗатратыСервер.Оформление_РаспределениеМатериаловИРаботНаСебестоимостьПродукции22");
	НоваяСтрока.ДействиеИспользование = ЗакрытиеМесяцаСервер.ОписаниеДействия_СервернаяПроцедура(
		"ЗатратыСервер.Использование_РаспределениеМатериаловИРаботНаСебестоимостьПродукции22");
	НоваяСтрока.ДействиеВыполнить  = ЗакрытиеМесяцаСервер.ОписаниеДействия_ОткрытьФорму(
		Метаданные.Документы.РаспределениеПроизводственныхЗатрат.Формы.ФормаРаспределениеМатериаловИРабот.ПолноеИмя());
	// Доп. параметры формы.
	НоваяСтрока.ДействиеВыполнить.ПараметрыФормы.Вставить("Состояние",     		     		"ТребуетсяРаспределить");
	НоваяСтрока.ДействиеВыполнить.ПараметрыФормы.Вставить("Подразделение", 		     		Справочники.СтруктураПредприятия.ПустаяСсылка());
	НоваяСтрока.ДействиеВыполнить.ПараметрыФормы.Вставить("ОформитьПроизводствоБезЗаказов", Ложь);
КонецПроцедуры

// Обработчики этапа.

Процедура Использование_РаспределениеМатериаловИРаботНаСебестоимостьПродукции22(ПараметрыОбработчика) Экспорт
	
	ЗакрытиеМесяцаСервер.УвеличитьКоличествоОбработанныхДанныхДляЗамера(ПараметрыОбработчика, 1);
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьПроизводство") Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеОтключено(
			ПараметрыОбработчика,
			НСтр("ru='Учет производственных операций не ведется'", ОбщегоНазначения.КодОсновногоЯзыка()));
			
		Возврат;
		
	КонецЕсли;
	
	ЗакрытиеМесяцаСервер.УвеличитьКоличествоОбработанныхДанныхДляЗамера(ПараметрыОбработчика, 1);
	
	НастройкиПроизводства = ПроизводствоСервер.НастройкиПодсистемыПроизводство();
	
	Если НЕ НастройкиПроизводства.ИспользуетсяПроизводство22 Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеТребуется(
			ПараметрыОбработчика,
			НСтр("ru='Не используется управление производством (версия 2.2)'", ОбщегоНазначения.КодОсновногоЯзыка()));
			
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ЗакрытиеМесяцаСервер.ИнициализироватьЗапрос(Запрос, ПараметрыОбработчика);
	
	Запрос.Текст = Документы.РаспределениеПроизводственныхЗатрат.ТекстЗапросаМатериаловИРаботВКладовых(Истина);
	
	// Доп. параметры запроса.
	Запрос.УстановитьПараметр("ВсеДвижения",             Истина);
	Запрос.УстановитьПараметр("НачалоПериода",  	     Запрос.Параметры.НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода",  	     Запрос.Параметры.КонецПериода);
	Запрос.УстановитьПараметр("ГраницаОкончаниеПериода", Запрос.Параметры.ГраницаКонецПериода);
	Запрос.УстановитьПараметр("ВсеОрганизации",	         Ложь);
	Запрос.УстановитьПараметр("Организации",       	     Запрос.Параметры.МассивОрганизаций);
	Запрос.УстановитьПараметр("ВсеПодразделения",  	     Истина);
	Запрос.УстановитьПараметр("Подразделения",     	     Новый Массив);
	Запрос.УстановитьПараметр("ВсеТипыНоменклатуры",     Истина);
	Запрос.УстановитьПараметр("ТипНоменклатуры",         Неопределено);
	Запрос.УстановитьПараметр("ВсеАналитики",	           Истина);
	Запрос.УстановитьПараметр("АналитикаУчетаНоменклатуры",Неопределено);
	
	Запрос.Выполнить();
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДД.Организация
	|ПОМЕСТИТЬ ДвиженияМатериаловВПроизводстве
	|ИЗ
	|	РегистрНакопления.МатериалыИРаботыВПроизводстве КАК ДД
	|ГДЕ
	|	ДД.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДД.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|	И ДД.Организация В (&МассивОрганизаций)
	|	И ДД.Активность
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МатериалыИРаботы.Организация,
	|	МатериалыИРаботы.Подразделение,
	|	МатериалыИРаботы.Номенклатура,
	|	МатериалыИРаботы.Характеристика,
	|	МатериалыИРаботы.Серия,
	|	МатериалыИРаботы.Распределить КАК Количество
	|ПОМЕСТИТЬ ВТНераспределенныеМатериалыИРаботы
	|ИЗ
	|	МатериалыИРаботы КАК МатериалыИРаботы
	|ГДЕ
	|	МатериалыИРаботы.Распределить > 0
	|	И МатериалыИРаботы.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МатериалыИРаботы.Организация,
	|	МатериалыИРаботы.Подразделение,
	|	МатериалыИРаботы.Номенклатура,
	|	МатериалыИРаботы.Характеристика,
	|	МатериалыИРаботы.Серия,
	|	МатериалыИРаботы.Распределить КАК Количество
	|ИЗ
	|	МатериалыИРаботы КАК МатериалыИРаботы
	|	ЛЕВОЕ СОЕДИНЕНИЕ ДвиженияМатериаловВПроизводстве КАК ДвиженияМатериаловВПроизводстве
	|	ПО МатериалыИРаботы.Организация = ДвиженияМатериаловВПроизводстве.Организация
	|ГДЕ
	|	МатериалыИРаботы.Распределить > 0
	|	И МатериалыИРаботы.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|	И ДвиженияМатериаловВПроизводстве.Организация ЕСТЬ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МатериалыИРаботы.Организация
	|ПОМЕСТИТЬ ВТРаспределенныеМатериалыИРаботы
	|ИЗ
	|	МатериалыИРаботы КАК МатериалыИРаботы
	|ГДЕ
	|	МатериалыИРаботы.Распределено > 0";
	
	Запрос.Выполнить();
	
	РазмерыВременныхТаблиц = ЗакрытиеМесяцаСервер.РазмерыВременныхТаблиц(Запрос, ПараметрыОбработчика);
	
	Если РазмерыВременныхТаблиц.ВТНераспределенныеМатериалыИРаботы = 0
	 И РазмерыВременныхТаблиц.ВТРаспределенныеМатериалыИРаботы = 0 Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеТребуется(
			ПараметрыОбработчика,
			НСтр("ru='Нет материалов и работ для распределения на этапы производства'", ОбщегоНазначения.КодОсновногоЯзыка()));
		
	КонецЕсли;
	
КонецПроцедуры



// Оформление операции в закрытии месяца.
// 
// Параметры:
// 	ПараметрыОбработчика - см. Обработки.ОперацииЗакрытияМесяца.ИнициализироватьПараметрыОбработчикаЭтапа
Процедура Оформление_РаспределениеМатериаловИРаботНаСебестоимостьПродукции22(ПараметрыОбработчика) Экспорт
	
	НастройкиПроизводства = ПроизводствоСервер.НастройкиПодсистемыПроизводство();
	
	Если НЕ (НастройкиПроизводства.ИспользуетсяПроизводство21 И НастройкиПроизводства.ИспользуетсяПроизводство22) Тогда
		ПараметрыОбработчика.ДанныеЭтапа.Наименование = НСтр("ru = 'Распределение материалов и работ на себестоимость продукции'");
	КонецЕсли;
	
	ПараметрыОбработчика.ДанныеЭтапа.ТекстВыполнить = НСтр("ru='Распределить'");
	
	ЗакрытиеМесяцаСервер.УвеличитьКоличествоОбработанныхДанныхДляЗамера(ПараметрыОбработчика);
	
КонецПроцедуры

// Проверки состояния системы, относящиеся к этапу.

Процедура ОписаниеПроверок_РаспределениеМатериаловИРаботНаСебестоимостьПродукции22(ТаблицаПроверок) Экспорт
	
	// Распределение материалов и работ на себестоимость продукции (2.2).
	ОписаниеПроверки = ЗакрытиеМесяцаСервер.ДобавитьОписаниеНовойПроверки(ТаблицаПроверок,
		"НеРаспределеныМатериалыИРаботыНаСебестоимостьПродукции22",
		Перечисления.ОперацииЗакрытияМесяца.РаспределениеМатериаловИРаботНаСебестоимостьПродукции22,
		Перечисления.МоментЗапускаПроверкиОперацииЗакрытияМесяца.ДоИПослеРасчета,
		"ЗатратыСервер.ПроверкаНеобходимостиРаспределенияМатериаловИРаботНаСебестоимостьПродукции22");
	
	ЗакрытиеМесяцаСервер.ЗаполнитьПредставлениеНовойПроверки(ОписаниеПроверки,
		НСтр("ru='Не распределенные материалы (работы) на этапы производства'", ОбщегоНазначения.КодОсновногоЯзыка()),
		НСтр("ru='Должно быть оформлено распределение всех материалов и работ на этапы производства документами ""Распределение материалов и работ"".'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
КонецПроцедуры

Процедура ПроверкаНеобходимостиРаспределенияМатериаловИРаботНаСебестоимостьПродукции22(ПараметрыПроверки) Экспорт
	
	Если НЕ ЗакрытиеМесяцаСервер.ПроверкаВыполняетсяМеханизмомЗакрытияМесяца(ПараметрыПроверки) Тогда
		Возврат;
	КонецЕсли;
	
	СписокПолей = Новый СписокЗначений;
	СписокПолей.Добавить("Организация", 	НСтр("ru='Организация'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("Подразделение", 	НСтр("ru='Подразделение'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("Номенклатура", 	НСтр("ru='Номенклатура'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("Характеристика", 	НСтр("ru='Характеристика'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("Серия", 			НСтр("ru='Серия'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("Количество",		НСтр("ru='Количество'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	ПараметрыРегистрации = ЗакрытиеМесяцаСервер.ИнициализироватьПараметрыРегистрацииПроблемПроверки(
		"ВТНераспределенныеМатериалыИРаботы",
		НСтр("ru='Обнаружены не распределенные на этапы производства материалы (работы) организации ""%1"" на конец периода %2'", ОбщегоНазначения.КодОсновногоЯзыка()),
		СписокПолей);
	
	ЗакрытиеМесяцаСервер.ЗарегистрироватьПроблемыВыполненияПроверки(
	 	ПараметрыПроверки,
		ПараметрыРегистрации);
	
КонецПроцедуры

#КонецОбласти

#Область НастройкаПоказателейДляРаспределенияРасходовНаСебестоимостьПродукции

// Добавляет этап в таблицу этапов закрытия месяца.
// Элементы данной таблицы являются элементами второго уровня в дереве этапов в форме закрытия месяца.
// 
// Параметры:
// 	ТаблицаЭтапов - см. Обработки.ОперацииЗакрытияМесяца.ЗаполнитьОписаниеЭтаповЗакрытияМесяца
// 	ТекущийРодитель - Строка - идентификатор группы.
Процедура ДобавитьЭтап_НастройкаПоказателейДляРаспределенияРасходовНаСебестоимостьПродукции(ТаблицаЭтапов,ТекущийРодитель) Экспорт
	НоваяСтрока = ЗакрытиеМесяцаСервер.ДобавитьЭтапВТаблицу(ТаблицаЭтапов, ТекущийРодитель,
		Перечисления.ОперацииЗакрытияМесяца.НастройкаПоказателейДляРаспределенияРасходовНаСебестоимостьПродукции);
	НоваяСтрока.ВыполняетсяВручную = Истина;
	НоваяСтрока.ТекстВыполнить = НСтр("ru='Настроить'");
	НоваяСтрока.ДействиеИспользование = ЗакрытиеМесяцаСервер.ОписаниеДействия_СервернаяПроцедура(
		"ЗатратыСервер.Использование_НастройкаПоказателейДляРаспределенияРасходовНаСебестоимостьПродукции");
	НоваяСтрока.ДействиеВыполнить  = ЗакрытиеМесяцаСервер.ОписаниеДействия_ОткрытьФорму(
		Метаданные.Справочники.ПравилаРаспределенияРасходов.Формы.ФормаСпискаВручную.ПолноеИмя());
	// Доп. параметры формы.
	НоваяСтрока.ДействиеВыполнить.ПараметрыФормы.Вставить("ТолькоНезаполненные", Истина);
КонецПроцедуры

// Обработчики этапа.

Процедура Использование_НастройкаПоказателейДляРаспределенияРасходовНаСебестоимостьПродукции(ПараметрыОбработчика) Экспорт
	
	Запрос = Новый Запрос;
	ЗакрытиеМесяцаСервер.ИнициализироватьЗапрос(Запрос, ПараметрыОбработчика);
	ПараметрыЗапроса = Документы.РаспределениеПрочихЗатрат.ОписаниеПараметровЗапросаПолученияДанныхДляРаспределения();
	Документы.РаспределениеПрочихЗатрат.ИнициализироватьЗапросПолученияДанныхДляРаспределения(Запрос, ПараметрыЗапроса);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Организация КАК Организация,
	|	ДД.Показатель КАК Показатель
	|ПОМЕСТИТЬ ВТИспользуемыеПоказатели
	|ИЗ
	|	Документ.РаспределениеПрочихЗатрат КАК ДД
	|ГДЕ
	|	ДД.Проведен
	|	И ДД.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДД.Организация В (&МассивОрганизаций)
	|	И ДД.НазначениеНастройкиРаспределения В (
	|		ЗНАЧЕНИЕ(Перечисление.НазначениеПравилРаспределенияРасходов.РаспределениеСтатейРасходовПоЭтапамПроизводства),
	|		ЗНАЧЕНИЕ(Перечисление.НазначениеПравилРаспределенияРасходов.РаспределениеСтатейРасходовПоПодразделениям)
	|	)
	|	И ДД.БазаРаспределенияПоПодразделениям В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВводитсяЕжемесячно),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВводитсяПриИзменении)
	|	)";
	
	Запрос.Выполнить();	
	
	Если ЗакрытиеМесяцаСервер.РазмерВременнойТаблицы(Запрос, "ВТИспользуемыеПоказатели", ПараметрыОбработчика) = 0 Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеТребуется(
			ПараметрыОбработчика,
			НСтр("ru='Нет данных для распределения расходов.'", ОбщегоНазначения.КодОсновногоЯзыка()));
		
		Возврат;
		
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.Организация КАК Организация,
	|	Т.Показатель КАК Показатель
	|ПОМЕСТИТЬ ВТНекорректныеПоказатели
	|ИЗ
	|	ВТИспользуемыеПоказатели КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПравилаРаспределенияРасходов КАК Показатели
	|		ПО Показатели.Ссылка = Т.Показатель
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПоказателейДляРаспределенияРасходов КАК ЗначенияЕжемесячно
	|		ПО Показатели.Ссылка = ЗначенияЕжемесячно.Показатель
	|		И (НАЧАЛОПЕРИОДА(ЗначенияЕжемесячно.Период, МЕСЯЦ) = &НачалоПериода)
	|ГДЕ
	|	Показатели.БазаРаспределения = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВводитсяЕжемесячно)
	|	И Показатели.НазначениеПравила = ЗНАЧЕНИЕ(Перечисление.НазначениеПравилРаспределенияРасходов.РаспределениеСтатейРасходовПоПодразделениям)
	|	И ЗначенияЕжемесячно.Показатель ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Организация,
	|	Т.Показатель
	|ИЗ
	|	ВТИспользуемыеПоказатели КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПравилаРаспределенияРасходов КАК Показатели
	|		ПО Показатели.Ссылка = Т.Показатель
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПоказателейДляРаспределенияРасходов.СрезПоследних(&КонецПериода,) КАК ЗначенияПриИзменении
	|		ПО Показатели.Ссылка = ЗначенияПриИзменении.Показатель
	|ГДЕ
	|	Показатели.БазаРаспределения = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВводитсяПриИзменении)
	|	И Показатели.НазначениеПравила = ЗНАЧЕНИЕ(Перечисление.НазначениеПравилРаспределенияРасходов.РаспределениеСтатейРасходовПоПодразделениям)
	|	И ЗначенияПриИзменении.Показатель ЕСТЬ NULL";
	
	Запрос.Выполнить();
	
	Если ЗакрытиеМесяцаСервер.РазмерВременнойТаблицы(Запрос, "ВТНекорректныеПоказатели", ПараметрыОбработчика) = 0 Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеТребуется(
			ПараметрыОбработчика,
			НСтр("ru='Все показатели распределения расходов настроены корректно.'", ОбщегоНазначения.КодОсновногоЯзыка()));
		
	КонецЕсли;
	
КонецПроцедуры

// Проверки состояния системы, относящиеся к этапу.

Процедура ОписаниеПроверок_НастройкаПоказателейДляРаспределенияРасходовНаСебестоимостьПродукции(ТаблицаПроверок) Экспорт
	
	// Настройка показателей для распределения расходов на себестоимость продукции.
	ОписаниеПроверки = ЗакрытиеМесяцаСервер.ДобавитьОписаниеНовойПроверки(ТаблицаПроверок,
		"НеВыполненаНастройкаПоказателейДляРаспределенияРасходовНаСебестоимостьПродукции",
		Перечисления.ОперацииЗакрытияМесяца.НастройкаПоказателейДляРаспределенияРасходовНаСебестоимостьПродукции,
		Перечисления.МоментЗапускаПроверкиОперацииЗакрытияМесяца.ДоИПослеРасчета,
		"ЗатратыСервер.ПроверкаНеобходимостиНастройкиПоказателейДляРаспределенияРасходовНаСебестоимостьПродукции");
	
	ЗакрытиеМесяцаСервер.ЗаполнитьПредставлениеНовойПроверки(ОписаниеПроверки,
		НСтр("ru='Не заданные значения показателей распределения расходов'", ОбщегоНазначения.КодОсновногоЯзыка()),
		НСтр("ru='Для показателей с базами распределения ""Вводится ежемесячно"" и ""Вводится при изменении"" должны быть заполнены значения в рассчитываемом периоде.'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
КонецПроцедуры

Процедура ПроверкаНеобходимостиНастройкиПоказателейДляРаспределенияРасходовНаСебестоимостьПродукции(ПараметрыПроверки) Экспорт
	
	Если НЕ ЗакрытиеМесяцаСервер.ПроверкаВыполняетсяМеханизмомЗакрытияМесяца(ПараметрыПроверки) Тогда
		Возврат;
	КонецЕсли;
	
	СписокПолей = Новый СписокЗначений;
	СписокПолей.Добавить("Организация", НСтр("ru='Организация'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("Показатель", 	НСтр("ru='Показатель'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	ПараметрыРегистрации = ЗакрытиеМесяцаСервер.ИнициализироватьПараметрыРегистрацииПроблемПроверки(
		"ВТНекорректныеПоказатели",
		НСтр("ru='Обнаружены показатели, значения которых не заданы в периоде %2'", ОбщегоНазначения.КодОсновногоЯзыка()),
		СписокПолей,
		"Показатель");
	
	ЗакрытиеМесяцаСервер.ЗарегистрироватьПроблемыВыполненияПроверки(
	 	ПараметрыПроверки,
		ПараметрыРегистрации);
	
КонецПроцедуры

#КонецОбласти

#Область НастройкаПоказателейДляРаспределенияРасходовМеждуОВЗ

// Добавляет этап в таблицу этапов закрытия месяца.
// Элементы данной таблицы являются элементами второго уровня в дереве этапов в форме закрытия месяца.
// 
// Параметры:
// 	ТаблицаЭтапов - см. Обработки.ОперацииЗакрытияМесяца.ЗаполнитьОписаниеЭтаповЗакрытияМесяца
// 	ТекущийРодитель - Строка - идентификатор группы.
Процедура ДобавитьЭтап_НастройкаПоказателейДляРаспределенияРасходовМеждуОВЗ(ТаблицаЭтапов,ТекущийРодитель) Экспорт
	Если НЕ (ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОбъектамВозникновенияЗатрат")) Тогда
		Возврат
	КонецЕсли;
	НоваяСтрока = ЗакрытиеМесяцаСервер.ДобавитьЭтапВТаблицу(ТаблицаЭтапов, ТекущийРодитель,
		Перечисления.ОперацииЗакрытияМесяца.НастройкаПоказателейДляРаспределенияРасходовМеждуОВЗ);
	НоваяСтрока.ВыполняетсяВручную = Истина;
	НоваяСтрока.ТекстВыполнить = НСтр("ru='Настроить'");
	НоваяСтрока.ДействиеИспользование = ЗакрытиеМесяцаСервер.ОписаниеДействия_СервернаяПроцедура(
		"ЗатратыСервер.Использование_НастройкаПоказателейДляРаспределенияРасходовМеждуОВЗ");
	НоваяСтрока.ДействиеВыполнить  = ЗакрытиеМесяцаСервер.ОписаниеДействия_ОткрытьФорму(
		Метаданные.Справочники.ПравилаРаспределенияРасходов.Формы.ФормаСпискаВручную.ПолноеИмя());
	// Доп. параметры формы.
	НоваяСтрока.ДействиеВыполнить.ПараметрыФормы.Вставить("ТолькоНезаполненные", Истина);
	НоваяСтрока.ДействиеВыполнить.ПараметрыФормы.Вставить("НазначениеПравила", Перечисления.НазначениеПравилРаспределенияРасходов.РаспределениеРасходовНаОВЗ);
КонецПроцедуры

// Обработчики этапа.

Процедура Использование_НастройкаПоказателейДляРаспределенияРасходовМеждуОВЗ(ПараметрыОбработчика) Экспорт
	
	Запрос = Новый Запрос;
	ЗакрытиеМесяцаСервер.ИнициализироватьЗапрос(Запрос, ПараметрыОбработчика);
	ПараметрыЗапроса = Документы.РаспределениеПрочихЗатрат.ОписаниеПараметровЗапросаПолученияДанныхДляРаспределения();
	Документы.РаспределениеПрочихЗатрат.ИнициализироватьЗапросПолученияДанныхДляРаспределения(Запрос, ПараметрыЗапроса);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Организация КАК Организация,
	|	ДД.Показатель КАК Показатель
	|ПОМЕСТИТЬ ВТИспользуемыеПоказатели
	|ИЗ
	|	Документ.РаспределениеПрочихЗатрат КАК ДД
	|ГДЕ
	|	ДД.Проведен
	|	И ДД.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДД.Организация В (&МассивОрганизаций)
	|	И ДД.НазначениеНастройкиРаспределения = ЗНАЧЕНИЕ(Перечисление.НазначениеПравилРаспределенияРасходов.РаспределениеРасходовНаОВЗ)
	|	И ДД.БазаРаспределенияПоПодразделениям В (
	|		ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВводитсяЕжемесячно),
	|		ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВводитсяПриИзменении)
	|	)";
	
	Запрос.Выполнить();	
	
	Если ЗакрытиеМесяцаСервер.РазмерВременнойТаблицы(Запрос, "ВТИспользуемыеПоказатели", ПараметрыОбработчика) = 0 Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеТребуется(
			ПараметрыОбработчика,
			НСтр("ru='Нет данных для распределения расходов.'", ОбщегоНазначения.КодОсновногоЯзыка()));
		
		Возврат;
		
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.Организация КАК Организация,
	|	Т.Показатель КАК Показатель
	|ПОМЕСТИТЬ ВТНекорректныеПоказатели
	|ИЗ
	|	ВТИспользуемыеПоказатели КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПравилаРаспределенияРасходов КАК Показатели
	|		ПО Показатели.Ссылка = Т.Показатель
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПоказателейДляРаспределенияРасходовНаОВЗ КАК ЗначенияЕжемесячно
	|		ПО Показатели.Ссылка = ЗначенияЕжемесячно.Показатель
	|		И (НАЧАЛОПЕРИОДА(ЗначенияЕжемесячно.Период, МЕСЯЦ) = &НачалоПериода)
	|ГДЕ
	|	Показатели.БазаРаспределения = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВводитсяЕжемесячно)
	|	И Показатели.НазначениеПравила = ЗНАЧЕНИЕ(Перечисление.НазначениеПравилРаспределенияРасходов.РаспределениеРасходовНаОВЗ)
	|	И ЗначенияЕжемесячно.Показатель ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Т.Организация,
	|	Т.Показатель
	|ИЗ
	|	ВТИспользуемыеПоказатели КАК Т
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПравилаРаспределенияРасходов КАК Показатели
	|		ПО Показатели.Ссылка = Т.Показатель
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПоказателейДляРаспределенияРасходовНаОВЗ.СрезПоследних(&КонецПериода,) КАК ЗначенияПриИзменении
	|		ПО Показатели.Ссылка = ЗначенияПриИзменении.Показатель
	|ГДЕ
	|	Показатели.БазаРаспределения = ЗНАЧЕНИЕ(Перечисление.ТипыБазыРаспределенияРасходов.ВводитсяПриИзменении)
	|	И Показатели.НазначениеПравила = ЗНАЧЕНИЕ(Перечисление.НазначениеПравилРаспределенияРасходов.РаспределениеРасходовНаОВЗ)
	|	И ЗначенияПриИзменении.Показатель ЕСТЬ NULL";
	
	Запрос.Выполнить();
	
	Если ЗакрытиеМесяцаСервер.РазмерВременнойТаблицы(Запрос, "ВТНекорректныеПоказатели", ПараметрыОбработчика) = 0 Тогда
		
		ЗакрытиеМесяцаСервер.УстановитьСостояниеНеТребуется(
			ПараметрыОбработчика,
			НСтр("ru='Все показатели распределения расходов настроены корректно.'", ОбщегоНазначения.КодОсновногоЯзыка()));
		
	КонецЕсли;
	
КонецПроцедуры

// Проверки состояния системы, относящиеся к этапу.

Процедура ОписаниеПроверок_НастройкаПоказателейДляРаспределенияРасходовМеждуОВЗ(ТаблицаПроверок) Экспорт
	
	Если НЕ (ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОбъектамВозникновенияЗатрат")) Тогда
		Возврат
	КонецЕсли;
	
	// Настройка показателей для распределения расходов на себестоимость продукции.
	ОписаниеПроверки = ЗакрытиеМесяцаСервер.ДобавитьОписаниеНовойПроверки(ТаблицаПроверок,
		"НеВыполненаНастройкаПоказателейДляРаспределенияРасходовМеждуОВЗ",
		Перечисления.ОперацииЗакрытияМесяца.НастройкаПоказателейДляРаспределенияРасходовМеждуОВЗ,
		Перечисления.МоментЗапускаПроверкиОперацииЗакрытияМесяца.ДоИПослеРасчета,
		"ЗатратыСервер.ПроверкаНеобходимостиНастройкиПоказателейДляРаспределенияРасходовМеждуОВЗ");
	
	ЗакрытиеМесяцаСервер.ЗаполнитьПредставлениеНовойПроверки(ОписаниеПроверки,
		НСтр("ru='Не заданные значения показателей распределения расходов'", ОбщегоНазначения.КодОсновногоЯзыка()),
		НСтр("ru='Для показателей с базами распределения ""Вводится ежемесячно"" и ""Вводится при изменении"" должны быть заполнены значения в рассчитываемом периоде.'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
КонецПроцедуры

Процедура ПроверкаНеобходимостиНастройкиПоказателейДляРаспределенияРасходовМеждуОВЗ(ПараметрыПроверки) Экспорт
	
	Если НЕ ЗакрытиеМесяцаСервер.ПроверкаВыполняетсяМеханизмомЗакрытияМесяца(ПараметрыПроверки) Тогда
		Возврат;
	КонецЕсли;
	
	СписокПолей = Новый СписокЗначений;
	СписокПолей.Добавить("Организация", НСтр("ru='Организация'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("Показатель", 	НСтр("ru='Показатель'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	ПараметрыРегистрации = ЗакрытиеМесяцаСервер.ИнициализироватьПараметрыРегистрацииПроблемПроверки(
		"ВТНекорректныеПоказатели",
		НСтр("ru='Обнаружены показатели, значения которых не заданы в периоде %2'", ОбщегоНазначения.КодОсновногоЯзыка()),
		СписокПолей,
		,
		Метаданные.РегистрыСведений.ЗначенияПоказателейДляРаспределенияРасходовНаОВЗ.ПолноеИмя());
	
	ЗакрытиеМесяцаСервер.ЗарегистрироватьПроблемыВыполненияПроверки(
	 	ПараметрыПроверки,
		ПараметрыРегистрации);
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкаСоответствияОрганизацияПодразделениеДаннымОВЗ

Процедура ПроверкаСоответствияОрганизацияПодразделениеДаннымОВЗ(ПараметрыПроверки) Экспорт
	
	ТекстЗапроса = РасчетСебестоимостиПостатейныеЗатраты.ТекстВТпоОВЗ() + 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПрочиеРасходы.Регистратор КАК Документ,
	|	ПрочиеРасходы.Организация,
	|	ПрочиеРасходы.Подразделение,
	|	ПрочиеРасходы.СтатьяРасходов,
	|	ВтОВЗ.ОВЗ КАК ОВЗ,
	|	ВтОВЗ.Организация КАК ОрганизацияОВЗ,
	|	ВтОВЗ.Подразделение КАК ПодразделениеОВЗ
	|ПОМЕСТИТЬ НеСоответствияОрганизацияПодразделениеДаннымОВЗ
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы КАК ПрочиеРасходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОВЗ КАК ВтОВЗ
	|		ПО ПрочиеРасходы.АналитикаРасходов = ВтОВЗ.ОВЗ
	|ГДЕ
	|	ПрочиеРасходы.Организация В (&МассивОрганизаций)
	|	И ПрочиеРасходы.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (ПрочиеРасходы.Организация <> ВтОВЗ.Организация
	|	ИЛИ ПрочиеРасходы.Подразделение <> ВтОВЗ.Подразделение)
	|	И ПрочиеРасходы.Активность
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Регистратор КАК Документ,
	|	ДД.Организация,
	|	СтоимостьОС.Подразделение,
	|	ДД.СтатьяРасходовБУ,
	|	ВтОВЗ.ОВЗ КАК ОВЗ,
	|	ВтОВЗ.Организация КАК ОрганизацияОВЗ,
	|	ВтОВЗ.Подразделение КАК ПодразделениеОВЗ
	|ИЗ
	|	РегистрСведений.ПорядокУчетаОСБУ.СрезПоследних(&КонецПериода, Организация В (&МассивОрганизаций)) КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОС.Остатки(&КонецПериода,
	|			Организация В (&МассивОрганизаций)
	|		) КАК СтоимостьОС
	|		ПО СтоимостьОС.ОсновноеСредство = ДД.ОсновноеСредство
	|			И СтоимостьОС.Организация = ДД.Организация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОВЗ КАК ВтОВЗ
	|		ПО ДД.АналитикаРасходовБУ = ВтОВЗ.ОВЗ
	|ГДЕ
	|	СтоимостьОС.СтоимостьРеглОстаток <> 0
	|	И (ДД.Организация <> ВтОВЗ.Организация
	|	ИЛИ СтоимостьОС.Подразделение <> ВтОВЗ.Подразделение)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Регистратор КАК Документ,
	|	ДД.Организация,
	|	СтоимостьОС.Подразделение,
	|	ДД.СтатьяРасходовНУ,
	|	ВтОВЗ.ОВЗ КАК ОВЗ,
	|	ВтОВЗ.Организация КАК ОрганизацияОВЗ,
	|	ВтОВЗ.Подразделение КАК ПодразделениеОВЗ
	|ИЗ
	|	РегистрСведений.ПорядокУчетаОСБУ.СрезПоследних(&КонецПериода, Организация В (&МассивОрганизаций)) КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.СтоимостьОС.Остатки(&КонецПериода, 
	|			Организация В (&МассивОрганизаций)
	|		) КАК СтоимостьОС
	|		ПО СтоимостьОС.ОсновноеСредство = ДД.ОсновноеСредство
	|			И СтоимостьОС.Организация = ДД.Организация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОВЗ КАК ВтОВЗ
	|		ПО ДД.АналитикаРасходовНУ = ВтОВЗ.ОВЗ
	|ГДЕ
	|	СтоимостьОС.СтоимостьНУОстаток <> 0
	|	И (ДД.Организация <> ВтОВЗ.Организация
	|	ИЛИ СтоимостьОС.Подразделение <> ВтОВЗ.Подразделение)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Ссылка КАК Документ,
	|	ДД.Организация,
	|	ДД.Местонахождение,
	|	ДД.СтатьяРасходовУУ,
	|	ВтОВЗ.ОВЗ КАК ОВЗ,
	|	ВтОВЗ.Организация КАК ОрганизацияОВЗ,
	|	ВтОВЗ.Подразделение КАК ПодразделениеОВЗ
	|ИЗ
	|	Документ.ПринятиеКУчетуОС2_4 КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОВЗ КАК ВтОВЗ
	|		ПО ДД.АналитикаРасходовУУ = ВтОВЗ.ОВЗ
	|ГДЕ
	|	ДД.Организация В (&МассивОрганизаций)
	|	И ДД.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДД.Проведен
	|	И (ДД.Организация <> ВтОВЗ.Организация
	|	ИЛИ ДД.Местонахождение <> ВтОВЗ.Подразделение)
	|
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Ссылка КАК Документ,
	|	ДД.Организация,
	|	ДД.Местонахождение,
	|	ДД.СтатьяРасходовБУ,
	|	ВтОВЗ.ОВЗ КАК ОВЗ,
	|	ВтОВЗ.Организация КАК ОрганизацияОВЗ,
	|	ВтОВЗ.Подразделение КАК ПодразделениеОВЗ
	|ИЗ
	|	Документ.ПринятиеКУчетуОС2_4 КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОВЗ КАК ВтОВЗ
	|		ПО ДД.АналитикаРасходовБУ = ВтОВЗ.ОВЗ
	|ГДЕ
	|	ДД.Организация В (&МассивОрганизаций)
	|	И ДД.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДД.Проведен
	|	И (ДД.Организация <> ВтОВЗ.Организация
	|	ИЛИ ДД.Местонахождение <> ВтОВЗ.Подразделение)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Ссылка КАК Документ,
	|	ДД.Организация,
	|	ДД.Местонахождение,
	|	ДД.СтатьяРасходовНУ,
	|	ВтОВЗ.ОВЗ КАК ОВЗ,
	|	ВтОВЗ.Организация КАК ОрганизацияОВЗ,
	|	ВтОВЗ.Подразделение КАК ПодразделениеОВЗ
	|ИЗ
	|	Документ.ПринятиеКУчетуОС2_4 КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОВЗ КАК ВтОВЗ
	|		ПО ДД.АналитикаРасходовНУ = ВтОВЗ.ОВЗ
	|ГДЕ
	|	ДД.Организация В (&МассивОрганизаций)
	|	И ДД.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДД.Проведен
	|	И (ДД.Организация <> ВтОВЗ.Организация
	|	ИЛИ ДД.Местонахождение <> ВтОВЗ.Подразделение)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Ссылка КАК Документ,
	|	ДД.Организация,
	|	ДД.Местонахождение,
	|	ДД.СтатьяРасходовАмортизационнойПремии,
	|	ВтОВЗ.ОВЗ КАК ОВЗ,
	|	ВтОВЗ.Организация КАК ОрганизацияОВЗ,
	|	ВтОВЗ.Подразделение КАК ПодразделениеОВЗ
	|ИЗ
	|	Документ.ПринятиеКУчетуОС2_4 КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОВЗ КАК ВтОВЗ
	|		ПО ДД.АналитикаРасходовАмортизационнойПремии = ВтОВЗ.ОВЗ
	|ГДЕ
	|	ДД.Организация В (&МассивОрганизаций)
	|	И ДД.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДД.Проведен
	|	И (ДД.Организация <> ВтОВЗ.Организация
	|	ИЛИ ДД.Местонахождение <> ВтОВЗ.Подразделение)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДД.Ссылка КАК Документ,
	|	ДД.Организация,
	|	ДД.Местонахождение,
	|	ДД.СтатьяРасходовНалог,
	|	ВтОВЗ.ОВЗ КАК ОВЗ,
	|	ВтОВЗ.Организация КАК ОрганизацияОВЗ,
	|	ВтОВЗ.Подразделение КАК ПодразделениеОВЗ
	|ИЗ
	|	Документ.ПринятиеКУчетуОС2_4 КАК ДД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтОВЗ КАК ВтОВЗ
	|		ПО ДД.АналитикаРасходовНалог = ВтОВЗ.ОВЗ
	|ГДЕ
	|	ДД.Организация В (&МассивОрганизаций)
	|	И ДД.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДД.Проведен
	|	И (ДД.Организация <> ВтОВЗ.Организация
	|	ИЛИ ДД.Местонахождение <> ВтОВЗ.Подразделение)
	|	";
	
	ИмяПоляОбъекта = "Документ";
	
	ИмяВременнойТаблицы = "НеСоответствияОрганизацияПодразделениеДаннымОВЗ";
	ШаблонТекстаОшибки  = НСтр("ru='В расходах организации ""%1"" за период %2 обнаружено несоответствие пары организация/подразделение в первичном документе и в настройке объекта возникновения затрат'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	СписокПолей = Новый СписокЗначений;
	СписокПолей.Добавить(ИмяПоляОбъекта,	НСтр("ru='Документ'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("ОВЗ",				НСтр("ru='Объект возникновения затрат'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("Организация",		НСтр("ru='Организация (док.)'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("ОрганизацияОВЗ",	НСтр("ru='Организация (ОВЗ)'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("Подразделение",	НСтр("ru='Подразделение (док.)'", ОбщегоНазначения.КодОсновногоЯзыка()));
	СписокПолей.Добавить("ПодразделениеОВЗ",НСтр("ru='Подразделение (ОВЗ)'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	ПараметрыРегистрации = ЗакрытиеМесяцаСервер.ИнициализироватьПараметрыРегистрацииПроблемПроверки(ИмяВременнойТаблицы,
																									ШаблонТекстаОшибки,
																									СписокПолей,
																									ИмяПоляОбъекта);
	
	ЗакрытиеМесяцаСервер.ЗарегистрироватьПроблемыВыполненияПроверки(ПараметрыПроверки, ПараметрыРегистрации, ТекстЗапроса);
	
КонецПроцедуры

#КонецОбласти

//-- НЕ УТ
#КонецОбласти

#Область ОбработчикиПроверкиПриЗаписи

//++ НЕ УТ
Процедура ПроверкаПриЗаписиПрочиеРасходы(Регистратор, Отказ) Экспорт
	
	#Область ТекстПроверкиПодразделенияДляПроизводственнойСтатьи
	ТекстПроверкиПодразделенияДляПроизводственнойСтатьи = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	1 КАК КодОшибки,
	|	ДД.Организация КАК Параметр2,
	|	ДД.Подразделение КАК Параметр3,
	|	ДД.НаправлениеДеятельности КАК Параметр4,
	|	ДД.СтатьяРасходов КАК Параметр5,
	|	ДД.АналитикаРасходов КАК Параметр6,
	|	НЕОПРЕДЕЛЕНО КАК Параметр7,
	|	НЕОПРЕДЕЛЕНО КАК Параметр8,
	|	НЕОПРЕДЕЛЕНО КАК Параметр9
	|ИЗ РегистрНакопления.ПрочиеРасходы КАК ДД
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПроизводственныеСтатьи КАК Статьи
	|	ПО ДД.СтатьяРасходов = Статьи.СтатьяРасхода
	|ГДЕ ДД.Регистратор = &Регистратор И ДД.Активность
	|	И ДД.Подразделение = ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	И НЕ ДД.РасчетСебестоимости
	|	И НЕ ДД.РасчетПартий
	|";
	#КонецОбласти
	
	#Область ТекстПроверкиПартияПрошлогоПериода
	ТекстПроверкиПартияПрошлогоПериода = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	2 КАК КодОшибки,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.НаправлениеДеятельности,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	Партии.Документ,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ РегистрНакопления.ПрочиеРасходы КАК ДД
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтатьиНаСебестоимостьПроизводства КАК Статьи
	|	ПО ДД.СтатьяРасходов = Статьи.СтатьяРасхода
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.ПартииПроизводства КАК Партии
	|	ПО ДД.АналитикаРасходов = Партии.Ссылка
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.ПроизводствоБезЗаказа КАК Док
	|	ПО Партии.Документ = Док.Ссылка
	|ГДЕ ДД.Регистратор = &Регистратор И ДД.Активность
	|	И НАЧАЛОПЕРИОДА(ДД.Период, МЕСЯЦ) > НАЧАЛОПЕРИОДА(Док.Дата, МЕСЯЦ)
	|	И НЕ ДД.РасчетСебестоимости
	|	И НЕ ДД.РасчетПартий
	|";
	#КонецОбласти

	#Область ТекстПроверкиОрганизацияПодразделениеОВЗ
	ТекстПроверкиОрганизацияПодразделениеОВЗ = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	3 КАК КодОшибки,
	|	ДД.Организация,
	|	ДД.Подразделение,
	|	ДД.НаправлениеДеятельности,
	|	ДД.СтатьяРасходов,
	|	ДД.АналитикаРасходов,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО
	|ИЗ РегистрНакопления.ПрочиеРасходы КАК ДД
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ СтатьиНаОВЗ КАК Статьи
	|	ПО ДД.СтатьяРасходов = Статьи.СтатьяРасхода
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.ОбъектыВозникновенияЗатрат КАК ОВЗ
	|	ПО ДД.АналитикаРасходов = ОВЗ.Ссылка
	|ГДЕ ДД.Регистратор = &Регистратор И ДД.Активность
	|	И (ДД.Организация <> ОВЗ.Организация ИЛИ ДД.Подразделение <> ОВЗ.Подразделение)
	|	И НЕ ДД.РасчетСебестоимости
	|	И НЕ ДД.РасчетПартий
	|";
	#КонецОбласти
	
	ТекстыПроверок = Новый Массив();
	ТекстыПроверок.Добавить(ТекстПроверкиПодразделенияДляПроизводственнойСтатьи);
	ТекстыПроверок.Добавить(ТекстПроверкиПартияПрошлогоПериода);
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОбъектамВозникновенияЗатрат") Тогда
		ТекстыПроверок.Добавить(ТекстПроверкиОрганизацияПодразделениеОВЗ);
	КонецЕсли;
	
	ТекстыОшибок = Новый Соответствие();
	ТекстыОшибок.Вставить(1, НСтр("ru = 'Для производственной статьи расходов ""%5"" требуется указать подразделение.'"));
	ТекстыОшибок.Вставить(2, НСтр("ru = 'Для статьи расходов ""%5"" в аналитике указана партия прошлого периода ""%6"". Требуется указать партию текущего или будущего периода.'"));
	ТекстыОшибок.Вставить(3, НСтр("ru = 'Организация или подразделение объекта возникновения затрат ""%6"" не совпадают с данными документа'"));
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.Текст = "ВЫБРАТЬ 
	|	Статьи.Ссылка КАК СтатьяРасхода
	|ПОМЕСТИТЬ ПроизводственныеСтатьи
	|ИЗ ПланВидовХарактеристик.СтатьиРасходов КАК Статьи
	|ГДЕ
	|	Статьи.ВариантРаспределенияРасходовУпр В (&ВариантыРаспределения)
	|	ИЛИ Статьи.ВариантРаспределенияРасходовРегл В (&ВариантыРаспределения)
	|ИНДЕКСИРОВАТЬ ПО
	|	СтатьяРасхода;
	|	
	|ВЫБРАТЬ 
	|	Статьи.Ссылка КАК СтатьяРасхода
	|ПОМЕСТИТЬ СтатьиНаОВЗ
	|ИЗ ПланВидовХарактеристик.СтатьиРасходов КАК Статьи
	|ГДЕ
	|	Статьи.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат)
	|	ИЛИ Статьи.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаОбъектыВозникновенияЗатрат)
	|ИНДЕКСИРОВАТЬ ПО
	|	СтатьяРасхода;
	|
	|ВЫБРАТЬ 
	|	Статьи.Ссылка КАК СтатьяРасхода
	|ПОМЕСТИТЬ СтатьиНаСебестоимостьПроизводства
	|ИЗ ПланВидовХарактеристик.СтатьиРасходов КАК Статьи
	|ГДЕ
	|	Статьи.ВариантРаспределенияРасходовУпр = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства)
	|	ИЛИ Статьи.ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьПроизводства)
	|ИНДЕКСИРОВАТЬ ПО
	|	СтатьяРасхода;
	|";
	
	Запрос.Текст = Запрос.Текст + СтрСоединить(ТекстыПроверок, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	Запрос.УстановитьПараметр("ВариантыРаспределения", ПроизводствоСерверПовтИсп.ПолучитьПроизводственныеВариантыРаспределения());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ТекстыОшибок.Получить(Выборка.КодОшибки),
			Регистратор,
			Выборка.Параметр2,
			Выборка.Параметр3,
			Выборка.Параметр4,
			Выборка.Параметр5,
			Выборка.Параметр6,
			Выборка.Параметр7,
			Выборка.Параметр8,
			Выборка.Параметр9);
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'При записи в регистр ""Прочие расходы"" произошла ошибка'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,Метаданные.РегистрыНакопления.ПрочиеРасходы,,
			ТекстОшибки);
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, Регистратор,,, Отказ);
	КонецЦикла;
	
КонецПроцедуры
//-- НЕ УТ

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ НЕ УТ

//++ Устарело_Производство21

#Область БлокировкаПриОбновленииИБ

Процедура ПроверитьБлокировкуВходящихДанныхПриОбновленииИБ(ПредставлениеОперации)
	
	ВходящиеДанные = Новый Соответствие;
	ВходящиеДанные.Вставить(Метаданные.Документы.ВыпускПродукции);
	ВходящиеДанные.Вставить(Метаданные.РегистрыНакопления.РаспоряженияНаСписаниеПоНормативам);
	
	ЗакрытиеМесяцаСервер.ПроверитьБлокировкуВходящихДанныхПриОбновленииИБ(ВходящиеДанные, ПредставлениеОперации);
	
КонецПроцедуры

#КонецОбласти

//-- Устарело_Производство21

//-- НЕ УТ

#КонецОбласти

