//@strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Задает расширенные настройки отчета
//
// Параметры:
//   Настройки - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.Настройки.
//
Процедура НастроитьВариантыОтчета(Настройки) Экспорт
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПроизводственныеЗатратыТМЦ);
	ОписаниеОтчета.Описание = НСтр("ru= 'Сводные данные о движении затрат, распределении затрат на партии производства и выпущенной продукции в разрезе организаций.
		|Позволяет проследить поступление материалов, отнесение материалов, трудозатрат и постатейных расходов на партии производства и выпуск продукции.'");
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ВариантыОтчетовУТПереопределяемый.ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "НачальныйОстаток");
	ВариантыОтчетовУТПереопределяемый.ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "Поступления");
	ВариантыОтчетовУТПереопределяемый.ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "Приобретено");
	ВариантыОтчетовУТПереопределяемый.ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "Перемещения");
	ВариантыОтчетовУТПереопределяемый.ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ПередачиНаСклад");
	ВариантыОтчетовУТПереопределяемый.ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ИзрасходованоНаПартииПроизводства");
	ВариантыОтчетовУТПереопределяемый.ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "Произведено");
	ВариантыОтчетовУТПереопределяемый.ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "СписанияНаРасходы");
	ВариантыОтчетовУТПереопределяемый.ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "КонечныйОстаток");
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДвижениеМатериаловПродукцииРаботПоПредприятию");
	ОписаниеВарианта.Описание = НСтр("ru= 'Сводные данные о движении затрат, распределении затрат на партии производства и выпущенной продукции по предприятию.
		|Позволяет проследить поступление материалов, отнесение материалов, трудозатрат и постатейных расходов на партии производства и выпуск продукции.'");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
