
&НаКлиенте
Процедура ИТБК_НоменклатураПриИзмененииПосле(Элемент)
	
	//Элементы.серии.ОтборСтрок = Новый ФиксированнаяСтруктура("Номенклатура", объект.Номенклатура); 
	
КонецПроцедуры


&НаСервере
Процедура ИТБК_ПриЧтенииНаСервереПосле(ТекущийОбъект)
	
	//Элементы.серии.ОтборСтрок = Новый ФиксированнаяСтруктура("Номенклатура", объект.Номенклатура); 
	Элементы.ИТБК_Доизготовление.Заголовок = "# К доизготовлению (" + объект.ИТБК_Доизготовить.Количество() + ")";
	ИТБК_СтатусПриИзмененииПослеНаСервере();
	
КонецПроцедуры


&НаСервере
Процедура ИТБК_СтатусПриИзмененииПослеНаСервере()

	для Каждого стр из  Элементы.ГруппаСтраницы.ПодчиненныеЭлементы цикл
		стр.ТолькоПросмотр = объект.Статус = Перечисления.СтатусыСборокТоваров.СобраноРазобрано;
	КонецЦикла;
	
	
КонецПроцедуры


&НаКлиенте
Процедура ИТБК_СтатусПриИзмененииПосле(Элемент)
	
	ИТБК_СтатусПриИзмененииПослеНаСервере();
	
КонецПроцедуры


&НаКлиенте
&После("ОткрытьПодборСерийЗавершение")
Процедура ИТБК_ОткрытьПодборСерийЗавершение(Результат, ДополнительныеПараметры)
	
	//ЗаполнитьИТБК_Серию();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИТБК_Серию()
	
	//СтрокаСерии = Объект.Серии.Выгрузить().Найти(Объект.Номенклатура,"Номенклатура");
	//Если СтрокаСерии <> Неопределено тогда
	//	Объект.ИТБК_Серия = СтрокаСерии.Серия;	
	//иначе
	//	Объект.ИТБК_Серия = Объект.Серия
	//КонецЕсли;

	
КонецПроцедуры

&НаСервере
&После("УстановитьДоступностьСерииВШапке")
Процедура ИТБК_УстановитьДоступностьСерииВШапке()
	// begin fix Designer29.09.2023 10:53:56
	//Элементы.итбк_Серия.Видимость = Элементы.Серия.Видимость;
	//Элементы.Серия.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ИТБК_ОбработкаВыбораПосле(ВыбранноеЗначение, ИсточникВыбора)
	ЗаполнитьИТБК_Серию();
КонецПроцедуры

&НаКлиенте
Процедура ИТБК_ПриОткрытииПосле(Отказ)
	ТолькоПросмотр = Истина;
КонецПроцедуры

&НаСервере
Процедура ИТБК_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Количество=1;  	     // begin fix Designer29.09.2023 10:47:17
	КоличествоУпаковок=1;// end fix Designer29.09.2023 10:47:23
КонецПроцедуры

&НаКлиенте
Процедура ИТБК_СерияПриИзмененииПосле(Элемент)
	Объект.ИТБК_Серия = Объект.Серия;
КонецПроцедуры
