
&После("ВыполнитьПереопределяемуюКоманду")
Процедура vs_ВыполнитьПереопределяемуюКоманду(Форма, Команда, ДополнительныеПараметры)
	Если Форма.ИмяФормы	= "Документ.СчетФактураВыданный.Форма.ФормаДокумента" Тогда
		Если Команда.Имя = "ПредставлениеНомера" Тогда
			Объект = Форма.Объект;
			Объект.ПредставлениеНомера = СокрЛП(Объект.ПредставлениеНомера);  
			ПредставлениеНомера = Объект.ПредставлениеНомера;
			Если ЗначениеЗаполнено(ПредставлениеНомера) Тогда
				ДлинаНомера = СтрДлина(Объект.Номер);
				СтандартнаяОбработка = Истина;
				Префикс = "00КА-";  // 87158109C874F5EC58B55558DF4EDC40   "Авто_3E08091877A5277BEC2619EF47395CBB"
				//СерверныйКонтекст = Новый Структура;
				//СерверныйКонтекст.Вставить("ПараметрКоманды"	, Команда.Имя);
				//СерверныйКонтекст.Вставить("ИмяКомандыВФорме"	, Команда.Имя);
				//СерверныйКонтекст.Вставить("Результат"			, Префикс);
				//Форма.Подключаемый_ВыполнитьКомандуНаСервере(СерверныйКонтекст, Префикс);
				////ПрефиксацияОбъектовСобытия.УстановитьПрефиксИнформационнойБазыИОрганизации(Форма.Объект, СтандартнаяОбработка, Префикс);
				Объект.Номер = СтрШаблон("%1%2%3", Префикс, Сред("000000000000000000000000", 1, (ДлинаНомера - 5 - СтрДлина(ПредставлениеНомера))), ПредставлениеНомера);	
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Форма.ИмяФормы	= "Документ.СчетФактураВыданныйАванс.Форма.ФормаДокументаРФ" Тогда
		Объект = Форма.Объект;
		Если Команда.Имя = "ПредставлениеНомера" Тогда
			Объект.ПредставлениеНомера = СокрЛП(Объект.ПредставлениеНомера);  
			ПредставлениеНомера = Объект.ПредставлениеНомера;
			// begin fix Designer 2026.02.25
			Для Индекс = 1 По СтрДлина(ПредставлениеНомера) Цикл
				КодСимвола = КодСимвола(Лев(ПредставлениеНомера, 1));
				Если (Не КодСимвола < 48 И Не КодСимвола > 57) Тогда
					Прервать;
				КонецЕсли;
				ПредставлениеНомера = Сред(ПредставлениеНомера,2);
			КонецЦикла;
			// end fix Designer 2026.02.25
			Если ЗначениеЗаполнено(ПредставлениеНомера) Тогда
				ДлинаНомера = СтрДлина(Объект.Номер);
				СтандартнаяОбработка = Истина;
				Префикс = "00КА-А";  // 87158109C874F5EC58B55558DF4EDC40   "Авто_3E08091877A5277BEC2619EF47395CBB"
				//СерверныйКонтекст = Новый Структура;
				//СерверныйКонтекст.Вставить("ПараметрКоманды"	, Команда.Имя);
				//СерверныйКонтекст.Вставить("ИмяКомандыВФорме"	, Команда.Имя);
				//СерверныйКонтекст.Вставить("Результат"			, Префикс);
				//Форма.Подключаемый_ВыполнитьКомандуНаСервере(СерверныйКонтекст, Префикс);
				////ПрефиксацияОбъектовСобытия.УстановитьПрефиксИнформационнойБазыИОрганизации(Форма.Объект, СтандартнаяОбработка, Префикс);
				Объект.Номер = СтрШаблон("%1%2%3", Префикс, Сред("000000000000000000000000", 1, (ДлинаНомера - 6 - СтрДлина(ПредставлениеНомера))), ПредставлениеНомера);	
				Объект.ПредставлениеНомера = СтрШаблон("%1%2", "А", ПредставлениеНомера);
			КонецЕсли;
		ИначеЕсли Команда.Имя = "Номер" Тогда
			//Объект.ПредставлениеНомера = Документы.СчетФактураВыданныйАванс.vs_ПолучитьПредставлениеНомера(ТекущийОбъект);
			Объект.ПредставлениеНомера = СтрШаблон("А%1",ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(
			Объект.Номер, Истина, Истина));
		КонецЕсли;
	ИначеЕсли Форма.ИмяФормы	= "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		Если Команда.Имя = "Номер" Тогда
			ПредставлениеНомера = СокрЛП(Форма.Объект.Номер);  
			Форма.Объект.Номер = ПредставлениеНомера;
			Если ЗначениеЗаполнено(ПредставлениеНомера) Тогда
				ДлинаНомера = СтрДлина(Форма.Объект.Номер);
				СтандартнаяОбработка = Истина;
				Префикс = "00КА-";  // 87158109C874F5EC58B55558DF4EDC40   "Авто_3E08091877A5277BEC2619EF47395CBB"
				//СерверныйКонтекст = Новый Структура;
				//СерверныйКонтекст.Вставить("ПараметрКоманды"	, Команда.Имя);
				//СерверныйКонтекст.Вставить("ИмяКомандыВФорме"	, Команда.Имя);
				//СерверныйКонтекст.Вставить("Результат"			, Префикс);
				//Форма.Подключаемый_ВыполнитьКомандуНаСервере(СерверныйКонтекст, Префикс);
				////ПрефиксацияОбъектовСобытия.УстановитьПрефиксИнформационнойБазыИОрганизации(Форма.Объект, СтандартнаяОбработка, Префикс);
				Форма.Объект.Номер = СтрШаблон("%1%2%3", Префикс, Сред("000000000000000000000000", 1, (ДлинаНомера - 5 - СтрДлина(ПредставлениеНомера))), ПредставлениеНомера);	
			КонецЕсли;
		ИначеЕсли Команда.Имя = "РеквизитыПечати" Тогда
		
			Попытка
				Форма.ЗаблокироватьДанныеФормыДляРедактирования();
			Исключение
				ПоказатьПредупреждение(Неопределено, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				Возврат;
			КонецПопытки;
			////////////////////////////////
			Объект = Форма.Объект;
			////////////////////////////////
			ДанныеРаспоряженияНаДоставку = ДоставкаТоваровКлиентСервер.ПараметрыРаспоряжения();
			ЗаполнитьЗначенияСвойств(ДанныеРаспоряженияНаДоставку, Объект);
			
			СтруктураПараметров = Новый Структура();
			СтруктураПараметров.Вставить("АдресДоставки",                   Объект.АдресДоставки);
			СтруктураПараметров.Вставить("АдресДоставкиЗначенияПолей",      Объект.АдресДоставкиЗначенияПолей);
			СтруктураПараметров.Вставить("ЗонаДоставки",                    Объект.ЗонаДоставки);
			СтруктураПараметров.Вставить("ВремяДоставкиС",                  Объект.ВремяДоставкиС);
			СтруктураПараметров.Вставить("ВремяДоставкиПо",                 Объект.ВремяДоставкиПо);
			СтруктураПараметров.Вставить("ДополнительнаяИнформацияПоДоставке", Объект.ДополнительнаяИнформацияПоДоставке);
			СтруктураПараметров.Вставить("ДанныеРаспоряженияНаДоставку",    ДанныеРаспоряженияНаДоставку);
			СтруктураПараметров.Вставить("Ссылка",                          Объект.Ссылка);
			СтруктураПараметров.Вставить("БанковскийСчетГрузоотправителя",  Объект.БанковскийСчетГрузоотправителя);
			СтруктураПараметров.Вставить("БанковскийСчетГрузополучателя",   Объект.БанковскийСчетГрузополучателя);
			СтруктураПараметров.Вставить("БанковскийСчетКонтрагента",       Объект.БанковскийСчетКонтрагента);
			СтруктураПараметров.Вставить("Грузоотправитель",                Объект.Грузоотправитель);
			СтруктураПараметров.Вставить("Грузополучатель",                 Объект.Грузополучатель);
			СтруктураПараметров.Вставить("ДоверенностьВыдана",              Объект.ДоверенностьВыдана);
			СтруктураПараметров.Вставить("ДоверенностьДата",                Объект.ДоверенностьДата);
			СтруктураПараметров.Вставить("ДоверенностьЛицо",                Объект.ДоверенностьЛицо);
			СтруктураПараметров.Вставить("ДоверенностьНомер",               Объект.ДоверенностьНомер);
			СтруктураПараметров.Вставить("Договор",                         Объект.Договор);
			СтруктураПараметров.Вставить("Основание",                       Объект.Основание);
			СтруктураПараметров.Вставить("ОснованиеДата",                   Объект.ОснованиеДата);
			СтруктураПараметров.Вставить("ОснованиеНомер",                  Объект.ОснованиеНомер);
			СтруктураПараметров.Вставить("Отпустил",                        Объект.Отпустил);
			СтруктураПараметров.Вставить("ОтпустилДолжность",               Объект.ОтпустилДолжность);
			СтруктураПараметров.Вставить("Партнер",                         Объект.Партнер);
			СтруктураПараметров.Вставить("ХозяйственнаяОперация",           Объект.ХозяйственнаяОперация);
			СтруктураПараметров.Вставить("Контрагент",                      Объект.Контрагент);
			////////////////////////////////
			СтруктураПараметров.Вставить("ТолькоПросмотр",                  Форма.ТолькоПросмотр);
			////////////////////////////////
			СтруктураПараметров.Вставить("ТипОбъекта",                     "РеализацияТоваровУслуг");
			СтруктураПараметров.Вставить("РеализацияПоЗаказам",             Объект.РеализацияПоЗаказам);
			СтруктураПараметров.Вставить("БанковскийСчетОрганизации",       Объект.БанковскийСчетОрганизации);
			СтруктураПараметров.Вставить("Организация",                     Объект.Организация);
			СтруктураПараметров.Вставить("Дата",                            Объект.Дата);
			СтруктураПараметров.Вставить("Руководитель",                    Объект.Руководитель);
			СтруктураПараметров.Вставить("ГлавныйБухгалтер",                Объект.ГлавныйБухгалтер);
			////////////////////////////////
			СтруктураПараметров.Вставить("ТаблицаОснованийДляПечати",       Форма.ТаблицаОснованийДляПечати);
			////////////////////////////////
			//++ Локализация
			СтруктураПараметров.Вставить("КодСпециальныхОбстоятельств",     Объект.КодСпециальныхОбстоятельств);
			//-- Локализация
			СтруктураПараметров.Вставить("СведенияОТранспортировкеИГрузе",  Объект.СведенияОТранспортировкеИГрузе);
			СтруктураПараметров.Вставить("СопроводительныеДокументы",       Объект.СопроводительныеДокументы);
			////////////////////////////////
			СтруктураПараметров.Вставить("РеализацияЧерезКомиссионера",     Форма.РеализацияЧерезКомиссионера);
			////////////////////////////////
			////////////////////////////////
			ОбщаяФормаРеквизитыПечатиРеализации = ПолучитьФорму("ОбщаяФорма.РеквизитыПечатиРеализации", СтруктураПараметров, Форма, Объект);//, <Окно>, <НавигационнаяСсылка>)
			
			//ПараметрыСтроки = Новый КвалификаторыСтроки(30,ДопустимаяДлина.Переменная);
			//НашеОписание = Новый ОписаниеТипов("Строка",,ПараметрыСтроки);
			//ОбщаяФормаРеквизитыПечатиРеализации.Элементы.ДоверенностьНомер.ОграничениеТипа = НашеОписание;
			//ОбщаяФормаРеквизитыПечатиРеализации.Параметры.ДоверенностьНомер = 
			//	ОбщаяФормаРеквизитыПечатиРеализации.Элементы.ДоверенностьНомер.ОграничениеТипа.ПривестиЗначение(ОбщаяФормаРеквизитыПечатиРеализации.Параметры.ДоверенностьНомер);
			////ОбщаяФормаРеквизитыПечатиРеализации 
			ОбщаяФормаРеквизитыПечатиРеализации.vs_ДоверенностьНомер = Объект.ДоверенностьНомер;
			ОбщаяФормаРеквизитыПечатиРеализации.Открыть();
			//ОткрытьФорму("ОбщаяФорма.РеквизитыПечатиРеализации", СтруктураПараметров, ЭтотОбъект,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			////////////////////////////////
		КонецЕсли;
	ИначеЕсли Форма.ИмяФормы	= "Документ.АктВыполненныхРабот.Форма.ФормаДокумента" Тогда
		Если Команда.Имя = "Номер" Тогда
			ПредставлениеНомера = СокрЛП(Форма.Объект.Номер);  
			Форма.Объект.Номер = ПредставлениеНомера;
			Если ЗначениеЗаполнено(ПредставлениеНомера) Тогда
				ДлинаНомера = СтрДлина(Форма.Объект.Номер);
				СтандартнаяОбработка = Истина;
				Префикс = "00КА-";  // 87158109C874F5EC58B55558DF4EDC40   "Авто_3E08091877A5277BEC2619EF47395CBB"
				//СерверныйКонтекст = Новый Структура;
				//СерверныйКонтекст.Вставить("ПараметрКоманды"	, Команда.Имя);
				//СерверныйКонтекст.Вставить("ИмяКомандыВФорме"	, Команда.Имя);
				//СерверныйКонтекст.Вставить("Результат"			, Префикс);
				//Форма.Подключаемый_ВыполнитьКомандуНаСервере(СерверныйКонтекст, Префикс);
				////ПрефиксацияОбъектовСобытия.УстановитьПрефиксИнформационнойБазыИОрганизации(Форма.Объект, СтандартнаяОбработка, Префикс);
				Форма.Объект.Номер = СтрШаблон("%1%2%3", Префикс, Сред("000000000000000000000000", 1, (ДлинаНомера - 5 - СтрДлина(ПредставлениеНомера))), ПредставлениеНомера);	
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Форма.ИмяФормы	= "Документ.ВнутреннееПотребление.Форма.ФормаДокумента" Тогда
		Если Команда.Имя = "vs_СтатьяРасходов" Тогда
			Объект = Форма.Объект;
			vs_СтатьяРасходов = Объект.vs_СтатьяРасходов;
			Для каждого Стр Из Объект.Товары Цикл
				Стр.СтатьяРасходов = vs_СтатьяРасходов;
			КонецЦикла;
		КонецЕсли;
		
	//ИначеЕсли Форма.ИмяФормы	= "Отчет.vs_МатериальныйОтчет.Форма" Тогда
	//	Если Команда.Имя = "vs_ОтразитьМатериальныйОтчет" Тогда
	//		//Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ОтчетСформирован")
	//		//	и ТипЗнч(Форма.ОтчетСформирован) = Тип("Булево") и Форма.ОтчетСформирован Тогда
	//		//
	//		//Иначе
	//		//	ОбщегоНазначенияКлиент.СообщитьПользователю("Сначала сформируйте отчет!",, "СформироватьОтчет");
	//		//КонецЕсли; 
	//		Контекст = Новый Структура;
	//		Контекст.Вставить("Результат", Результат);
	//		Контекст.Вставить("ПараметрыФормирования", ПараметрыФормирования);
	//		Контекст.Вставить("НастройкаОтказаОтПредупреждения", Неопределено);
	//		МодификацияКонфигурацииВызовСервераПереопределяемый.vs_МатериальныйОтчет_СкомпоноватьРезультат(Форма, Команда, ДополнительныеПараметры);
	//	КонецЕсли;	
	КонецЕсли;
КонецПроцедуры
