
&ИзменениеИКонтроль("ЗаполнитьДокумент_УПД2019_ИнформацияПродавца")
Функция ИТБК_ЗаполнитьДокумент_УПД2019_ИнформацияПродавца(Знач Данные)

	ДеревоДанных = Данные;

	ДатаФормирования = ТекущаяДатаСеанса();
	ИдентификаторФайла = ИдентификаторФайла_УПД2019_ИнформацияПродавца(ДеревоДанных, ДатаФормирования);

	ПространствоИмен = ПространствоИмен_УПД2019_ИнформацияПродавца();

	Ошибки = Неопределено; // служебная переменная для хранения списка возникших ошибок

	ЭтоЭлектронноеАктированиеЕИС = Ложь;
	МодульЭлектронноеАктированиеЕИС = Неопределено;
	Если ОбщегоНазначения.ПодсистемаСуществует(
		"ЭлектронноеВзаимодействие.ЭлектронноеАктированиеЕИС") Тогда
		МодульЭлектронноеАктированиеЕИС = ОбщегоНазначения.ОбщийМодуль("ЭлектронноеАктированиеЕИС");
		Если МодульЭлектронноеАктированиеЕИС.ИспользоватьЭлектронноеАктированиеВЕИС()
			И ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных,
			"ДанныеЭлектронногоАктированияЕИС") = Истина Тогда
			ЭтоЭлектронноеАктированиеЕИС = Истина;
			МодульЭлектронноеАктированиеЕИС.ПередФормированиемЭлектронногоДокумента(
			ДеревоДанных, ПространствоИмен);
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "СведенияОКомиссионере")) Тогда
		СвКомиссионера = ПолучитьОбъектТипаCML("УчастникТип", ПространствоИмен);
		ЗаполнитьСведенияОбУчастникеУПД_2019(СвКомиссионера, ДеревоДанных, Ошибки, ПространствоИмен, "СведенияОКомиссионере");

		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.УстановитьСтроку();
		ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, СвКомиссионера);

		СтрXML = ЗаписьXML.Закрыть();
		НачПоз = СтрНайти(СтрXML, "<ИдСв>");
		КолСимв = СтрНайти(СтрXML, "</ИдСв>") - НачПоз + СтрДлина("</ИдСв>");
		СтрXML = Сред(СтрXML, НачПоз, КолСимв);

		ТекстоваяИнформация = Новый ТаблицаЗначений;
		ТекстоваяИнформация.Колонки.Добавить("Идентификатор");
		ТекстоваяИнформация.Колонки.Добавить("Значение");
		НоваяСтрока = ТекстоваяИнформация.Добавить();
		НоваяСтрока.Идентификатор = "ДанныеКомиссионера";
		НоваяСтрока.Значение = СтрXML;
		ДеревоЭлектронногоДокументаБЭД.ДобавитьЗаписьВТаблицуДерева(ДеревоДанных, НоваяСтрока, "ДопДанныеСчетаФактуры.ТекстоваяИнформация");
	КонецЕсли;

	Если ЗначениеЗаполнено(ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "СведенияОКомитенте")) Тогда
		СвКомитента = ПолучитьОбъектТипаCML("УчастникТип", ПространствоИмен);
		ЗаполнитьСведенияОбУчастникеУПД_2019(СвКомитента, ДеревоДанных, Ошибки, ПространствоИмен, "СведенияОКомитенте");

		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.УстановитьСтроку();
		ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, СвКомитента);

		СтрXML = ЗаписьXML.Закрыть();
		НачПоз = СтрНайти(СтрXML, "<ИдСв>");
		КолСимв = СтрНайти(СтрXML, "</ИдСв>") - НачПоз + СтрДлина("</ИдСв>");
		СтрXML = Сред(СтрXML, НачПоз, КолСимв);

		ТекстоваяИнформация = Новый ТаблицаЗначений;
		ТекстоваяИнформация.Колонки.Добавить("Идентификатор");
		ТекстоваяИнформация.Колонки.Добавить("Значение");
		НоваяСтрока = ТекстоваяИнформация.Добавить();
		НоваяСтрока.Идентификатор = "ДанныеКомитента";
		НоваяСтрока.Значение = СтрXML;
		ДеревоЭлектронногоДокументаБЭД.ДобавитьЗаписьВТаблицуДерева(ДеревоДанных, НоваяСтрока, "ДопДанныеСчетаФактуры.ТекстоваяИнформация");
	КонецЕсли;

	Файл = ПолучитьОбъектТипаCML("Файл", ПространствоИмен);

	// Техническая информация по документу.
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Файл, "ИдФайл", ИдентификаторФайла, Истина, Ошибки);
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Файл, "ВерсПрог", ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "ВерсияПрограммы"),, Ошибки);
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Файл, "ВерсФорм", "5.01", Истина, Ошибки);

	СвУчДокОбор = ПолучитьОбъектТипаCML("Файл.СвУчДокОбор", ПространствоИмен);
	Участники = ДеревоЭлектронногоДокументаБЭД.ДанныеЭлементаДереваЭлектронногоДокумента(Данные, "Участники");

	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвУчДокОбор, "ИдОтпр", Участники.ИдентификаторОтправителя, Истина, Ошибки);
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвУчДокОбор, "ИдПол", Участники.ИдентификаторПолучателя, Истина, Ошибки);

	Если СведенияОбОператореЗаполнены(Участники.Оператор) Тогда
		СвОЭДОтпр = ПолучитьОбъектТипаCML("Файл.СвУчДокОбор.СвОЭДОтпр", ПространствоИмен);
		НаимОрг = Участники.Оператор.Наименование;
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвОЭДОтпр, "НаимОрг", НаимОрг, Истина, Ошибки);
		ИННЮЛ = Участники.Оператор.ИНН;
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвОЭДОтпр, "ИННЮЛ", ИННЮЛ, Истина, Ошибки);
		ИдЭДО = Участники.Оператор.Идентификатор;
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвОЭДОтпр, "ИдЭДО", ИдЭДО, Истина, Ошибки);
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвУчДокОбор, "СвОЭДОтпр",СвОЭДОтпр, , Ошибки);
	КонецЕсли;

	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Файл, "СвУчДокОбор", СвУчДокОбор, Истина, Ошибки);

	Документ = ПолучитьОбъектТипаCML("Файл.Документ", ПространствоИмен);
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Документ, "КНД", "1115131", Истина, Ошибки);
	ФункцияУПД = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "Функция");
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Документ, "Функция", ФункцияУПД, Истина, Ошибки);

	ПоФактХЖ = "";
	Если ФункцияУПД = СвРК() Тогда
		ПоФактХЖ = "Документ, включающий в себя сведения о факте реализации комиссионером (агентом, действующим от собственного имени), товаров комитента (принципала)";
	ИначеЕсли ФункцияУПД = СвЗК() Тогда
		ПоФактХЖ = "Документ, включающий в себя сведения о факте закупки комиссионером (агентом, действующим от собственного имени) товара для комитента (принципала)";
	ИначеЕсли ФункцияУПД = СЧФДОП() ИЛИ ФункцияУПД = ДОП() Тогда
		ПоФактХЖ = "Документ об отгрузке товаров (выполнении работ), передаче имущественных прав (документ об оказании услуг)";
	КонецЕсли;
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Документ, "ПоФактХЖ", ПоФактХЖ,, Ошибки);

	НаимДокОпр = "";
	Если ФункцияУПД = СЧФДОП() Тогда
		НаимДокОпр = "Счет-фактура и документ об отгрузке товаров (выполнении работ), передаче имущественных прав (документ об оказании услуг)";
	ИначеЕсли ФункцияУПД = ДОП() Тогда
		НаимДокОпр = "Документ об отгрузке товаров (выполнении работ), передаче имущественных прав (Документ об оказании услуг)";
	ИначеЕсли ФункцияУПД = СвРК() Тогда
		НаимДокОпр = "Документ, включающий в себя сведения о факте реализации комиссионером (агентом, действующим от собственного имени), товаров комитента (принципала)";
	ИначеЕсли ФункцияУПД = СвЗК() Тогда
		НаимДокОпр = "Документ, включающий в себя сведения о факте закупки комиссионером (агентом, действующим от собственного имени) товара для комитента (принципала)";
	КонецЕсли;
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Документ, "НаимДокОпр", НаимДокОпр,, Ошибки);
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Документ, "ДатаИнфПр", Формат(ДатаФормирования, "ДФ=dd.MM.yyyy"), Истина, Ошибки);
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Документ, "ВремИнфПр", Формат(ДатаФормирования, "ДФ=HH.mm.ss"), Истина, Ошибки);
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Документ, "НаимЭконСубСост", ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "СоставительДокументаНаименование"), Истина, Ошибки);
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Документ, "ОснДоверОргСост", ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "СоставительДокументаДоверенность"), , Ошибки);

	// Сведения о счете-фактуре.
	ДанныеСчетаФактуры = ПолучитьОбъектТипаCML("Файл.Документ.СвСчФакт", ПространствоИмен);

	НомерДок = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "НомерДокумента");
	ДатаДок = ДатаФНС(ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "ДатаДокумента"));
	КодВалюты = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "ВалютаКод");
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДанныеСчетаФактуры, "НомерСчФ", НомерДок, Истина, Ошибки);
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДанныеСчетаФактуры, "ДатаСчФ", ДатаДок, Истина, Ошибки);
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДанныеСчетаФактуры, "КодОКВ", КодВалюты, Истина, Ошибки);

	НомерДок = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "НомерИсправления");
	ДатаДок = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "ДатаИсправления");
	ИспрСчФ = ПолучитьОбъектТипаCML("Файл.Документ.СвСчФакт.ИспрСчФ", ПространствоИмен);
	Если ЗначениеЗаполнено(НомерДок) И ЗначениеЗаполнено(ДатаДок) Тогда
		ДатаДок = ДатаФНС(ДатаДок);
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИспрСчФ, "НомИспрСчФ", НомерДок, Истина, Ошибки);
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИспрСчФ, "ДатаИспрСчФ", ДатаДок, Истина, Ошибки);
	Иначе
		Если НЕ ЭтоЭлектронноеАктированиеЕИС Тогда
			// Для ЕИС нужно чтобы этот ИспрСчФ присутствовал только при наличии данных,
			// иначе не выполняется подпись в личном кабинете.
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИспрСчФ, "ДефНомИспрСчФ", "-", Истина, Ошибки);
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИспрСчФ, "ДефДатаИспрСчФ", "-", Истина, Ошибки);
		КонецЕсли;
	КонецЕсли;
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДанныеСчетаФактуры,"ИспрСчФ", ИспрСчФ, , Ошибки);

	ТаблицаПродавцов = ДеревоДанных.Строки.Найти("СведенияОПродавце", "ПолныйПуть");
	Для каждого СтрокаПродавца Из ТаблицаПродавцов.Строки Цикл

		СвПрод = ПолучитьОбъектТипаCML("УчастникТип", ПространствоИмен);
		ЗаполнитьСведенияОбУчастникеУПД_2019(СвПрод, СтрокаПродавца, Ошибки, ПространствоИмен, "СведенияОПродавце.НомерСтроки");
		ДанныеСчетаФактуры.СвПрод.Добавить(СвПрод);

	КонецЦикла;

	ТаблицаГрузоотправителей = ДеревоДанных.Строки.Найти("СведенияОГрузоотправителе", "ПолныйПуть");
	Если ЗначениеЗаполнено(ТаблицаГрузоотправителей.Значение) Тогда
		Для каждого СтрокаГрузоотправителя Из ТаблицаГрузоотправителей.Строки Цикл

			ГрузОт = ПолучитьОбъектТипаCML("Файл.Документ.СвСчФакт.ГрузОт", ПространствоИмен);
			ОнЖе = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(СтрокаГрузоотправителя, "СведенияОГрузоотправителе.НомерСтроки.ОнЖе");
#Вставка
//Сообщить(ОнЖе);
//Сообщить("1");
#КонецВставки
			Если ОнЖе = Истина Тогда
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ГрузОт, "ОнЖе", "он же", , Ошибки);
			Иначе
				ГрузОтпр = ПолучитьОбъектТипаCML("УчастникТип", ПространствоИмен);
				ЗаполнитьСведенияОбУчастникеУПД_2019(
				ГрузОтпр, СтрокаГрузоотправителя, Ошибки, ПространствоИмен, "СведенияОГрузоотправителе.НомерСтроки.Грузоотправитель");
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ГрузОт, "ГрузОтпр", ГрузОтпр, Истина, Ошибки);
			КонецЕсли;
			ДанныеСчетаФактуры.ГрузОт.Добавить(ГрузОт);

		КонецЦикла;
	КонецЕсли;

	ТаблицаГрузополучателей = ДеревоДанных.Строки.Найти("СведенияОГрузополучателе", "ПолныйПуть");
	Если ЗначениеЗаполнено(ТаблицаГрузополучателей.Значение) Тогда
		Для каждого СтрокаГрузополучателя Из ТаблицаГрузополучателей.Строки Цикл

			ГрузПолуч = ПолучитьОбъектТипаCML("УчастникТип", ПространствоИмен);
			ЗаполнитьСведенияОбУчастникеУПД_2019(ГрузПолуч, СтрокаГрузополучателя, Ошибки, ПространствоИмен, "СведенияОГрузополучателе.НомерСтроки");
			ДанныеСчетаФактуры.ГрузПолуч.Добавить(ГрузПолуч);

		КонецЦикла;
	КонецЕсли;

	ТаблицаПокупателей = ДеревоДанных.Строки.Найти("СведенияОПокупателе", "ПолныйПуть");
	Для каждого СтрокаПокупателя Из ТаблицаПокупателей.Строки Цикл

		СвПокуп = ПолучитьОбъектТипаCML("УчастникТип", ПространствоИмен);
		ЗаполнитьСведенияОбУчастникеУПД_2019(СвПокуп, СтрокаПокупателя, Ошибки, ПространствоИмен, "СведенияОПокупателе.НомерСтроки");
		ДанныеСчетаФактуры.СвПокуп.Добавить(СвПокуп);

	КонецЦикла;

	СтрокаТаблицы = ДеревоДанных.Строки.Найти("ПлатежноРасчетныеДокументы", "ПолныйПуть");
	Если ТипЗнч(СтрокаТаблицы.Значение) = Тип("Число") И СтрокаТаблицы.Значение > 0 Тогда
		Для Каждого ПРД Из СтрокаТаблицы.Строки Цикл
			СвПРД = ПолучитьОбъектТипаCML("Файл.Документ.СвСчФакт.СвПРД", ПространствоИмен);
			ОбщийПуть = "ПлатежноРасчетныеДокументы.НомерСтроки.";
			Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ПРД, ОбщийПуть + "НомерПРД");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвПРД, "НомерПРД", Реквизит, Истина, Ошибки);
			Реквизит = ДатаФНС(ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ПРД, ОбщийПуть + "ДатаПРД"));
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвПРД, "ДатаПРД", Реквизит, Истина, Ошибки);
			Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ПРД, ОбщийПуть + "Сумма");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвПРД, "СуммаПРД", Реквизит, Ложь, Ошибки);
			ДанныеСчетаФактуры.СвПРД.Добавить(СвПРД);
		КонецЦикла;
	КонецЕсли;

	ДопСвФХЖ1 = ПолучитьОбъектТипаCML("Файл.Документ.СвСчФакт.ДопСвФХЖ1", ПространствоИмен);
	ЗаполнитьНаименованиеВалютыXML(ДопСвФХЖ1, КодВалюты, Ошибки);
	Если ЗначениеЗаполнено(ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "ДополнительныеСведенияОбУчастниках")) Тогда
		ОбщийПуть = "ДополнительныеСведенияОбУчастниках.";
		Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, ОбщийПуть + "ИдентификаторГосКонтракта");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСвФХЖ1, "ИдГосКон", Реквизит, Ложь, Ошибки);
		Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, ОбщийПуть + "ВалютаКурс");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСвФХЖ1, "КурсВал", Реквизит, Ложь, Ошибки);
		Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, ОбщийПуть + "ОбстоятельстваФормированияСФ");
		Если ЗначениеЗаполнено(Реквизит)
			И (Документ.Функция = "СЧФ" И СтрНайти("1,2,3", Реквизит)
			ИЛИ (Документ.Функция = "ДОП" ИЛИ Документ.Функция = "СЧФДОП")
			И СтрНайти("4,5,6,7,8", Реквизит)) Тогда
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСвФХЖ1, "ОбстФормСЧФ", Реквизит, Ложь, Ошибки);
		КонецЕсли;
		Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, ОбщийПуть + "ЗакупкаДляГосударственныхНужд");
		Если ЗначениеЗаполнено(Реквизит) Тогда
			// Информация о закупке для государственных и муниципальных нужд.
			ИнфПродГосЗакКазн = ПолучитьОбъектТипаCML("Файл.Документ.СвСчФакт.ДопСвФХЖ1.ИнфПродГосЗакКазн", ПространствоИмен);
			ОбщийПуть = ОбщийПуть + "ЗакупкаДляГосударственныхНужд.";
			Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, ОбщийПуть + "ДатаГосКонтракта");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИнфПродГосЗакКазн, "ДатаГосКонт", ДатаФНС(Реквизит), Истина, Ошибки);
			Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, ОбщийПуть + "НомерГосКонтракта");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИнфПродГосЗакКазн, "НомерГосКонт", Реквизит, Истина, Ошибки);
			Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, ОбщийПуть + "НомерЛицевогоСчетаПродавца");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИнфПродГосЗакКазн, "ЛицСчетПрод", Реквизит, Ложь, Ошибки);
			Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, ОбщийПуть + "КодБюджетнойКлассификацииПродавца");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИнфПродГосЗакКазн, "КодПродБюджКласс", Реквизит, Ложь, Ошибки);
			Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, ОбщийПуть + "КодЦели");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИнфПродГосЗакКазн, "КодЦелиПрод", Реквизит, Ложь, Ошибки);
			Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, ОбщийПуть + "КазначействоПродавцаКод");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИнфПродГосЗакКазн, "КодКазначПрод", Реквизит, Ложь, Ошибки);
			Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, ОбщийПуть + "КазначействоПродавцаНаименование");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИнфПродГосЗакКазн, "НаимКазначПрод", Реквизит, Ложь, Ошибки);
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСвФХЖ1, "ИнфПродГосЗакКазн", ИнфПродГосЗакКазн, Ложь, Ошибки);
		КонецЕсли;
	КонецЕсли;
	// Основание уступки денежного требования.
	Если ЗначениеЗаполнено(ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "ОснованиеУступкиДенежногоТребования")) Тогда
		ОснУстДенТреб = ПолучитьОбъектТипаCML("Файл.Документ.СвСчФакт.ДопСвФХЖ1.ОснУстДенТреб", ПространствоИмен);
		ОбщийПуть = "ОснованиеУступкиДенежногоТребования.";
		Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, ОбщийПуть + "Наименование");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ОснУстДенТреб, "НаимОсн", Реквизит, Ложь, Ошибки);
		Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, ОбщийПуть + "Номер");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ОснУстДенТреб, "НомОсн", Реквизит, Ложь, Ошибки);
		Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, ОбщийПуть + "Дата");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ОснУстДенТреб, "ДатаОсн", ДатаФНС(Реквизит), Ложь, Ошибки);
		Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, ОбщийПуть + "ДополнительныеСведения");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ОснУстДенТреб, "ДопСвОсн", Реквизит, Ложь, Ошибки);
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСвФХЖ1, "ОснУстДенТреб", ОснУстДенТреб, Ложь, Ошибки);
	КонецЕсли;
	// Фактор.
	Если ЗначениеЗаполнено(ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "СведенияОФакторе")) Тогда
		СвФактор = ПолучитьОбъектТипаCML("УчастникТип", ПространствоИмен);
		ЗаполнитьСведенияОбУчастникеУПД_2019(СвФактор, ДеревоДанных, Ошибки, ПространствоИмен, "СведенияОФакторе");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСвФХЖ1, "СвФактор", СвФактор, Истина, Ошибки);
	КонецЕсли;
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДанныеСчетаФактуры, "ДопСвФХЖ1", ДопСвФХЖ1, , Ошибки);

	Если ЗначениеЗаполнено(ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "ДопДанныеСчетаФактуры")) Тогда
		ИнфПолФХЖ1 = ПолучитьОбъектТипаCML("Файл.Документ.СвСчФакт.ИнфПолФХЖ1", ПространствоИмен);

		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИнфПолФХЖ1, "ИдФайлИнфПол",
		ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "ДопДанныеСчетаФактуры.ИдентификаторФайла"), , Ошибки);

		СтрокиДопДанныеСчетаФактуры = ДеревоДанных.Строки.Найти("ДопДанныеСчетаФактуры", "ПолныйПуть");
		СтрокаТаблицы = СтрокиДопДанныеСчетаФактуры.Строки.Найти("ДопДанныеСчетаФактуры.ТекстоваяИнформация", "ПолныйПуть");
		Если ТипЗнч(СтрокаТаблицы.Значение) = Тип("Число") И СтрокаТаблицы.Значение > 0 Тогда
			Для Каждого Информация Из СтрокаТаблицы.Строки Цикл
				ТекстИнфТип = ПолучитьОбъектТипаCML("ТекстИнфТип", ПространствоИмен);

				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТекстИнфТип, "Идентиф",
				ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Информация,
				"ДопДанныеСчетаФактуры.ТекстоваяИнформация.НомерСтроки.Идентификатор"), Истина, Ошибки);
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТекстИнфТип, "Значен",
				ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Информация,
				"ДопДанныеСчетаФактуры.ТекстоваяИнформация.НомерСтроки.Значение"), Истина, Ошибки);

				ИнфПолФХЖ1.ТекстИнф.Добавить(ТекстИнфТип);
			КонецЦикла;

			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДанныеСчетаФактуры, "ИнфПолФХЖ1", ИнфПолФХЖ1, , Ошибки);
		КонецЕсли;
	КонецЕсли;

	ДокументыПодтвержденияОтгрузки = ДеревоДанных.Строки.Найти("ДокументыПодтвержденияОтгрузки", "ПолныйПуть");
	Если ТипЗнч(ДокументыПодтвержденияОтгрузки.Значение) = Тип("Число") И ДокументыПодтвержденияОтгрузки.Значение > 0 Тогда
		Для Каждого СтрокаДокумента Из ДокументыПодтвержденияОтгрузки.Строки Цикл
			ДокПодтвОтгр = ПолучитьОбъектТипаCML("Файл.Документ.СвСчФакт.ДокПодтвОтгр", ПространствоИмен);
			ОбщийПуть = "ДокументыПодтвержденияОтгрузки.НомерСтроки.";
			Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(СтрокаДокумента, ОбщийПуть + "Наименование");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДокПодтвОтгр, "НаимДокОтгр", Реквизит, Истина, Ошибки);
			Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(СтрокаДокумента, ОбщийПуть + "Номер");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДокПодтвОтгр, "НомДокОтгр", Реквизит, Истина, Ошибки);
			Реквизит = ДатаФНС(ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(СтрокаДокумента, ОбщийПуть + "Дата"));
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДокПодтвОтгр, "ДатаДокОтгр", Реквизит, Ложь, Ошибки);
			ДанныеСчетаФактуры.ДокПодтвОтгр.Добавить(ДокПодтвОтгр);
		КонецЦикла;
	КонецЕсли;

	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Документ, "СвСчФакт", ДанныеСчетаФактуры, Истина, Ошибки);

	// Сведения таблицы счета-фактуры.
	ТабличнаяЧасть = ПолучитьОбъектТипаCML("Файл.Документ.ТаблСчФакт", ПространствоИмен);
	ВсеСтрокиБезНДС = Истина;
	ВсеСтрокиСДефисом = Новый Структура("СтоимостьТоваровСНалогом,СуммаНалога", Истина, Истина);

	СтрокаТаблицаТоваров = ДеревоДанных.Строки.Найти("СведенияОТоварах", "ПолныйПуть");
	Для Каждого Товар Из СтрокаТаблицаТоваров.Строки Цикл
		СведенияОТоваре = ПолучитьОбъектТипаCML("Файл.Документ.ТаблСчФакт.СведТов", ПространствоИмен);

		// Обязательные реквизиты:
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведенияОТоваре, "НомСтр", Товар.Значение, Истина, Ошибки);
		Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Товар, "СведенияОТоварах.НомерСтроки.ТоварНаименование");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведенияОТоваре, "НаимТов", Реквизит, Истина, Ошибки);

		СтавкаНДС = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Товар, "СведенияОТоварах.НомерСтроки.НалоговаяСтавка");
		СтавкаXDTO = СтавкаНДСXDTO(СтавкаНДС);
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведенияОТоваре, "НалСт", СтавкаXDTO, Истина, Ошибки);

		Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Товар, "СведенияОТоварах.НомерСтроки.СтоимостьТоваровСНалогом");
		Если Реквизит = Неопределено Тогда
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведенияОТоваре, "ДефСтТовУчНал", "-", Истина, Ошибки);
		Иначе
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведенияОТоваре, "СтТовУчНал", Реквизит, Истина, Ошибки);
			ВсеСтрокиСДефисом.СтоимостьТоваровСНалогом = Ложь;
		КонецЕсли;

		СумАкцизТип = ПолучитьОбъектТипаCML("СумАкцизТип", ПространствоИмен);
		Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Товар, "СведенияОТоварах.НомерСтроки.СуммаАкциза");
		Если НЕ ЗначениеЗаполнено(Реквизит) Тогда
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СумАкцизТип, "БезАкциз", "без акциза", Истина, Ошибки);
		Иначе
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СумАкцизТип, "СумАкциз", Реквизит, Истина, Ошибки);
		КонецЕсли;
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведенияОТоваре, "Акциз", СумАкцизТип, Истина, Ошибки);

		СумНДСТип = ПолучитьОбъектТипаCML("СумНДСТип", ПространствоИмен);
		Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Товар, "СведенияОТоварах.НомерСтроки.СуммаНалога");
		Если Реквизит = Неопределено Тогда
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СумНДСТип, "ДефНДС", "-", Истина, Ошибки);
		ИначеЕсли НЕ ЗначениеЗаполнено(Реквизит) И ВРег(СтавкаНДС) = ВРег("без НДС") Тогда
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СумНДСТип, "БезНДС", "без НДС", Истина, Ошибки);
			ВсеСтрокиСДефисом.СуммаНалога = Ложь;
		Иначе
			ВсеСтрокиБезНДС = Ложь;
			ВсеСтрокиСДефисом.СуммаНалога = Ложь;
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СумНДСТип, "СумНал", Реквизит, Истина, Ошибки);
		КонецЕсли;
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведенияОТоваре, "СумНал", СумНДСТип, Истина, Ошибки);

		ЕдиницаИзмеренияНаименование = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Товар, "СведенияОТоварах.НомерСтроки.ЕдиницаИзмеренияНаименование");

		// Необязательные реквизиты:
		ЕдиницаИзмеренияКод = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Товар, "СведенияОТоварах.НомерСтроки.ЕдиницаИзмеренияКод");

		Если ЗначениеЗаполнено(ЕдиницаИзмеренияНаименование) Тогда
			Если ЗначениеЗаполнено(ЕдиницаИзмеренияКод) Тогда
				ОКЕИ_Тов = ЕдиницаИзмеренияКод;
			Иначе 
				ОКЕИ_Тов = "0000";
			КонецЕсли;
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведенияОТоваре, "ОКЕИ_Тов", СокрЛП(ОКЕИ_Тов), Ложь, Ошибки);
		Иначе
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведенияОТоваре, "ДефОКЕИ_Тов", "-", Ложь, Ошибки);
		КонецЕсли;

		Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Товар, "СведенияОТоварах.НомерСтроки.Количество",,, Истина);
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведенияОТоваре, "КолТов", Реквизит, Истина, Ошибки);

		Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Товар, "СведенияОТоварах.НомерСтроки.ЦенаЗаЕдиницуИзмерения");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведенияОТоваре, "ЦенаТов", Реквизит, , Ошибки);

		Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Товар, "СведенияОТоварах.НомерСтроки.СтоимостьТоваровБезНалога");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведенияОТоваре, "СтТовБезНДС", Реквизит, , Ошибки);

		СведенияОПрослеживаемости = ДеревоЭлектронногоДокументаБЭД.ДанныеЭлементаДереваЭлектронногоДокумента(
		Товар, "СведенияОТоварах.НомерСтроки.СведенияОПрослеживаемости");

		КодСтраны = "";
		Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Товар, "СведенияОТоварах.НомерСтроки.СведенияОТаможеннойДекларации");
		Если ТипЗнч(Реквизит) = Тип("Число") И Реквизит > 0 Тогда
			СтрокиТД = Товар.Строки.Найти("СведенияОТоварах.НомерСтроки.СведенияОТаможеннойДекларации", "ПолныйПуть", Истина);
			Для Каждого СтрокаТД Из СтрокиТД.Строки Цикл
				СвТД = ПолучитьОбъектТипаCML("Файл.Документ.ТаблСчФакт.СведТов.СвТД", ПространствоИмен);
				КодСтраны = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(СтрокаТД, "СведенияОТоварах.НомерСтроки.СведенияОТаможеннойДекларации.НомерСтроки.СтранаПроисхожденияКод");
				НомерТД = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(СтрокаТД, "СведенияОТоварах.НомерСтроки.СведенияОТаможеннойДекларации.НомерСтроки.ТаможеннаяДекларацияНомер");
				Если ЗначениеЗаполнено(КодСтраны) Тогда
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвТД, "КодПроисх", КодСтраны, Истина, Ошибки);
				Иначе
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвТД, "ДефКодПроисх", "-", Истина, Ошибки);
				КонецЕсли;

				Если СведенияОПрослеживаемости.Количество() > 0 Тогда
					НомерТД = "Прослеж";
				КонецЕсли;
				Если ЗначениеЗаполнено(НомерТД) Тогда
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвТД, "НомерТД", НомерТД, Истина, Ошибки);
				КонецЕсли;

				СведенияОТоваре.СвТД.Добавить(СвТД);
			КонецЦикла;
		КонецЕсли;

		ДопСведТов = ПолучитьОбъектТипаCML("Файл.Документ.ТаблСчФакт.СведТов.ДопСведТов", ПространствоИмен);

		Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Товар, "СведенияОТоварах.НомерСтроки.Признак");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "ПрТовРаб", Реквизит, , Ошибки);
		Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Товар, "СведенияОТоварах.НомерСтроки.ПризнакДополнительнаяИнформация");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "ДопПризн", Реквизит, , Ошибки);
		Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Товар, "СведенияОТоварах.НомерСтроки.ТоварКод");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "КодТов", Реквизит, , Ошибки);
		Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Товар, "СведенияОТоварах.НомерСтроки.ТоварХарактеристика");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "ХарактерТов", Реквизит, , Ошибки);
		Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Товар, "СведенияОТоварах.НомерСтроки.ТоварСорт");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "СортТов", Реквизит, , Ошибки);
		Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Товар, "СведенияОТоварах.НомерСтроки.ТоварАртикул");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "АртикулТов", Реквизит, , Ошибки);
		Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Товар, "СведенияОТоварах.НомерСтроки.КодКаталога");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "КодКат", Реквизит, , Ошибки);
		Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Товар, "СведенияОТоварах.НомерСтроки.КодВидаТовара");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "КодВидТов", Реквизит, , Ошибки);

		СведенияОМаркировке = ДеревоЭлектронногоДокументаБЭД.ДанныеЭлементаДереваЭлектронногоДокумента(
		Товар, "СведенияОТоварах.НомерСтроки.СведенияОМаркировке");
		Если ЗначениеЗаполнено(СведенияОМаркировке.ИндивидуальныеУпаковки) Тогда
			НомСредИдентТов = ПолучитьОбъектТипаCML("Файл.Документ.ТаблСчФакт.СведТов.ДопСведТов.НомСредИдентТов", ПространствоИмен);
			Для каждого СтрокаКода Из СведенияОМаркировке.ИндивидуальныеУпаковки Цикл
				НомСредИдентТов.НомУпак.Добавить(СтрокаКода.Код);
			КонецЦикла;
			ДопСведТов.НомСредИдентТов.Добавить(НомСредИдентТов);
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОМаркировке.КонтрольныеИдентификационныеЗнаки) Тогда
			НомСредИдентТов = ПолучитьОбъектТипаCML("Файл.Документ.ТаблСчФакт.СведТов.ДопСведТов.НомСредИдентТов", ПространствоИмен);
			Для каждого СтрокаКода Из СведенияОМаркировке.КонтрольныеИдентификационныеЗнаки Цикл
				НомСредИдентТов.КИЗ.Добавить(СтрокаКода.Код);
			КонецЦикла;
			ДопСведТов.НомСредИдентТов.Добавить(НомСредИдентТов);
		КонецЕсли;
		Если ЗначениеЗаполнено(СведенияОМаркировке.ТранспортныеУпаковки) Тогда
			Для каждого СтрокаКода Из СведенияОМаркировке.ТранспортныеУпаковки Цикл
				НомСредИдентТов = ПолучитьОбъектТипаCML("Файл.Документ.ТаблСчФакт.СведТов.ДопСведТов.НомСредИдентТов", ПространствоИмен);
				НомСредИдентТов.ИдентТрансУпак = СтрокаКода.Код;
				ДопСведТов.НомСредИдентТов.Добавить(НомСредИдентТов);
			КонецЦикла;
		КонецЕсли;

		Для Каждого СтрокаПрослеживаемости Из СведенияОПрослеживаемости Цикл

			Нпп = СведенияОПрослеживаемости.Индекс(СтрокаПрослеживаемости) + 1;
			ПрефиксСведений = СтрШаблон("ДопПрослеж%1", Нпп);
			СведПрослеж = ПолучитьОбъектТипаCML("Файл.Документ.ТаблСчФакт.СведТов.ДопСведТов.СведПрослеж", ПространствоИмен);
			СведПрослеж.НомТовПрослеж = СтрокаПрослеживаемости.НомерТовара;
			СведПрослеж.ЕдИзмПрослеж = СтрокаПрослеживаемости.ЕдиницаИзмеренияКод;
			СведПрослеж.НаимЕдИзмПрослеж = СтрокаПрослеживаемости.ЕдиницаИзмеренияНаименование;
			СведПрослеж.КолВЕдПрослеж = СтрокаПрослеживаемости.Количество;
			СведПрослеж.ДопПрослеж = ПрефиксСведений;
			ДопСведТов.СведПрослеж.Добавить(СведПрослеж);

			ИдентификаторДопДанных = СтрШаблон("%1_КолУчетное", ПрефиксСведений);
			ЗначениеДопДанных = СтрокаПрослеживаемости.КоличествоУчетное;
			ТекстИнфТип = ПолучитьОбъектТипаCML("ТекстИнфТип", ПространствоИмен);
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТекстИнфТип, "Идентиф", ИдентификаторДопДанных, Истина, Ошибки);
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТекстИнфТип, "Значен", ЗначениеДопДанных, Истина, Ошибки);
			СведенияОТоваре.ИнфПолФХЖ2.Добавить(ТекстИнфТип);

			ИдентификаторДопДанных = СтрШаблон("%1_СтТовПрослежБезНДС", ПрефиксСведений);
			ЗначениеДопДанных = СтрокаПрослеживаемости.СтоимостьБезНДС;
			ТекстИнфТип = ПолучитьОбъектТипаCML("ТекстИнфТип", ПространствоИмен);
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТекстИнфТип, "Идентиф", ИдентификаторДопДанных, Истина, Ошибки);
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТекстИнфТип, "Значен", ЗначениеДопДанных, Истина, Ошибки);
			СведенияОТоваре.ИнфПолФХЖ2.Добавить(ТекстИнфТип);

		КонецЦикла;

		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "НаимЕдИзм", ЕдиницаИзмеренияНаименование, , Ошибки);

		Если ЗначениеЗаполнено(КодСтраны) Тогда
			ДанныеСтраныПоКлассификатору = ДанныеКлассификатораСтранМираПоКоду(КодСтраны);
			Если ДанныеСтраныПоКлассификатору <> Неопределено Тогда
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "КрНаимСтрПр", ДанныеСтраныПоКлассификатору.Наименование, , Ошибки);
			ИначеЕсли КодСтраны = "980" Тогда
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "КрНаимСтрПр", НСтр("ru = 'Евросоюз'"), , Ошибки);
			ИначеЕсли КодСтраны = "981" Тогда
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "КрНаимСтрПр", НСтр("ru = 'ЕАЭС'"), , Ошибки);
			КонецЕсли;
		КонецЕсли;

		Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Товар, "СведенияОТоварах.НомерСтроки.КоличествоНадлежитОтпустить");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "НадлОтп", Реквизит, , Ошибки);

		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведенияОТоваре, "ДопСведТов", ДопСведТов, Истина, Ошибки);

		СтрокаТаблицы = Товар.Строки.Найти("СведенияОТоварах.НомерСтроки.ТекстоваяИнформация", "ПолныйПуть");
		Если ТипЗнч(СтрокаТаблицы.Значение) = Тип("Число") И СтрокаТаблицы.Значение > 0 Тогда
			Для Каждого Информация Из СтрокаТаблицы.Строки Цикл
				ТекстИнфТип = ПолучитьОбъектТипаCML("ТекстИнфТип", ПространствоИмен);

				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТекстИнфТип, "Идентиф",
				ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Информация,
				"СведенияОТоварах.НомерСтроки.ТекстоваяИнформация.НомерСтроки.Идентификатор"), Истина, Ошибки);
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТекстИнфТип, "Значен",
				ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Информация,
				"СведенияОТоварах.НомерСтроки.ТекстоваяИнформация.НомерСтроки.Значение"), Истина, Ошибки);

				СведенияОТоваре.ИнфПолФХЖ2.Добавить(ТекстИнфТип);
			КонецЦикла;
		КонецЕсли;

		// Выгружаем доп. данные.
		СтрокаДопДанных = Товар.Строки.Найти("СведенияОТоварах.НомерСтроки.ДопДанныеПодписанные", "ПолныйПуть");
		Если ТипЗнч(СтрокаДопДанных.Значение) = Тип("Число") И СтрокаДопДанных.Значение > 0 Тогда
			Для Каждого ТекСтрокаДопДанных Из СтрокаДопДанных.Строки Цикл

				ИдентификаторДопДанных = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ТекСтрокаДопДанных,
				"СведенияОТоварах.НомерСтроки.ДопДанныеПодписанные.НомерСтроки.Идентификатор");
				ЗначениеДопДанных = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ТекСтрокаДопДанных,
				"СведенияОТоварах.НомерСтроки.ДопДанныеПодписанные.НомерСтроки.Значение");

				ТекстИнфТип = ПолучитьОбъектТипаCML("ТекстИнфТип", ПространствоИмен);

				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТекстИнфТип, "Идентиф", ИдентификаторДопДанных, Истина, Ошибки);
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТекстИнфТип, "Значен", ЗначениеДопДанных, Истина, Ошибки);

				СведенияОТоваре.ИнфПолФХЖ2.Добавить(ТекстИнфТип);
			КонецЦикла;
		КонецЕсли;

		ТабличнаяЧасть.СведТов.Добавить(СведенияОТоваре);
	КонецЦикла;

	ВсегоОпл = ПолучитьОбъектТипаCML("Файл.Документ.ТаблСчФакт.ВсегоОпл", ПространствоИмен);
	Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "ВсегоКОплате.ВсегоСтоимостьТоваровБезНалога");
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ВсегоОпл, "СтТовБезНДСВсего", Реквизит, , Ошибки);
	Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "ВсегоКОплате.ВсегоСтоимостьТоваровСНалогом");
	Если ВсеСтрокиСДефисом.СтоимостьТоваровСНалогом Тогда
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ВсегоОпл, "ДефСтТовУчНалВсего", "-", Истина, Ошибки);
	Иначе
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ВсегоОпл, "СтТовУчНалВсего", Реквизит, Истина, Ошибки);
	КонецЕсли;

	СумНДСТип = ПолучитьОбъектТипаCML("СумНДСТип", ПространствоИмен);
	Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "ВсегоКОплате.ВсегоСуммаНалога");
	Если ВсеСтрокиСДефисом.СуммаНалога Тогда
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СумНДСТип, "ДефНДС", "-", Истина, Ошибки);
	ИначеЕсли Не ЗначениеЗаполнено(Реквизит) И ВсеСтрокиБезНДС Тогда
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СумНДСТип, "БезНДС", "без НДС", Истина, Ошибки);
	Иначе
		ЗначениеСумНДСТип = Формат(Реквизит, "ЧДЦ=2; ЧРД=.; ЧГ=; ЧН=");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СумНДСТип, "СумНал", ЗначениеСумНДСТип, Истина, Ошибки);
	КонецЕсли;
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ВсегоОпл, "СумНалВсего", СумНДСТип, Истина, Ошибки);

	Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "ВсегоКОплате.ВсегоКоличество");
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ВсегоОпл, "КолНеттоВс", Реквизит, , Ошибки);

	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТабличнаяЧасть, "ВсегоОпл", ВсегоОпл, Истина, Ошибки);
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Документ, "ТаблСчФакт", ТабличнаяЧасть, Истина, Ошибки);

	Если ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "Функция") <> СЧФ() Тогда

		// Сведения о факте отгрузки товаров.
		ДанныеОбОтгрузкеТоваров = ПолучитьОбъектТипаCML("Файл.Документ.СвПродПер", ПространствоИмен);
		ОтгрузкаТоваров = ПолучитьОбъектТипаCML("Файл.Документ.СвПродПер.СвПер", ПространствоИмен);

		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ОтгрузкаТоваров, "СодОпер",
		ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "СодержаниеОперации"), Истина, Ошибки);
		ВидОперации = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "ВидОперации");
		ВидОперацииСтрокой = ВидОперацииЭДСтрокой(ВидОперации);			
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ОтгрузкаТоваров, "ВидОпер", ВидОперацииСтрокой, , Ошибки);
		ДатаОтгрузкиТоваров = ДатаФНС(ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "ДатаОтгрузкиТоваров"));
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ОтгрузкаТоваров, "ДатаПер", ДатаОтгрузкиТоваров, , Ошибки);

		ДатаНачалаПоставки = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "ДатаНачалаПоставки");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ОтгрузкаТоваров, "ДатаНач",  ДатаФНС(ДатаНачалаПоставки), , Ошибки);
		ДатаОкончанияПоставки = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "ДатаОкончанияПоставки");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ОтгрузкаТоваров, "ДатаОкон",  ДатаФНС(ДатаОкончанияПоставки), , Ошибки);

		Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "ОснованиеОтгрузкиТоваров");
		Если ТипЗнч(Реквизит) = Тип("Число") И Реквизит > 0 Тогда
			СтрокаТаблицы = ДеревоДанных.Строки.Найти("ОснованиеОтгрузкиТоваров", "ПолныйПуть");
			Если ТипЗнч(СтрокаТаблицы.Значение) = Тип("Число") И СтрокаТаблицы.Значение > 0 Тогда
				Для Каждого Основание Из СтрокаТаблицы.Строки Цикл
					ОснПер = ПолучитьОбъектТипаCML("Файл.Документ.СвПродПер.СвПер.ОснПер", ПространствоИмен);

					НомерОснования = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Основание,
					"ОснованиеОтгрузкиТоваров.НомерСтроки.ДокументНомер");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ОснПер, "НомОсн", НомерОснования, , Ошибки);

					ДокументДата = ДатаФНС(ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Основание,
					"ОснованиеОтгрузкиТоваров.НомерСтроки.ДокументДата"));
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ОснПер, "ДатаОсн", ДокументДата, , Ошибки);

					НаименованиеОснования = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Основание,
					"ОснованиеОтгрузкиТоваров.НомерСтроки.ДокументНаименование");
					УдалитьНомерИДатуИзНаименования(НаименованиеОснования, НомерОснования, ДокументДата);
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ОснПер, "НаимОсн", НаименованиеОснования, Истина, Ошибки);

					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ОснПер, "ДопСвОсн",
					ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Основание,
					"ОснованиеОтгрузкиТоваров.НомерСтроки.ДокументДопСведения"), , Ошибки);

					ОтгрузкаТоваров.ОснПер.Добавить(ОснПер);
				КонецЦикла;
			КонецЕсли;
		Иначе
			ОснПер = ПолучитьОбъектТипаCML("Файл.Документ.СвПродПер.СвПер.ОснПер", ПространствоИмен);
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ОснПер, "НаимОсн", "Без документа-основания", Истина, Ошибки);
			ОтгрузкаТоваров.ОснПер.Добавить(ОснПер);
		КонецЕсли;

		ТранГруз = ПолучитьОбъектТипаCML("Файл.Документ.СвПродПер.СвПер.ТранГруз", ПространствоИмен);
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТранГруз, "СвТранГруз",
		ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "СведенияОТранспортировке"), , Ошибки);

		Если ЗначениеЗаполнено(ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "СведенияОЛицеПередавшемТовары")) Тогда

			СвЛицПер = ПолучитьОбъектТипаCML("Файл.Документ.СвПродПер.СвПер.СвЛицПер", ПространствоИмен);
			Если ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "СведенияОЛицеПередавшемТовары") = "РаботникОрганизацииПродавца" Тогда

				РабОргПрод = ПолучитьОбъектТипаCML("Файл.Документ.СвПродПер.СвПер.СвЛицПер.РабОргПрод", ПространствоИмен);

				Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных,
				"СведенияОЛицеПередавшемТовары.РаботникОрганизацииПродавца.Должность");
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(РабОргПрод, "Должность", Реквизит, Истина, Ошибки);
				Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных,
				"СведенияОЛицеПередавшемТовары.РаботникОрганизацииПродавца.ИныеСведения");
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(РабОргПрод, "ИныеСвед", Реквизит, , Ошибки);
				Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных,
				"СведенияОЛицеПередавшемТовары.РаботникОрганизацииПродавца.ОснованиеПолномочий");
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(РабОргПрод, "ОснПолн", Реквизит, , Ошибки);

				ФИО = ПолучитьОбъектТипаCML("ФИОТип", ПространствоИмен);
				Фамилия = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных,
				"СведенияОЛицеПередавшемТовары.РаботникОрганизацииПродавца.Фамилия");
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ФИО, "Фамилия", Фамилия, Истина, Ошибки);
				Имя = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных,
				"СведенияОЛицеПередавшемТовары.РаботникОрганизацииПродавца.Имя");
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ФИО, "Имя", Имя, Истина, Ошибки);
				Отчество = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных,
				"СведенияОЛицеПередавшемТовары.РаботникОрганизацииПродавца.Отчество");
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ФИО, "Отчество", Отчество, , Ошибки);
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(РабОргПрод, "ФИО", ФИО,  , Ошибки);

				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвЛицПер, "РабОргПрод", РабОргПрод, , Ошибки);

			ИначеЕсли ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "СведенияОЛицеПередавшемТовары") = "ИноеЛицо" Тогда

				ИнЛицо = ПолучитьОбъектТипаCML("Файл.Документ.СвПродПер.СвПер.СвЛицПер.ИнЛицо", ПространствоИмен);
				Если ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "СведенияОЛицеПередавшемТовары.ИноеЛицо") = "ПредставительОрганизации" Тогда
					ПредОргПер = ПолучитьОбъектТипаCML("Файл.Документ.СвПродПер.СвПер.СвЛицПер.ИнЛицо.ПредОргПер", ПространствоИмен);

					Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных,
					"СведенияОЛицеПередавшемТовары.ИноеЛицо.ПредставительОрганизации.Должность");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ПредОргПер, "Должность", Реквизит, Истина, Ошибки);
					Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных,
					"СведенияОЛицеПередавшемТовары.ИноеЛицо.ПредставительОрганизации.ИныеСведения");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ПредОргПер, "ИныеСвед", Реквизит, , Ошибки);
					Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных,
					"СведенияОЛицеПередавшемТовары.ИноеЛицо.ПредставительОрганизации.НаименованиеОрганизации");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ПредОргПер, "НаимОргПер", Реквизит, Истина, Ошибки);
					Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных,
					"СведенияОЛицеПередавшемТовары.ИноеЛицо.ПредставительОрганизации.ДоверенностьНаОтгрузку");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ПредОргПер, "ОснДоверОргПер", Реквизит, , Ошибки);
					Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных,
					"СведенияОЛицеПередавшемТовары.ИноеЛицо.ПредставительОрганизации.ОснованиеПолномочий");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ПредОргПер, "ОснПолнПредПер", Реквизит, , Ошибки);

					ФИО = ПолучитьОбъектТипаCML("ФИОТип", ПространствоИмен);
					Фамилия = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных,
					"СведенияОЛицеПередавшемТовары.ИноеЛицо.ПредставительОрганизации.Фамилия");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ФИО, "Фамилия", Фамилия, Истина, Ошибки);
					Имя = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных,
					"СведенияОЛицеПередавшемТовары.ИноеЛицо.ПредставительОрганизации.Имя");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ФИО, "Имя", Имя, Истина, Ошибки);
					Отчество = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных,
					"СведенияОЛицеПередавшемТовары.ИноеЛицо.ПредставительОрганизации.Отчество");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ФИО, "Отчество", Отчество, , Ошибки);
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ПредОргПер, "ФИО", ФИО,  , Ошибки);

					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИнЛицо, "ПредОргПер", ПредОргПер, , Ошибки);
				ИначеЕсли ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "СведенияОЛицеПередавшемТовары.ИноеЛицо") = "ФЛ" Тогда
					ФЛПер = ПолучитьОбъектТипаCML("Файл.Документ.СвПродПер.СвПер.СвЛицПер.ИнЛицо.ФЛПер", ПространствоИмен);

					Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных,
					"СведенияОЛицеПередавшемТовары.ИноеЛицо.ФЛ.ИныеСведения");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ФЛПер, "ИныеСвед", Реквизит, , Ошибки);
					Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных,
					"СведенияОЛицеПередавшемТовары.ИноеЛицо.ФЛ.ДоверенностьНаОтгрузку");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ФЛПер, "ОснДоверФЛ", Реквизит, , Ошибки);

					ФИО = ПолучитьОбъектТипаCML("ФИОТип", ПространствоИмен);
					Фамилия = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных,
					"СведенияОЛицеПередавшемТовары.ИноеЛицо.ФЛ.Фамилия");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ФИО, "Фамилия", Фамилия, Истина, Ошибки);
					Имя = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных,
					"СведенияОЛицеПередавшемТовары.ИноеЛицо.ФЛ.Имя");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ФИО, "Имя", Имя, Истина, Ошибки);
					Отчество = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных,
					"СведенияОЛицеПередавшемТовары.ИноеЛицо.ФЛ.Отчество");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ФИО, "Отчество", Отчество, , Ошибки);
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ФЛПер, "ФИО", ФИО,  , Ошибки);

					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИнЛицо, "ФЛПер", ФЛПер, , Ошибки);

				КонецЕсли;
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвЛицПер, "ИнЛицо", ИнЛицо, , Ошибки);

			КонецЕсли;

			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ОтгрузкаТоваров, "СвЛицПер", СвЛицПер, , Ошибки);

		КонецЕсли;

		Реквизит = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "ТранспортнаяНакладная");
		Если ТипЗнч(Реквизит) = Тип("Число") И Реквизит > 0 Тогда
			СтрокаТаблицы = ДеревоДанных.Строки.Найти("ТранспортнаяНакладная", "ПолныйПуть");
			Если ТипЗнч(СтрокаТаблицы.Значение) = Тип("Число") И СтрокаТаблицы.Значение > 0 Тогда
				Для Каждого Накладная Из СтрокаТаблицы.Строки Цикл
					ТранНакл = ПолучитьОбъектТипаCML("Файл.Документ.СвПродПер.СвПер.ТранГруз.ТранНакл", ПространствоИмен);

					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТранНакл, "НомТранНакл",
					ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Накладная,
					"ТранспортнаяНакладная.НомерСтроки.ТранспортнаяНакладнаяНомер"), Истина, Ошибки);
					ДатаДок = ДатаФНС(ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Накладная,
					"ТранспортнаяНакладная.НомерСтроки.ТранспортнаяНакладнаяДата"));
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТранНакл, "ДатаТранНакл", ДатаДок, Истина, Ошибки);

					ТранГруз.ТранНакл.Добавить(ТранНакл);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;

		Если ЗначениеЗаполнено(ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "СведенияОПеревозчике")) Тогда
			Перевозчик = ПолучитьОбъектТипаCML("УчастникТип", ПространствоИмен);
			ЗаполнитьСведенияОбУчастникеУПД_2019(Перевозчик, ДеревоДанных, Ошибки, ПространствоИмен, "СведенияОПеревозчике");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТранГруз, "Перевозчик", Перевозчик, Истина, Ошибки);
		КонецЕсли;

		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ОтгрузкаТоваров, "ТранГруз", ТранГруз, , Ошибки);

		Если ЗначениеЗаполнено(ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "СведенияОПередачеВещи")) Тогда
			СвПерВещи = ПолучитьОбъектТипаCML("Файл.Документ.СвПродПер.СвПер.СвПерВещи", ПространствоИмен);

			ДатаДок = ДатаФНС(ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "СведенияОПередачеВещи.ПередачаВещиДата"));
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвПерВещи, "ДатаПерВещ", ДатаДок, , Ошибки);
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвПерВещи, "СвПерВещ",
			ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "СведенияОПередачеВещи.ПередачаВещиСведения"), , Ошибки);

			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ОтгрузкаТоваров, "СвПерВещи", СвПерВещи, , Ошибки);
		КонецЕсли;
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДанныеОбОтгрузкеТоваров, "СвПер", ОтгрузкаТоваров, Истина, Ошибки);

		Если ЗначениеЗаполнено(ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "ДопДанныеДокументаОтгрузки")) Тогда
			ИнфПолФХЖ3 = ПолучитьОбъектТипаCML("Файл.Документ.СвПродПер.ИнфПолФХЖ3", ПространствоИмен);

			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИнфПолФХЖ3, "ИдФайлИнфПол",
			ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "ДопДанныеДокументаОтгрузки.ИдентификаторФайла"), , Ошибки);

			СтрокиДопДанныеДокументаОтгрузки = ДеревоДанных.Строки.Найти("ДопДанныеДокументаОтгрузки", "ПолныйПуть");
			СтрокаТаблицы = СтрокиДопДанныеДокументаОтгрузки.Строки.Найти("ДопДанныеДокументаОтгрузки.ТекстоваяИнформация", "ПолныйПуть");
			Если ТипЗнч(СтрокаТаблицы.Значение) = Тип("Число") И СтрокаТаблицы.Значение > 0 Тогда
				Для Каждого Информация Из СтрокаТаблицы.Строки Цикл
					ТекстИнфТип = ПолучитьОбъектТипаCML("ТекстИнфТип", ПространствоИмен);

					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТекстИнфТип, "Идентиф",
					ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Информация,
					"ДопДанныеДокументаОтгрузки.ТекстоваяИнформация.НомерСтроки.Идентификатор"), Истина, Ошибки);
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТекстИнфТип, "Значен",
					ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(Информация,
					"ДопДанныеДокументаОтгрузки.ТекстоваяИнформация.НомерСтроки.Значение"), Истина, Ошибки);

					ИнфПолФХЖ3.ТекстИнф.Добавить(ТекстИнфТип);
				КонецЦикла;
			КонецЕсли;
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДанныеОбОтгрузкеТоваров, "ИнфПолФХЖ3", ИнфПолФХЖ3, Истина, Ошибки);
		КонецЕсли;

		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Документ, "СвПродПер", ДанныеОбОтгрузкеТоваров, Истина, Ошибки);
	КонецЕсли;

	Если ЭтоЭлектронноеАктированиеЕИС Тогда

		// Для ЕИС список подписантов определяется заранее.
		МодульЭлектронноеАктированиеЕИС.ЗаполнитьСведенияОПодписантах(
		ДеревоДанных, Документ, ПространствоИмен, Ошибки);

	Иначе

		// Сведения о лице, подписывающем файл обмена.
		Подписант = ПолучитьОбъектТипаCML("Файл.Документ.Подписант", ПространствоИмен);
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Подписант, "ОблПолн", "5", Истина, Ошибки);
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Подписант, "Статус", "1", Истина, Ошибки);
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Подписант, "ОснПолн", "Должностные обязанности", Истина, Ошибки);

		// В подписанте пустым значением заполняется поле Физ.лицо.
		ЗаполнитьФизЛицоПодписанта(Подписант, ПространствоИмен, Ошибки);

		Документ.Подписант.Добавить(Подписант);

	КонецЕсли;

	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Файл, "Документ", Документ, Истина, Ошибки);

	ПроверитьОбъектXDTO(Файл, Ошибки);

	Результат = НовыйРезультатЗаполненияДокумента();

	Если ЗначениеЗаполнено(Ошибки) Тогда

		Результат.Ошибки = Ошибки;

	Иначе

		Если ЭтоЭлектронноеАктированиеЕИС Тогда
			ВидДокумента = "УПДПрод";
			МодульЭлектронноеАктированиеЕИС.ПриФормированииДвоичныхДанныхЭД(
			ВидДокумента, Файл, ДеревоДанных);
		КонецЕсли;

		ДвоичныеДанные = ДвоичныеДанныеОбъектаXDTO(Файл);
		Результат.ДанныеОсновногоФайла.ДвоичныеДанные =
		ОбщегоНазначенияБЭД.УдалитьПространствоИмен(ДвоичныеДанные, ПространствоИмен);

		ИмяФайлаПоУмолчанию = ИдентификаторФайла + ".xml";
		Результат.ДанныеОсновногоФайла.ИмяФайла = ИмяФайлаПоУмолчанию;

		// Формирование приложения для ЕИС в сфере закупок.
		Если ЭтоЭлектронноеАктированиеЕИС Тогда
			РезультатСозданияПриложения = МодульЭлектронноеАктированиеЕИС.
			СформироватьДанныеПриложенияУПДДляЕИС(ДеревоДанных, ИдентификаторФайла);
			Если НЕ РезультатСозданияПриложения.Выполнено Тогда
				ОбщегоНазначенияБЭД.ДобавитьОшибку(
				Результат.Ошибки, РезультатСозданияПриложения.ОписаниеОшибки);
			КонецЕсли;

			Результат.ДанныеДополнительногоФайла.ДвоичныеДанные =
			РезультатСозданияПриложения.ДвоичныеДанные;
			Результат.ДанныеДополнительногоФайла.ИмяФайла =
			РезультатСозданияПриложения.ИмяФайла;
		КонецЕсли;

	КонецЕсли;

	Возврат Результат;

КонецФункции

&ИзменениеИКонтроль("ЗаполнитьДокумент_УПД_5_02_ИнформацияПродавца")
Функция ИТБК_ЗаполнитьДокумент_УПД_5_02_ИнформацияПродавца(Знач ДеревоДанных)
	
	ДатаФормирования = ТекущаяДатаСеанса();
	ИдентификаторФайлаXML = ИдентификаторФайла_УПД_5_02_ИнформацияПродавца(ДеревоДанных, ДатаФормирования);
	
	ПространствоИмен = ПространствоИмен_УПД_5_02_ИнформацияПродавца();
	Пакет = ФабрикаXDTO.Пакеты.Получить(ПространствоИмен);
	
	Ошибки = Неопределено; // служебная переменная для хранения списка возникших ошибок
	
	ЭтоЭлектронноеАктированиеЕИС = Ложь;
	МодульЭлектронноеАктированиеЕИС = Неопределено;
	Если ОбщегоНазначения.ПодсистемаСуществует(
			"ЭлектронноеВзаимодействие.ЭлектронноеАктированиеЕИС") Тогда
		МодульЭлектронноеАктированиеЕИС = ОбщегоНазначения.ОбщийМодуль("ЭлектронноеАктированиеЕИС");
		Если МодульЭлектронноеАктированиеЕИС.ИспользоватьЭлектронноеАктированиеВЕИС()
			И ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных,
				"ДанныеЭлектронногоАктированияЕИС") = Истина Тогда
			ЭтоЭлектронноеАктированиеЕИС = Истина;
			МодульЭлектронноеАктированиеЕИС.ПередФормированиемЭлектронногоДокумента(
				ДеревоДанных, ПространствоИмен);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "СведенияОКомиссионере")) Тогда
		СведенияКомиссионера = ПолучитьОбъектТипаCML("УчастникТип", ПространствоИмен);
		ЗаполнитьСведенияОбУчастникеУПД_5_02(СведенияКомиссионера, ДеревоДанных, Ошибки, ПространствоИмен, "СведенияОКомиссионере");
		
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.УстановитьСтроку();
		ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, СведенияКомиссионера);
		
		СтрXML = ЗаписьXML.Закрыть();
		НачПоз = СтрНайти(СтрXML, "<ИдСв>");
		КолСимв = СтрНайти(СтрXML, "</ИдСв>") - НачПоз + СтрДлина("</ИдСв>");
		СтрXML = Сред(СтрXML, НачПоз, КолСимв);
		
		ТекстоваяИнформация = Новый ТаблицаЗначений;
		ТекстоваяИнформация.Колонки.Добавить("Идентификатор");
		ТекстоваяИнформация.Колонки.Добавить("Значение");
		НоваяСтрока = ТекстоваяИнформация.Добавить();
		НоваяСтрока.Идентификатор = "ДанныеКомиссионера";
		НоваяСтрока.Значение = СтрXML;
		ДеревоЭлектронногоДокументаБЭД.ДобавитьЗаписьВТаблицуДерева(ДеревоДанных,
			НоваяСтрока, "СведенияОСчетеФактуре.ИнформационноеПолеФХЖ.ТекстоваяИнформация");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "СведенияОКомитенте")) Тогда
		СведенияКомитента = ПолучитьОбъектТипаCML("УчастникТип", ПространствоИмен);
		ЗаполнитьСведенияОбУчастникеУПД_5_02(СведенияКомитента, ДеревоДанных, Ошибки, ПространствоИмен, "СведенияОКомитенте");
		
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.УстановитьСтроку();
		ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, СведенияКомитента);
		
		СтрXML = ЗаписьXML.Закрыть();
		НачПоз = СтрНайти(СтрXML, "<ИдСв>");
		КолСимв = СтрНайти(СтрXML, "</ИдСв>") - НачПоз + СтрДлина("</ИдСв>");
		СтрXML = Сред(СтрXML, НачПоз, КолСимв);
		
		ТекстоваяИнформация = Новый ТаблицаЗначений;
		ТекстоваяИнформация.Колонки.Добавить("Идентификатор");
		ТекстоваяИнформация.Колонки.Добавить("Значение");
		НоваяСтрока = ТекстоваяИнформация.Добавить();
		НоваяСтрока.Идентификатор = "ДанныеКомитента";
		НоваяСтрока.Значение = СтрXML;
		ДеревоЭлектронногоДокументаБЭД.ДобавитьЗаписьВТаблицуДерева(ДеревоДанных,
			НоваяСтрока, "СведенияОСчетеФактуре.ИнформационноеПолеФХЖ.ТекстоваяИнформация");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "СведенияОПеревозчике")) Тогда
		СведенияПеревозчика = ПолучитьОбъектТипаCML("УчастникТип", ПространствоИмен);
		ЗаполнитьСведенияОбУчастникеУПД_5_02(СведенияПеревозчика, ДеревоДанных, Ошибки, ПространствоИмен, "СведенияОПеревозчике");
		
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.УстановитьСтроку();
		ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, СведенияПеревозчика);
		
		СтрXML = ЗаписьXML.Закрыть();
		НачПоз = СтрНайти(СтрXML, "<ИдСв>");
		КолСимв = СтрНайти(СтрXML, "</ИдСв>") - НачПоз + СтрДлина("</ИдСв>");
		СтрXML = Сред(СтрXML, НачПоз, КолСимв);
		
		ТекстоваяИнформация = Новый ТаблицаЗначений;
		ТекстоваяИнформация.Колонки.Добавить("Идентификатор");
		ТекстоваяИнформация.Колонки.Добавить("Значение");
		НоваяСтрока = ТекстоваяИнформация.Добавить();
		НоваяСтрока.Идентификатор = "ДанныеПеревозчика";
		НоваяСтрока.Значение = СтрXML;
		ДеревоЭлектронногоДокументаБЭД.ДобавитьЗаписьВТаблицуДерева(ДеревоДанных,
			НоваяСтрока, "СведенияОСчетеФактуре.ИнформационноеПолеФХЖ.ТекстоваяИнформация");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "НомерТранспортнойНакладной")) Тогда
		ТекстоваяИнформация = Новый ТаблицаЗначений;
		ТекстоваяИнформация.Колонки.Добавить("Идентификатор");
		ТекстоваяИнформация.Колонки.Добавить("Значение");
		НоваяСтрока = ТекстоваяИнформация.Добавить();
		НоваяСтрока.Идентификатор = "НомерТранспортнойНакладной";
		НоваяСтрока.Значение = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "НомерТранспортнойНакладной");
		ДеревоЭлектронногоДокументаБЭД.ДобавитьЗаписьВТаблицуДерева(ДеревоДанных,
			НоваяСтрока, "СведенияОПередаче.ИнформационноеПолеФХЖ.ТекстоваяИнформация");
	КонецЕсли;	
		
	Если ЗначениеЗаполнено(ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "ДатаТранспортнойНакладной")) Тогда
		ТекстоваяИнформация = Новый ТаблицаЗначений;
		ТекстоваяИнформация.Колонки.Добавить("Идентификатор");
		ТекстоваяИнформация.Колонки.Добавить("Значение");
		НоваяСтрока = ТекстоваяИнформация.Добавить();
		НоваяСтрока.Идентификатор = "ДатаТранспортнойНакладной";
		НоваяСтрока.Значение = ДатаФНС(ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "ДатаТранспортнойНакладной"));
		ДеревоЭлектронногоДокументаБЭД.ДобавитьЗаписьВТаблицуДерева(ДеревоДанных,
			НоваяСтрока, "СведенияОПередаче.ИнформационноеПолеФХЖ.ТекстоваяИнформация");
	КонецЕсли;
	
	СвойствоФайл = Пакет.КорневыеСвойства.Получить("Файл");
	Файл = ПолучитьОбъектТипаCML(СвойствоФайл.Тип, ПространствоИмен);
	
	// Техническая информация по документу.
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Файл, "ИдФайл", ИдентификаторФайлаXML, Истина, Ошибки);
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Файл, "ВерсПрог", ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "ВерсияПрограммы"),, Ошибки);
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Файл, "ВерсФорм", "5.02", Истина, Ошибки);
	
	СвойствоДокумент = Файл.Свойства().Получить("Документ");
	Документ = ПолучитьОбъектТипаCML(СвойствоДокумент.Тип, ПространствоИмен);
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Документ, "КНД", "1115131", Истина, Ошибки);
	УИД = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "УникальныйИдентификаторДокумента");
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Документ, "УИД", УИД, , Ошибки);
	ФункцияУПД = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "Функция");
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Документ, "Функция", ФункцияУПД, , Ошибки);
		
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Документ, "ДатаИнфПр", Формат(ДатаФормирования, "ДФ=dd.MM.yyyy"), Истина, Ошибки);
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Документ, "ВремИнфПр", Формат(ДатаФормирования, "ДФ=HH.mm.ss"), Истина, Ошибки);
	
	НаимЭконСубСост = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "СоставительДокументаНаименование");
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Документ, "НаимЭконСубСост", НаимЭконСубСост, , Ошибки);
	
	СоглСтрДопИнф = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "СогласованныеДопПоля");
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Документ, "СоглСтрДопИнф", СоглСтрДопИнф, , Ошибки);
	
	// Сведения о счете-фактуре.
	СвойствоСвСчФакт = Документ.Свойства().Получить("СвСчФакт");
	СвСчФакт = ПолучитьОбъектТипаCML(СвойствоСвСчФакт.Тип, ПространствоИмен);
	Путь = "СведенияОСчетеФактуре.";
	
	НомерДок = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, Путь + "НомерДокумента");
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвСчФакт, "НомерДок", НомерДок, Истина, Ошибки);
	
	ДатаДок = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, Путь + "ДатаДокумента");
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвСчФакт, "ДатаДок", ДатаФНС(ДатаДок), Истина, Ошибки);
	
	ИмяФайлИспрПрод = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, Путь + "ИмяФайлаПродавца");
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвСчФакт, "ИмяФайлИспрПрод", ИмяФайлИспрПрод, , Ошибки);
	
	ИмяФайлИспрПок = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, Путь + "ИмяФайлаПокупателя");
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвСчФакт, "ИмяФайлИспрПок", ИмяФайлИспрПок, , Ошибки);
	
	// Исправление.
	Исправление = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, Путь + "Исправление");
	Если ЗначениеЗаполнено(Исправление) Тогда
		СвойствоИспрДок = СвСчФакт.Свойства().Получить("ИспрДок");
		ИспрДок = ПолучитьОбъектТипаCML(СвойствоИспрДок.Тип, ПространствоИмен);
		ИсправлениеПуть = Путь + "Исправление.";
		
		НомИспр = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, ИсправлениеПуть + "НомерИсправления");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИспрДок, "НомИспр", НомИспр, Истина, Ошибки);
		
		ДатаИспр = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, ИсправлениеПуть + "ДатаИсправления");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИспрДок, "ДатаИспр", ДатаФНС(ДатаИспр), Истина, Ошибки);
		
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвСчФакт, "ИспрДок", ИспрДок, , Ошибки);
	КонецЕсли;
	
	// Сведения о продавцах.
	СведенияОПродавцах = ДеревоДанных.Строки.Найти(Путь + "СведенияОПродавцах", "ПолныйПуть", Истина);
	Если ЗначениеЗаполнено(СведенияОПродавцах.Значение) Тогда
		ПродавецПуть = Путь + "СведенияОПродавцах.НомерСтроки.Продавец";
		Для Каждого ТекущийПродавец Из СведенияОПродавцах.Строки Цикл
			Продавец = ПолучитьОбъектТипаCML("УчастникТип", ПространствоИмен);
			ЗаполнитьСведенияОбУчастникеУПД_5_02(Продавец, ТекущийПродавец, Ошибки, ПространствоИмен, ПродавецПуть);
			СвСчФакт.СвПрод.Добавить(Продавец);
		КонецЦикла;	
	КонецЕсли;
	
	// Сведения о покупателях.
	СведенияОПокупателях = ДеревоДанных.Строки.Найти(Путь + "СведенияОПокупателях", "ПолныйПуть", Истина);
	Если ЗначениеЗаполнено(СведенияОПокупателях.Значение) Тогда
		ПокупательПуть = Путь + "СведенияОПокупателях.НомерСтроки.Покупатель";
		Для Каждого ТекущийПокупатель Из СведенияОПокупателях.Строки Цикл
			Покупатель = ПолучитьОбъектТипаCML("УчастникТип", ПространствоИмен);
			ЗаполнитьСведенияОбУчастникеУПД_5_02(Покупатель, ТекущийПокупатель, Ошибки, ПространствоИмен, ПокупательПуть);
			СвСчФакт.СвПокуп.Добавить(Покупатель);
		КонецЦикла;	
	КонецЕсли;
	
	// Сведения о грузоотправителях.
	СведенияОГрузоотправителях = ДеревоДанных.Строки.Найти(Путь + "СведенияОГрузоотправителях", "ПолныйПуть", Истина);
	Если ЗначениеЗаполнено(СведенияОГрузоотправителях.Значение) Тогда
		
		СвойствоГрузОт = СвСчФакт.Свойства().Получить("ГрузОт");
		ГрузоотправительПуть = Путь + "СведенияОГрузоотправителях.НомерСтроки.Грузоотправитель";
		ОнЖеПуть = Путь + "СведенияОГрузоотправителях.НомерСтроки.ОнЖе";
		
		Для Каждого ТекущийГрузоотправитель Из СведенияОГрузоотправителях.Строки Цикл
			ГрузОт = ПолучитьОбъектТипаCML(СвойствоГрузОт.Тип, ПространствоИмен);
			
			ОнЖе = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ТекущийГрузоотправитель, ОнЖеПуть);
#Вставка
//Сообщить(ОнЖе);
//Сообщить("2");
#КонецВставки
			Если ОнЖе = Истина Тогда
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ГрузОт, "ОнЖе", "он же", , Ошибки);
			Иначе
				Грузоотправитель = ПолучитьОбъектТипаCML("УчастникТип", ПространствоИмен);
				ЗаполнитьСведенияОбУчастникеУПД_5_02(
					Грузоотправитель, ТекущийГрузоотправитель, Ошибки, ПространствоИмен, ГрузоотправительПуть);
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ГрузОт, "ГрузОтпр", Грузоотправитель, Истина, Ошибки);
			КонецЕсли;
			
			СвСчФакт.ГрузОт.Добавить(ГрузОт);
		КонецЦикла;	
	КонецЕсли;
	
	// Сведения о грузополучателях.
	СведенияОГрузополучателях = ДеревоДанных.Строки.Найти(Путь + "СведенияОГрузополучателях", "ПолныйПуть", Истина);
	Если ЗначениеЗаполнено(СведенияОГрузополучателях.Значение) Тогда
		ГрузополучательПуть = Путь + "СведенияОГрузополучателях.НомерСтроки.Грузополучатель";
		Для Каждого ТекущийГрузополучатель Из СведенияОГрузополучателях.Строки Цикл
			Грузополучатель = ПолучитьОбъектТипаCML("УчастникТип", ПространствоИмен);
			ЗаполнитьСведенияОбУчастникеУПД_5_02(Грузополучатель, ТекущийГрузополучатель, Ошибки, ПространствоИмен, ГрузополучательПуть);
			СвСчФакт.ГрузПолуч.Добавить(Грузополучатель);
		КонецЦикла;	
	КонецЕсли;
	
	// Сведения о платежно-расчетных документах.
	СведенияОПлатежноРасчетныхДокументах = ДеревоДанных.Строки.Найти(Путь + "СведенияОПлатежноРасчетныхДокументах", "ПолныйПуть", Истина);
	Если ЗначениеЗаполнено(СведенияОПлатежноРасчетныхДокументах.Значение) Тогда
		СвПРД = СвСчФакт.Свойства().Получить("СвПРД");
		ПутьПРД = Путь + "СведенияОПлатежноРасчетныхДокументах.НомерСтроки.";
		Для Каждого ТекущийДокумент Из СведенияОПлатежноРасчетныхДокументах.Строки Цикл
			НовыйПРД = ПолучитьОбъектТипаCML(СвПРД.Тип, ПространствоИмен);
			
			НомерПРД = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ТекущийДокумент, ПутьПРД + "Номер");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(НовыйПРД, "НомерПРД", НомерПРД, , Ошибки);
			
			ДатаПРД = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ТекущийДокумент, ПутьПРД + "Дата");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(НовыйПРД, "ДатаПРД", ДатаФНС(ДатаПРД), , Ошибки);
			
			СуммаПРД = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ТекущийДокумент, ПутьПРД + "Сумма");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(НовыйПРД, "СуммаПРД", СуммаПРД, , Ошибки);
			
			СвСчФакт.СвПРД.Добавить(НовыйПРД);
		КонецЦикла;	
	КонецЕсли;
	
	// Документы об отгрузке.
	НаименованиеДокументаОснования = "Счет-фактура и документ об отгрузке товаров (выполнении работ), передаче имущественных прав (документ об оказании услуг)";
	ДокументыОбОтгрузке = ДеревоДанных.Строки.Найти(Путь + "ДокументыОбОтгрузке", "ПолныйПуть", Истина);
	Если ЗначениеЗаполнено(ДокументыОбОтгрузке.Значение) Тогда
		ДокументыПуть = Путь + "ДокументыОбОтгрузке.НомерСтроки.ДокументОбОтгрузке";
		Для Каждого ТекущийДокумент Из ДокументыОбОтгрузке.Строки Цикл
	        НовыйДокумент = ПолучитьОбъектТипаCML("РеквДокТип", ПространствоИмен);
			ЗаполнитьРеквизитыДокументаУПД_5_02(НовыйДокумент, 
				ТекущийДокумент, 
				Ошибки, 
				ПространствоИмен, 
				ДокументыПуть,
				Истина);
			Если ФункцияУПД = СЧФДОП() Тогда
				НаименованиеДокументаОснования = НовыйДокумент.РеквНаимДок;
			КонецЕсли;
			СвСчФакт.ДокПодтвОтгрНом.Добавить(НовыйДокумент);
	    КонецЦикла;
	КонецЕсли;
	
	Если ФункцияУПД = СЧФДОП() И СвСчФакт.ДокПодтвОтгрНом.Количество() = 0 Тогда
		НовыйДокумент = ПолучитьОбъектТипаCML("РеквДокТип", ПространствоИмен);
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(НовыйДокумент, "РеквНаимДок", НаименованиеДокументаОснования, , Ошибки);
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(НовыйДокумент, "РеквНомерДок", НомерДок, , Ошибки);
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(НовыйДокумент, "РеквДатаДок", ДатаФНС(ДатаДок), , Ошибки);
		СвСчФакт.ДокПодтвОтгрНом.Добавить(НовыйДокумент);
	КонецЕсли;
	
	ПоФактХЖ = "";
	Если ФункцияУПД = СвРК() Тогда
		ПоФактХЖ = "Документ, включающий в себя сведения о факте реализации комиссионером (агентом, действующим от собственного имени) товаров комитента (принципала)";
	ИначеЕсли ФункцияУПД = СвЗК() Тогда
		ПоФактХЖ = "Документ, включающий в себя сведения о факте закупки комиссионером (агентом, действующим от собственного имени) товаров для комитента (принципала)";
	ИначеЕсли ФункцияУПД = ДОП() Или ФункцияУПД = СЧФДОП() Тогда
		ПоФактХЖ = "Документ об отгрузке товаров (выполнении работ), передаче имущественных прав (документ об оказании услуг)";
	КонецЕсли;
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Документ, "ПоФактХЖ", ПоФактХЖ, , Ошибки);

	НаимДокОпр = "";
	Если ФункцияУПД = СЧФДОП() Тогда
		НаимДокОпр = НаименованиеДокументаОснования;
	ИначеЕсли ФункцияУПД = ДОП() Тогда
		НаимДокОпр = "Документ об отгрузке товаров (выполнении работ), передаче имущественных прав (Документ об оказании услуг)";
	ИначеЕсли ФункцияУПД = СвРК() Тогда
		НаимДокОпр = "Документ, включающий в себя сведения о факте реализации комиссионером (агентом, действующим от собственного имени), товаров комитента (принципала)";
	ИначеЕсли ФункцияУПД = СвЗК() Тогда
		НаимДокОпр = "Документ, включающий в себя сведения о факте закупки комиссионером (агентом, действующим от собственного имени) товара для комитента (принципала)";
	КонецЕсли;
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Документ, "НаимДокОпр", НаимДокОпр, , Ошибки);
		
	// Валюта.
	Валюта = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, Путь + "Валюта");
	Если ЗначениеЗаполнено(Валюта) Тогда
		СвойствоДенИзм = СвСчФакт.Свойства().Получить("ДенИзм");
		ДенИзм = ПолучитьОбъектТипаCML(СвойствоДенИзм.Тип, ПространствоИмен);
		ВалютаПуть = Путь + "Валюта.";
		
		Код = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, ВалютаПуть + "Код");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДенИзм, "КодОКВ", Код, Истина, Ошибки);
		
		Наименование = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, ВалютаПуть + "Наименование");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДенИзм, "НаимОКВ", Наименование, Истина, Ошибки);
		
		Курс = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, ВалютаПуть + "Курс");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДенИзм, "КурсВал", Курс, , Ошибки);
		
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвСчФакт, "ДенИзм", ДенИзм, , Ошибки);	
	КонецЕсли;
	
	// Дополнительные сведения об участниках.
	ДополнительныеСведенияОбУчастниках = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
		ДеревоДанных, Путь + "ДополнительныеСведенияОбУчастниках");
	Если ЗначениеЗаполнено(ДополнительныеСведенияОбУчастниках) Тогда	
		СвойствоДопСвФХЖ1 = СвСчФакт.Свойства().Получить("ДопСвФХЖ1");
		ДопСвФХЖ1 = ПолучитьОбъектТипаCML(СвойствоДопСвФХЖ1.Тип, ПространствоИмен);
		ДопСведенияОбУчастникахПуть = Путь + "ДополнительныеСведенияОбУчастниках.";
		
		ИдентификаторГосКонтракта = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
			ДеревоДанных, ДопСведенияОбУчастникахПуть + "ИдентификаторГосКонтракта");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСвФХЖ1, "ИдГосКон", ИдентификаторГосКонтракта, , Ошибки);
		
		ОбстоятельстваФормированияСФ = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
			ДеревоДанных, ДопСведенияОбУчастникахПуть + "ОбстоятельстваФормированияСФ");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСвФХЖ1, "СпОбстФСЧФ", ОбстоятельстваФормированияСФ, , Ошибки);
		
		СпециальныеОбстоятельстваФормированияУПД = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
			ДеревоДанных, ДопСведенияОбУчастникахПуть + "СпециальныеОбстоятельстваФормированияУПД");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСвФХЖ1, "СпОбстФСЧФДОП", СпециальныеОбстоятельстваФормированияУПД, , Ошибки);

		СпециальныеОбстоятельстваФормированияДокумента = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
			ДеревоДанных, ДопСведенияОбУчастникахПуть + "СпециальныеОбстоятельстваФормированияДокумента");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСвФХЖ1, "СпОбстФДОП", СпециальныеОбстоятельстваФормированияДокумента, , Ошибки);
		
		ВидыОбязательств = ДеревоДанных.Строки.Найти(ДопСведенияОбУчастникахПуть + "ВидыОбязательств", "ПолныйПуть", Истина);
		Если ЗначениеЗаполнено(ВидыОбязательств.Значение) Тогда
			СвойствоВидОбяз = ДопСвФХЖ1.Свойства().Получить("ВидОбяз");
			ВидыОбязательствПуть = ДопСведенияОбУчастникахПуть + "ВидыОбязательств.НомерСтроки.";
			Для Каждого ТекущийВид Из ВидыОбязательств.Строки Цикл
		        ВидОбяз = ПолучитьОбъектТипаCML(СвойствоВидОбяз.Тип, ПространствоИмен);
				
				КодВида = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ТекущийВид, ВидыОбязательствПуть + "КодВида");
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ВидОбяз, "КодВидОбяз", КодВида, , Ошибки);
				
				НаименованиеВида = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ТекущийВид, ВидыОбязательствПуть + "НаименованиеВида");
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ВидОбяз, "НаимВидОбяз", НаименованиеВида, , Ошибки);
				
				ДопСвФХЖ1.ВидОбяз.Добавить(ВидОбяз);
		    КонецЦикла;
		КонецЕсли;
		
		СведенияОГосКонтракте = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
			ДеревоДанных, ДопСведенияОбУчастникахПуть + "СведенияОГосКонтракте");
		Если ЗначениеЗаполнено(СведенияОГосКонтракте) Тогда
			СвойствоИнфПродЗаГосКазн = ДопСвФХЖ1.Свойства().Получить("ИнфПродЗаГосКазн");
			ИнфПродЗаГосКазн = ПолучитьОбъектТипаCML(СвойствоИнфПродЗаГосКазн.Тип, ПространствоИмен);
			СведенияОГосКонтрактеПуть = ДопСведенияОбУчастникахПуть + "СведенияОГосКонтракте.";
			
			ДатаКонтракта = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ДеревоДанных, СведенияОГосКонтрактеПуть + "ДатаКонтракта");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИнфПродЗаГосКазн, "ДатаГосКонт", ДатаФНС(ДатаКонтракта), Истина, Ошибки);
			
			НомерКонтракта = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ДеревоДанных, СведенияОГосКонтрактеПуть + "НомерКонтракта");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИнфПродЗаГосКазн, "НомерГосКонт", НомерКонтракта, Истина, Ошибки);
			
			НомерСчетаПродавца = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ДеревоДанных, СведенияОГосКонтрактеПуть + "НомерСчетаПродавца");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИнфПродЗаГосКазн, "ЛицСчетПрод", НомерСчетаПродавца, , Ошибки);
			
			КодПоБюджетнойКлассификации = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ДеревоДанных, СведенияОГосКонтрактеПуть + "КодПоБюджетнойКлассификации");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИнфПродЗаГосКазн, "КодПродБюджКласс", КодПоБюджетнойКлассификации, , Ошибки);
			
			КодЦели = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ДеревоДанных, СведенияОГосКонтрактеПуть + "КодЦели");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИнфПродЗаГосКазн, "КодЦелиПрод", КодЦели, , Ошибки);
			
			КодТерриториальногоОргана = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ДеревоДанных, СведенияОГосКонтрактеПуть + "КодТерриториальногоОргана");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИнфПродЗаГосКазн, "КодКазначПрод", КодТерриториальногоОргана, , Ошибки);
			
			НаименованиеТерриториальногоОргана = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ДеревоДанных, СведенияОГосКонтрактеПуть + "НаименованиеТерриториальногоОргана");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИнфПродЗаГосКазн, "НаимКазначПрод", НаименованиеТерриториальногоОргана, , Ошибки);
			
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСвФХЖ1, "ИнфПродЗаГосКазн", ИнфПродЗаГосКазн, , Ошибки);
		КонецЕсли;
		
		СведенияОФакторе = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
			ДеревоДанных, ДопСведенияОбУчастникахПуть + "СведенияОФакторе");
		Если ЗначениеЗаполнено(СведенияОФакторе) Тогда
			ФакторПуть = ДопСведенияОбУчастникахПуть + "СведенияОФакторе";
			СведенияФактора = ПолучитьОбъектТипаCML("УчастникТип", ПространствоИмен);
			ЗаполнитьСведенияОбУчастникеУПД_5_02(СведенияФактора, ДеревоДанных, Ошибки, ПространствоИмен, ФакторПуть);
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСвФХЖ1, "СвФактор", СведенияФактора, , Ошибки);
		КонецЕсли;
		
		ОснованиеУступкиДенежногоТребования = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
			ДеревоДанных, ДопСведенияОбУчастникахПуть + "ОснованиеУступкиДенежногоТребования");
		Если ЗначениеЗаполнено(ОснованиеУступкиДенежногоТребования) Тогда
			ОснованиеУступкиПуть = ДопСведенияОбУчастникахПуть + "ОснованиеУступкиДенежногоТребования";
			ОснованиеУступки = ПолучитьОбъектТипаCML("РеквДокТип", ПространствоИмен);
			ЗаполнитьРеквизитыДокументаУПД_5_02(ОснованиеУступки, ДеревоДанных, Ошибки, ПространствоИмен, ОснованиеУступкиПуть);
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСвФХЖ1, "ОснУстДенТреб", ОснованиеУступки, , Ошибки);
		КонецЕсли;
		
		СопроводительныеДокументы = ДеревоДанных.Строки.Найти(
			ДопСведенияОбУчастникахПуть + "СопроводительныеДокументы", "ПолныйПуть", Истина);
		Если ЗначениеЗаполнено(СопроводительныеДокументы.Значение) Тогда
			ДокументыПуть = ДопСведенияОбУчастникахПуть + "СопроводительныеДокументы.НомерСтроки.СопроводительныйДокумент";
			Для Каждого ТекущийДокумент Из СопроводительныеДокументы.Строки Цикл
		        НовыйДокумент = ПолучитьОбъектТипаCML("РеквДокТип", ПространствоИмен);
				ЗаполнитьРеквизитыДокументаУПД_5_02(НовыйДокумент, ТекущийДокумент, Ошибки, ПространствоИмен, ДокументыПуть);
				ДопСвФХЖ1.СопрДокФХЖ.Добавить(НовыйДокумент);
		    КонецЦикла;
		КонецЕсли;
		
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвСчФакт, "ДопСвФХЖ1", ДопСвФХЖ1, , Ошибки);
	КонецЕсли;
	
	// Информационное поле ФХЖ. 
	ИнформационноеПолеФХЖ1 = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
		ДеревоДанных, Путь + "ИнформационноеПолеФХЖ");
	Если ЗначениеЗаполнено(ИнформационноеПолеФХЖ1) Тогда
		СвойствоИнфПолФХЖ1 = СвСчФакт.Свойства().Получить("ИнфПолФХЖ1");
		ИнфПолФХЖ1 = ПолучитьОбъектТипаCML(СвойствоИнфПолФХЖ1.Тип, ПространствоИмен);
		ПутьИнфПолФХЖ1 = Путь + "ИнформационноеПолеФХЖ.";
			
		ИдентификаторФайла = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
			ДеревоДанных, ПутьИнфПолФХЖ1 + "ИдентификаторФайла");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИнфПолФХЖ1, "ИдФайлИнфПол", ИдентификаторФайла, , Ошибки);	
			
		ТекстоваяИнформация = ДеревоДанных.Строки.Найти(ПутьИнфПолФХЖ1 + "ТекстоваяИнформация", "ПолныйПуть", Истина);
		Если ЗначениеЗаполнено(ТекстоваяИнформация.Значение) Тогда
			ТекстоваяИнформацияПуть = ПутьИнфПолФХЖ1 + "ТекстоваяИнформация.НомерСтроки.";
			Для Каждого ТекущаяСтрока Из ТекстоваяИнформация.Строки Цикл
		        ТекстИнф = ПолучитьОбъектТипаCML("ТекстИнфТип", ПространствоИмен);
				
				Идентификатор = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ТекущаяСтрока, ТекстоваяИнформацияПуть + "Идентификатор");
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТекстИнф, "Идентиф", Идентификатор, Истина, Ошибки);
				
				Значение = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ТекущаяСтрока, ТекстоваяИнформацияПуть + "Значение");
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТекстИнф, "Значен", Значение, Истина, Ошибки);
				
				ИнфПолФХЖ1.ТекстИнф.Добавить(ТекстИнф);
		    КонецЦикла;
		КонецЕсли;	
			
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвСчФакт, "ИнфПолФХЖ1", ИнфПолФХЖ1, , Ошибки);	
	КонецЕсли;		
	
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Документ, "СвСчФакт", СвСчФакт, Истина, Ошибки);
	
	// Таблица счета-Фактуры.
	СвойствоТаблСчФакт = Документ.Свойства().Получить("ТаблСчФакт");
	ТаблСчФакт = ПолучитьОбъектТипаCML(СвойствоТаблСчФакт.Тип, ПространствоИмен);
	Путь = "ТаблицаСчетаФактуры.";
	
	СпецОбстоятельстваФормированияСЧФ = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
		ДеревоДанных, 
		"СведенияОСчетеФактуре.ДополнительныеСведенияОбУчастниках.ОбстоятельстваФормированияСФ", 
		Ложь,
		,
		Истина);
	
	ЭтоАванс = ЭтоАвансУПД_5_02(СпецОбстоятельстваФормированияСЧФ);
	СодержитСчетФактуру = СодержитСчетФактуруУПД_5_02(ФункцияУПД);
	
	// Сведения об отгруженных позициях.
	СведенияОбОтгруженныхПозициях = ДеревоДанных.Строки.Найти(Путь + "СведенияОбОтгруженныхПозициях", "ПолныйПуть", Истина);
	Если ЗначениеЗаполнено(СведенияОбОтгруженныхПозициях.Значение) Тогда
	    СвойствоСведТов = ТаблСчФакт.Свойства().Получить("СведТов");
		ПутьОтгруженнойПозиции = Путь + "СведенияОбОтгруженныхПозициях.НомерСтроки.";
		
		Для Каждого ТекущаяСтрока Из СведенияОбОтгруженныхПозициях.Строки Цикл
		    СведТов = ПолучитьОбъектТипаCML(СвойствоСведТов.Тип, ПространствоИмен);
			
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведТов, "НомСтр", ТекущаяСтрока.Значение, Истина, Ошибки);
			
			Наименование = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "Наименование");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведТов, "НаимТов", Наименование, , Ошибки);
			
			ЕдиницаИзмеренияКод = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "ЕдиницаИзмеренияКод");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведТов, "ОКЕИ_Тов", ЕдиницаИзмеренияКод, , Ошибки);
			
			ЕдиницаИзмеренияНаименование = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "ЕдиницаИзмеренияНаименование");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведТов, "НаимЕдИзм", ЕдиницаИзмеренияНаименование, , Ошибки);
			
			Количество = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "Количество");
			Если (СодержитСчетФактуру И Не ЭтоАванс) Или Количество > 0 Тогда
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведТов, "КолТов", Количество,
					(СодержитСчетФактуру И Не ЭтоАванс) И ЗначениеЗаполнено(ЕдиницаИзмеренияКод), Ошибки);
			КонецЕсли;
			
			Цена = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "Цена");
			Если (СодержитСчетФактуру И Не ЭтоАванс) Или Цена > 0 Тогда
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведТов, "ЦенаТов", Цена, СодержитСчетФактуру И Не ЭтоАванс, Ошибки);
			КонецЕсли;
			
			СтоимостьСНалогом = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "СтоимостьСНалогом");
			
			СтоимостьБезНалога = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "СтоимостьБезНалога");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведТов, 
				"СтТовБезНДС", 
				СтоимостьБезНалога, 
				СтоимостьТовараОбязательнаУПД_5_02(ФункцияУПД, СпециальныеОбстоятельстваФормированияДокумента, СтоимостьСНалогом), 
				Ошибки);
			
			НалоговаяСтавка = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "НалоговаяСтавка");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведТов, "НалСт", СтавкаНДСXDTO(НалоговаяСтавка), Истина, Ошибки);
			
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведТов, 
				"СтТовУчНал",
				СтоимостьСНалогом, 
				СтоимостьТовараОбязательнаУПД_5_02(ФункцияУПД, СпециальныеОбстоятельстваФормированияДокумента, СтоимостьБезНалога),
				Ошибки);
				
			СвойствоДопСведТов = СведТов.Свойства().Получить("ДопСведТов");
			ДопСведТов = ПолучитьОбъектТипаCML(СвойствоДопСведТов.Тип, ПространствоИмен);
			
			Признак = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "Признак");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "ПрТовРаб", Признак, , Ошибки);
			
			ИнформацияОПризнаке = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "ИнформацияОПризнаке");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "ДопПризн", ИнформацияОПризнаке, , Ошибки);
			
			СтранаПроисхождения = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "СтранаПроисхождения");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "КрНаимСтрПр", СтранаПроисхождения, , Ошибки);

			ЗаказанноеКоличество = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "ЗаказанноеКоличество");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "НадлОтп", ЗаказанноеКоличество, , Ошибки);
			
			Характеристика = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "Характеристика");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "ХарактерТов", Характеристика, , Ошибки);
			
			Сорт = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "Сорт");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "СортТов", Сорт, , Ошибки);
			
			Серия = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "Серия");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "СерияТов", Серия, , Ошибки);
			
			Артикул = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "Артикул");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "АртикулТов", Артикул, , Ошибки);
			
			Код = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "Код");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "КодТов", Код, , Ошибки);
			
			ГТИН = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "ГТИН");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "ГТИН", ГТИН, , Ошибки);
			
			КодКаталога = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "КодКаталога");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "КодКат", КодКаталога, , Ошибки);
			
			КодВидаТовара = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "КодВидаТовара");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "КодВидТов", КодВидаТовара, , Ошибки);
			
			КодВидаПродукции = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "КодВидаПродукции");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "КодВидПр", КодВидаПродукции, , Ошибки);
			
			КодПоОКДП2 = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "КодПоОКДП2");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "КодТовОКДП2", КодПоОКДП2, , Ошибки);
			
			ДополнительнаяИнформация = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "ДополнительнаяИнформация");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "ДопИнфПВидО", ДополнительнаяИнформация, , Ошибки);
			
			СопроводительныеДокументы = ТекущаяСтрока.Строки.Найти(ПутьОтгруженнойПозиции + "СопроводительныеДокументы", "ПолныйПуть", Истина);
			Если ЗначениеЗаполнено(СопроводительныеДокументы.Значение) Тогда
			    ДокументыПуть = ПутьОтгруженнойПозиции + "СопроводительныеДокументы.НомерСтроки.СопроводительныйДокумент";
				Для Каждого ТекущийДокумент Из СопроводительныеДокументы.Строки Цикл
			        НовыйДокумент = ПолучитьОбъектТипаCML("РеквДокТип", ПространствоИмен);
					ЗаполнитьРеквизитыДокументаУПД_5_02(НовыйДокумент, ТекущийДокумент, Ошибки, ПространствоИмен, ДокументыПуть);
					ДопСведТов.СопрДокТов.Добавить(НовыйДокумент);
			    КонецЦикла;
			КонецЕсли;
			
			ДанныеДляРасчетаАмортизации = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "ДанныеДляРасчетаАмортизации");
			Если ЗначениеЗаполнено(ДанныеДляРасчетаАмортизации) Тогда
			    СвойствоНалУчАморт = ДопСведТов.Свойства().Получить("НалУчАморт");
				НалУчАморт = ПолучитьОбъектТипаCML(СвойствоНалУчАморт.Тип, ПространствоИмен);
			    ПутьАмортизации = ПутьОтгруженнойПозиции + "ДанныеДляРасчетаАмортизации.";
				
				АмортизационнаяГруппа = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ТекущаяСтрока, ПутьАмортизации + "АмортизационнаяГруппа");
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(НалУчАморт, "АмГруппа", АмортизационнаяГруппа, Истина, Ошибки);
				
				КодОКОФ = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ТекущаяСтрока, ПутьАмортизации + "КодОКОФ");
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(НалУчАморт, "КодОКОФ", КодОКОФ, Истина, Ошибки);
				
				СрокИспользования = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ТекущаяСтрока, ПутьАмортизации + "СрокИспользования");
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(НалУчАморт, "СрПолИспОС", СрокИспользования, Истина, Ошибки);
				
				ФактическийСрокИспользования = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ТекущаяСтрока, ПутьАмортизации + "ФактическийСрокИспользования");
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(НалУчАморт, "ФактСрокИсп", ФактическийСрокИспользования, Истина, Ошибки);
				
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "НалУчАморт", НалУчАморт, , Ошибки);
			КонецЕсли;	
				
			СуммаВосстановленногоНалога = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "СуммаВосстановленногоНалога");
			Если ЗначениеЗаполнено(СуммаВосстановленногоНалога) Тогда	
				Налог = ПолучитьОбъектТипаCML("СумНДСТип", ПространствоИмен);
				
				БезНДС = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ТекущаяСтрока, ПутьОтгруженнойПозиции + "СуммаВосстановленногоНалога.БезНДС");
				Если ЗначениеЗаполнено(БезНДС) Тогда	
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Налог, "БезНДС", "без НДС", , Ошибки);	
				КонецЕсли;
				
				Сумма = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ТекущаяСтрока, ПутьОтгруженнойПозиции + "СуммаВосстановленногоНалога.Сумма");
				Если ЗначениеЗаполнено(Сумма) Тогда	
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Налог, "СумНал", Сумма, , Ошибки);	
				КонецЕсли;
				
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "СумНалВосст", Налог, , Ошибки);
			КонецЕсли;	
				
			СведенияОПрослеживаемости = ТекущаяСтрока.Строки.Найти(ПутьОтгруженнойПозиции + "СведенияОПрослеживаемости", "ПолныйПуть", Истина);
			ЕстьПрослеживаемость = ЗначениеЗаполнено(СведенияОПрослеживаемости.Значение) И СведенияОПрослеживаемости.Строки.Количество();
			Если ЕстьПрослеживаемость Тогда
				СвойствоСведПрослеж = ДопСведТов.Свойства().Получить("СведПрослеж");
				ПрослеживаемостьПуть = ПутьОтгруженнойПозиции + "СведенияОПрослеживаемости.НомерСтроки.";
				НомерПоПорядку = 0;
				
				Для Каждого ТекущаяПрослеживаемость Из СведенияОПрослеживаемости.Строки Цикл
					НомерПоПорядку = НомерПоПорядку + 1;
					СведПрослеж = ПолучитьОбъектТипаCML(СвойствоСведПрослеж.Тип, ПространствоИмен);
					ПрефиксСведений = СтрШаблон("ДопПрослеж%1", НомерПоПорядку);
					
				    НомерТовара = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущаяПрослеживаемость, ПрослеживаемостьПуть + "НомерТовара");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведПрослеж, "НомТовПрослеж", НомерТовара, Истина, Ошибки);
					
					ЕдиницаИзмеренияКод = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущаяПрослеживаемость, ПрослеживаемостьПуть + "ЕдиницаИзмеренияКод");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведПрослеж, "ЕдИзмПрослеж", ЕдиницаИзмеренияКод, Истина, Ошибки);
					
					ЕдиницаИзмеренияНаименование = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущаяПрослеживаемость, ПрослеживаемостьПуть + "ЕдиницаИзмеренияНаименование");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведПрослеж, "НаимЕдИзмПрослеж", ЕдиницаИзмеренияНаименование, Истина, Ошибки);
					
					Количество = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущаяПрослеживаемость, ПрослеживаемостьПуть + "Количество");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведПрослеж, "КолВЕдПрослеж", Количество, Истина, Ошибки);
					
					СтоимостьБезНДС = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущаяПрослеживаемость, ПрослеживаемостьПуть + "СтоимостьБезНДС");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведПрослеж, "СтТовБезНДСПрослеж", СтоимостьБезНДС, Истина, Ошибки);
					
					ДополнительнаяИнформация = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущаяПрослеживаемость, ПрослеживаемостьПуть + "ДополнительнаяИнформация");
					Если ЗначениеЗаполнено(ДополнительнаяИнформация) Тогда
						РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведПрослеж, "ДопИнфПрослеж", ДополнительнаяИнформация, , Ошибки);
					Иначе
					    РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведПрослеж, "ДопИнфПрослеж", ПрефиксСведений, , Ошибки);
					КонецЕсли;
					
					ТекстИнф = ПолучитьОбъектТипаCML("ТекстИнфТип", ПространствоИмен);
					Идентификатор = СтрШаблон("%1_КолУчетное", ПрефиксСведений);
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТекстИнф, "Идентиф", Идентификатор, Истина, Ошибки);
					Значение = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущаяПрослеживаемость, ПрослеживаемостьПуть + "КоличествоУчетное");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТекстИнф, "Значен", Значение, Истина, Ошибки);
					СведТов.ИнфПолФХЖ2.Добавить(ТекстИнф);
					
					ТекстИнф = ПолучитьОбъектТипаCML("ТекстИнфТип", ПространствоИмен);
					Идентификатор = СтрШаблон("%1_СтТовПрослежБезНДС", ПрефиксСведений);
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТекстИнф, "Идентиф", Идентификатор, Истина, Ошибки);
					Значение = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущаяПрослеживаемость, ПрослеживаемостьПуть + "СтоимостьБезНДС");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТекстИнф, "Значен", Значение, Истина, Ошибки);
					СведТов.ИнфПолФХЖ2.Добавить(ТекстИнф);
					
					ДопСведТов.СведПрослеж.Добавить(СведПрослеж);
			    КонецЦикла;
			КонецЕсли;
			
			СведенияОДекларации = ТекущаяСтрока.Строки.Найти(ПутьОтгруженнойПозиции + "СведенияОДекларации", "ПолныйПуть", Истина);
			Если ЗначениеЗаполнено(СведенияОДекларации.Значение) Тогда
			    СвойствоСвДТ = СведТов.Свойства().Получить("СвДТ");
				ПутьДекларации = ПутьОтгруженнойПозиции + "СведенияОДекларации.НомерСтроки.";
			
			    Для Каждого ТекущаяДекларация Из СведенияОДекларации.Строки Цикл
			    	СвДТ = ПолучитьОбъектТипаCML(СвойствоСвДТ.Тип, ПространствоИмен);
					
					КодСтраны = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущаяДекларация, ПутьДекларации + "КодСтраны");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвДТ, "КодПроисх", КодСтраны, , Ошибки);
					
					НомерДекларации = ?(ЕстьПрослеживаемость, "Прослеж",
						ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущаяДекларация, ПутьДекларации + "НомерДекларации"));
						
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвДТ, "НомерДТ", НомерДекларации, , Ошибки);
					
					СведТов.СвДТ.Добавить(СвДТ);
				КонецЦикла;	
			КонецЕсли;
			
			СведенияОМаркировке = ТекущаяСтрока.Строки.Найти(ПутьОтгруженнойПозиции + "СведенияОМаркировке", "ПолныйПуть", Истина);
			Если ЗначениеЗаполнено(СведенияОМаркировке.Значение) Тогда
			    СвойствоМаркировка = ДопСведТов.Свойства().Получить("НомСредИдентТов");
				МаркировкаПуть = ПутьОтгруженнойПозиции + "СведенияОМаркировке.НомерСтроки.";
				ИдентификаторПуть = МаркировкаПуть + "Идентификатор.";
				
				Для Каждого ТекущаяМаркировка Из СведенияОМаркировке.Строки Цикл
	    			Маркировка = ПолучитьОбъектТипаCML(СвойствоМаркировка.Тип, ПространствоИмен);
					
					ИдентификаторУпаковки = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущаяМаркировка, МаркировкаПуть + "ИдентификаторУпаковки");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Маркировка, "ИдентТрансУпак", ИдентификаторУпаковки, , Ошибки);
					
					Количество = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущаяМаркировка, МаркировкаПуть + "Количество");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Маркировка, "КолВедМарк", Количество, , Ошибки);
					
					Партия = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущаяМаркировка, МаркировкаПуть + "Партия");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Маркировка, "ПрПартМарк", Партия, , Ошибки);
					
					КонтрольныеЗнаки = ТекущаяМаркировка.Строки.Найти(ИдентификаторПуть + "КонтрольныеЗнаки", "ПолныйПуть", Истина);
					Если ЗначениеЗаполнено(КонтрольныеЗнаки.Значение) Тогда
						ПутьКИЗ = ИдентификаторПуть + "КонтрольныеЗнаки.НомерСтроки.";
				
						Для Каждого ТекущийКИЗ Из КонтрольныеЗнаки.Строки Цикл
							
							КонтрольныйЗнак = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
								ТекущийКИЗ, ПутьКИЗ + "КонтрольныйЗнак");
							
							Маркировка.КИЗ.Добавить(КонтрольныйЗнак);
						КонецЦикла;
					КонецЕсли;
					
					ИдентификаторыУпаковок = ТекущаяМаркировка.Строки.Найти(ИдентификаторПуть + "ИдентификаторыУпаковок", "ПолныйПуть", Истина);
					Если ЗначениеЗаполнено(ИдентификаторыУпаковок.Значение) Тогда
						ПутьНомУпак = ИдентификаторПуть + "ИдентификаторыУпаковок.НомерСтроки.";
						
						Для Каждого ТекущийИдентификаторУпаковки Из ИдентификаторыУпаковок.Строки Цикл
						
							ИдентификаторУпаковки = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
								ТекущийИдентификаторУпаковки, ПутьНомУпак + "ИдентификаторУпаковки");
							
							Маркировка.НомУпак.Добавить(ИдентификаторУпаковки);
				        КонецЦикла;
					КонецЕсли;
					
			        ДопСведТов.НомСредИдентТов.Добавить(Маркировка);
				КонецЦикла;	
			КонецЕсли;
			
			ДополнительныеСведенияГИС = ТекущаяСтрока.Строки.Найти(ПутьОтгруженнойПозиции + "ДополнительныеСведенияГИС", "ПолныйПуть", Истина);
			Если ЗначениеЗаполнено(ДополнительныеСведенияГИС.Значение) Тогда
			    СвойствоСвГосСист = ДопСведТов.Свойства().Получить("СвГосСист");
				ПутьГИС = ПутьОтгруженнойПозиции + "ДополнительныеСведенияГИС.НомерСтроки.";
			
			    Для Каждого ТекущаяСтрокаГИС Из ДополнительныеСведенияГИС.Строки Цикл
	    			СвГосСист = ПолучитьОбъектТипаCML(СвойствоСвГосСист.Тип, ПространствоИмен);
					
					НаименованиеГИС = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущаяСтрокаГИС, ПутьГИС + "НаименованиеГИС");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвГосСист, "НаимГосСист", НаименованиеГИС, Истина, Ошибки);
					
					УчетнаяЕдиницаГИС = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущаяСтрокаГИС, ПутьГИС + "УчетнаяЕдиницаГИС");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвГосСист, "УчетЕд", УчетнаяЕдиницаГИС, , Ошибки);
					
					ИнаяИнформация = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущаяСтрокаГИС, ПутьГИС + "ИнаяИнформация");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвГосСист, "ИнаяИнф", ИнаяИнформация, , Ошибки);
					
					ИдентификационныеНомераУчетныхЕдиницГИС = ТекущаяСтрокаГИС.Строки.Найти(
						ПутьГИС + "ИдентификационныеНомераУчетныхЕдиницГИС", "ПолныйПуть", Истина);
					Если ЗначениеЗаполнено(ИдентификационныеНомераУчетныхЕдиницГИС.Значение) Тогда
					    СвойствоИдНомУчетЕд = СвГосСист.Свойства().Получить("ИдНомУчетЕд");
						ПутьИдНомУчетЕд = ПутьГИС + "ИдентификационныеНомераУчетныхЕдиницГИС.НомерСтроки.";
						
						Для Каждого ТекущийИдНомУчетЕд Из ИдентификационныеНомераУчетныхЕдиницГИС.Строки Цикл
						    ИдНомУчетЕд = ПолучитьОбъектТипаCML(СвойствоИдНомУчетЕд.Тип, ПространствоИмен);
							
							ИдентификационныйНомер = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
								ТекущийИдНомУчетЕд, ПутьИдНомУчетЕд + "ИдентификационныйНомер");
							РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИдНомУчетЕд, "ИдНомУчетЕд", ИдентификационныйНомер, Истина, Ошибки);
							
							СвГосСист.ИдНомУчетЕд.Добавить(ИдНомУчетЕд);
						КонецЦикла;
					КонецЕсли;						
						
					ДопСведТов.СвГосСист.Добавить(СвГосСист);
			    КонецЦикла;
			КонецЕсли;
			
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведТов, "ДопСведТов", ДопСведТов, , Ошибки);
			
			СуммаАкциза = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "СуммаАкциза");
			Если ЗначениеЗаполнено(СуммаАкциза) Тогда	
				Акциз = ПолучитьОбъектТипаCML("СумАкцизТип", ПространствоИмен);
				
				БезАкциза = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ТекущаяСтрока, ПутьОтгруженнойПозиции + "СуммаАкциза.БезАкциза");
				Если ЗначениеЗаполнено(БезАкциза) Тогда	
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Акциз, "БезАкциз", "без акциза", , Ошибки);	
				КонецЕсли;
				
				Сумма = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ТекущаяСтрока, ПутьОтгруженнойПозиции + "СуммаАкциза.Сумма");
				Если ЗначениеЗаполнено(Сумма) Тогда	
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Акциз, "СумАкциз", Сумма, , Ошибки);	
				КонецЕсли;
				
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведТов, "Акциз", Акциз, , Ошибки);
			КонецЕсли;	
			
			СуммаНалога = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "СуммаНалога");
			Если ЗначениеЗаполнено(СуммаНалога) Тогда	
				Налог = ПолучитьОбъектТипаCML("СумНДСТип", ПространствоИмен);
				
				БезНДС = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ТекущаяСтрока, ПутьОтгруженнойПозиции + "СуммаНалога.БезНДС");
				Если ЗначениеЗаполнено(БезНДС) Тогда	
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Налог, "БезНДС", "без НДС", , Ошибки);	
				КонецЕсли;
				
				Сумма = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ТекущаяСтрока, ПутьОтгруженнойПозиции + "СуммаНалога.Сумма");
				Если ЗначениеЗаполнено(Сумма) Или Сумма = 0 Тогда
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Налог, "СумНал", Сумма, , Ошибки, Истина);	
				КонецЕсли;
				
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведТов, "СумНал", Налог, , Ошибки, Истина);
			КонецЕсли;
			
			ИнформационноеПолеФХЖ = ТекущаяСтрока.Строки.Найти(ПутьОтгруженнойПозиции + "ИнформационноеПолеФХЖ", "ПолныйПуть", Истина);
			Если ЗначениеЗаполнено(ИнформационноеПолеФХЖ.Значение) Тогда
				ПутьФХЖ = ПутьОтгруженнойПозиции + "ИнформационноеПолеФХЖ.НомерСтроки.";
				Для Каждого ТекущееПоле Из ИнформационноеПолеФХЖ.Строки Цикл
					ТекстИнф = ПолучитьОбъектТипаCML("ТекстИнфТип", ПространствоИмен);
					
					Идентификатор = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущееПоле, ПутьФХЖ + "Идентификатор");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТекстИнф, "Идентиф", Идентификатор, Истина, Ошибки);
					
					Значение = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущееПоле, ПутьФХЖ + "Значение");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТекстИнф, "Значен", Значение, Истина, Ошибки);
					
					СведТов.ИнфПолФХЖ2.Добавить(ТекстИнф);
				КонецЦикла;	
			КонецЕсли;
			
			ДопДанныеПодписанные = ТекущаяСтрока.Строки.Найти(ПутьОтгруженнойПозиции + "ДопДанныеПодписанные", "ПолныйПуть", Истина);
			Если ЗначениеЗаполнено(ДопДанныеПодписанные.Значение) Тогда
				ПутьДопДанные = ПутьОтгруженнойПозиции + "ДопДанныеПодписанные.НомерСтроки.";
				Для Каждого ТекущееПоле Из ДопДанныеПодписанные.Строки Цикл
					ТекстИнф = ПолучитьОбъектТипаCML("ТекстИнфТип", ПространствоИмен);
					
					Идентификатор = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущееПоле, ПутьДопДанные + "Идентификатор");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТекстИнф, "Идентиф", Идентификатор, Истина, Ошибки);
					
					Значение = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущееПоле, ПутьДопДанные + "Значение");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТекстИнф, "Значен", Значение, Истина, Ошибки);
					
					СведТов.ИнфПолФХЖ2.Добавить(ТекстИнф);
				КонецЦикла;	
			КонецЕсли;
			
			ТаблСчФакт.СведТов.Добавить(СведТов);
		КонецЦикла;
	КонецЕсли;
	
	// Всего к оплате.
	ВсегоКОплате = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, Путь + "ВсегоКОплате");
	Если ЗначениеЗаполнено(ВсегоКОплате) Тогда
		СвойствоВсегоОпл = ТаблСчФакт.Свойства().Получить("ВсегоОпл");
		ВсегоОпл = ПолучитьОбъектТипаCML(СвойствоВсегоОпл.Тип, ПространствоИмен);
		ПутьВсегоОпл = Путь + "ВсегоКОплате.";
		
		СтоимостьСНалогом = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
			ДеревоДанных, ПутьВсегоОпл + "СтоимостьСНалогом");
		
		СтоимостьБезНалога = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
			ДеревоДанных, ПутьВсегоОпл + "СтоимостьБезНалога");
			
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ВсегоОпл, 
			"СтТовБезНДСВсего", 
			СтоимостьБезНалога, 
			СтоимостьТовараОбязательнаУПД_5_02(ФункцияУПД, СпециальныеОбстоятельстваФормированияДокумента, СтоимостьСНалогом), 
			Ошибки);
		
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ВсегоОпл, 
			"СтТовУчНалВсего", 
			СтоимостьСНалогом, 
			СтоимостьТовараОбязательнаУПД_5_02(ФункцияУПД, СпециальныеОбстоятельстваФормированияДокумента, СтоимостьБезНалога), 
			Ошибки);
		
		Количество = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
			ДеревоДанных, ПутьВсегоОпл + "Количество");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ВсегоОпл, "КолНеттоВс", Количество, , Ошибки);
		
		СуммаНалога = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
			ДеревоДанных, ПутьВсегоОпл + "СуммаНалога");
		Если ЗначениеЗаполнено(СуммаНалога) Тогда	
			Налог = ПолучитьОбъектТипаCML("СумНДСТип", ПространствоИмен);
			
			БезНДС = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ДеревоДанных, ПутьВсегоОпл + "СуммаНалога.БезНДС");
			Если ЗначениеЗаполнено(БезНДС) Тогда	
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Налог, "БезНДС", "без НДС", , Ошибки);	
			КонецЕсли;
			
			Сумма = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ДеревоДанных, ПутьВсегоОпл + "СуммаНалога.Сумма");
			Если ЗначениеЗаполнено(Сумма) Или Сумма = 0 Тогда
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Налог, "СумНал", Сумма, , Ошибки, Истина);
			КонецЕсли;
			
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ВсегоОпл, "СумНалВсего", Налог, , Ошибки, Истина);
		КонецЕсли;
		
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТаблСчФакт, "ВсегоОпл", ВсегоОпл, , Ошибки);
	КонецЕсли;	
		
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Документ, "ТаблСчФакт", ТаблСчФакт, , Ошибки);
		
	// Сведения о передаче.
	Путь = "СведенияОПередаче";
	СведенияОПередаче = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, Путь);
	Если ЗначениеЗаполнено(СведенияОПередаче) Тогда			
		СвойствоСвПродПер = Документ.Свойства().Получить("СвПродПер");
		СвПродПер = ПолучитьОбъектТипаCML(СвойствоСвПродПер.Тип, ПространствоИмен);
		
		// Операция.
		Операция = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, Путь + ".Операция");
		Если ЗначениеЗаполнено(Операция) Тогда
		    СвойствоСвПер = СвПродПер.Свойства().Получить("СвПер");
			СвПер = ПолучитьОбъектТипаCML(СвойствоСвПер.Тип, ПространствоИмен);
			ОперацияПуть = Путь + ".Операция.";
			
			СодержаниеОперации = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ДеревоДанных, ОперацияПуть + "СодержаниеОперации");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвПер, "СодОпер", СодержаниеОперации, Истина, Ошибки);
			
			ВидОперации = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ДеревоДанных, ОперацияПуть + "ВидОперации");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвПер, "ВидОпер", ВидОперации, , Ошибки);
			
			ДатаОтгрузки = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ДеревоДанных, ОперацияПуть + "ДатаОтгрузки");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвПер, "ДатаПер", ДатаФНС(ДатаОтгрузки), , Ошибки);
			
			ДатаНачалаПоставки = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ДеревоДанных, ОперацияПуть + "ДатаНачалаПоставки");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвПер, "ДатаНачПер", ДатаФНС(ДатаНачалаПоставки), , Ошибки);
			
			ДатаОкончанияПоставки = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ДеревоДанных, ОперацияПуть + "ДатаОкончанияПоставки");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвПер, "ДатаОконПер", ДатаФНС(ДатаОкончанияПоставки), , Ошибки);
			
			ОснованиеОтгрузкиПередачи = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ДеревоДанных, ОперацияПуть + "ОснованиеОтгрузкиПередачи");
			Если ЗначениеЗаполнено(ОснованиеОтгрузкиПередачи) Тогда
				ОснованиеПуть = ОперацияПуть + "ОснованиеОтгрузкиПередачи.";
				
				ДокументыОснования = ДеревоДанных.Строки.Найти(ОснованиеПуть + "ДокументыОснования", "ПолныйПуть", Истина);
				Если ЗначениеЗаполнено(ДокументыОснования.Значение) Тогда
					ДокументыПуть = ОснованиеПуть + "ДокументыОснования.НомерСтроки.ДокументОснование";
					Для Каждого ТекущийДокумент Из ДокументыОснования.Строки Цикл
				        НовыйДокумент = ПолучитьОбъектТипаCML("РеквДокТип", ПространствоИмен);
						ЗаполнитьРеквизитыДокументаУПД_5_02(НовыйДокумент, ТекущийДокумент, Ошибки, ПространствоИмен, ДокументыПуть);
						СвПер.ОснПер.Добавить(НовыйДокумент);
				    КонецЦикла;
				КонецЕсли;
				
				БезДокументаОснования = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ДеревоДанных, ОснованиеПуть + "БезДокументаОснования");
				Если ЗначениеЗаполнено(БезДокументаОснования) Тогда
				    РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвПер, "БезДокОснПер", "1", Истина, Ошибки);
				КонецЕсли;
				
			КонецЕсли;
			
			ЛицоОтветственноеЗаПередачу = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ДеревоДанных, ОперацияПуть + "ЛицоОтветственноеЗаПередачу");
			Если ЗначениеЗаполнено(ЛицоОтветственноеЗаПередачу) Тогда
				СвойствоСвЛицПер = СвПер.Свойства().Получить("СвЛицПер");
				СвЛицПер = ПолучитьОбъектТипаCML(СвойствоСвЛицПер.Тип, ПространствоИмен);
				
				Если ЛицоОтветственноеЗаПередачу = "РаботникПродавца" Тогда
					СвойствоРабОргПрод = СвЛицПер.Свойства().Получить("РабОргПрод");
					РабОргПрод = ПолучитьОбъектТипаCML(СвойствоРабОргПрод.Тип, ПространствоИмен);
			        РаботникПродавцаПуть = ОперацияПуть + "ЛицоОтветственноеЗаПередачу.РаботникПродавца.";
					
					Должность = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ДеревоДанных, РаботникПродавцаПуть + "Должность");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(РабОргПрод, "Должность", Должность, Истина, Ошибки);
					
					ИныеСведения = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ДеревоДанных, РаботникПродавцаПуть + "ИныеСведения");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(РабОргПрод, "ИныеСвед", ИныеСведения, , Ошибки);
					
					ФИО = ПолучитьОбъектТипаCML("ФИОТип", ПространствоИмен);
					ЗаполнитьФИО_УПД_5_02(ФИО, ДеревоДанных, РаботникПродавцаПуть + "ФИО", Ошибки);
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(РабОргПрод, "ФИО", ФИО, Истина, Ошибки);
					
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвЛицПер, "РабОргПрод", РабОргПрод, , Ошибки);
				ИначеЕсли ЛицоОтветственноеЗаПередачу = "ИноеЛицо" Тогда	
					СвойствоИнЛицо = СвЛицПер.Свойства().Получить("ИнЛицо");
					ИнЛицо = ПолучитьОбъектТипаCML(СвойствоИнЛицо.Тип, ПространствоИмен);
					ИноеЛицо = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ДеревоДанных, ОперацияПуть + "ЛицоОтветственноеЗаПередачу.ИноеЛицо");
					
					Если ИноеЛицо = "ПредставительОрганизации" Тогда
						СвойствоПредОргПер = ИнЛицо.Свойства().Получить("ПредОргПер");
						ПредОргПер = ПолучитьОбъектТипаCML(СвойствоПредОргПер.Тип, ПространствоИмен);
						ПредставительОрганизацииПуть = ОперацияПуть + "ЛицоОтветственноеЗаПередачу.ИноеЛицо.ПредставительОрганизации.";
						
						Должность = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
							ДеревоДанных, ПредставительОрганизацииПуть + "Должность");
						РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ПредОргПер, "Должность", Должность, Истина, Ошибки);
						
						ИныеСведения = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
							ДеревоДанных, ПредставительОрганизацииПуть + "ИныеСведения");
						РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ПредОргПер, "ИныеСвед", ИныеСведения, , Ошибки);
						
						НаименованиеОрганизации = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
							ДеревоДанных, ПредставительОрганизацииПуть + "НаименованиеОрганизации");
						РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ПредОргПер, "НаимОргПер", НаименованиеОрганизации, Истина, Ошибки);
						
						ИНН = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
							ДеревоДанных, ПредставительОрганизацииПуть + "ИНН");
						РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ПредОргПер, "ИННЮЛПер", ИНН, , Ошибки);
						
						ОснованиеДоверияОтгрузки = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
							ДеревоДанных, ПредставительОрганизацииПуть + "ОснованиеДоверияОтгрузки");
						Если ЗначениеЗаполнено(ОснованиеДоверияОтгрузки) Тогда
							НовыйДокумент = ПолучитьОбъектТипаCML("РеквДокТип", ПространствоИмен);
							ЗаполнитьРеквизитыДокументаУПД_5_02(
								НовыйДокумент, ДеревоДанных, Ошибки, ПространствоИмен, ПредставительОрганизацииПуть + "ОснованиеДоверияОтгрузки");
							РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ПредОргПер, "ОснДоверОргПер", НовыйДокумент, , Ошибки);
						КонецЕсли;
						
						ОснованиеПолномочийПредставителя = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
							ДеревоДанных, ПредставительОрганизацииПуть + "ОснованиеПолномочийПредставителя");
						Если ЗначениеЗаполнено(ОснованиеПолномочийПредставителя) Тогда
							НовыйДокумент = ПолучитьОбъектТипаCML("РеквДокТип", ПространствоИмен);
							ЗаполнитьРеквизитыДокументаУПД_5_02(
								НовыйДокумент, ДеревоДанных, Ошибки, ПространствоИмен, ПредставительОрганизацииПуть + "ОснованиеПолномочийПредставителя");
							РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ПредОргПер, "ОснПолнПредПер", НовыйДокумент, , Ошибки);
						КонецЕсли;
						
						ФИО = ПолучитьОбъектТипаCML("ФИОТип", ПространствоИмен);
						ЗаполнитьФИО_УПД_5_02(ФИО, ДеревоДанных, ПредставительОрганизацииПуть + "ФИО", Ошибки);
						РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ПредОргПер, "ФИО", ФИО, Истина, Ошибки);
						
						РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИнЛицо, "ПредОргПер", ПредОргПер, , Ошибки);
					ИначеЕсли ИноеЛицо = "ФизическоеЛицо" Тогда	
						СвойствоФЛПер = ИнЛицо.Свойства().Получить("ФЛПер");
						ФЛПер = ПолучитьОбъектТипаCML(СвойствоФЛПер.Тип, ПространствоИмен);
						ФизическоеЛицоПуть = ОперацияПуть + "ЛицоОтветственноеЗаПередачу.ИноеЛицо.ФизическоеЛицо.";
						
						ИНН = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
							ДеревоДанных, ФизическоеЛицоПуть + "ИНН");
						РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ФЛПер, "ИННФЛПер", ИНН, , Ошибки);
						
						ИныеСведения = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
							ДеревоДанных, ФизическоеЛицоПуть + "ИныеСведения");
						РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ФЛПер, "ИныеСвед", ИныеСведения, , Ошибки);
						
						ОснованиеДоверияОтгрузки = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
							ДеревоДанных, ФизическоеЛицоПуть + "ОснованиеДоверияОтгрузки");
						Если ЗначениеЗаполнено(ОснованиеДоверияОтгрузки) Тогда
							НовыйДокумент = ПолучитьОбъектТипаCML("РеквДокТип", ПространствоИмен);
							ЗаполнитьРеквизитыДокументаУПД_5_02(
								НовыйДокумент, ДеревоДанных, Ошибки, ПространствоИмен, ФизическоеЛицоПуть + "ОснованиеДоверияОтгрузки");
							РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ФЛПер, "ОснДоверФЛ", НовыйДокумент, , Ошибки);
						КонецЕсли;
						
						ФИО = ПолучитьОбъектТипаCML("ФИОТип", ПространствоИмен);
						ЗаполнитьФИО_УПД_5_02(ФИО, ДеревоДанных, ФизическоеЛицоПуть + "ФИО", Ошибки);
						РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ФЛПер, "ФИО", ФИО, Истина, Ошибки);
						
						РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИнЛицо, "ФЛПер", ФЛПер, , Ошибки);
					КонецЕсли;
					
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвЛицПер, "ИнЛицо", ИнЛицо, , Ошибки);
				КонецЕсли;
			
			    РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвПер, "СвЛицПер", СвЛицПер, , Ошибки);
			КонецЕсли;
			
			Транспортировка = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ДеревоДанных, ОперацияПуть + "Транспортировка");
			Если ЗначениеЗаполнено(Транспортировка) Тогда
				СвойствоТран = СвПер.Свойства().Получить("Тран");
				Тран = ПолучитьОбъектТипаCML(СвойствоТран.Тип, ПространствоИмен);
				ТранспортировкаПуть = ОперацияПуть + "Транспортировка.";
				ВыводитьГруппуТранспортировка = Ложь;
					
				Сведения = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ДеревоДанных, ТранспортировкаПуть + "Сведения");
				Если ЗначениеЗаполнено(Сведения) Тогда
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Тран, "СвТран", Сведения, , Ошибки);
					ВыводитьГруппуТранспортировка = Истина;
				КонецЕсли;
				
				Инкотермс = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ДеревоДанных, ТранспортировкаПуть + "Инкотермс");
				Если ЗначениеЗаполнено(Инкотермс) Тогда
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Тран, "Инкотермс", Инкотермс, , Ошибки);
					ВыводитьГруппуТранспортировка = Истина;
				КонецЕсли;
				
				ВерсияИнкотермс = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ДеревоДанных, ТранспортировкаПуть + "ВерсияИнкотермс");
				Если ЗначениеЗаполнено(ВерсияИнкотермс) Тогда
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Тран, "ВерИнкотермс", ВерсияИнкотермс, , Ошибки);
					ВыводитьГруппуТранспортировка = Истина;
				КонецЕсли;
				
				Если ВыводитьГруппуТранспортировка Тогда
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвПер, "Тран", Тран, , Ошибки);
				КонецЕсли;
			КонецЕсли;	
			
			СведенияОПередачеВещи = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ДеревоДанных, ОперацияПуть + "СведенияОПередачеВещи");
			Если ЗначениеЗаполнено(СведенияОПередачеВещи) Тогда
				СвойствоСвПерВещи = СвПер.Свойства().Получить("СвПерВещи");
				СвПерВещи = ПолучитьОбъектТипаCML(СвойствоСвПерВещи.Тип, ПространствоИмен);
				ПутьПередачиВещи = ОперацияПуть + "СведенияОПередачеВещи.";
				
				ДатаПередачи = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ДеревоДанных, ПутьПередачиВещи + "ДатаПередачи");
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвПерВещи, "ДатаПерВещ", ДатаФНС(ДатаПередачи), , Ошибки);
				
				СведенияОПередаче = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ДеревоДанных, ПутьПередачиВещи + "СведенияОПередаче");
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвПерВещи, "СвПерВещ", СведенияОПередаче, , Ошибки);
				
				ДокументПодтверждающийПередачу = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ДеревоДанных, ПутьПередачиВещи + "ДокументПодтверждающийПередачу");
				Если ЗначениеЗаполнено(ДокументПодтверждающийПередачу) Тогда
					НовыйДокумент = ПолучитьОбъектТипаCML("РеквДокТип", ПространствоИмен);
					ЗаполнитьРеквизитыДокументаУПД_5_02(
						НовыйДокумент, ДеревоДанных, Ошибки, ПространствоИмен, ПутьПередачиВещи + "ДокументПодтверждающийПередачу");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвПерВещи, "ДокПерВещ", НовыйДокумент, , Ошибки);
				КонецЕсли;
				
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвПер, "СвПерВещи", СвПерВещи, , Ошибки);
			КонецЕсли;
			
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвПродПер, "СвПер", СвПер, , Ошибки);
		КонецЕсли;
		
		// Информационное поле ФХЖ. 
		ИнформационноеПолеФХЖ3 = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
			ДеревоДанных, Путь + ".ИнформационноеПолеФХЖ");
		Если ЗначениеЗаполнено(ИнформационноеПолеФХЖ3) Тогда
			СвойствоИнфПолФХЖ3 = СвПродПер.Свойства().Получить("ИнфПолФХЖ3");
			ИнфПолФХЖ3 = ПолучитьОбъектТипаCML(СвойствоИнфПолФХЖ3.Тип, ПространствоИмен);
			ПутьИнфПолФХЖ3 = Путь + ".ИнформационноеПолеФХЖ.";
				
			ИдентификаторФайла = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ДеревоДанных, ПутьИнфПолФХЖ3 + "ИдентификаторФайла");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИнфПолФХЖ3, "ИдФайлИнфПол", ИдентификаторФайла, , Ошибки);	
				
			ТекстоваяИнформация = ДеревоДанных.Строки.Найти(ПутьИнфПолФХЖ3 + "ТекстоваяИнформация", "ПолныйПуть", Истина);
			Если ЗначениеЗаполнено(ТекстоваяИнформация.Значение) Тогда
				ТекстоваяИнформацияПуть = ПутьИнфПолФХЖ3 + "ТекстоваяИнформация.НомерСтроки.";
				Для Каждого ТекущаяСтрока Из ТекстоваяИнформация.Строки Цикл
			        ТекстИнф = ПолучитьОбъектТипаCML("ТекстИнфТип", ПространствоИмен);
					
					Идентификатор = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущаяСтрока, ТекстоваяИнформацияПуть + "Идентификатор");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТекстИнф, "Идентиф", Идентификатор, Истина, Ошибки);
					
					Значение = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущаяСтрока, ТекстоваяИнформацияПуть + "Значение");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТекстИнф, "Значен", Значение, Истина, Ошибки);
					
					ИнфПолФХЖ3.ТекстИнф.Добавить(ТекстИнф);
			    КонецЦикла;
			КонецЕсли;	
				
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвПродПер, "ИнфПолФХЖ3", ИнфПолФХЖ3, , Ошибки);	
		КонецЕсли;
		
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Документ, "СвПродПер", СвПродПер, , Ошибки);
	КонецЕсли;	
	
	// Основание составителя файла.
	Путь = "ОснованиеСоставителяФайла";
	ОснованиеСоставителяФайла = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, Путь);
	Если ЗначениеЗаполнено(ОснованиеСоставителяФайла) Тогда
		НовыйДокумент = ПолучитьОбъектТипаCML("РеквДокТип", ПространствоИмен);
		ЗаполнитьРеквизитыДокументаУПД_5_02(
			НовыйДокумент, ДеревоДанных, Ошибки, ПространствоИмен, Путь);
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Документ, "ОснДоверОргСост", НовыйДокумент, , Ошибки);
	КонецЕсли;	
		
	// Подписанты.
	Если ЭтоЭлектронноеАктированиеЕИС Тогда
		// Для ЕИС список подписантов определяется заранее.
		МодульЭлектронноеАктированиеЕИС.ЗаполнитьСведенияОПодписантах(
			ДеревоДанных, Документ, ПространствоИмен, Ошибки);
	Иначе
		// Сведения о лице, подписывающем файл обмена.
		СвойствоПодписант = Документ.Свойства().Получить("Подписант");
		Подписант = ПолучитьОбъектТипаCML(СвойствоПодписант.Тип, ПространствоИмен);
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Подписант, "ТипПодпис", "2", Истина, Ошибки); // Простая электронная подпись.
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Подписант, "СпосПодтПолном", "1", Истина, Ошибки); // В соответствии с данными, содержащимися в электронной подписи.
		// В подписанте пустым значением заполняется поле Физ.лицо.
		ФИО = ПолучитьОбъектТипаCML("ФИОТип", ПространствоИмен);
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ФИО, "Фамилия", "-", , Ошибки);
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ФИО, "Имя", "-", , Ошибки);
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Подписант, "ФИО", ФИО, Истина, Ошибки);
		
		Документ.Подписант.Добавить(Подписант);
		
	КонецЕсли;

	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Файл, "Документ", Документ, Истина, Ошибки);	
		
	ПроверитьОбъектXDTO(Файл, Ошибки);
	
	Результат = НовыйРезультатЗаполненияДокумента();
	
	Если ЗначениеЗаполнено(Ошибки) Тогда
		
		Результат.Ошибки = Ошибки;
		
	Иначе
		
		Если ЭтоЭлектронноеАктированиеЕИС Тогда
			ВидДокумента = "УПДПрод";
			МодульЭлектронноеАктированиеЕИС.ПриФормированииДвоичныхДанныхЭД(
				ВидДокумента, Файл, ДеревоДанных);
		КонецЕсли;
		
		ДвоичныеДанные = ДвоичныеДанныеОбъектаXDTO(Файл, , , "Файл");
		Результат.ДанныеОсновногоФайла.ДвоичныеДанные =
			ОбщегоНазначенияБЭД.УдалитьПространствоИмен(ДвоичныеДанные, ПространствоИмен);
		
		ИмяФайлаПоУмолчанию = ИдентификаторФайлаXML + ".xml";
		Результат.ДанныеОсновногоФайла.ИмяФайла = ИмяФайлаПоУмолчанию;
		
		// Формирование приложения для ЕИС в сфере закупок.
		Если ЭтоЭлектронноеАктированиеЕИС Тогда
			РезультатСозданияПриложения = МодульЭлектронноеАктированиеЕИС.
				СформироватьДанныеПриложенияУПДДляЕИС(ДеревоДанных, ИдентификаторФайлаXML);
			Если НЕ РезультатСозданияПриложения.Выполнено Тогда
				ОбщегоНазначенияБЭД.ДобавитьОшибку(
					Результат.Ошибки, РезультатСозданияПриложения.ОписаниеОшибки);
			КонецЕсли;
				
			Результат.ДанныеДополнительногоФайла.ДвоичныеДанные =
				РезультатСозданияПриложения.ДвоичныеДанные;
			Результат.ДанныеДополнительногоФайла.ИмяФайла =
				РезультатСозданияПриложения.ИмяФайла;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&ИзменениеИКонтроль("ЗаполнитьДокумент_УПД_5_03_ИнформацияПродавца")
Функция ИТБК_ЗаполнитьДокумент_УПД_5_03_ИнформацияПродавца(Знач ДеревоДанных)

	ДатаФормирования = ТекущаяДатаСеанса();
	ИдентификаторФайлаXML = ИдентификаторФайла_УПД_5_02_ИнформацияПродавца(ДеревоДанных, ДатаФормирования);
	
	ПространствоИмен = ПространствоИмен_УПД_5_03_ИнформацияПродавца();
	Пакет = ФабрикаXDTO.Пакеты.Получить(ПространствоИмен);
	
	Ошибки = Неопределено; // служебная переменная для хранения списка возникших ошибок
	
	ЭтоЭлектронноеАктированиеЕИС = Ложь;
	МодульЭлектронноеАктированиеЕИС = Неопределено;
	Если ОбщегоНазначения.ПодсистемаСуществует(
			"ЭлектронноеВзаимодействие.ЭлектронноеАктированиеЕИС") Тогда
		МодульЭлектронноеАктированиеЕИС = ОбщегоНазначения.ОбщийМодуль("ЭлектронноеАктированиеЕИС");
		Если МодульЭлектронноеАктированиеЕИС.ИспользоватьЭлектронноеАктированиеВЕИС()
			И ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных,
				"ДанныеЭлектронногоАктированияЕИС") = Истина Тогда
			ЭтоЭлектронноеАктированиеЕИС = Истина;
			МодульЭлектронноеАктированиеЕИС.ПередФормированиемЭлектронногоДокумента(
				ДеревоДанных, ПространствоИмен);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "СведенияОКомиссионере")) Тогда
		СведенияКомиссионера = ПолучитьОбъектТипаCML("УчастникТип", ПространствоИмен);
		ЗаполнитьСведенияОбУчастникеУПД_5_02(СведенияКомиссионера, ДеревоДанных, Ошибки, ПространствоИмен, "СведенияОКомиссионере");
		
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.УстановитьСтроку();
		ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, СведенияКомиссионера);
		
		СтрXML = ЗаписьXML.Закрыть();
		НачПоз = СтрНайти(СтрXML, "<ИдСв>");
		КолСимв = СтрНайти(СтрXML, "</ИдСв>") - НачПоз + СтрДлина("</ИдСв>");
		СтрXML = Сред(СтрXML, НачПоз, КолСимв);
		
		ТекстоваяИнформация = Новый ТаблицаЗначений;
		ТекстоваяИнформация.Колонки.Добавить("Идентификатор");
		ТекстоваяИнформация.Колонки.Добавить("Значение");
		НоваяСтрока = ТекстоваяИнформация.Добавить();
		НоваяСтрока.Идентификатор = "ДанныеКомиссионера";
		НоваяСтрока.Значение = СтрXML;
		ДеревоЭлектронногоДокументаБЭД.ДобавитьЗаписьВТаблицуДерева(ДеревоДанных,
			НоваяСтрока, "СведенияОСчетеФактуре.ИнформационноеПолеФХЖ.ТекстоваяИнформация");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "СведенияОКомитенте")) Тогда
		СведенияКомитента = ПолучитьОбъектТипаCML("УчастникТип", ПространствоИмен);
		ЗаполнитьСведенияОбУчастникеУПД_5_02(СведенияКомитента, ДеревоДанных, Ошибки, ПространствоИмен, "СведенияОКомитенте");
		
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.УстановитьСтроку();
		ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, СведенияКомитента);
		
		СтрXML = ЗаписьXML.Закрыть();
		НачПоз = СтрНайти(СтрXML, "<ИдСв>");
		КолСимв = СтрНайти(СтрXML, "</ИдСв>") - НачПоз + СтрДлина("</ИдСв>");
		СтрXML = Сред(СтрXML, НачПоз, КолСимв);
		
		ТекстоваяИнформация = Новый ТаблицаЗначений;
		ТекстоваяИнформация.Колонки.Добавить("Идентификатор");
		ТекстоваяИнформация.Колонки.Добавить("Значение");
		НоваяСтрока = ТекстоваяИнформация.Добавить();
		НоваяСтрока.Идентификатор = "ДанныеКомитента";
		НоваяСтрока.Значение = СтрXML;
		ДеревоЭлектронногоДокументаБЭД.ДобавитьЗаписьВТаблицуДерева(ДеревоДанных,
			НоваяСтрока, "СведенияОСчетеФактуре.ИнформационноеПолеФХЖ.ТекстоваяИнформация");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "СведенияОПеревозчике")) Тогда
		СведенияПеревозчика = ПолучитьОбъектТипаCML("УчастникТип", ПространствоИмен);
		ЗаполнитьСведенияОбУчастникеУПД_5_02(СведенияПеревозчика, ДеревоДанных, Ошибки, ПространствоИмен, "СведенияОПеревозчике");
		
		ЗаписьXML = Новый ЗаписьXML;
		ЗаписьXML.УстановитьСтроку();
		ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, СведенияПеревозчика);
		
		СтрXML = ЗаписьXML.Закрыть();
		НачПоз = СтрНайти(СтрXML, "<ИдСв>");
		КолСимв = СтрНайти(СтрXML, "</ИдСв>") - НачПоз + СтрДлина("</ИдСв>");
		СтрXML = Сред(СтрXML, НачПоз, КолСимв);
		
		ТекстоваяИнформация = Новый ТаблицаЗначений;
		ТекстоваяИнформация.Колонки.Добавить("Идентификатор");
		ТекстоваяИнформация.Колонки.Добавить("Значение");
		НоваяСтрока = ТекстоваяИнформация.Добавить();
		НоваяСтрока.Идентификатор = "ДанныеПеревозчика";
		НоваяСтрока.Значение = СтрXML;
		ДеревоЭлектронногоДокументаБЭД.ДобавитьЗаписьВТаблицуДерева(ДеревоДанных,
			НоваяСтрока, "СведенияОСчетеФактуре.ИнформационноеПолеФХЖ.ТекстоваяИнформация");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "НомерТранспортнойНакладной")) Тогда
		ТекстоваяИнформация = Новый ТаблицаЗначений;
		ТекстоваяИнформация.Колонки.Добавить("Идентификатор");
		ТекстоваяИнформация.Колонки.Добавить("Значение");
		НоваяСтрока = ТекстоваяИнформация.Добавить();
		НоваяСтрока.Идентификатор = "НомерТранспортнойНакладной";
		НоваяСтрока.Значение = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "НомерТранспортнойНакладной");
		ДеревоЭлектронногоДокументаБЭД.ДобавитьЗаписьВТаблицуДерева(ДеревоДанных,
			НоваяСтрока, "СведенияОПередаче.ИнформационноеПолеФХЖ.ТекстоваяИнформация");
	КонецЕсли;	
		
	Если ЗначениеЗаполнено(ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "ДатаТранспортнойНакладной")) Тогда
		ТекстоваяИнформация = Новый ТаблицаЗначений;
		ТекстоваяИнформация.Колонки.Добавить("Идентификатор");
		ТекстоваяИнформация.Колонки.Добавить("Значение");
		НоваяСтрока = ТекстоваяИнформация.Добавить();
		НоваяСтрока.Идентификатор = "ДатаТранспортнойНакладной";
		НоваяСтрока.Значение = ДатаФНС(ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "ДатаТранспортнойНакладной"));
		ДеревоЭлектронногоДокументаБЭД.ДобавитьЗаписьВТаблицуДерева(ДеревоДанных,
			НоваяСтрока, "СведенияОПередаче.ИнформационноеПолеФХЖ.ТекстоваяИнформация");
	КонецЕсли;
	
	СвойствоФайл = Пакет.КорневыеСвойства.Получить("Файл");
	Файл = ПолучитьОбъектТипаCML(СвойствоФайл.Тип, ПространствоИмен);
	
	// Техническая информация по документу.
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Файл, "ИдФайл", ИдентификаторФайлаXML, Истина, Ошибки);
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Файл, "ВерсПрог", ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "ВерсияПрограммы"),, Ошибки);
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Файл, "ВерсФорм", "5.03", Истина, Ошибки);
	
	СвойствоДокумент = Файл.Свойства().Получить("Документ");
	Документ = ПолучитьОбъектТипаCML(СвойствоДокумент.Тип, ПространствоИмен);
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Документ, "КНД", "1115131", Истина, Ошибки);
	УИД = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "УникальныйИдентификаторДокумента");
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Документ, "УИД", УИД, , Ошибки);
	ФункцияУПД = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "Функция");
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Документ, "Функция", ФункцияУПД, , Ошибки);
		
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Документ, "ДатаИнфПр", Формат(ДатаФормирования, "ДФ=dd.MM.yyyy"), Истина, Ошибки);
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Документ, "ВремИнфПр", Формат(ДатаФормирования, "ДФ=HH.mm.ss"), Истина, Ошибки);
	
	НаимЭконСубСост = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "СоставительДокументаНаименование");
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Документ, "НаимЭконСубСост", НаимЭконСубСост, , Ошибки);
	
	СоглСтрДопИнф = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, "СогласованныеДопПоля");
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Документ, "СоглСтрДопИнф", СоглСтрДопИнф, , Ошибки);
	
	// Сведения о счете-фактуре.
	СвойствоСвСчФакт = Документ.Свойства().Получить("СвСчФакт");
	СвСчФакт = ПолучитьОбъектТипаCML(СвойствоСвСчФакт.Тип, ПространствоИмен);
	Путь = "СведенияОСчетеФактуре.";
	
	НомерДок = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, Путь + "НомерДокумента");
#Вставка
	А = 0;//НомерДок = ПрефиксацияОбъектовКлиентСервер.УдалитьПрефиксыИзНомераОбъекта(НомерДок,Истина,Истина);
#КонецВставки
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвСчФакт, "НомерДок", НомерДок, Истина, Ошибки);
	
	ДатаДок = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, Путь + "ДатаДокумента");
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвСчФакт, "ДатаДок", ДатаФНС(ДатаДок), Истина, Ошибки);
	
	ИмяФайлИспрПрод = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, Путь + "ИмяФайлаПродавца");
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвСчФакт, "ИмяФайлИспрПрод", ИмяФайлИспрПрод, , Ошибки);
	
	ИмяФайлИспрПок = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, Путь + "ИмяФайлаПокупателя");
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвСчФакт, "ИмяФайлИспрПок", ИмяФайлИспрПок, , Ошибки);
	
	// Исправление.
	Исправление = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, Путь + "Исправление");
	Если ЗначениеЗаполнено(Исправление) Тогда
		СвойствоИспрДок = СвСчФакт.Свойства().Получить("ИспрДок");
		ИспрДок = ПолучитьОбъектТипаCML(СвойствоИспрДок.Тип, ПространствоИмен);
		ИсправлениеПуть = Путь + "Исправление.";
		
		НомИспр = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, ИсправлениеПуть + "НомерИсправления");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИспрДок, "НомИспр", НомИспр, Истина, Ошибки);
		
		ДатаИспр = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, ИсправлениеПуть + "ДатаИсправления");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИспрДок, "ДатаИспр", ДатаФНС(ДатаИспр), Истина, Ошибки);
		
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвСчФакт, "ИспрДок", ИспрДок, , Ошибки);
	КонецЕсли;
	
	// Сведения о продавцах.
	СведенияОПродавцах = ДеревоДанных.Строки.Найти(Путь + "СведенияОПродавцах", "ПолныйПуть", Истина);
	Если ЗначениеЗаполнено(СведенияОПродавцах.Значение) Тогда
		ПродавецПуть = Путь + "СведенияОПродавцах.НомерСтроки.Продавец";
		Для Каждого ТекущийПродавец Из СведенияОПродавцах.Строки Цикл
			Продавец = ПолучитьОбъектТипаCML("УчастникТип", ПространствоИмен);
			ЗаполнитьСведенияОбУчастникеУПД_5_02(Продавец, ТекущийПродавец, Ошибки, ПространствоИмен, ПродавецПуть);
			СвСчФакт.СвПрод.Добавить(Продавец);
		КонецЦикла;	
	КонецЕсли;
	
	// Сведения о покупателях.
	СведенияОПокупателях = ДеревоДанных.Строки.Найти(Путь + "СведенияОПокупателях", "ПолныйПуть", Истина);
	Если ЗначениеЗаполнено(СведенияОПокупателях.Значение) Тогда
		ПокупательПуть = Путь + "СведенияОПокупателях.НомерСтроки.Покупатель";
		Для Каждого ТекущийПокупатель Из СведенияОПокупателях.Строки Цикл
			Покупатель = ПолучитьОбъектТипаCML("УчастникТип", ПространствоИмен);
			ЗаполнитьСведенияОбУчастникеУПД_5_02(Покупатель, ТекущийПокупатель, Ошибки, ПространствоИмен, ПокупательПуть);
			СвСчФакт.СвПокуп.Добавить(Покупатель);
		КонецЦикла;	
	КонецЕсли;
	
	// Сведения о грузоотправителях.
	СведенияОГрузоотправителях = ДеревоДанных.Строки.Найти(Путь + "СведенияОГрузоотправителях", "ПолныйПуть", Истина);
	Если ЗначениеЗаполнено(СведенияОГрузоотправителях.Значение) Тогда
		
		СвойствоГрузОт = СвСчФакт.Свойства().Получить("ГрузОт");
		ГрузоотправительПуть = Путь + "СведенияОГрузоотправителях.НомерСтроки.Грузоотправитель";
		ОнЖеПуть = Путь + "СведенияОГрузоотправителях.НомерСтроки.ОнЖе";
		
		Для Каждого ТекущийГрузоотправитель Из СведенияОГрузоотправителях.Строки Цикл
			ГрузОт = ПолучитьОбъектТипаCML(СвойствоГрузОт.Тип, ПространствоИмен);
			
			ОнЖе = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ТекущийГрузоотправитель, ОнЖеПуть);
#Вставка
//Сообщить(ОнЖе);
//Сообщить("3");
#КонецВставки
			Если ОнЖе = Истина Тогда
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ГрузОт, "ОнЖе", "он же", , Ошибки);
			Иначе
				Грузоотправитель = ПолучитьОбъектТипаCML("УчастникТип", ПространствоИмен);
				ЗаполнитьСведенияОбУчастникеУПД_5_02(
					Грузоотправитель, ТекущийГрузоотправитель, Ошибки, ПространствоИмен, ГрузоотправительПуть);
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ГрузОт, "ГрузОтпр", Грузоотправитель, Истина, Ошибки);
			КонецЕсли;
#Вставка
//Сообщить(Грузоотправитель);
//Сообщить(ГрузОт);  
//Сообщить(ТекущийГрузоотправитель);
#КонецВставки
			
			СвСчФакт.ГрузОт.Добавить(ГрузОт);
		КонецЦикла;	
	КонецЕсли;
	
	// Сведения о грузополучателях.
	СведенияОГрузополучателях = ДеревоДанных.Строки.Найти(Путь + "СведенияОГрузополучателях", "ПолныйПуть", Истина);
	Если ЗначениеЗаполнено(СведенияОГрузополучателях.Значение) Тогда
		ГрузополучательПуть = Путь + "СведенияОГрузополучателях.НомерСтроки.Грузополучатель";
		Для Каждого ТекущийГрузополучатель Из СведенияОГрузополучателях.Строки Цикл
			Грузополучатель = ПолучитьОбъектТипаCML("УчастникТип", ПространствоИмен);
			ЗаполнитьСведенияОбУчастникеУПД_5_02(Грузополучатель, ТекущийГрузополучатель, Ошибки, ПространствоИмен, ГрузополучательПуть);
			СвСчФакт.ГрузПолуч.Добавить(Грузополучатель);
		КонецЦикла;	
	КонецЕсли;
	
	// Сведения о платежно-расчетных документах.
	СведенияОПлатежноРасчетныхДокументах = ДеревоДанных.Строки.Найти(Путь + "СведенияОПлатежноРасчетныхДокументах", "ПолныйПуть", Истина);
	Если ЗначениеЗаполнено(СведенияОПлатежноРасчетныхДокументах.Значение) Тогда
		СвПРД = СвСчФакт.Свойства().Получить("СвПРД");
		ПутьПРД = Путь + "СведенияОПлатежноРасчетныхДокументах.НомерСтроки.";
		Для Каждого ТекущийДокумент Из СведенияОПлатежноРасчетныхДокументах.Строки Цикл
			НовыйПРД = ПолучитьОбъектТипаCML(СвПРД.Тип, ПространствоИмен);
			
			НомерПРД = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ТекущийДокумент, ПутьПРД + "Номер");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(НовыйПРД, "НомерПРД", НомерПРД, , Ошибки);
			
			ДатаПРД = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ТекущийДокумент, ПутьПРД + "Дата");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(НовыйПРД, "ДатаПРД", ДатаФНС(ДатаПРД), , Ошибки);
			
			СуммаПРД = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ТекущийДокумент, ПутьПРД + "Сумма");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(НовыйПРД, "СуммаПРД", СуммаПРД, , Ошибки);
			
			СвСчФакт.СвПРД.Добавить(НовыйПРД);
		КонецЦикла;	
	КонецЕсли;
	
	// Документы об отгрузке.
	НаименованиеДокументаОснования = "Счет-фактура и документ об отгрузке товаров (выполнении работ), передаче имущественных прав (документ об оказании услуг)";
	ДокументыОбОтгрузке = ДеревоДанных.Строки.Найти(Путь + "ДокументыОбОтгрузке", "ПолныйПуть", Истина);
	Если ЗначениеЗаполнено(ДокументыОбОтгрузке.Значение) Тогда
		ДокументыПуть = Путь + "ДокументыОбОтгрузке.НомерСтроки.ДокументОбОтгрузке";
		Для Каждого ТекущийДокумент Из ДокументыОбОтгрузке.Строки Цикл
	        НовыйДокумент = ПолучитьОбъектТипаCML("РеквДокТип", ПространствоИмен);
			ЗаполнитьРеквизитыДокументаУПД_5_02(НовыйДокумент, 
				ТекущийДокумент, 
				Ошибки, 
				ПространствоИмен, 
				ДокументыПуть,
				Истина);
			Если ФункцияУПД = СЧФДОП() Тогда
				НаименованиеДокументаОснования = НовыйДокумент.РеквНаимДок;
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(НовыйДокумент, "РеквНомерДок", НомерДок, , Ошибки);
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(НовыйДокумент, "РеквДатаДок", ДатаФНС(ДатаДок), , Ошибки);
			КонецЕсли;
			СвСчФакт.ДокПодтвОтгрНом.Добавить(НовыйДокумент);
	    КонецЦикла;
	КонецЕсли;
	
	Если ФункцияУПД = СЧФДОП() И СвСчФакт.ДокПодтвОтгрНом.Количество() = 0 Тогда
		НовыйДокумент = ПолучитьОбъектТипаCML("РеквДокТип", ПространствоИмен);
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(НовыйДокумент, "РеквНаимДок", НаименованиеДокументаОснования, , Ошибки);
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(НовыйДокумент, "РеквНомерДок", НомерДок, , Ошибки);
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(НовыйДокумент, "РеквДатаДок", ДатаФНС(ДатаДок), , Ошибки);
		СвСчФакт.ДокПодтвОтгрНом.Добавить(НовыйДокумент);
	КонецЕсли;
	
	ПоФактХЖ = "";
	Если ФункцияУПД = СвРК() Тогда
		ПоФактХЖ = "Документ, включающий в себя сведения о факте реализации комиссионером (агентом, действующим от собственного имени) товаров комитента (принципала)";
	ИначеЕсли ФункцияУПД = СвЗК() Тогда
		ПоФактХЖ = "Документ, включающий в себя сведения о факте закупки комиссионером (агентом, действующим от собственного имени) товаров для комитента (принципала)";
	ИначеЕсли ФункцияУПД = ДОП() Или ФункцияУПД = СЧФДОП() Тогда
		ПоФактХЖ = "Документ об отгрузке товаров (выполнении работ), передаче имущественных прав (документ об оказании услуг)";
	КонецЕсли;
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Документ, "ПоФактХЖ", ПоФактХЖ, , Ошибки);

	НаимДокОпр = "";
	Если ФункцияУПД = СЧФДОП() Тогда
		НаимДокОпр = НаименованиеДокументаОснования;
	ИначеЕсли ФункцияУПД = ДОП() Тогда
		НаимДокОпр = "Документ об отгрузке товаров (выполнении работ), передаче имущественных прав (Документ об оказании услуг)";
	ИначеЕсли ФункцияУПД = СвРК() Тогда
		НаимДокОпр = "Документ, включающий в себя сведения о факте реализации комиссионером (агентом, действующим от собственного имени), товаров комитента (принципала)";
	ИначеЕсли ФункцияУПД = СвЗК() Тогда
		НаимДокОпр = "Документ, включающий в себя сведения о факте закупки комиссионером (агентом, действующим от собственного имени) товара для комитента (принципала)";
	КонецЕсли;
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Документ, "НаимДокОпр", НаимДокОпр, ФункцияУПД <> СЧФ(), Ошибки);
		
	// Валюта.
	Валюта = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, Путь + "Валюта");
	Если ЗначениеЗаполнено(Валюта) Тогда
		СвойствоДенИзм = СвСчФакт.Свойства().Получить("ДенИзм");
		ДенИзм = ПолучитьОбъектТипаCML(СвойствоДенИзм.Тип, ПространствоИмен);
		ВалютаПуть = Путь + "Валюта.";
		
		Код = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, ВалютаПуть + "Код");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДенИзм, "КодОКВ", Код, Истина, Ошибки);
		
		ЗаполнитьНаименованиеВалютыXML(ДенИзм, Код, Ошибки, Истина);
		
		Курс = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, ВалютаПуть + "Курс");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДенИзм, "КурсВал", Курс, , Ошибки);
		
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвСчФакт, "ДенИзм", ДенИзм, , Ошибки);	
	КонецЕсли;
	
	// Дополнительные сведения об участниках.
	ДополнительныеСведенияОбУчастниках = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
		ДеревоДанных, Путь + "ДополнительныеСведенияОбУчастниках");
	Если ЗначениеЗаполнено(ДополнительныеСведенияОбУчастниках) Тогда	
		СвойствоДопСвФХЖ1 = СвСчФакт.Свойства().Получить("ДопСвФХЖ1");
		ДопСвФХЖ1 = ПолучитьОбъектТипаCML(СвойствоДопСвФХЖ1.Тип, ПространствоИмен);
		ДопСведенияОбУчастникахПуть = Путь + "ДополнительныеСведенияОбУчастниках.";
		
		ИдентификаторГосКонтракта = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
			ДеревоДанных, ДопСведенияОбУчастникахПуть + "ИдентификаторГосКонтракта");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСвФХЖ1, "ИдГосКон", ИдентификаторГосКонтракта, , Ошибки);
		
		ОбстоятельстваФормированияСФ = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
			ДеревоДанных, ДопСведенияОбУчастникахПуть + "ОбстоятельстваФормированияСФ");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСвФХЖ1, "СпОбстФСЧФ", ОбстоятельстваФормированияСФ, , Ошибки);
		
		СпециальныеОбстоятельстваФормированияУПД = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
			ДеревоДанных, ДопСведенияОбУчастникахПуть + "СпециальныеОбстоятельстваФормированияУПД");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСвФХЖ1, "СпОбстФСЧФДОП", СпециальныеОбстоятельстваФормированияУПД, , Ошибки);

		СпециальныеОбстоятельстваФормированияДокумента = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
			ДеревоДанных, ДопСведенияОбУчастникахПуть + "СпециальныеОбстоятельстваФормированияДокумента");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСвФХЖ1, "СпОбстФДОП", СпециальныеОбстоятельстваФормированияДокумента, , Ошибки);
		
		ВидыОбязательств = ДеревоДанных.Строки.Найти(ДопСведенияОбУчастникахПуть + "ВидыОбязательств", "ПолныйПуть", Истина);
		Если ЗначениеЗаполнено(ВидыОбязательств.Значение) Тогда
			СвойствоВидОбяз = ДопСвФХЖ1.Свойства().Получить("ВидОбяз");
			ВидыОбязательствПуть = ДопСведенияОбУчастникахПуть + "ВидыОбязательств.НомерСтроки.";
			Для Каждого ТекущийВид Из ВидыОбязательств.Строки Цикл
		        ВидОбяз = ПолучитьОбъектТипаCML(СвойствоВидОбяз.Тип, ПространствоИмен);
				
				КодВида = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ТекущийВид, ВидыОбязательствПуть + "КодВида");
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ВидОбяз, "КодВидОбяз", КодВида, , Ошибки);
				
				НаименованиеВида = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ТекущийВид, ВидыОбязательствПуть + "НаименованиеВида");
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ВидОбяз, "НаимВидОбяз", НаименованиеВида, , Ошибки);
				
				ДопСвФХЖ1.ВидОбяз.Добавить(ВидОбяз);
		    КонецЦикла;
		КонецЕсли;
		
		СведенияОГосКонтракте = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
			ДеревоДанных, ДопСведенияОбУчастникахПуть + "СведенияОГосКонтракте");
		Если ЗначениеЗаполнено(СведенияОГосКонтракте) Тогда
			СвойствоИнфПродЗаГоскКазн = ДопСвФХЖ1.Свойства().Получить("ИнфПродЗаГоскКазн");
			ИнфПродЗаГоскКазн = ПолучитьОбъектТипаCML(СвойствоИнфПродЗаГоскКазн.Тип, ПространствоИмен);
			СведенияОГосКонтрактеПуть = ДопСведенияОбУчастникахПуть + "СведенияОГосКонтракте.";
			
			ДатаКонтракта = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ДеревоДанных, СведенияОГосКонтрактеПуть + "ДатаКонтракта");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИнфПродЗаГоскКазн, "ДатаГосКонт", ДатаФНС(ДатаКонтракта), Истина, Ошибки);
			
			НомерКонтракта = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ДеревоДанных, СведенияОГосКонтрактеПуть + "НомерКонтракта");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИнфПродЗаГоскКазн, "НомерГосКонт", НомерКонтракта, Истина, Ошибки);
			
			НомерСчетаПродавца = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ДеревоДанных, СведенияОГосКонтрактеПуть + "НомерСчетаПродавца");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИнфПродЗаГоскКазн, "ЛицСчетПрод", НомерСчетаПродавца, , Ошибки);
			
			КодПоБюджетнойКлассификации = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ДеревоДанных, СведенияОГосКонтрактеПуть + "КодПоБюджетнойКлассификации");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИнфПродЗаГоскКазн, "КодПродБюджКласс", КодПоБюджетнойКлассификации, , Ошибки);
			
			КодЦели = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ДеревоДанных, СведенияОГосКонтрактеПуть + "КодЦели");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИнфПродЗаГоскКазн, "КодЦелиПрод", КодЦели, , Ошибки);
			
			КодТерриториальногоОргана = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ДеревоДанных, СведенияОГосКонтрактеПуть + "КодТерриториальногоОргана");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИнфПродЗаГоскКазн, "КодКазначПрод", КодТерриториальногоОргана, , Ошибки);
			
			НаименованиеТерриториальногоОргана = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ДеревоДанных, СведенияОГосКонтрактеПуть + "НаименованиеТерриториальногоОргана");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИнфПродЗаГоскКазн, "НаимКазначПрод", НаименованиеТерриториальногоОргана, , Ошибки);
			
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСвФХЖ1, "ИнфПродЗаГоскКазн", ИнфПродЗаГоскКазн, , Ошибки);
		КонецЕсли;
		
		СведенияОФакторе = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
			ДеревоДанных, ДопСведенияОбУчастникахПуть + "СведенияОФакторе");
		Если ЗначениеЗаполнено(СведенияОФакторе) Тогда
			ФакторПуть = ДопСведенияОбУчастникахПуть + "СведенияОФакторе";
			СведенияФактора = ПолучитьОбъектТипаCML("УчастникТип", ПространствоИмен);
			ЗаполнитьСведенияОбУчастникеУПД_5_02(СведенияФактора, ДеревоДанных, Ошибки, ПространствоИмен, ФакторПуть);
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСвФХЖ1, "СвФактор", СведенияФактора, , Ошибки);
		КонецЕсли;
		
		ОснованиеУступкиДенежногоТребования = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
			ДеревоДанных, ДопСведенияОбУчастникахПуть + "ОснованиеУступкиДенежногоТребования");
		Если ЗначениеЗаполнено(ОснованиеУступкиДенежногоТребования) Тогда
			ОснованиеУступкиПуть = ДопСведенияОбУчастникахПуть + "ОснованиеУступкиДенежногоТребования";
			ОснованиеУступки = ПолучитьОбъектТипаCML("РеквДокТип", ПространствоИмен);
			ЗаполнитьРеквизитыДокументаУПД_5_02(ОснованиеУступки, ДеревоДанных, Ошибки, ПространствоИмен, ОснованиеУступкиПуть);
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСвФХЖ1, "ОснУстДенТреб", ОснованиеУступки, , Ошибки);
		КонецЕсли;
		
		СопроводительныеДокументы = ДеревоДанных.Строки.Найти(
			ДопСведенияОбУчастникахПуть + "СопроводительныеДокументы", "ПолныйПуть", Истина);
		Если ЗначениеЗаполнено(СопроводительныеДокументы.Значение) Тогда
			ДокументыПуть = ДопСведенияОбУчастникахПуть + "СопроводительныеДокументы.НомерСтроки.СопроводительныйДокумент";
			Для Каждого ТекущийДокумент Из СопроводительныеДокументы.Строки Цикл
		        НовыйДокумент = ПолучитьОбъектТипаCML("РеквДокТип", ПространствоИмен);
				ЗаполнитьРеквизитыДокументаУПД_5_02(НовыйДокумент, ТекущийДокумент, Ошибки, ПространствоИмен, ДокументыПуть);
				ДопСвФХЖ1.СопрДокФХЖ.Добавить(НовыйДокумент);
		    КонецЦикла;
		КонецЕсли;
		
		АвансовыеСчетаФактуры = ДеревоДанных.Строки.Найти(
			ДопСведенияОбУчастникахПуть + "АвансовыеСчетаФактуры", "ПолныйПуть", Истина);
		Если ЗначениеЗаполнено(АвансовыеСчетаФактуры.Значение) Тогда
			ДокументыПуть = ДопСведенияОбУчастникахПуть + "АвансовыеСчетаФактуры.НомерСтроки";
			Для Каждого ТекущийДокумент Из АвансовыеСчетаФактуры.Строки Цикл
				НовыйДокумент = ПолучитьОбъектТипаCML("РеквДокТип", ПространствоИмен);
	
				НомерДокумента = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ТекущийДокумент, ДокументыПуть + ".НомерДокумента");
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(НовыйДокумент, "РеквНомерДок", НомерДокумента, Истина, Ошибки);
	
				ДатаДокумента = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ТекущийДокумент, ДокументыПуть + ".ДатаДокумента");
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(НовыйДокумент, "РеквДатаДок", ДатаФНС(ДатаДокумента), Истина, Ошибки);
	
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(НовыйДокумент, "РеквНаимДок",
					"АСЧФ", Истина, Ошибки);
	
				НомерИсправительногоДокумента = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ТекущийДокумент, ДокументыПуть + ".НомерИсправительногоДокумента");
				ДатаИсправительногоДокумента = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ТекущийДокумент, ДокументыПуть + ".ДатаИсправительногоДокумента");
				
				ДополнительныеСведения = Неопределено;
				Если ЗначениеЗаполнено(НомерИсправительногоДокумента) Тогда
					ДополнительныеСведения = СтрШаблон("ИспАСЧФ № %1 от %2",
						НомерИсправительногоДокумента, Формат(ДатаИсправительногоДокумента, "ДФ=dd.MM.yyyy"));
				КонецЕсли;
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(НовыйДокумент, "РеквДопСведДок",
					ДополнительныеСведения, , Ошибки);
	
				ДопСвФХЖ1.СопрДокФХЖ.Добавить(НовыйДокумент);
			КонецЦикла;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДопСвФХЖ1.ИдГосКон)
			Или ЗначениеЗаполнено(ДопСвФХЖ1.СпОбстФДОП)
			Или ЗначениеЗаполнено(ДопСвФХЖ1.СпОбстФСЧФ)
			Или ЗначениеЗаполнено(ДопСвФХЖ1.СпОбстФСЧФДОП)
			Или ДопСвФХЖ1.ИнфПродЗаГоскКазн <> Неопределено			
			Или ДопСвФХЖ1.ОснУстДенТреб <> Неопределено
			Или ДопСвФХЖ1.СопрДокФХЖ <> Неопределено
			Или ДопСвФХЖ1.СвФактор <> Неопределено
			Или ДопСвФХЖ1.ВидОбяз.Количество() > 0
			Или ДопСвФХЖ1.СопрДокФХЖ.Количество() > 0 Тогда
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвСчФакт, "ДопСвФХЖ1", ДопСвФХЖ1, , Ошибки);
		КонецЕсли;
	КонецЕсли;
	
	// Информационное поле ФХЖ. 
	ИнформационноеПолеФХЖ1 = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
		ДеревоДанных, Путь + "ИнформационноеПолеФХЖ");
	Если ЗначениеЗаполнено(ИнформационноеПолеФХЖ1) Тогда
		СвойствоИнфПолФХЖ1 = СвСчФакт.Свойства().Получить("ИнфПолФХЖ1");
		ИнфПолФХЖ1 = ПолучитьОбъектТипаCML(СвойствоИнфПолФХЖ1.Тип, ПространствоИмен);
		ПутьИнфПолФХЖ1 = Путь + "ИнформационноеПолеФХЖ.";
			
		ИдентификаторФайла = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
			ДеревоДанных, ПутьИнфПолФХЖ1 + "ИдентификаторФайла");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИнфПолФХЖ1, "ИдФайлИнфПол", ИдентификаторФайла, , Ошибки);	
			
		ТекстоваяИнформация = ДеревоДанных.Строки.Найти(ПутьИнфПолФХЖ1 + "ТекстоваяИнформация", "ПолныйПуть", Истина);
		Если ЗначениеЗаполнено(ТекстоваяИнформация.Значение) Тогда
			ТекстоваяИнформацияПуть = ПутьИнфПолФХЖ1 + "ТекстоваяИнформация.НомерСтроки.";
			Для Каждого ТекущаяСтрока Из ТекстоваяИнформация.Строки Цикл
		        ТекстИнф = ПолучитьОбъектТипаCML("ТекстИнфТип", ПространствоИмен);
				
				Идентификатор = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ТекущаяСтрока, ТекстоваяИнформацияПуть + "Идентификатор");
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТекстИнф, "Идентиф", Идентификатор, Истина, Ошибки);
				
				Значение = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ТекущаяСтрока, ТекстоваяИнформацияПуть + "Значение");
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТекстИнф, "Значен", Значение, Истина, Ошибки);
				
				ИнфПолФХЖ1.ТекстИнф.Добавить(ТекстИнф);
		    КонецЦикла;
		КонецЕсли;	
			
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвСчФакт, "ИнфПолФХЖ1", ИнфПолФХЖ1, , Ошибки);	
	КонецЕсли;		
	
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Документ, "СвСчФакт", СвСчФакт, Истина, Ошибки);
	
	// Таблица счета-Фактуры.
	СвойствоТаблСчФакт = Документ.Свойства().Получить("ТаблСчФакт");
	ТаблСчФакт = ПолучитьОбъектТипаCML(СвойствоТаблСчФакт.Тип, ПространствоИмен);
	Путь = "ТаблицаСчетаФактуры.";
	
	СпецОбстоятельстваФормированияСЧФ = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
		ДеревоДанных, 
		"СведенияОСчетеФактуре.ДополнительныеСведенияОбУчастниках.ОбстоятельстваФормированияСФ", 
		Ложь,
		,
		Истина);
	
	СодержитСчетФактуру = СодержитСчетФактуруУПД_5_02(ФункцияУПД);
	ЭтоАванс = ЭтоАвансУПД_5_02(СпецОбстоятельстваФормированияСЧФ);
	
	// Сведения об отгруженных позициях.
	ДействуетСхемаУПД_5_03_04 = ДействуетСхемаУПД_5_03_04();
	СтраныПроисхожденияОбязательныКЗаполнению = Не ДействуетСхемаУПД_5_03_04 И СодержитСчетФактуру И Не ЭтоАванс;
	СведенияОбОтгруженныхПозициях = ДеревоДанных.Строки.Найти(Путь + "СведенияОбОтгруженныхПозициях", "ПолныйПуть", Истина);
	Если ЗначениеЗаполнено(СведенияОбОтгруженныхПозициях.Значение) Тогда
	    СвойствоСведТов = ТаблСчФакт.Свойства().Получить("СведТов");
		ПутьОтгруженнойПозиции = Путь + "СведенияОбОтгруженныхПозициях.НомерСтроки.";
		
		Для Каждого ТекущаяСтрока Из СведенияОбОтгруженныхПозициях.Строки Цикл
		    СведТов = ПолучитьОбъектТипаCML(СвойствоСведТов.Тип, ПространствоИмен);
			
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведТов, "НомСтр", ТекущаяСтрока.Значение, Истина, Ошибки);
			
			Наименование = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "Наименование");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведТов, "НаимТов", Наименование, , Ошибки);
			
			ЕдиницаИзмеренияКод = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "ЕдиницаИзмеренияКод");
			ЕдиницаИзмеренияНаименование = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "ЕдиницаИзмеренияНаименование");
			Если Не ЗначениеЗаполнено(ЕдиницаИзмеренияКод) И ЗначениеЗаполнено(ЕдиницаИзмеренияНаименование) Тогда
				ЕдиницаИзмеренияКод = "0000";
			КонецЕсли;
			ЕдиницаИзмеренияПоКлассификатору = ЕдиницаИзмеренияПоКлассификатору(ЕдиницаИзмеренияКод, ЕдиницаИзмеренияНаименование);
			
			Если Не ЗначениеЗаполнено(ЕдиницаИзмеренияПоКлассификатору.Код) И ЗначениеЗаполнено(ЕдиницаИзмеренияКод) Тогда
				ТекстСообщения = СтрШаблон(НСтр("ru='Для единицы измерения ""%1"" указан код не соответствующий классификатору (ОКЕИ)'"), ЕдиницаИзмеренияНаименование);
				ОбщегоНазначенияБЭД.ДобавитьОшибку(Ошибки, ТекстСообщения);
			Иначе
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведТов, "ОКЕИ_Тов", ЕдиницаИзмеренияПоКлассификатору.Код, , Ошибки);
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведТов, "НаимЕдИзм", ЕдиницаИзмеренияПоКлассификатору.Наименование, , Ошибки);
			КонецЕсли;
			
			Количество = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "Количество");
			Если (СодержитСчетФактуру И ЗначениеЗаполнено(ЕдиницаИзмеренияКод))
				Или (ЗначениеЗаполнено(Количество) И Количество > 0) Тогда
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведТов, "КолТов", Количество,
					СодержитСчетФактуру И ЗначениеЗаполнено(ЕдиницаИзмеренияКод), Ошибки);
			КонецЕсли;
				
			ЦенаОбязательна = СодержитСчетФактуру И ЗначениеЗаполнено(Количество);
			Цена = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "Цена");
			Если ЦенаОбязательна Или (ЗначениеЗаполнено(Цена) И Цена > 0) Тогда
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведТов, "ЦенаТов", Цена,
					ЦенаОбязательна, Ошибки);
			КонецЕсли;
			
			СтоимостьСНалогом = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "СтоимостьСНалогом");
			
			СтоимостьБезНалога = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "СтоимостьБезНалога");
				
			ВыводитьПустыеЗначенияСтоимостиБезНалога = Ложь;
			Если ФункцияУПД = ДОП() И Не ЗначениеЗаполнено(СтоимостьСНалогом) Тогда
				Если СтоимостьБезНалога = Неопределено Тогда
					СтоимостьБезНалога = 0;
				КонецЕсли;
				ВыводитьПустыеЗначенияСтоимостиБезНалога = Истина;
			КонецЕсли;
				
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведТов, 
				"СтТовБезНДС", 
				СтоимостьБезНалога, 
				СтоимостьТовараОбязательнаУПД_5_02(ФункцияУПД, СпециальныеОбстоятельстваФормированияДокумента, СтоимостьСНалогом), 
				Ошибки, ВыводитьПустыеЗначенияСтоимостиБезНалога);
			
			НалоговаяСтавка = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "НалоговаяСтавка");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведТов, "НалСт", СтавкаНДСXDTO(НалоговаяСтавка), Истина, Ошибки);
			
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведТов, 
				"СтТовУчНал",
				СтоимостьСНалогом, 
				СтоимостьТовараОбязательнаУПД_5_02(ФункцияУПД, СпециальныеОбстоятельстваФормированияДокумента, СтоимостьБезНалога),
				Ошибки);
				
			СвойствоДопСведТов = СведТов.Свойства().Получить("ДопСведТов");
			ДопСведТов = ПолучитьОбъектТипаCML(СвойствоДопСведТов.Тип, ПространствоИмен);
			
			Признак = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "Признак");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "ПрТовРаб", Признак, , Ошибки);
			
			ИнформацияОПризнаке = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "ИнформацияОПризнаке");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "ДопПризн", ИнформацияОПризнаке, , Ошибки);
			
			ЗаказанноеКоличество = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "ЗаказанноеКоличество");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "НадлОтп", ЗаказанноеКоличество, , Ошибки);
			
			Характеристика = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "Характеристика");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "ХарактерТов", Характеристика, , Ошибки);
			
			Сорт = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "Сорт");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "СортТов", Сорт, , Ошибки);
			
			Серия = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "Серия");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "СерияТов", Серия, , Ошибки);
			
			Артикул = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "Артикул");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "АртикулТов", Артикул, , Ошибки);
			
			Код = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "Код");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "КодТов", Код, , Ошибки);
			
			ГТИН = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "ГТИН");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "ГТИН", ГТИН, , Ошибки);
			
			КодКаталога = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "КодКаталога");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "КодКат", КодКаталога, , Ошибки);
			
			КодВидаТовара = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "КодВидаТовара");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "КодВидТов", КодВидаТовара, , Ошибки);
			
			КодВидаПродукции = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "КодВидаПродукции");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "КодВидПр", КодВидаПродукции, , Ошибки);
			
			КодПоОКДП2 = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "КодПоОКПД2");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "КодТовОКПД2", КодПоОКДП2, , Ошибки);
			
			ДополнительнаяИнформация = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "ДополнительнаяИнформация");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "ДопИнфПВидО", ДополнительнаяИнформация, , Ошибки);
			
			СопроводительныеДокументы = ТекущаяСтрока.Строки.Найти(ПутьОтгруженнойПозиции + "СопроводительныеДокументы", "ПолныйПуть", Истина);
			Если ЗначениеЗаполнено(СопроводительныеДокументы.Значение) Тогда
			    ДокументыПуть = ПутьОтгруженнойПозиции + "СопроводительныеДокументы.НомерСтроки.СопроводительныйДокумент";
				Для Каждого ТекущийДокумент Из СопроводительныеДокументы.Строки Цикл
			        НовыйДокумент = ПолучитьОбъектТипаCML("РеквДокТип", ПространствоИмен);
					ЗаполнитьРеквизитыДокументаУПД_5_02(НовыйДокумент, ТекущийДокумент, Ошибки, ПространствоИмен, ДокументыПуть);
					ДопСведТов.СопрДокТов.Добавить(НовыйДокумент);
			    КонецЦикла;
			КонецЕсли;
			
			ДанныеДляРасчетаАмортизации = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "ДанныеДляРасчетаАмортизации");
			Если ЗначениеЗаполнено(ДанныеДляРасчетаАмортизации) Тогда
			    СвойствоНалУчАморт = ДопСведТов.Свойства().Получить("НалУчАморт");
				НалУчАморт = ПолучитьОбъектТипаCML(СвойствоНалУчАморт.Тип, ПространствоИмен);
			    ПутьАмортизации = ПутьОтгруженнойПозиции + "ДанныеДляРасчетаАмортизации.";
				
				АмортизационнаяГруппа = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ТекущаяСтрока, ПутьАмортизации + "АмортизационнаяГруппа");
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(НалУчАморт, "АмГруппа", АмортизационнаяГруппа, Истина, Ошибки);
				
				КодОКОФ = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ТекущаяСтрока, ПутьАмортизации + "КодОКОФ");
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(НалУчАморт, "КодОКОФ", КодОКОФ, Истина, Ошибки);
				
				СрокИспользования = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ТекущаяСтрока, ПутьАмортизации + "СрокИспользования");
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(НалУчАморт, "СрПолИспОС", СрокИспользования, Истина, Ошибки);
				
				ФактическийСрокИспользования = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ТекущаяСтрока, ПутьАмортизации + "ФактическийСрокИспользования");
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(НалУчАморт, "ФактСрокИсп", ФактическийСрокИспользования, Истина, Ошибки);
				
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "НалУчАморт", НалУчАморт, , Ошибки);
			КонецЕсли;	
				
			СуммаВосстановленногоНалога = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "СуммаВосстановленногоНалога");
			Если ЗначениеЗаполнено(СуммаВосстановленногоНалога) Тогда	
				Налог = ПолучитьОбъектТипаCML("СумНДСТип", ПространствоИмен);
				
				БезНДС = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ТекущаяСтрока, ПутьОтгруженнойПозиции + "СуммаВосстановленногоНалога.БезНДС");
				Если ЗначениеЗаполнено(БезНДС) Тогда
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Налог, "БезНДС", "без НДС", , Ошибки);
				Иначе
					Сумма = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущаяСтрока, ПутьОтгруженнойПозиции + "СуммаВосстановленногоНалога.Сумма");
					Сумма = ?(Сумма = Неопределено, 0, Сумма);
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Налог, "СумНал", Сумма, , Ошибки, Истина);
				КонецЕсли;
				
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДопСведТов, "СумНалВосст", Налог, , Ошибки);
				
			КонецЕсли;	
				
			СведенияОПрослеживаемости = ТекущаяСтрока.Строки.Найти(ПутьОтгруженнойПозиции + "СведенияОПрослеживаемости", "ПолныйПуть", Истина);
			ЕстьПрослеживаемость = ЗначениеЗаполнено(СведенияОПрослеживаемости.Значение) И СведенияОПрослеживаемости.Строки.Количество();
			Если ЕстьПрослеживаемость Тогда
				СвойствоСведПрослеж = ДопСведТов.Свойства().Получить("СведПрослеж");
				ПрослеживаемостьПуть = ПутьОтгруженнойПозиции + "СведенияОПрослеживаемости.НомерСтроки.";
				НомерПоПорядку = 0;
				
				Для Каждого ТекущаяПрослеживаемость Из СведенияОПрослеживаемости.Строки Цикл
					НомерПоПорядку = НомерПоПорядку + 1;
					СведПрослеж = ПолучитьОбъектТипаCML(СвойствоСведПрослеж.Тип, ПространствоИмен);
					ПрефиксСведений = СтрШаблон("ДопПрослеж%1", НомерПоПорядку);
					
				    НомерТовара = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущаяПрослеживаемость, ПрослеживаемостьПуть + "НомерТовара");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведПрослеж, "НомТовПрослеж", НомерТовара, Истина, Ошибки);
					
					ЕдиницаИзмеренияКод = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущаяПрослеживаемость, ПрослеживаемостьПуть + "ЕдиницаИзмеренияКод");
					ЕдиницаИзмеренияНаименование = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущаяПрослеживаемость, ПрослеживаемостьПуть + "ЕдиницаИзмеренияНаименование");
					ЕдиницаИзмеренияПоКлассификатору = ЕдиницаИзмеренияПоКлассификатору(ЕдиницаИзмеренияКод, ЕдиницаИзмеренияНаименование, Ложь);
					
					Если Не ЗначениеЗаполнено(ЕдиницаИзмеренияПоКлассификатору.Код) И ЗначениеЗаполнено(ЕдиницаИзмеренияКод) Тогда
						ТекстСообщения = СтрШаблон(НСтр("ru='Для единицы измерения ""%1"" указан код не соответствующий классификатору (ОКЕИ)'"), ЕдиницаИзмеренияНаименование);
						ОбщегоНазначенияБЭД.ДобавитьОшибку(Ошибки, ТекстСообщения);
					Иначе
						РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведПрослеж, "ЕдИзмПрослеж", ЕдиницаИзмеренияПоКлассификатору.Код, Истина, Ошибки);
						РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведПрослеж, "НаимЕдИзмПрослеж", ЕдиницаИзмеренияПоКлассификатору.Наименование, Истина, Ошибки);
					КонецЕсли;
					
					Количество = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущаяПрослеживаемость, ПрослеживаемостьПуть + "Количество");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведПрослеж, "КолВЕдПрослеж", Количество, Истина, Ошибки);
					
					СтоимостьБезНДС = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущаяПрослеживаемость, ПрослеживаемостьПуть + "СтоимостьБезНДС");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведПрослеж, "СтТовБезНДСПрослеж", СтоимостьБезНДС, Истина, Ошибки);
					
					ДополнительнаяИнформация = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущаяПрослеживаемость, ПрослеживаемостьПуть + "ДополнительнаяИнформация");
					Если ЗначениеЗаполнено(ДополнительнаяИнформация) Тогда
						РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведПрослеж, "ДопИнфПрослеж", ДополнительнаяИнформация, , Ошибки);
					Иначе
					    РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведПрослеж, "ДопИнфПрослеж", ПрефиксСведений, , Ошибки);
					КонецЕсли;
					
					ТекстИнф = ПолучитьОбъектТипаCML("ТекстИнфТип", ПространствоИмен);
					Идентификатор = СтрШаблон("%1_КолУчетное", ПрефиксСведений);
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТекстИнф, "Идентиф", Идентификатор, Истина, Ошибки);
					Значение = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущаяПрослеживаемость, ПрослеживаемостьПуть + "КоличествоУчетное");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТекстИнф, "Значен", Значение, Истина, Ошибки);
					СведТов.ИнфПолФХЖ2.Добавить(ТекстИнф);
					
					ТекстИнф = ПолучитьОбъектТипаCML("ТекстИнфТип", ПространствоИмен);
					Идентификатор = СтрШаблон("%1_СтТовПрослежБезНДС", ПрефиксСведений);
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТекстИнф, "Идентиф", Идентификатор, Истина, Ошибки);
					Значение = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущаяПрослеживаемость, ПрослеживаемостьПуть + "СтоимостьБезНДС");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТекстИнф, "Значен", Значение, Истина, Ошибки);
					СведТов.ИнфПолФХЖ2.Добавить(ТекстИнф);
					
					ДопСведТов.СведПрослеж.Добавить(СведПрослеж);
			    КонецЦикла;
			КонецЕсли;
			
			СведенияОДекларации = ТекущаяСтрока.Строки.Найти(ПутьОтгруженнойПозиции + "СведенияОДекларации", "ПолныйПуть", Истина);
			Если ЗначениеЗаполнено(СведенияОДекларации.Значение) Тогда
			    СвойствоСвДТ = СведТов.Свойства().Получить("СвДТ");
				ПутьДекларации = ПутьОтгруженнойПозиции + "СведенияОДекларации.НомерСтроки.";
			
				НаименованиеСтран = Новый Массив;
			    Для Каждого ТекущаяДекларация Из СведенияОДекларации.Строки Цикл
			    	СвДТ = ПолучитьОбъектТипаCML(СвойствоСвДТ.Тип, ПространствоИмен);
					
					КодСтраны = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущаяДекларация, ПутьДекларации + "КодСтраны");
					НаименованиеСтраны = НаименованиеСтраныИзКлассификатора(КодСтраны, Истина);
					Если ЗначениеЗаполнено(НаименованиеСтраны) Тогда
						НаименованиеСтран.Добавить(НаименованиеСтраны);
					ИначеЕсли ЗначениеЗаполнено(КодСтраны) Тогда
						ТекстСообщения = СтрШаблон(НСтр("ru='Ошибка при заполнении сведений о декларации, не удалось найти страну с кодом %1 в классификаторе (ОКСМ)'"), КодСтраны);
						ОбщегоНазначенияБЭД.ДобавитьОшибку(Ошибки, ТекстСообщения);
						Продолжить;
					КонецЕсли;
					
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвДТ, "КодПроисх", КодСтраны, СтраныПроисхожденияОбязательныКЗаполнению, Ошибки);
					
					НомерДекларации = ?(ЕстьПрослеживаемость, "Прослеж",
						ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущаяДекларация, ПутьДекларации + "НомерДекларации"));
						
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвДТ, "НомерДТ", НомерДекларации, , Ошибки);
					
					СведТов.СвДТ.Добавить(СвДТ);
				КонецЦикла;
			
				НаименованиеСтран = ОбщегоНазначенияКлиентСервер.СвернутьМассив(НаименованиеСтран);
				Для Каждого НаименованиеСтраны Из НаименованиеСтран Цикл
						ДопСведТов.КрНаимСтрПр.Добавить(НаименованиеСтраны);
				КонецЦикла;
			КонецЕсли;
			
			СведенияОМаркировке = ТекущаяСтрока.Строки.Найти(ПутьОтгруженнойПозиции + "СведенияОМаркировке", "ПолныйПуть", Истина);
			Если ЗначениеЗаполнено(СведенияОМаркировке.Значение) Тогда
			    СвойствоМаркировка = ДопСведТов.Свойства().Получить("НомСредИдентТов");
				МаркировкаПуть = ПутьОтгруженнойПозиции + "СведенияОМаркировке.НомерСтроки.";
				ИдентификаторПуть = МаркировкаПуть + "Идентификатор.";
				
				Для Каждого ТекущаяМаркировка Из СведенияОМаркировке.Строки Цикл
	    			Маркировка = ПолучитьОбъектТипаCML(СвойствоМаркировка.Тип, ПространствоИмен);
					
					ИдентификаторУпаковки = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущаяМаркировка, МаркировкаПуть + "ИдентификаторУпаковки");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Маркировка, "ИдентТрансУпак", ИдентификаторУпаковки, , Ошибки);
					
					Количество = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущаяМаркировка, МаркировкаПуть + "Количество");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Маркировка, "КолВедМарк", Количество, , Ошибки);
					
					Партия = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущаяМаркировка, МаркировкаПуть + "Партия");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Маркировка, "ПрПартМарк", Партия, , Ошибки);
					
					КонтрольныеЗнаки = ТекущаяМаркировка.Строки.Найти(ИдентификаторПуть + "КонтрольныеЗнаки", "ПолныйПуть", Истина);
					Если ЗначениеЗаполнено(КонтрольныеЗнаки.Значение) Тогда
						ПутьКИЗ = ИдентификаторПуть + "КонтрольныеЗнаки.НомерСтроки.";
				
						Для Каждого ТекущийКИЗ Из КонтрольныеЗнаки.Строки Цикл
							
							КонтрольныйЗнак = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
								ТекущийКИЗ, ПутьКИЗ + "КонтрольныйЗнак");
							
							Маркировка.КИЗ.Добавить(КонтрольныйЗнак);
						КонецЦикла;
					КонецЕсли;
					
					ИдентификаторыУпаковок = ТекущаяМаркировка.Строки.Найти(ИдентификаторПуть + "ИдентификаторыУпаковок", "ПолныйПуть", Истина);
					Если ЗначениеЗаполнено(ИдентификаторыУпаковок.Значение) Тогда
						ПутьНомУпак = ИдентификаторПуть + "ИдентификаторыУпаковок.НомерСтроки.";
						
						Для Каждого ТекущийИдентификаторУпаковки Из ИдентификаторыУпаковок.Строки Цикл
						
							ИдентификаторУпаковки = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
								ТекущийИдентификаторУпаковки, ПутьНомУпак + "ИдентификаторУпаковки");
							
							Маркировка.НомУпак.Добавить(ИдентификаторУпаковки);
				        КонецЦикла;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(Маркировка.ИдентТрансУпак) 
						Или ЗначениеЗаполнено(Маркировка.КолВедМарк)
						Или ЗначениеЗаполнено(Маркировка.ПрПартМарк) 
						Или Маркировка.КИЗ.Количество() > 0
						Или Маркировка.НомУпак.Количество() > 0 Тогда
						ДопСведТов.НомСредИдентТов.Добавить(Маркировка);
					КонецЕсли;
				КонецЦикла;	
			КонецЕсли;
			
			ДополнительныеСведенияГИС = ТекущаяСтрока.Строки.Найти(ПутьОтгруженнойПозиции + "ДополнительныеСведенияГИС", "ПолныйПуть", Истина);
			Если ЗначениеЗаполнено(ДополнительныеСведенияГИС.Значение) Тогда
			    СвойствоСвГосСист = ДопСведТов.Свойства().Получить("СвГосСист");
				ПутьГИС = ПутьОтгруженнойПозиции + "ДополнительныеСведенияГИС.НомерСтроки.";
			
			    Для Каждого ТекущаяСтрокаГИС Из ДополнительныеСведенияГИС.Строки Цикл
	    			СвГосСист = ПолучитьОбъектТипаCML(СвойствоСвГосСист.Тип, ПространствоИмен);
					
					НаименованиеГИС = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущаяСтрокаГИС, ПутьГИС + "НаименованиеГИС");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвГосСист, "НаимГосСист", НаименованиеГИС, Истина, Ошибки);
					
					УчетнаяЕдиницаГИС = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущаяСтрокаГИС, ПутьГИС + "УчетнаяЕдиницаГИС");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвГосСист, "УчетЕд", УчетнаяЕдиницаГИС, , Ошибки);
					
					ИнаяИнформация = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущаяСтрокаГИС, ПутьГИС + "ИнаяИнформация");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвГосСист, "ИнаяИнф", ИнаяИнформация, , Ошибки);
					
					ИдентификационныеНомераУчетныхЕдиницГИС = ТекущаяСтрокаГИС.Строки.Найти(
						ПутьГИС + "ИдентификационныеНомераУчетныхЕдиницГИС", "ПолныйПуть", Истина);
					Если ЗначениеЗаполнено(ИдентификационныеНомераУчетныхЕдиницГИС.Значение) Тогда
					    СвойствоИдНомУчетЕд = СвГосСист.Свойства().Получить("ИдНомУчетЕд");
						ПутьИдНомУчетЕд = ПутьГИС + "ИдентификационныеНомераУчетныхЕдиницГИС.НомерСтроки.";
						
						Для Каждого ТекущийИдНомУчетЕд Из ИдентификационныеНомераУчетныхЕдиницГИС.Строки Цикл
						    ИдНомУчетЕд = ПолучитьОбъектТипаCML(СвойствоИдНомУчетЕд.Тип, ПространствоИмен);
							
							ИдентификационныйНомер = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
								ТекущийИдНомУчетЕд, ПутьИдНомУчетЕд + "ИдентификационныйНомер");
							РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИдНомУчетЕд, "ИдНомУчетЕд", ИдентификационныйНомер, Истина, Ошибки);
							
							СвГосСист.ИдНомУчетЕд.Добавить(ИдНомУчетЕд);
						КонецЦикла;
					КонецЕсли;						
						
					ДопСведТов.СвГосСист.Добавить(СвГосСист);
			    КонецЦикла;
			КонецЕсли;
			
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведТов, "ДопСведТов", ДопСведТов, , Ошибки);
			
			СуммаАкциза = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "СуммаАкциза");
			СуммаАкциза = ?(ЗначениеЗаполнено(СуммаАкциза), СуммаАкциза, Ложь);
			Если СуммаАкциза Или ЗначениеЗаполнено(КодВидаПродукции) Тогда
				Акциз = ПолучитьОбъектТипаCML("СумАкцизТип", ПространствоИмен);
				
				БезАкциза = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ТекущаяСтрока, ПутьОтгруженнойПозиции + "СуммаАкциза.БезАкциза");
				БезАкциза = ?(ЗначениеЗаполнено(БезАкциза), БезАкциза, Ложь);
				Если БезАкциза Тогда
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Акциз, "БезАкциз", "без акциза", , Ошибки);
				Иначе
					Сумма = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ТекущаяСтрока, ПутьОтгруженнойПозиции + "СуммаАкциза.Сумма");
					Сумма = ?(Сумма = Неопределено, 0, Сумма);
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Акциз, "СумАкциз", Сумма, , Ошибки);
				КонецЕсли;
				
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведТов, "Акциз", Акциз, , Ошибки);
				
			КонецЕсли;
			
			СуммаНалога = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ТекущаяСтрока, ПутьОтгруженнойПозиции + "СуммаНалога");
			СуммаНалога = ?(ЗначениеЗаполнено(СуммаНалога), СуммаНалога, Ложь);
			Если СуммаНалога Тогда
				Налог = ПолучитьОбъектТипаCML("СумНДСТип", ПространствоИмен);
				
				БезНДС = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ТекущаяСтрока, ПутьОтгруженнойПозиции + "СуммаНалога.БезНДС");
				БезНДС = ?(ЗначениеЗаполнено(БезНДС), БезНДС, Ложь);
				Если БезНДС Тогда
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Налог, "БезНДС", "без НДС", , Ошибки);
				Иначе
					Сумма = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущаяСтрока, ПутьОтгруженнойПозиции + "СуммаНалога.Сумма");
					Сумма = ?(Сумма = Неопределено, 0, Сумма);
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Налог, "СумНал", Сумма, , Ошибки, Истина);
				КонецЕсли;
				
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведТов, "СумНал", Налог, , Ошибки, Истина);
				
			КонецЕсли;
			
			ИнформационноеПолеФХЖ = ТекущаяСтрока.Строки.Найти(ПутьОтгруженнойПозиции + "ИнформационноеПолеФХЖ", "ПолныйПуть", Истина);
			Если ЗначениеЗаполнено(ИнформационноеПолеФХЖ.Значение) Тогда
				ПутьФХЖ = ПутьОтгруженнойПозиции + "ИнформационноеПолеФХЖ.НомерСтроки.";
				Для Каждого ТекущееПоле Из ИнформационноеПолеФХЖ.Строки Цикл
					ТекстИнф = ПолучитьОбъектТипаCML("ТекстИнфТип", ПространствоИмен);
					
					Идентификатор = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущееПоле, ПутьФХЖ + "Идентификатор");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТекстИнф, "Идентиф", Идентификатор, Истина, Ошибки);
					
					Значение = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущееПоле, ПутьФХЖ + "Значение");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТекстИнф, "Значен", Значение, Истина, Ошибки);
					
					СведТов.ИнфПолФХЖ2.Добавить(ТекстИнф);
				КонецЦикла;	
			КонецЕсли;
			
			ДопДанныеПодписанные = ТекущаяСтрока.Строки.Найти(ПутьОтгруженнойПозиции + "ДопДанныеПодписанные", "ПолныйПуть", Истина);
			Если ЗначениеЗаполнено(ДопДанныеПодписанные.Значение) Тогда
				ПутьДопДанные = ПутьОтгруженнойПозиции + "ДопДанныеПодписанные.НомерСтроки.";
				Для Каждого ТекущееПоле Из ДопДанныеПодписанные.Строки Цикл
					ТекстИнф = ПолучитьОбъектТипаCML("ТекстИнфТип", ПространствоИмен);
					
					Идентификатор = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущееПоле, ПутьДопДанные + "Идентификатор");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТекстИнф, "Идентиф", Идентификатор, Истина, Ошибки);
					
					Значение = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущееПоле, ПутьДопДанные + "Значение");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТекстИнф, "Значен", Значение, Истина, Ошибки);
					
					СведТов.ИнфПолФХЖ2.Добавить(ТекстИнф);
				КонецЦикла;	
			КонецЕсли;
			
			ТаблСчФакт.СведТов.Добавить(СведТов);
		КонецЦикла;
	КонецЕсли;
	
	// Всего к оплате.
	ВсегоКОплате = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, Путь + "ВсегоКОплате");
	Если ЗначениеЗаполнено(ВсегоКОплате) Тогда
		СвойствоВсегоОпл = ТаблСчФакт.Свойства().Получить("ВсегоОпл");
		ВсегоОпл = ПолучитьОбъектТипаCML(СвойствоВсегоОпл.Тип, ПространствоИмен);
		ПутьВсегоОпл = Путь + "ВсегоКОплате.";
		
		СтоимостьСНалогом = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
			ДеревоДанных, ПутьВсегоОпл + "СтоимостьСНалогом");
		
		СтоимостьБезНалога = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
			ДеревоДанных, ПутьВсегоОпл + "СтоимостьБезНалога");
		
		ВыводитьПустыеЗначенияСтоимостиБезНалога = Ложь;
		Если ФункцияУПД = ДОП() И Не ЗначениеЗаполнено(СтоимостьСНалогом) Тогда
			Если СтоимостьБезНалога = Неопределено Тогда
				СтоимостьБезНалога = 0;
			КонецЕсли;
			ВыводитьПустыеЗначенияСтоимостиБезНалога = Истина;
		КонецЕсли;
		
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ВсегоОпл, 
			"СтТовБезНДСВсего", 
			СтоимостьБезНалога, 
			СтоимостьТовараОбязательнаУПД_5_02(ФункцияУПД, СпециальныеОбстоятельстваФормированияДокумента, СтоимостьСНалогом), 
			Ошибки,
			ВыводитьПустыеЗначенияСтоимостиБезНалога);
		
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ВсегоОпл, 
			"СтТовУчНалВсего", 
			СтоимостьСНалогом, 
			СтоимостьТовараОбязательнаУПД_5_02(ФункцияУПД, СпециальныеОбстоятельстваФормированияДокумента, СтоимостьБезНалога), 
			Ошибки);
		
		Количество = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
			ДеревоДанных, ПутьВсегоОпл + "Количество");
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ВсегоОпл, "КолНеттоВс", Количество, , Ошибки);
		
		СуммаНалога = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
			ДеревоДанных, ПутьВсегоОпл + "СуммаНалога");
		Если ЗначениеЗаполнено(СуммаНалога) Тогда	
			Налог = ПолучитьОбъектТипаCML("СумНДСТип", ПространствоИмен);
			
			БезНДС = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ДеревоДанных, ПутьВсегоОпл + "СуммаНалога.БезНДС");
			Если ЗначениеЗаполнено(БезНДС) Тогда	
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Налог, "БезНДС", "без НДС", , Ошибки);
			Иначе
				Сумма = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ДеревоДанных, ПутьВсегоОпл + "СуммаНалога.Сумма");
				Сумма = ?(Сумма = Неопределено, 0, Сумма);
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Налог, "СумНал", Сумма, , Ошибки, Истина);
			КонецЕсли;
			
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ВсегоОпл, "СумНалВсего", Налог, , Ошибки, Истина);
			
		КонецЕсли;
		
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТаблСчФакт, "ВсегоОпл", ВсегоОпл, , Ошибки);
	КонецЕсли;	
		
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Документ, "ТаблСчФакт", ТаблСчФакт, , Ошибки);
		
	// Сведения о передаче.
	Путь = "СведенияОПередаче";
	СведенияОПередаче = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, Путь);
	Если ЗначениеЗаполнено(СведенияОПередаче) Тогда			
		СвойствоСвПродПер = Документ.Свойства().Получить("СвПродПер");
		СвПродПер = ПолучитьОбъектТипаCML(СвойствоСвПродПер.Тип, ПространствоИмен);
		
		// Операция.
		Операция = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, Путь + ".Операция");
		Если ЗначениеЗаполнено(Операция) Тогда
		    СвойствоСвПер = СвПродПер.Свойства().Получить("СвПер");
			СвПер = ПолучитьОбъектТипаCML(СвойствоСвПер.Тип, ПространствоИмен);
			ОперацияПуть = Путь + ".Операция.";
			
			СодержаниеОперации = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ДеревоДанных, ОперацияПуть + "СодержаниеОперации");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвПер, "СодОпер", СодержаниеОперации, Истина, Ошибки);
			
			ВидОперации = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ДеревоДанных, ОперацияПуть + "ВидОперации");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвПер, "ВидОпер", ВидОперации, , Ошибки);
			
			ДатаОтгрузки = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ДеревоДанных, ОперацияПуть + "ДатаОтгрузки");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвПер, "ДатаПер", ДатаФНС(ДатаОтгрузки), , Ошибки);
			
			ДатаНачалаПоставки = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ДеревоДанных, ОперацияПуть + "ДатаНачалаПоставки");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвПер, "ДатаНачПер", ДатаФНС(ДатаНачалаПоставки), , Ошибки);
			
			ДатаОкончанияПоставки = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ДеревоДанных, ОперацияПуть + "ДатаОкончанияПоставки");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвПер, "ДатаОконПер", ДатаФНС(ДатаОкончанияПоставки), , Ошибки);
			
			ОснованиеОтгрузкиПередачи = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ДеревоДанных, ОперацияПуть + "ОснованиеОтгрузкиПередачи");
			Если ЗначениеЗаполнено(ОснованиеОтгрузкиПередачи) Тогда
				ОснованиеПуть = ОперацияПуть + "ОснованиеОтгрузкиПередачи.";
				
				ДокументыОснования = ДеревоДанных.Строки.Найти(ОснованиеПуть + "ДокументыОснования", "ПолныйПуть", Истина);
				Если ЗначениеЗаполнено(ДокументыОснования.Значение) Тогда
					ДокументыПуть = ОснованиеПуть + "ДокументыОснования.НомерСтроки.ДокументОснование";
					Для Каждого ТекущийДокумент Из ДокументыОснования.Строки Цикл
				        НовыйДокумент = ПолучитьОбъектТипаCML("РеквДокТип", ПространствоИмен);
						ЗаполнитьРеквизитыДокументаУПД_5_02(НовыйДокумент, ТекущийДокумент, Ошибки, ПространствоИмен, ДокументыПуть);
						СвПер.ОснПер.Добавить(НовыйДокумент);
				    КонецЦикла;
				Иначе
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвПер, "БезДокОснПер", "1", Истина, Ошибки);
				КонецЕсли;
			Иначе
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвПер, "БезДокОснПер", "1", Истина, Ошибки);
			КонецЕсли;
			
			ЛицоОтветственноеЗаПередачу = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ДеревоДанных, ОперацияПуть + "ЛицоОтветственноеЗаПередачу");
			Если ЗначениеЗаполнено(ЛицоОтветственноеЗаПередачу) Тогда
				СвойствоСвЛицПер = СвПер.Свойства().Получить("СвЛицПер");
				СвЛицПер = ПолучитьОбъектТипаCML(СвойствоСвЛицПер.Тип, ПространствоИмен);
				
				Если ЛицоОтветственноеЗаПередачу = "РаботникПродавца" Тогда
					СвойствоРабОргПрод = СвЛицПер.Свойства().Получить("РабОргПрод");
					РабОргПрод = ПолучитьОбъектТипаCML(СвойствоРабОргПрод.Тип, ПространствоИмен);
			        РаботникПродавцаПуть = ОперацияПуть + "ЛицоОтветственноеЗаПередачу.РаботникПродавца.";
					
					Должность = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ДеревоДанных, РаботникПродавцаПуть + "Должность");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(РабОргПрод, "Должность", Должность, Истина, Ошибки);
					
					ИныеСведения = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ДеревоДанных, РаботникПродавцаПуть + "ИныеСведения");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(РабОргПрод, "ИныеСвед", ИныеСведения, , Ошибки);
					
					ФИО = ПолучитьОбъектТипаCML("ФИОТип", ПространствоИмен);
					ЗаполнитьФИО_УПД_5_02(ФИО, ДеревоДанных, РаботникПродавцаПуть + "ФИО", Ошибки);
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(РабОргПрод, "ФИО", ФИО, Истина, Ошибки);
					
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвЛицПер, "РабОргПрод", РабОргПрод, , Ошибки);
				ИначеЕсли ЛицоОтветственноеЗаПередачу = "ИноеЛицо" Тогда	
					СвойствоИнЛицо = СвЛицПер.Свойства().Получить("ИнЛицо");
					ИнЛицо = ПолучитьОбъектТипаCML(СвойствоИнЛицо.Тип, ПространствоИмен);
					ИноеЛицо = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ДеревоДанных, ОперацияПуть + "ЛицоОтветственноеЗаПередачу.ИноеЛицо");
					
					Если ИноеЛицо = "ПредставительОрганизации" Тогда
						СвойствоПредОргПер = ИнЛицо.Свойства().Получить("ПредОргПер");
						ПредОргПер = ПолучитьОбъектТипаCML(СвойствоПредОргПер.Тип, ПространствоИмен);
						ПредставительОрганизацииПуть = ОперацияПуть + "ЛицоОтветственноеЗаПередачу.ИноеЛицо.ПредставительОрганизации.";
						
						Должность = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
							ДеревоДанных, ПредставительОрганизацииПуть + "Должность");
						РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ПредОргПер, "Должность", Должность, Истина, Ошибки);
						
						ИныеСведения = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
							ДеревоДанных, ПредставительОрганизацииПуть + "ИныеСведения");
						РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ПредОргПер, "ИныеСвед", ИныеСведения, , Ошибки);
						
						НаименованиеОрганизации = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
							ДеревоДанных, ПредставительОрганизацииПуть + "НаименованиеОрганизации");
						РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ПредОргПер, "НаимОргПер", НаименованиеОрганизации, Истина, Ошибки);
						
						ИНН = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
							ДеревоДанных, ПредставительОрганизацииПуть + "ИНН");
						РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ПредОргПер, "ИННЮЛПер", ИНН, , Ошибки);
						
						ОснованиеДоверияОтгрузки = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
							ДеревоДанных, ПредставительОрганизацииПуть + "ОснованиеДоверияОтгрузки");
						Если ЗначениеЗаполнено(ОснованиеДоверияОтгрузки) Тогда
							НовыйДокумент = ПолучитьОбъектТипаCML("РеквДокТип", ПространствоИмен);
							ЗаполнитьРеквизитыДокументаУПД_5_02(
								НовыйДокумент, ДеревоДанных, Ошибки, ПространствоИмен, ПредставительОрганизацииПуть + "ОснованиеДоверияОтгрузки");
							РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ПредОргПер, "ОснДоверОргПер", НовыйДокумент, , Ошибки);
						КонецЕсли;
						
						ОснованиеПолномочийПредставителя = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
							ДеревоДанных, ПредставительОрганизацииПуть + "ОснованиеПолномочийПредставителя");
						Если ЗначениеЗаполнено(ОснованиеПолномочийПредставителя) Тогда
							НовыйДокумент = ПолучитьОбъектТипаCML("РеквДокТип", ПространствоИмен);
							ЗаполнитьРеквизитыДокументаУПД_5_02(
								НовыйДокумент, ДеревоДанных, Ошибки, ПространствоИмен, ПредставительОрганизацииПуть + "ОснованиеПолномочийПредставителя");
							РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ПредОргПер, "ОснПолнПредПер", НовыйДокумент, , Ошибки);
						КонецЕсли;
						
						ФИО = ПолучитьОбъектТипаCML("ФИОТип", ПространствоИмен);
						ЗаполнитьФИО_УПД_5_02(ФИО, ДеревоДанных, ПредставительОрганизацииПуть + "ФИО", Ошибки);
						РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ПредОргПер, "ФИО", ФИО, Истина, Ошибки);
						
						РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИнЛицо, "ПредОргПер", ПредОргПер, , Ошибки);
					ИначеЕсли ИноеЛицо = "ФизическоеЛицо" Тогда	
						СвойствоФЛПер = ИнЛицо.Свойства().Получить("ФЛПер");
						ФЛПер = ПолучитьОбъектТипаCML(СвойствоФЛПер.Тип, ПространствоИмен);
						ФизическоеЛицоПуть = ОперацияПуть + "ЛицоОтветственноеЗаПередачу.ИноеЛицо.ФизическоеЛицо.";
						
						ИНН = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
							ДеревоДанных, ФизическоеЛицоПуть + "ИНН");
						РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ФЛПер, "ИННФЛПер", ИНН, , Ошибки);
						
						ИныеСведения = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
							ДеревоДанных, ФизическоеЛицоПуть + "ИныеСведения");
						РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ФЛПер, "ИныеСвед", ИныеСведения, , Ошибки);
						
						ОснованиеДоверияОтгрузки = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
							ДеревоДанных, ФизическоеЛицоПуть + "ОснованиеДоверияОтгрузки");
						Если ЗначениеЗаполнено(ОснованиеДоверияОтгрузки) Тогда
							НовыйДокумент = ПолучитьОбъектТипаCML("РеквДокТип", ПространствоИмен);
							ЗаполнитьРеквизитыДокументаУПД_5_02(
								НовыйДокумент, ДеревоДанных, Ошибки, ПространствоИмен, ФизическоеЛицоПуть + "ОснованиеДоверияОтгрузки");
							РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ФЛПер, "ОснДоверФЛ", НовыйДокумент, , Ошибки);
						КонецЕсли;
						
						ФИО = ПолучитьОбъектТипаCML("ФИОТип", ПространствоИмен);
						ЗаполнитьФИО_УПД_5_02(ФИО, ДеревоДанных, ФизическоеЛицоПуть + "ФИО", Ошибки);
						РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ФЛПер, "ФИО", ФИО, Истина, Ошибки);
						
						РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИнЛицо, "ФЛПер", ФЛПер, , Ошибки);
					КонецЕсли;
					
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвЛицПер, "ИнЛицо", ИнЛицо, , Ошибки);
				КонецЕсли;
			
			    РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвПер, "СвЛицПер", СвЛицПер, , Ошибки);
			КонецЕсли;
			
			Транспортировка = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ДеревоДанных, ОперацияПуть + "Транспортировка");
			Если ЗначениеЗаполнено(Транспортировка) Тогда
				СвойствоТран = СвПер.Свойства().Получить("Тран");
				Тран = ПолучитьОбъектТипаCML(СвойствоТран.Тип, ПространствоИмен);
				ТранспортировкаПуть = ОперацияПуть + "Транспортировка.";
				ВыводитьГруппуТранспортировка = Ложь;
					
				Сведения = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ДеревоДанных, ТранспортировкаПуть + "Сведения");
				Если ЗначениеЗаполнено(Сведения) Тогда
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Тран, "СвТран", Сведения, , Ошибки);
					ВыводитьГруппуТранспортировка = Истина;
				КонецЕсли;
				
				Инкотермс = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ДеревоДанных, ТранспортировкаПуть + "Инкотермс");
				Если ЗначениеЗаполнено(Инкотермс) Тогда
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Тран, "Инкотермс", Инкотермс, , Ошибки);
					ВыводитьГруппуТранспортировка = Истина;
				КонецЕсли;
				
				ВерсияИнкотермс = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ДеревоДанных, ТранспортировкаПуть + "ВерсияИнкотермс");
				Если ЗначениеЗаполнено(ВерсияИнкотермс) Тогда
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Тран, "ВерИнкотермс", ВерсияИнкотермс, , Ошибки);
					ВыводитьГруппуТранспортировка = Истина;
				КонецЕсли;
				
				Если ВыводитьГруппуТранспортировка Тогда
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвПер, "Тран", Тран, , Ошибки);
				КонецЕсли;
			КонецЕсли;	
			
			СведенияОПередачеВещи = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ДеревоДанных, ОперацияПуть + "СведенияОПередачеВещи");
			Если ЗначениеЗаполнено(СведенияОПередачеВещи) Тогда
				СвойствоСвПерВещи = СвПер.Свойства().Получить("СвПерВещи");
				СвПерВещи = ПолучитьОбъектТипаCML(СвойствоСвПерВещи.Тип, ПространствоИмен);
				ПутьПередачиВещи = ОперацияПуть + "СведенияОПередачеВещи.";
				
				ДатаПередачи = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ДеревоДанных, ПутьПередачиВещи + "ДатаПередачи");
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвПерВещи, "ДатаПерВещ", ДатаФНС(ДатаПередачи), , Ошибки);
				
				СведенияОПередаче = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ДеревоДанных, ПутьПередачиВещи + "СведенияОПередаче");
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвПерВещи, "СвПерВещ", СведенияОПередаче, , Ошибки);
				
				ДокументПодтверждающийПередачу = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
					ДеревоДанных, ПутьПередачиВещи + "ДокументПодтверждающийПередачу");
				Если ЗначениеЗаполнено(ДокументПодтверждающийПередачу) Тогда
					НовыйДокумент = ПолучитьОбъектТипаCML("РеквДокТип", ПространствоИмен);
					ЗаполнитьРеквизитыДокументаУПД_5_02(
						НовыйДокумент, ДеревоДанных, Ошибки, ПространствоИмен, ПутьПередачиВещи + "ДокументПодтверждающийПередачу");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвПерВещи, "ДокПерВещ", НовыйДокумент, , Ошибки);
				КонецЕсли;
				
				РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвПер, "СвПерВещи", СвПерВещи, , Ошибки);
			КонецЕсли;
			
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвПродПер, "СвПер", СвПер, , Ошибки);
		КонецЕсли;
		
		// Информационное поле ФХЖ. 
		ИнформационноеПолеФХЖ3 = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
			ДеревоДанных, Путь + ".ИнформационноеПолеФХЖ");
		Если ЗначениеЗаполнено(ИнформационноеПолеФХЖ3) Тогда
			СвойствоИнфПолФХЖ3 = СвПродПер.Свойства().Получить("ИнфПолФХЖ3");
			ИнфПолФХЖ3 = ПолучитьОбъектТипаCML(СвойствоИнфПолФХЖ3.Тип, ПространствоИмен);
			ПутьИнфПолФХЖ3 = Путь + ".ИнформационноеПолеФХЖ.";
				
			ИдентификаторФайла = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
				ДеревоДанных, ПутьИнфПолФХЖ3 + "ИдентификаторФайла");
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ИнфПолФХЖ3, "ИдФайлИнфПол", ИдентификаторФайла, , Ошибки);	
				
			ТекстоваяИнформация = ДеревоДанных.Строки.Найти(ПутьИнфПолФХЖ3 + "ТекстоваяИнформация", "ПолныйПуть", Истина);
			Если ЗначениеЗаполнено(ТекстоваяИнформация.Значение) Тогда
				ТекстоваяИнформацияПуть = ПутьИнфПолФХЖ3 + "ТекстоваяИнформация.НомерСтроки.";
				Для Каждого ТекущаяСтрока Из ТекстоваяИнформация.Строки Цикл
					ТекстИнф = ПолучитьОбъектТипаCML("ТекстИнфТип", ПространствоИмен);
					
					Идентификатор = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущаяСтрока, ТекстоваяИнформацияПуть + "Идентификатор");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТекстИнф, "Идентиф", Идентификатор, Истина, Ошибки);
					
					Значение = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(
						ТекущаяСтрока, ТекстоваяИнформацияПуть + "Значение");
					РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ТекстИнф, "Значен", Значение, Истина, Ошибки);
					
					ИнфПолФХЖ3.ТекстИнф.Добавить(ТекстИнф);
			    КонецЦикла;
			КонецЕсли;	
				
			РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвПродПер, "ИнфПолФХЖ3", ИнфПолФХЖ3, , Ошибки);	
		КонецЕсли;
		
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Документ, "СвПродПер", СвПродПер, , Ошибки);
	КонецЕсли;	
	
	// Основание составителя файла.
	Путь = "ОснованиеСоставителяФайла";
	ОснованиеСоставителяФайла = ДеревоЭлектронногоДокументаБЭД.ЗначениеРеквизитаВДереве(ДеревоДанных, Путь);
	Если ЗначениеЗаполнено(ОснованиеСоставителяФайла) Тогда
		НовыйДокумент = ПолучитьОбъектТипаCML("РеквДокТип", ПространствоИмен);
		ЗаполнитьРеквизитыДокументаУПД_5_02(
			НовыйДокумент, ДеревоДанных, Ошибки, ПространствоИмен, Путь);
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Документ, "ОснДоверОргСост", НовыйДокумент, , Ошибки);
	КонецЕсли;	
		
	// Подписанты.
	Если ЭтоЭлектронноеАктированиеЕИС Тогда
		// Для ЕИС список подписантов определяется заранее.
		МодульЭлектронноеАктированиеЕИС.ЗаполнитьСведенияОПодписантах(
			ДеревоДанных, Документ, ПространствоИмен, Ошибки);
	Иначе
		// Сведения о лице, подписывающем файл обмена.
		СвойствоПодписант = Документ.Свойства().Получить("Подписант");
		Подписант = ПолучитьОбъектТипаCML(СвойствоПодписант.Тип, ПространствоИмен);
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Подписант, "ТипПодпис", "2", Истина, Ошибки); // Простая электронная подпись.
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Подписант, "СпосПодтПолном", "1", Истина, Ошибки); // В соответствии с данными, содержащимися в электронной подписи.
		// В подписанте пустым значением заполняется поле Физ.лицо.
		ФИО = ПолучитьОбъектТипаCML("ФИОТип", ПространствоИмен);
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ФИО, "Фамилия", "-", , Ошибки);
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ФИО, "Имя", "-", , Ошибки);
		РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Подписант, "ФИО", ФИО, Истина, Ошибки);
		
		Документ.Подписант.Добавить(Подписант);
		
	КонецЕсли;

	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Файл, "Документ", Документ, Истина, Ошибки);	
		
	ПроверитьОбъектXDTO(Файл, Ошибки);
	
	Результат = НовыйРезультатЗаполненияДокумента();
	
	Если ЗначениеЗаполнено(Ошибки) Тогда
		
		Результат.Ошибки = Ошибки;
		
	Иначе
		
		Если ЭтоЭлектронноеАктированиеЕИС Тогда
			ВидДокумента = "УПДПрод";
			МодульЭлектронноеАктированиеЕИС.ПриФормированииДвоичныхДанныхЭД(
				ВидДокумента, Файл, ДеревоДанных);
		КонецЕсли;
		
		ДвоичныеДанные = ДвоичныеДанныеОбъектаXDTO(Файл, , , "Файл");
		Результат.ДанныеОсновногоФайла.ДвоичныеДанные =
			ОбщегоНазначенияБЭД.УдалитьПространствоИмен(ДвоичныеДанные, ПространствоИмен);
		
		ИмяФайлаПоУмолчанию = ИдентификаторФайлаXML + ".xml";
		Результат.ДанныеОсновногоФайла.ИмяФайла = ИмяФайлаПоУмолчанию;
		
		// Формирование приложения для ЕИС в сфере закупок.
		Если ЭтоЭлектронноеАктированиеЕИС Тогда
			РезультатСозданияПриложения = МодульЭлектронноеАктированиеЕИС.
				СформироватьДанныеПриложенияУПДДляЕИС(ДеревоДанных, ИдентификаторФайлаXML);
			Если НЕ РезультатСозданияПриложения.Выполнено Тогда
				ОбщегоНазначенияБЭД.ДобавитьОшибку(
					Результат.Ошибки, РезультатСозданияПриложения.ОписаниеОшибки);
			КонецЕсли;
				
			Результат.ДанныеДополнительногоФайла.ДвоичныеДанные =
				РезультатСозданияПриложения.ДвоичныеДанные;
			Результат.ДанныеДополнительногоФайла.ИмяФайла =
				РезультатСозданияПриложения.ИмяФайла;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&ИзменениеИКонтроль("ПрочитатьСчетФактуруXDTO")
Процедура ИТБК_ПрочитатьСчетФактуруXDTO(ЭД, ДанныеРазбора, НовыйЭД, Ошибка)

	НовыйЭД.ВидЭД = Перечисления.ТипыДокументовЭДО.СчетФактура;

	ДеревоЭлектронногоДокументаБЭД.ДобавитьРеквизитШапкиОбъекта(НовыйЭД, "Номер", ЭД.Документ.СвСчФакт.НомерСчФ);
	ДеревоЭлектронногоДокументаБЭД.ДобавитьРеквизитШапкиОбъекта(НовыйЭД, "ИдентификаторДокумента", ЭД.ИдФайл);
	ДеревоЭлектронногоДокументаБЭД.ДобавитьРеквизитШапкиОбъекта(НовыйЭД, "Дата", ФорматыЭДО.ДатаИзСтроки(ЭД.Документ.СвСчФакт.ДатаСчФ));
	ДеревоЭлектронногоДокументаБЭД.ДобавитьРеквизитШапкиОбъекта(НовыйЭД, "ВалКод", ЭД.Документ.СвСчФакт.КодОКВ);
	Если НЕ ЭД.Документ.СвСчФакт.ИспрСчФ = Неопределено Тогда
		ДеревоЭлектронногоДокументаБЭД.ДобавитьРеквизитШапкиОбъекта(НовыйЭД, "НомерИсправления", ЭД.Документ.СвСчФакт.ИспрСчФ.НомИспрСчФ);
		ДеревоЭлектронногоДокументаБЭД.ДобавитьРеквизитШапкиОбъекта(НовыйЭД, "ДатаИсправления", ФорматыЭДО.ДатаИзСтроки(ЭД.Документ.СвСчФакт.ИспрСчФ.ДатаИспрСчФ));
	КонецЕсли;

	Если НЕ ЭД.Документ.СвСчФакт.ГрузОт = Неопределено Тогда
		Если НЕ ЭД.Документ.СвСчФакт.ГрузОт.ГрузОтпр = Неопределено Тогда
			Если НЕ ЭД.Документ.СвСчФакт.ГрузОт.ГрузОтпр.НаимГоп.НаимОрг = Неопределено Тогда
				ДеревоЭлектронногоДокументаБЭД.ДобавитьРеквизитШапкиОбъекта(НовыйЭД, "Грузоотправитель", ЭД.Документ.СвСчФакт.ГрузОт.ГрузОтпр.НаимГоп.НаимОрг);
			Иначе
				ДеревоЭлектронногоДокументаБЭД.ДобавитьРеквизитШапкиОбъекта(НовыйЭД, "Грузоотправитель",
				ЭД.Документ.СвСчФакт.ГрузОт.ГрузОтпр.НаимГоп.ФИОИП.Фамилия + " " + ЭД.Документ.СвСчФакт.ГрузОт.ГрузОтпр.НаимГоп.ФИОИП.Имя
				+ " " + ЭД.Документ.СвСчФакт.ГрузОт.ГрузОтпр.НаимГоп.ФИОИП.Отчество);
			КонецЕсли;
			Если Не ЭД.Документ.СвСчФакт.ГрузОт.ГрузОтпр.Адрес.АдрИно = Неопределено Тогда
				ДеревоЭлектронногоДокументаБЭД.ДобавитьРеквизитШапкиОбъекта(НовыйЭД, "ГрузоотправительАдрес", ЭД.Документ.СвСчФакт.ГрузОт.ГрузОтпр.Адрес.АдрИно.АдрТекст);
				ДеревоЭлектронногоДокументаБЭД.ДобавитьРеквизитШапкиОбъекта(НовыйЭД, "ГрузоотправительКодСтраны", ЭД.Документ.СвСчФакт.ГрузОт.ГрузОтпр.Адрес.АдрИно.КодСтр);
			Иначе
				ДеревоЭлектронногоДокументаБЭД.ДобавитьРеквизитШапкиОбъекта(НовыйЭД, "ГрузоотправительАдрес", СоставнойАдрес(ЭД.Документ.СвСчФакт.ГрузОт.ГрузОтпр.Адрес.АдрРФ));
			КонецЕсли
		ИначеЕсли НЕ ЭД.Документ.СвСчФакт.ГрузОт.ОнЖе = Неопределено Тогда
			ДеревоЭлектронногоДокументаБЭД.ДобавитьРеквизитШапкиОбъекта(НовыйЭД, "Грузоотправитель", НСтр("ru = 'он же'"));
#Вставка
//Сообщить(ЭД.Документ.СвСчФакт.ГрузОт.ОнЖе);
//Сообщить("4");
#КонецВставки
		КонецЕсли;
	КонецЕсли;

	Если НЕ ЭД.Документ.СвСчФакт.ГрузПолуч = Неопределено Тогда
		Если НЕ ЭД.Документ.СвСчФакт.ГрузПолуч.НаимГоп.НаимОрг = Неопределено Тогда
			ДеревоЭлектронногоДокументаБЭД.ДобавитьРеквизитШапкиОбъекта(НовыйЭД, "Грузополучатель", ЭД.Документ.СвСчФакт.ГрузПолуч.НаимГоп.НаимОрг);
		Иначе
			ДеревоЭлектронногоДокументаБЭД.ДобавитьРеквизитШапкиОбъекта(
			НовыйЭД,
			"Грузополучатель",
			ЭД.Документ.СвСчФакт.ГрузПолуч.НаимГоп.ФИОИП.Фамилия + " " + ЭД.Документ.СвСчФакт.ГрузПолуч.НаимГоп.ФИОИП.Имя
			+ " " + ЭД.Документ.СвСчФакт.ГрузПолуч.НаимГоп.ФИОИП.Отчество);
		КонецЕсли;

		Если НЕ ЭД.Документ.СвСчФакт.ГрузПолуч.Адрес.АдрИно = Неопределено Тогда
			ДеревоЭлектронногоДокументаБЭД.ДобавитьРеквизитШапкиОбъекта(НовыйЭД, "ГрузополучательАдрес", ЭД.Документ.СвСчФакт.ГрузПолуч.Адрес.АдрИно.АдрТекст);
			ДеревоЭлектронногоДокументаБЭД.ДобавитьРеквизитШапкиОбъекта(НовыйЭД, "ГрузополучательКодСтраны", ЭД.Документ.СвСчФакт.ГрузПолуч.Адрес.АдрИно.КодСтр);
		Иначе
			ДеревоЭлектронногоДокументаБЭД.ДобавитьРеквизитШапкиОбъекта(НовыйЭД, "ГрузополучательАдрес", СоставнойАдрес(ЭД.Документ.СвСчФакт.ГрузПолуч.Адрес.АдрРФ));
		КонецЕсли
	КонецЕсли;

	ДеревоДопДанных = Неопределено;
	СтрокаДерева = НовыйЭД.Строки.Найти("ДеревоДопДанных", "Реквизит");
	Если СтрокаДерева <> Неопределено И ТипЗнч(СтрокаДерева.ЗначениеРеквизита) = Тип("ДеревоЗначений") Тогда
		ДеревоДопДанных = СтрокаДерева.ЗначениеРеквизита;
	КонецЕсли;
	ИнфПол = ЭД.Документ.СвСчФакт.ИнфПол;
	Если ИнфПол <> Неопределено И ИнфПол.ТекстИнф <> Неопределено И СтрНайти(ИнфПол.ТекстИнф, "xml") = 0 Тогда
		Если ЭД.ВерсФорм = "5.02" Тогда

			ПрочитатьДопДанныеФНС_502(ИнфПол, ДеревоДопДанных, "Шапка");

		Иначе
			Если ИнфПол <> Неопределено И ИнфПол.ТекстИнф <> Неопределено И СтрНайти(ИнфПол.ТекстИнф, "xml") = 0 Тогда
				ФорматыЭДО.ПрочитатьИнфПол(ИнфПол.ТекстИнф, ДеревоДопДанных, "Шапка");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	КомиссионнаяСФ = Ложь;
	Если ТипЗнч(ДеревоДопДанных) = Тип("ДеревоЗначений") Тогда
		ЗаполнитьШапкуПоДопДанным(ДеревоДопДанных, НовыйЭД, Ошибка);
		КомиссионнаяСФ = ЗаполнитьДанныеКомиссионераИзДопДанных(ДанныеРазбора, НовыйЭД, "SFAKT", Ошибка);
		Если Ошибка Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;

	Продавец = ЭД.Документ.СвСчФакт.СвПрод;
	Покупатель = ЭД.Документ.СвСчФакт.СвПокуп;
	ДеревоЭлектронногоДокументаБЭД.ДобавитьРеквизитШапкиОбъекта(НовыйЭД, "ВыставленныйКомитентом", КомиссионнаяСФ);
	Если НовыйЭД.НаправлениеЭД = Перечисления.НаправленияЭДО.Исходящий
		ИЛИ НовыйЭД.НаправлениеЭД = Перечисления.НаправленияЭДО.Интеркампани Тогда
		ПрочитатьДанныеКонтрагента(Продавец, ЭД, ДанныеРазбора, НовыйЭД, Ошибка, "Продавец");
		ПрочитатьДанныеКонтрагента(Покупатель, ЭД, ДанныеРазбора, НовыйЭД, Ошибка, "Покупатель");
	ИначеЕсли НовыйЭД.НаправлениеЭД = Перечисления.НаправленияЭДО.Входящий Тогда
		ПрочитатьДанныеКонтрагента(Продавец, ЭД, ДанныеРазбора, НовыйЭД, Ошибка, "Покупатель");
		Если КомиссионнаяСФ Тогда
			ПрочитатьДанныеКонтрагента(Покупатель, ЭД, ДанныеРазбора, НовыйЭД, Ошибка, "ПокупательКомиссии");
		Иначе
			ПрочитатьДанныеКонтрагента(Покупатель, ЭД, ДанныеРазбора, НовыйЭД, Ошибка, "Продавец");
		КонецЕсли;
	КонецЕсли;

	Организация = ПолучитьРеквизитШапкиЭД(НовыйЭД, "Организация", ДанныеРазбора.ДеревоРазбора);

	Если НЕ ЭД.Документ.СвСчФакт.СвПРД = Неопределено И ЭД.Документ.СвСчФакт.СвПРД.Количество() > 0 Тогда
		ПлатежныеДокументы = "";
		ПервыйЭлемент = Истина;
		Для Каждого СтрокаПлатежа Из ЭД.Документ.СвСчФакт.СвПРД Цикл
			ПлатежныеДокументы = ПлатежныеДокументы + ?(ПервыйЭлемент,"",", № ") + СтрокаПлатежа.НомерПРД + " от " + СтрокаПлатежа.ДатаПРД;
			ПервыйЭлемент = Ложь;
		КонецЦикла;
		ДеревоЭлектронногоДокументаБЭД.ДобавитьРеквизитШапкиОбъекта(НовыйЭД, "ПлатежныйДокумент", ПлатежныеДокументы);
	КонецЕсли;

	Если Не ЭД.Документ.Подписант.Свойства().Получить("ИП") = Неопределено
		И Не ЭД.Документ.Подписант.ИП = Неопределено Тогда

		ДеревоЭлектронногоДокументаБЭД.ДобавитьРеквизитШапкиОбъекта(НовыйЭД, "ПодписантИП", ЭД.Документ.Подписант.ИП.ФИО.Фамилия + " "
		+ ЭД.Документ.Подписант.ИП.ФИО.Имя + " " + ЭД.Документ.Подписант.ИП.ФИО.Отчество);
		ДеревоЭлектронногоДокументаБЭД.ДобавитьРеквизитШапкиОбъекта(НовыйЭД, "ПодписантИННФЛ", ЭД.Документ.Подписант.ИП.ИННФЛ);
		ДеревоЭлектронногоДокументаБЭД.ДобавитьРеквизитШапкиОбъекта(НовыйЭД, "ПодписантСвГосРегИП", ЭД.Документ.Подписант.ИП.СвГосРегИП);
	ИначеЕсли Не ЭД.Документ.Подписант.Свойства().Получить("ЮЛ") = Неопределено
		И Не ЭД.Документ.Подписант.ЮЛ = Неопределено Тогда

		ДеревоЭлектронногоДокументаБЭД.ДобавитьРеквизитШапкиОбъекта(НовыйЭД, "ПодписантЮЛ", ЭД.Документ.Подписант.ЮЛ.ФИО.Фамилия + " "
		+ ЭД.Документ.Подписант.ЮЛ.ФИО.Имя + " " + ЭД.Документ.Подписант.ЮЛ.ФИО.Отчество);
		ДеревоЭлектронногоДокументаБЭД.ДобавитьРеквизитШапкиОбъекта(НовыйЭД, "ПодписантИННЮЛ", ЭД.Документ.Подписант.ЮЛ.ИННЮЛ);
	КонецЕсли;

	ДеревоЭлектронногоДокументаБЭД.ДобавитьРеквизитШапкиОбъекта(НовыйЭД, "СтТовБезНДС",ЭД.Документ.ТаблСчФакт.ВсегоОпл.СтТовБезНДСВсего);
	ДеревоЭлектронногоДокументаБЭД.ДобавитьРеквизитШапкиОбъекта(НовыйЭД, "СтТовУчНал", ЭД.Документ.ТаблСчФакт.ВсегоОпл.СтТовУчНалВсего);
	ДеревоЭлектронногоДокументаБЭД.ДобавитьРеквизитШапкиОбъекта(НовыйЭД, "СуммаДокумента", ЭД.Документ.ТаблСчФакт.ВсегоОпл.СтТовУчНалВсего);
	ДеревоЭлектронногоДокументаБЭД.ДобавитьРеквизитШапкиОбъекта(НовыйЭД, "СумНДС",     СуммаНДССФПривестиКТребуемомуФормату(
	ЭД.Документ.ТаблСчФакт.ВсегоОпл.СумНалВсего.СумНДС));

	Для Каждого Товар Из ЭД.Документ.ТаблСчФакт.СведТов Цикл

		СписокТЧ = Новый СписокЗначений;
		СписокТЧ.Добавить(Товар.НомСтр,         "НомСтр");
		СписокТЧ.Добавить(Товар.НаимТов,        "НаимТов");
		СписокТЧ.Добавить(Товар.ОКЕИ_Тов,       "ОКЕИ_Тов");
		СписокТЧ.Добавить(Товар.КолТов,         "КолТов");
		СписокТЧ.Добавить(Товар.ЦенаТов,        "ЦенаТов");
		СписокТЧ.Добавить(Товар.СтТовБезНДС,    "СтТовБезНДС");
		СписокТЧ.Добавить(Товар.СтТовУчНал,     "СтТовУчНал");
		Если ЭД.ВерсФорм = "5.01" Тогда
			СписокТЧ.Добавить(Товар.НалСт.НалСтВел, "НалСтВел");
			СписокТЧ.Добавить(Товар.НалСт.НалСтТип, "НалСтТип");
		Иначе
			СписокТЧ.Добавить(Товар.НалСт, "НалСтВел");
		КонецЕсли;

		СумАкциз = Товар.Акциз.СумАкциз;
		Если Не ЗначениеЗаполнено(СумАкциз) Тогда
			СумАкциз = Товар.Акциз.БезАкциз;
		КонецЕсли;
		СписокТЧ.Добавить(СумАкциз, "СумАкциз");

		СписокТЧ.Добавить(СуммаНДССФПривестиКТребуемомуФормату(Товар.СумНал.СумНДС), "СумНДС");
		Если ЗначениеЗаполнено(Товар.ОКЕИ_Тов) Тогда
			ЕдИзм = ЭлектронноеВзаимодействие.НайтиСсылку("ЕдиницыИзмерения", Строка(Товар.ОКЕИ_Тов));
			Если ЗначениеЗаполнено(ЕдИзм) Тогда
				СписокТЧ.Добавить(Строка(ЕдИзм), "ЕдиницаИзмерения");
			КонецЕсли;
		КонецЕсли;

		Если ЗначениеЗаполнено(Товар.ИнфПолСтр) Тогда
			// В инф.поле xml-строка Актуального формата.
			ИнфПол = Товар.ИнфПолСтр;
			Если ЭД.ВерсФорм = "5.01" Тогда

				ФорматыЭДО.ПрочитатьИнфПол(ИнфПол, ДеревоДопДанных, "Товары", Товар.НомСтр);

			Иначе

				ПрочитатьДопДанныеТЧ_ФНС502(ИнфПол, ДеревоДопДанных, "Товары", Товар.НомСтр);

			КонецЕсли;
			ЗаполнитьСтрокуТЧПоДопДанным(ДеревоДопДанных, СписокТЧ, Товар.НомСтр, "Товары", Ошибка);
		КонецЕсли;

		Если ЭД.ВерсФорм = "5.01" Тогда

			Если НЕ Товар.НомерТД = Неопределено И Товар.НомерТД.Количество() > 0 Тогда
				НомераТД = "";
				Для Каждого СтрокаТД Из Товар.НомерТД Цикл
					НомераТД = НомераТД + СтрокаТД + ", ";
				КонецЦикла;
				СписокТЧ.Добавить(НомераТД, "НомерТД");
			КонецЕсли;

			Если НЕ Товар.КодПроисх = Неопределено И Товар.КодПроисх.Количество() > 0 Тогда
				СписокТЧ.Добавить(Товар.КодПроисх[0], "КодПроисх");
			КонецЕсли;

		Иначе
			НомераТД = "";
			КодПроисх = "";
			НаименованиеСтраныПроисхождения = "";

			ДопДанныеТаможеннойДекларации = Неопределено;
			СписокТЧДопДанныеТаможеннойДекларации = СписокТЧ.НайтиПоЗначению("ДопДанныеТаможеннойДекларации");
			Если Не СписокТЧДопДанныеТаможеннойДекларации = Неопределено Тогда 
				ЧтениеXML = Новый ЧтениеXML;
				ЧтениеXML.УстановитьСтроку(СписокТЧДопДанныеТаможеннойДекларации.Представление);
				ДопДанныеТаможеннойДекларации = СериализаторXDTO.ПрочитатьXML(ЧтениеXML, Тип("ТаблицаЗначений"));
			КонецЕсли;
			Для Каждого СведенияТД Из Товар.СвТД Цикл
				НомераТД = НомераТД + СведенияТД.НомерТД;
				КодПроисх = КодПроисх + СведенияТД.КодПроисх;
				Если Не ДопДанныеТаможеннойДекларации = Неопределено Тогда 
					НаименованиеСтраныИзДопДанных = ДопДанныеТаможеннойДекларации.Найти(КодПроисх, "КодСтраныПроисхождения");
					Если Не НаименованиеСтраныИзДопДанных = Неопределено Тогда
						НаименованиеСтраныПроисхождения = НаименованиеСтраныПроисхождения + НаименованиеСтраныИзДопДанных.НаименованиеСтраныПроисхождения;
					КонецЕсли
				КонецЕсли;
			КонецЦикла;

			СписокТЧ.Добавить(НомераТД, "НомерТД");
			СписокТЧ.Добавить(КодПроисх, "КодПроисх");
			СписокТЧ.Добавить(НаименованиеСтраныПроисхождения, "НаименованиеСтраныПроисхождения");

			Если Не СписокТЧДопДанныеТаможеннойДекларации = Неопределено Тогда
				СписокТЧ.Удалить(СписокТЧДопДанныеТаможеннойДекларации);
			КонецЕсли;
		КонецЕсли;

		ДеревоЭлектронногоДокументаБЭД.ДобавитьРеквизитыТЧОбъекта(НовыйЭД, "СтрокаТЧ", СписокТЧ);
	КонецЦикла;

	СтрокаДерева = НовыйЭД.Строки.Найти("ДеревоДопДанных", "Реквизит");
	Если СтрокаДерева = Неопределено Тогда
		ДеревоЭлектронногоДокументаБЭД.ДобавитьРеквизитШапкиОбъекта(НовыйЭД, "ДеревоДопДанных", ДеревоДопДанных);
	КонецЕсли;

КонецПроцедуры
