//@strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Задает расширенные настройки отчета
//
// Параметры:
//   Настройки - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.Настройки.
//
Процедура НастроитьВариантыОтчета(Настройки) Экспорт
	
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ОстаткиТоваровПереданныхПереработчикам);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьПроизводствоНаСтороне");
	ОписаниеВарианта.Описание = НСтр("ru= 'Каков остаток сырья и материалов у переработчиков?
	|Какая потребность в сырье и материалах у переработчиков?
	|Какой излишек/дефицит сырья и материалов у переработчиков?'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СырьеИМатериалыУПереработчиков");
	ОписаниеВарианта.Описание = НСтр("ru= 'Каков остаток сырья и материалов у переработчиков?
	|Какая потребность в сырье и материалах у переработчиков?
	|Какой излишек/дефицит сырья и материалов у переработчиков?'");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
