
&ИзменениеИКонтроль("ОбработатьДанныеДляПереходаНаНовуюВерсию")
Процедура vs_ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры)
	
	ПолноеИмяОбъекта = "РегистрНакопления.РасчетыСПоставщиками";

	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	Если ОбновляемыеДанные.Количество() = 0 Тогда
		Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
		Если Параметры.ОбработкаЗавершена
			И ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Неопределено, Метаданные.РегистрыНакопления.РасчетыСКлиентами.ПолноеИмя())
			И ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Неопределено, Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.ПолноеИмя())
			И ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Неопределено, Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.ПолноеИмя()) Тогда
			Константы.УдалитьТипыЗаписейВзаиморасчетовЗаполнены.Установить(Истина);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	#Область ТекстЗапроса
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОбновляемыеДанные.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТДляОбработки
	|ИЗ
	|	&ОбновляемыеДанные КАК ОбновляемыеДанные
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|
	|ВЫБРАТЬ
	|	СсылкиДляОбработки.Регистратор КАК Регистратор,
	|	СсылкиДляОбработки.Регистратор.Номер КАК РегистраторНомер
	|ИЗ 
	|	ВТДляОбработки КАК СсылкиДляОбработки
	|;
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыПриемники.Регистратор КАК Ссылка
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК РасчетыПриемники
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДляОбработки КАК СсылкиДляОбработки
	|		ПО РасчетыПриемники.Регистратор = СсылкиДляОбработки.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщиками КАК НеПустыеПриемники
	|	ПО РасчетыПриемники.Регистратор = НеПустыеПриемники.Регистратор
	|		И НеПустыеПриемники.ОбъектРасчетовПриемник <> ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)
	|		И НеПустыеПриемники.АналитикаУчетаПоПартнерамПриемник <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка)
	|		И НеПустыеПриемники.ВалютаПриемник <> ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|		И НеПустыеПриемники.СуммаПриемник <> 0
	|ГДЕ
	|	&НоваяАрхитектураВзаиморасчетов
	|	И НеПустыеПриемники.Регистратор ЕСТЬ NULL
	|	И РасчетыПриемники.ПоДаннымОбъектаРасчетовИсточника
	|	И ТИПЗНАЧЕНИЯ(РасчетыПриемники.Регистратор) <> ТИП(Документ.ВзаимозачетЗадолженности)
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыСПоставщиками.Регистратор КАК Регистратор,
	|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетовНакладная
	|ПОМЕСТИТЬ ВтОбъектыРасчетов
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК РасчетыСПоставщиками
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДляОбработки КАК ВТДляОбработки
	|		ПО ВТДляОбработки.Регистратор = РасчетыСПоставщиками.Регистратор
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ПО (РасчетыСПоставщиками.Регистратор = ОбъектыРасчетов.Объект)
	|ГДЕ
	|	РасчетыСПоставщиками.Сумма <> 0
	|	И НЕ РасчетыСПоставщиками.ЗакупкаПоЗаказу В (&ПустыеСсылкиНаЗаказы)
	|	И РасчетыСПоставщиками.ЗакупкаПоЗаказу.ПорядокРасчетов В(&ПорядкиРасчетов)
	|	И НЕ РасчетыСПоставщиками.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	ОбъектРасчетовНакладная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтОбъектыРасчетов.Регистратор КАК Ссылка
	|ИЗ
	|	ВтОбъектыРасчетов КАК ВтОбъектыРасчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщиками.Обороты(
	|				,
	|				,
	|				Регистратор,
	|				ОбъектРасчетов В
	|					(ВЫБРАТЬ
	|						Т.ОбъектРасчетовНакладная
	|					ИЗ
	|						ВтОбъектыРасчетов КАК Т)) КАК РасчетыСПоставщикамиОбороты
	|		ПО (ВтОбъектыРасчетов.Регистратор = РасчетыСПоставщикамиОбороты.Регистратор)
	|			И (ВтОбъектыРасчетов.ОбъектРасчетовНакладная = РасчетыСПоставщикамиОбороты.ОбъектРасчетов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтОбъектыРасчетов.Регистратор
	|
	|ИМЕЮЩИЕ
	|	СУММА(ЕСТЬNULL(РасчетыСПоставщикамиОбороты.СуммаОборот, 0)) <> СУММА(ЕСТЬNULL(РасчетыСПоставщикамиОбороты.КОплатеОборот, 0))
	|;
	|
	// Исправление хозяйственных операций
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Ссылка
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДляОбработки КАК СсылкиДляОбработки
	|		ПО Расчеты.Регистратор = СсылкиДляОбработки.Регистратор
	|ГДЕ
	|	ВЫРАЗИТЬ(Расчеты.Регистратор КАК Документ.ВзаимозачетЗадолженности).ВидОперации В (&ВидыОперацийПоДолгу)
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Ссылка
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДляОбработки КАК СсылкиДляОбработки
	|		ПО Расчеты.Регистратор = СсылкиДляОбработки.Регистратор
	|ГДЕ
	|	ВЫРАЗИТЬ(Расчеты.Регистратор КАК Документ.ВзаимозачетЗадолженности).ВидОперации В (&ВидыОперацийПоАвансу)
	|;
	|
	// Заполнение флага ПоДаннымОбъектаРасчетовИсточника в расчетах по срокам
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыПриемники.ДокументРегистратор КАК Ссылка
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыИсточники
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДляОбработки КАК СсылкиДляОбработки
	|		ПО РасчетыИсточники.ДокументРегистратор = СсылкиДляОбработки.Регистратор
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыПриемники
	|	ПО РасчетыИсточники.ДокументРегистратор = РасчетыПриемники.ДокументРегистратор
	|		И РасчетыИсточники.ОбъектРасчетовПриемник = РасчетыПриемники.ОбъектРасчетов
	|		И РасчетыИсточники.АналитикаУчетаПоПартнерамПриемник = РасчетыПриемники.АналитикаУчетаПоПартнерам
	|		И РасчетыИсточники.ВалютаПриемник = РасчетыПриемники.Валюта
	|		И РасчетыИсточники.СуммаПриемник <> 0
	|ГДЕ
	|	&НоваяАрхитектураВзаиморасчетов
	|	И НЕ РасчетыПриемники.ПоДаннымОбъектаРасчетовИсточника
	|;
	|
	// Документы основания Сторно
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СсылкиДляОбработки.Регистратор КАК Ссылка,
	|	ДанныеСторно.СторнируемыйДокумент КАК СторнируемыйДокумент
	|ИЗ
	|	ВТДляОбработки КАК СсылкиДляОбработки
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Сторно КАК ДанныеСторно
	|		ПО СсылкиДляОбработки.Регистратор = ДанныеСторно.Ссылка
	|;
	|
	// Возвраты товаров
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СсылкиДляОбработки.Регистратор КАК Ссылка,
	|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетов
	|ИЗ
	|	ВТДляОбработки КАК СсылкиДляОбработки
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ПО СсылкиДляОбработки.Регистратор = ОбъектыРасчетов.Объект
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(СсылкиДляОбработки.Регистратор) В 
	|		(ТИП(Документ.ВозвратТоваровПоставщику),
	|		ТИП(Документ.ВозвратТоваровМеждуОрганизациями))
	|	И ОбъектыРасчетов.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком)
	|;
	|
	// Исправление кор. аналитики для взаимозачета задолженности
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Ссылка
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТДляОбработки КАК СсылкиДляОбработки
	|		ПО Расчеты.Регистратор = СсылкиДляОбработки.Регистратор
	|ГДЕ
	|	Расчеты.ПоДаннымОбъектаРасчетовИсточника
	|	И (Расчеты.КорОбъектРасчетов = ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)
	|		ИЛИ Расчеты.КорАналитикаУчетаПопартнерам = ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка))
	|	И Расчеты.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности
	|";
	#КонецОбласти
	
	НоваяАрхитектураВзаиморасчетов = ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов");
	Запрос.УстановитьПараметр("НоваяАрхитектураВзаиморасчетов", НоваяАрхитектураВзаиморасчетов);
	Запрос.УстановитьПараметр("ОбновляемыеДанные", ОбновляемыеДанные);
	Запрос.УстановитьПараметр("ПустыеСсылкиНаЗаказы", ОперативныеВзаиморасчетыСервер.ПустыеСсылкиНаЗаказы());
	МассивПорядковРасчетов = Новый Массив;
	МассивПорядковРасчетов.Добавить(Перечисления.ПорядокРасчетов.ПоДоговорамНакладным);
	МассивПорядковРасчетов.Добавить(Перечисления.ПорядокРасчетов.ПоЗаказамНакладным);
	Запрос.УстановитьПараметр("ПорядкиРасчетов", МассивПорядковРасчетов);
	Запрос.УстановитьПараметр("ВидыОперацийПоДолгу", РегистрыНакопления.РасчетыСКлиентами.ВидыОперацийПоДолгу());
	Запрос.УстановитьПараметр("ВидыОперацийПоАвансу", РегистрыНакопления.РасчетыСКлиентами.ВидыОперацийПоАвансу());
	РезультатыЗапроса = Запрос.ВыполнитьПакет();

	ОбновляемыеДанные =  РезультатыЗапроса[1].Выбрать();
	ОчисткаФлагаПоДаннымИсточника = РезультатыЗапроса[2].Выгрузить().ВыгрузитьКолонку("Ссылка");
	ИсправлениеОстатковКОплате = РезультатыЗапроса[4].Выгрузить().ВыгрузитьКолонку("Ссылка");
	ВзаимозачетПереносДолга = РезультатыЗапроса[5].Выгрузить().ВыгрузитьКолонку("Ссылка");
	ВзаимозачетПереносАванса = РезультатыЗапроса[6].Выгрузить().ВыгрузитьКолонку("Ссылка");
	ЗаполнениеФлагаВРасчетахПоСрокам = РезультатыЗапроса[7].Выгрузить().ВыгрузитьКолонку("Ссылка");
	СторнируемыеДокументы = РезультатыЗапроса[8].Выгрузить();
	СторнируемыеДокументы.Индексы.Добавить("Ссылка");
	ВозвратыТоваров = РезультатыЗапроса[9].Выгрузить();
	ВозвратыТоваров.Индексы.Добавить("Ссылка");
	ВзаимозачетКорАналитика = РезультатыЗапроса[10].Выгрузить();
	
	ЗапросВспомогательныхДанных = РегистрыНакопления.РасчетыСКлиентами.ЗапросВспомогательныхДанных(Ложь);
	ЗапросДанныхОперативногоРегистра = РегистрыНакопления.РасчетыСКлиентами.ЗапросДанныхОперативногоРегистра(Ложь);
	ЗапросКорАналитики = РегистрыНакопления.РасчетыСКлиентами.ЗапросКорАналитики();
	
	НастройкаХозяйственнойОперации = 
		Справочники.НастройкиХозяйственныхОпераций.НайтиПоРеквизиту("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.ОплатаПоставщику);
	НеИспользуемаяНастройкаОперации = 
		Справочники.НастройкиХозяйственныхОпераций.НайтиПоРеквизиту("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.УдалитьОплатаСамозанятому);
	
	ДанныеЗаменыОперации = РегистрыНакопления.РасчетыСКлиентами.ДанныеЗаменыОперации();
	
	Пока ОбновляемыеДанные.Следующий() Цикл
		
		ПроблемныйРегистратор = ОбновляемыеДанные.Регистратор;
		
		Если НоваяАрхитектураВзаиморасчетов Тогда
			ЗапросВспомогательныхДанных.УстановитьПараметр("Ссылка", ПроблемныйРегистратор);
			ВспомогательныеДанные = ЗапросВспомогательныхДанных.ВыполнитьПакет();
			РегистраторыРасчетов = ВспомогательныеДанные[0].Выгрузить();
		КонецЕсли;
		
		НачатьТранзакцию();
		
		Попытка
			
			ПричинаИсключения = "Блокировка";
			#Область Блокировки
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПоставщиками.НаборЗаписей");
			ЭлементБлокировки.УстановитьЗначение("Регистратор", ПроблемныйРегистратор);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			Если НоваяАрхитектураВзаиморасчетов Тогда
				ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСКлиентамиПоСрокам.НаборЗаписей");
				ЭлементБлокировки.ИсточникДанных = РегистраторыРасчетов;
				ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Регистратор", "Регистратор");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				
				ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПоставщикамиПоСрокам.НаборЗаписей");
				ЭлементБлокировки.ИсточникДанных = РегистраторыРасчетов;
				ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Регистратор", "Регистратор");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			КонецЕсли;
			
			Блокировка.Заблокировать();
			#КонецОбласти
			
			ПричинаИсключения = "ПлохиеДанные";
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ПроблемныйРегистратор);
			НаборЗаписей.Прочитать();
			
			Если ЗаполнениеФлагаВРасчетахПоСрокам.Найти(ПроблемныйРегистратор) <> Неопределено Тогда
				РегистрыНакопления.РасчетыСКлиентами.ЗаполнитьФлагВРасчетахПоСрокам(НаборЗаписей, ВспомогательныеДанные, РегистраторыРасчетов);
			КонецЕсли;
			
			Если ОчисткаФлагаПоДаннымИсточника.Найти(ПроблемныйРегистратор) <> Неопределено Тогда
				Для Каждого Запись Из НаборЗаписей Цикл
					Запись.ПоДаннымОбъектаРасчетовИсточника = Ложь;
				КонецЦикла;
			КонецЕсли;

			ЕстьЗаявкиНаРасходованиеДенежныхСредств = Ложь;
			Для Каждого Запись Из НаборЗаписей Цикл
				Если Запись.ВидДвижения = ВидДвиженияНакопления.Приход
					И Запись.КОплате > 0 
					И НачалоДня(Запись.Период) < НачалоДня(Запись.ДатаРегистратора)
					И НЕ ТипЗнч(ПроблемныйРегистратор) = Тип("ДокументСсылка.ВводОстатков")
					И НЕ ТипЗнч(ПроблемныйРегистратор) = Тип("ДокументСсылка.ВводОстатковВзаиморасчетов") Тогда
					Запись.Период = Запись.ДатаРегистратора;
				КонецЕсли;
				
				Если Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.УдалитьОплатаСамозанятому Тогда
					
					Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоставщику;
					
					Если ЗначениеЗаполнено(Запись.НастройкаХозяйственнойОперации)
						И Запись.НастройкаХозяйственнойОперации = НеИспользуемаяНастройкаОперации Тогда
						Запись.НастройкаХозяйственнойОперации = НастройкаХозяйственнойОперации;
					КонецЕсли;
					
				КонецЕсли;
				Если ЗначениеЗаполнено(Запись.ЗаявкаНаРасходованиеДенежныхСредств) Тогда
					ЕстьЗаявкиНаРасходованиеДенежныхСредств = Истина;
				КонецЕсли;
			КонецЦикла;
			
			#Область ОчисткаРесурсаОплачиваетсяПоЗаявкамНаРасходованиеСредств
			Если ЕстьЗаявкиНаРасходованиеДенежныхСредств Тогда
				ЗаявкиНаРасходованиеДенежныхСредств = НаборЗаписей.ВыгрузитьКолонку("ЗаявкаНаРасходованиеДенежныхСредств");
				РеквизитыЗаявок = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ЗаявкиНаРасходованиеДенежныхСредств,"КонтролироватьОплатуПоОбъектамРасчетов");
				Для Каждого Запись Из НаборЗаписей Цикл
					Если ЗначениеЗаполнено(Запись.ЗаявкаНаРасходованиеДенежныхСредств)
						И Запись.Оплачивается <> 0 
						И НЕ РеквизитыЗаявок[Запись.ЗаявкаНаРасходованиеДенежныхСредств] Тогда
						Запись.Оплачивается = 0;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			#КонецОбласти
			
			#Область ПерезаполнениеПоляПорядокЗачетаПоДатеПлатежа
			ТипДокумента = ТипЗнч(Запись.Регистратор);
			Тип = ОперативныеВзаиморасчетыСервер.НомерТипа(ТипДокумента);
			Для Каждого Запись Из НаборЗаписей Цикл
				Если Запись.ВидДвижения = ВидДвиженияНакопления.Приход
					И Запись.Сумма > 0 
					И ЗначениеЗаполнено(Запись.ДатаПлатежа)
					И НачалоДня(Запись.ДатаПлатежа) <> НачалоДня(Запись.ДатаРегистратора) 
					И Запись.ПорядокОперации = Запись.ПорядокЗачетаПоДатеПлатежа 
					И Запись.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПереносЗадолженностиМеждуФилиалами Тогда
					Запись.ПорядокЗачетаПоДатеПлатежа = ОперативныеВзаиморасчетыСервер.Порядок(Запись.ДатаПлатежа, 
						ОбновляемыеДанные.РегистраторНомер, ТипДокумента, Сред(Запись.ПорядокОперации,9,1), Тип);
				КонецЕсли;
			КонецЦикла;
			#КонецОбласти
			
			#Область ИсправлениеПорядкаОперации
			Если ТипЗнч(ПроблемныйРегистратор) = Тип("ДокументСсылка.ЗаказПоставщику")
				
				Тогда
				НомерДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроблемныйРегистратор, "Номер");
				Для Каждого Запись Из НаборЗаписей Цикл
					Если Запись.КПоступлению <> 0 Тогда
						Запись.ПорядокОперации = ОперативныеВзаиморасчетыСервер.Порядок(
							Запись.ДатаРегистратора,
							НомерДокумента,
							ТипЗнч(Запись.Регистратор),
							1);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			#КонецОбласти
			
			#Область ИсправлениеОстатоквКОплате
			
			Если ИсправлениеОстатковКОплате.Найти(ПроблемныйРегистратор) <> Неопределено Тогда
			
				ДанныеДляПроведения = ПроведениеДокументов.ДанныеДокументаДляПроведения(ПроблемныйРегистратор, "РасчетыСПоставщиками");
				НовыеДвижения = ДанныеДляПроведения.ТаблицаРасчетыСПоставщиками;
				
				МассивДоговоров = НовыеДвижения.ВыгрузитьКолонку("Договор");
				МассивДоговоров = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивДоговоров);
				ПорядкиЗачетаОплатНакладныхДоговоров = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивДоговоров, "ПорядокЗачетаОплатНакладных");
				
				ВзаиморасчетыСервер.ДобавитьЗаполнитьПорядокРасчетовСПоставщиками(НовыеДвижения, ТипЗнч(ПроблемныйРегистратор), ПорядкиЗачетаОплатНакладныхДоговоров);
				
				КолонкиИзмерений = "АналитикаУчетаПоПартнерам,ОбъектРасчетов,Валюта,ВидДвижения";
				// Для контроля неизменности движений по ресурсам, кроме КОплате
				КолонкиРесурсов = "Сумма,Оплачивается,КПоступлению";
				ТаблицаДвижений = НаборЗаписей.Выгрузить();
				
				СтарыеДвижения = ТаблицаДвижений.Скопировать(,КолонкиИзмерений+","+КолонкиРесурсов);
				СтарыеДвижения.Свернуть(КолонкиИзмерений, КолонкиРесурсов);
				СтарыеДвижения.Сортировать(КолонкиИзмерений+","+КолонкиРесурсов);
				Индекс = СтарыеДвижения.Количество();
				Пока Индекс > 0 Цикл
					Индекс = Индекс - 1;
					Если СтарыеДвижения[Индекс].Сумма = 0
						И СтарыеДвижения[Индекс].Оплачивается = 0
						И СтарыеДвижения[Индекс].КПоступлению = 0 Тогда
						СтарыеДвижения.Удалить(Индекс);
					КонецЕсли;
				КонецЦикла;
				
				ИдентификаторФинЗаписиКОплате = "";
				ЕстьИзменения = Ложь;
				Индекс = ТаблицаДвижений.Количество();
				Пока Индекс > 0 Цикл
					Индекс = Индекс - 1;
					Если ТаблицаДвижений[Индекс].КОплате <> 0 Тогда
						ТаблицаДвижений[Индекс].КОплате = 0;
						Если ТаблицаДвижений[Индекс].ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПереносАванса Тогда
							ИдентификаторФинЗаписиКОплате = ТаблицаДвижений[Индекс].ИдентификаторФинЗаписи;
						КонецЕсли;
						Если ТаблицаДвижений[Индекс].Сумма = 0
							И ТаблицаДвижений[Индекс].Оплачивается = 0
							И ТаблицаДвижений[Индекс].КПоступлению = 0 Тогда
							ТаблицаДвижений.Удалить(Индекс);
						КонецЕсли;
						ЕстьИзменения = Истина;
					КонецЕсли;
				КонецЦикла;
				
				Для Каждого СтрокаКОплате Из НовыеДвижения Цикл
					Если СтрокаКОплате.КОплате <> 0 Тогда
						ЕстьИзменения = Истина;
						НоваяЗапись = ТаблицаДвижений.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаКОплате);
						НоваяЗапись.Сумма = 0;
						НоваяЗапись.СуммаУпр = 0;
						НоваяЗапись.СуммаРегл = 0;
						НоваяЗапись.ИдентификаторФинЗаписи = "";
						НоваяЗапись.Оплачивается = 0;
						НоваяЗапись.КПоступлению = 0;
						НоваяЗапись.Регистратор = ПроблемныйРегистратор;
						НоваяЗапись.Активность = Истина;
					КонецЕсли;
				КонецЦикла;
				
				НовыеДвижения = ТаблицаДвижений.Скопировать(,КолонкиИзмерений+","+КолонкиРесурсов);
				НовыеДвижения.Свернуть(КолонкиИзмерений, КолонкиРесурсов);
				НовыеДвижения.Сортировать(КолонкиИзмерений+","+КолонкиРесурсов);
				Индекс = НовыеДвижения.Количество();
				Пока Индекс > 0 Цикл
					Индекс = Индекс - 1;
					Если НовыеДвижения[Индекс].Сумма = 0
						И НовыеДвижения[Индекс].Оплачивается = 0
						И НовыеДвижения[Индекс].КПоступлению = 0 Тогда
						НовыеДвижения.Удалить(Индекс);
					КонецЕсли;
				КонецЦикла;
				
				Если ЕстьИзменения И ТаблицыРавны(СтарыеДвижения, НовыеДвижения) Тогда
				
					ЗапросСвертки = Новый Запрос;
					ЗапросСвертки.Текст = 
					"ВЫБРАТЬ
					|	&ВсеПоля
					|ПОМЕСТИТЬ ВтДвижения
					|ИЗ
					|	&ТаблицаДвижений КАК ТаблицаДвижений
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	&ПоляГруппировки,
					|	&ПоляРесурсов
					|ИЗ
					|	ВтДвижения КАК Т
					|СГРУППИРОВАТЬ ПО
					|	&ПоляГруппировки";
					ЗапросСвертки.УстановитьПараметр("ТаблицаДвижений", ТаблицаДвижений);
					КолонкиДляГруппировки = Новый Массив;
					ВсеКолонки = Новый Массив;
					КолонкиРесурсов = КолонкиРесурсов + ",КОплате";
					Для Каждого Колонка Из ТаблицаДвижений.Колонки Цикл
						Если СтрНайти(КолонкиРесурсов, Колонка.Имя) = 0 
							И Колонка.Имя <> "СуммаУпр"
							И Колонка.Имя <> "СуммаРегл"
							И Колонка.Имя <> "ИдентификаторФинЗаписи"
							И Колонка.Имя <> "НомерСтроки"
							И Колонка.Имя <> "МоментВремени" Тогда
							КолонкиДляГруппировки.Добавить(Колонка.Имя);
						КонецЕсли;
						Если Колонка.Имя <> "МоментВремени" Тогда
							ВсеКолонки.Добавить(Колонка.Имя);
						КонецЕсли;
					КонецЦикла;
					КолонкиДляСуммирования = СтрРазделить(КолонкиРесурсов, ",");
					Индекс = 0;
					Пока Индекс < КолонкиДляСуммирования.Количество() Цикл
						КолонкиДляСуммирования[Индекс] = СтрШаблон("СУММА(%1) КАК %1", КолонкиДляСуммирования[Индекс]);
						Индекс = Индекс + 1;
					КонецЦикла;
					КолонкиДляСуммирования.Добавить("СУММА(СуммаУпр) КАК СуммаУпр");
					КолонкиДляСуммирования.Добавить("СУММА(СуммаРегл) КАК СуммаРегл");
					КолонкиДляСуммирования.Добавить("МАКСИМУМ(ИдентификаторФинЗаписи) КАК ИдентификаторФинЗаписи");
					КолонкиДляСуммирования.Добавить("МАКСИМУМ(НомерСтроки) КАК НомерСтроки");
					ЗапросСвертки.Текст = СтрЗаменить(ЗапросСвертки.Текст, "&ПоляГруппировки", СтрСоединить(КолонкиДляГруппировки,","));
					ЗапросСвертки.Текст = СтрЗаменить(ЗапросСвертки.Текст, "&ВсеПоля", СтрСоединить(ВсеКолонки,","));
					ЗапросСвертки.Текст = СтрЗаменить(ЗапросСвертки.Текст, "&ПоляРесурсов", СтрСоединить(КолонкиДляСуммирования,","));
					
					ТаблицаДвижений = ЗапросСвертки.Выполнить().Выгрузить();
					Для Каждого СтрокаДвижения Из ТаблицаДвижений Цикл
						Если СтрокаДвижения.КОплате <> 0 
							И СтрокаДвижения.Сумма = 0
							И Не ЗначениеЗаполнено(СтрокаДвижения.ИдентификаторФинЗаписи) Тогда
							СтрокаДвижения.ИдентификаторФинЗаписи = ИдентификаторФинЗаписиКОплате;
						КонецЕсли;
					КонецЦикла;
					НаборЗаписей.Загрузить(ТаблицаДвижений);
					
				Иначе
					
					ТекстСообщения = СтрШаблон(НСтр("ru = 'При выполнении обработчика обновления регистра накопления ""%1"" 
							|по исправлению остатков ""%2""изменились итоги остальных ресурсов в движениях документа 
							|%3, обработка документа не выполнена'"),
						Метаданные.РегистрыНакопления.РасчетыСПоставщиками.Представление(),
						Метаданные.РегистрыНакопления.РасчетыСПоставщиками.Ресурсы.КОплате.Представление(),
						ПроблемныйРегистратор);
					ЗаписьЖурналаРегистрации(
						ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
						УровеньЖурналаРегистрации.Ошибка,
						Метаданные.РегистрыНакопления.РасчетыСПоставщиками, ,
						ТекстСообщения);
					
				КонецЕсли;
				
			КонецЕсли;
			
			#КонецОбласти

			#Область ИсправлениеХозяйственнойОперацииВзаимозачета
			Если ВзаимозачетПереносДолга.Найти(ПроблемныйРегистратор) <> Неопределено Тогда
				РегистрыНакопления.РасчетыСКлиентами.ЗаменитьХозяйственнуюОперацию(ДанныеЗаменыОперации, НаборЗаписей, Истина);
			ИначеЕсли ВзаимозачетПереносАванса.Найти(ПроблемныйРегистратор) <> Неопределено Тогда
				РегистрыНакопления.РасчетыСКлиентами.ЗаменитьХозяйственнуюОперацию(ДанныеЗаменыОперации, НаборЗаписей, Ложь);
			КонецЕсли;
			#КонецОбласти
			
			#Область ИсправлениеВремениПроведенияБронирования
			Если ТипЗнч(ПроблемныйРегистратор) = Тип("ДокументСсылка.Бронирование") Тогда
				
				ДатаДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПроблемныйРегистратор, "Дата");
				Для Каждого Запись Из НаборЗаписей Цикл
				
					ПроверитьИУстановитьВремяПериодаЗаписи(Запись, ДатаДокумента);
					Если НЕ Запись.ДатаРегистратора = Запись.Период Тогда
						Запись.ДатаРегистратора = Запись.Период;
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			#КонецОбласти
			
			#Область ЗаполнениеОперацииВзаиморасчетов
			ТипДокумента = ТипЗнч(ОбновляемыеДанные.Регистратор);
			ОбъектРасчетовВозвратТоваров = Справочники.ОбъектыРасчетов.ПустаяСсылка();
			// Для движений сторно необходимо анализировать тип сторнируемого документа
			Если ТипДокумента = Тип("ДокументСсылка.Сторно") Тогда
				СтрокаСторнируемогоДокумента = СторнируемыеДокументы.Найти(Запись.Регистратор, "Ссылка");
				Если СтрокаСторнируемогоДокумента <> Неопределено Тогда
					ТипДокумента = ТипЗнч(СтрокаСторнируемогоДокумента.СторнируемыйДокумент);
				КонецЕсли;
			КонецЕсли;
			Если (ТипДокумента = Тип("ДокументСсылка.ВозвратТоваровМеждуОрганизациями")
				Или ТипДокумента = Тип("ДокументСсылка.ВозвратТоваровПоставщику")) Тогда
				СтрокаВозврата = ВозвратыТоваров.Найти(ПроблемныйРегистратор, "Ссылка");
				Если СтрокаВозврата <> Неопределено Тогда
					ОбъектРасчетовВозвратТоваров = СтрокаВозврата.ОбъектРасчетов;
				КонецЕсли;
			КонецЕсли;
			Для Каждого Запись Из НаборЗаписей Цикл
				Если Запись.Сумма <> 0
					И Не ЗначениеЗаполнено(Запись.ОперацияВзаиморасчетов) Тогда
					Если ТипДокумента = Тип("ДокументСсылка.ВзаимозачетЗадолженности")
						Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереносПлатежаМеждуФилиалами
						Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереносЗадолженностиМеждуФилиалами
						Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереносАванса
						Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВзаимозачетЗадолженности
						Или (Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями
							Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровПоставщику)
							И Не (Запись.ВидДвижения = ВидДвиженияНакопления.Приход
								И Запись.Сумма > 0
								И ОбъектРасчетовВозвратТоваров = Запись.ОбъектРасчетов) Тогда
						Запись.ОперацияВзаиморасчетов = Перечисления.ОперацииВзаиморасчетов.ПереносВзаиморасчетов;
					ИначеЕсли ТипДокумента = Тип("ДокументСсылка.КорректировкаЗадолженности")
						Или ТипДокумента = Тип("ДокументСсылка.КорректировкаРегистров")
						Или Запись.ВидДвижения = ВидДвиженияНакопления.Приход
							И (Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.БронированиеЧерезАгента
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.БронированиеУПоставщика
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратБронирования
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетКомиссионера
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет)
						Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.БронированиеЧерезПодотчетноеЛицо
						Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ИспользованиеБронированияПодотчетнымЛицом
						Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СторноИспользованияБронированияПодотчетнымЛицом
						Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратБронированияПодотчетногоЛица
						Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.УдержаниеВознагражденияКомиссионера
						Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.УдержаниеВознагражденияКомитентом
						Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковПремийПоставщиков
						Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтражениеПремииПоставщикаРетроБонус Тогда
						Запись.ОперацияВзаиморасчетов = Перечисления.ОперацииВзаиморасчетов.КорректировкаЗадолженности;
					ИначеЕсли Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтПоставщика
						Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтДругойОрганизации Тогда
						Запись.ОперацияВзаиморасчетов = Перечисления.ОперацииВзаиморасчетов.ВозвратДенежныхСредств;
					ИначеЕсли ТипДокумента = Тип("ДокументСсылка.КорректировкаПриобретения")
							И (Запись.ВидДвижения = ВидДвиженияНакопления.Приход
								Или Запись.ВидДвижения = ВидДвиженияНакопления.Расход
								И (Запись.Сумма < 0 И Не Запись.Сторно
									Или Запись.Сумма > 0 И Запись.Сторно))
						Или Запись.ВидДвижения = ВидДвиженияНакопления.Приход
							И (Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровПоставщику
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхДокументовПоставщику)
						Или Запись.ВидДвижения = ВидДвиженияНакопления.Расход
							И (Запись.Сумма < 0 И Не Запись.Сторно
								Или Запись.Сумма > 0 И Запись.Сторно)
							И (Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетКомиссионераКомиссия
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетКомиссионера
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетКомитенту)
						Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетКомитенту
							И Запись.ВидДвижения = ВидДвиженияНакопления.Приход
							И (Запись.Сумма > 0 И Не Запись.Сторно
								Или Запись.Сумма < 0 И Запись.Сторно)
						Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратБронирования Тогда
						Запись.ОперацияВзаиморасчетов = Перечисления.ОперацииВзаиморасчетов.КорректировкаНакладной;
					ИначеЕсли Запись.ВидДвижения = ВидДвиженияНакопления.Приход
							И (Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоставщику
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеречислениеТаможне
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковАвансовПоставщикам)
							И (Запись.Сумма > 0 И Не Запись.Сторно
									Или Запись.Сумма < 0 И Запись.Сторно) Тогда
						Запись.ОперацияВзаиморасчетов = Перечисления.ОперацииВзаиморасчетов.Оплата;
					ИначеЕсли Запись.ВидДвижения = ВидДвиженияНакопления.Расход
							И (Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.БронированиеЧерезАгента
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.БронированиеУПоставщика
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ШтрафыПриВозвратеБронирования
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыкупТоваровДавальца
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыкупПринятыхНаХранениеТоваров
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетДавальцуМеждуОрганизациями
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетКомиссионера
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетКомиссионераКомиссия
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетКомитенту
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетКомитентуОСписании
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваровДавальцаНаРасходы
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеПринятыхТоваровНаРасходы
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПроизводствоУПереработчика
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПроизводствоУПереработчика2_5
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПроизводствоУПереработчикаВСтранахЕАЭС2_5
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОтчетПоКомиссииМеждуОрганизациямиОСписании
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияТоваровВДругуюОрганизацию
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхДокументовОтПоставщика
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаРеглУчет
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпорту
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭС
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаТоварыВПути
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпортуТоварыВПути
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСТоварыВПути
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщикаФактуровкаПоставки
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаВСтранахЕАЭСФактуровкаПоставки
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпортуПоступлениеИзТоваровВПути
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОформлениеГТДБрокером
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОформлениеГТДСамостоятельно
								Или Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВводОстатковЗадолженностиПоставщикам
								Или ТипДокумента = Тип("ДокументСсылка.КорректировкаПриобретения"))
							И (Запись.Сумма > 0 И Не Запись.Сторно
									Или Запись.Сумма < 0 И Запись.Сторно) Тогда
						Запись.ОперацияВзаиморасчетов = Перечисления.ОперацииВзаиморасчетов.Отгрузка;
					Иначе
						Запись.ОперацияВзаиморасчетов = Перечисления.ОперацииВзаиморасчетов.КорректировкаЗадолженности;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			#КонецОбласти
			
			#Область ЗаполнениеПриемниковВОперативномРегистре
				РегистрыНакопления.РасчетыСКлиентами.ЗаполнитьПриемникиВОперативномРегистре(НаборЗаписей, ЗапросДанныхОперативногоРегистра);
			#КонецОбласти
			
			#Область ИсправлениеКорАналитикиРасчетовВзаимозачета
			Если ВзаимозачетКорАналитика.Найти(ПроблемныйРегистратор) <> Неопределено Тогда
				РегистрыНакопления.РасчетыСКлиентами.ИсправитьКорАналитикуВзаимозачета(ЗапросКорАналитики, НаборЗаписей);
			КонецЕсли;
			#КонецОбласти
			
			ИзменилисьИтоги = Ложь;
			Если НаборЗаписей.Количество() > 0 Тогда
				ИзменилисьИтоги = РегистрыНакопления.РасчетыСКлиентами.ЕстьИзмененияИтоговНабора(НаборЗаписей);
			КонецЕсли;
#Вставка
			// Здесь можно описать новое поведение. 
			ИзменилисьИтоги=False;

#КонецВставки
			Если НаборЗаписей.Модифицированность() И НЕ ИзменилисьИтоги Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(НаборЗаписей);
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			Если ПричинаИсключения = "ПлохиеДанные" Тогда
				ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), ПроблемныйРегистратор);
				Если ЗначениеЗаполнено(ПроблемныйРегистратор) Тогда
					ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(НаборЗаписей);
					ОбновлениеИнформационнойБазы.ЗарегистрироватьПроблемуСДанными(
						ПроблемныйРегистратор,
						РегистрыНакопления.РасчетыСКлиентами.ТекстСообщенияОбОшибке(ИнформацияОбОшибке(), ПроблемныйРегистратор)
						+ Символы.ПС + РегистрыНакопления.РасчетыСКлиентами.ТекстПерепроведитеДокументВРучную());
				КонецЕсли;
			КонецЕсли;
			
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
	Если Параметры.ОбработкаЗавершена
		И ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Неопределено, Метаданные.РегистрыНакопления.РасчетыСКлиентами.ПолноеИмя())
		И ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Неопределено, Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам.ПолноеИмя())
		И ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Неопределено, Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.ПолноеИмя()) Тогда
		Константы.УдалитьТипыЗаписейВзаиморасчетовЗаполнены.Установить(Истина);
	КонецЕсли;
	
КонецПроцедуры
