#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
&Перед("ДобавитьКомандыПечати")
Процедура ИТБК_ДобавитьКомандыПечати(КомандыПечати)  Экспорт
	
	// Поступление товаров с номенклатурой поставщика
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Накладная с номенклатурой поставщика";
	КомандаПечати.Представление = НСтр("ru = 'Приобретение товаров (с номенклатурой поставщика)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;

КонецПроцедуры

&Перед("Печать")
Процедура ИТБК_Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)  Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Накладная с номенклатурой поставщика") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Накладная с номенклатурой поставщика", НСтр("ru='Накладная с номенклатурой поставщика'"), СформироватьПечатнуюФормуНакладнаяСНоменклатуройПоставщика(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;

КонецПроцедуры

Функция СформироватьПечатнуюФормуНакладнаяСНоменклатуройПоставщика(МассивОбъектов, ОбъектыПечати)
	
	КолонкаКодов = ФормированиеПечатныхФорм.ДополнительнаяКолонкаПечатныхФормДокументов().ИмяКолонки;
	ВыводитьКоды = ЗначениеЗаполнено(КолонкаКодов);
	
	ИспользоватьРучныеСкидки = ПолучитьФункциональнуюОпцию("ИспользоватьРучныеСкидкиВЗакупках");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПриобретениеТоваровУслуг.Ссылка КАК Ссылка,
	|	ПриобретениеТоваровУслуг.Номер КАК Номер,
	|	ПриобретениеТоваровУслуг.Дата КАК Дата,
	|	ПриобретениеТоваровУслуг.Партнер КАК Партнер,
	|	ПриобретениеТоваровУслуг.Контрагент КАК Поставщик,
	|	ПриобретениеТоваровУслуг.Организация КАК Организация,
	|	ПриобретениеТоваровУслуг.Организация.Префикс КАК Префикс,
	|	ПриобретениеТоваровУслуг.Валюта КАК Валюта,
	|	ПриобретениеТоваровУслуг.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	ПриобретениеТоваровУслуг.Принял КАК ПолучениеПроизвел,
	|	ПриобретениеТоваровУслуг.Менеджер КАК Менеджер,
	|	ВЫБОР
	|		КОГДА ПриобретениеТоваровУслуг.НалогообложениеНДС В (ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС), ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ЭлектронныеУслуги))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК УчитыватьНДС,
	|	ПриобретениеТоваровУслуг.ЗаказПоставщику.НомерПоДаннымПоставщика КАК СчетПоставщикаНомер,
	|	ПриобретениеТоваровУслуг.ЗаказПоставщику.ДатаПоДаннымПоставщика КАК СчетПоставщикаДата,
	|	ПриобретениеТоваровУслуг.ЗаказПоставщику.Номер КАК ЗаказПоставщикуНомер,
	|	ПриобретениеТоваровУслуг.ЗаказПоставщику.Дата КАК ЗаказПоставщикуДата,
	|	ПриобретениеТоваровУслуг.Склад КАК Склад,
	|	ПриобретениеТоваровУслуг.НомерВходящегоДокумента КАК НомерВходДок,
	|	ПриобретениеТоваровУслуг.ДатаВходящегоДокумента КАК ДатаВходДок
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	|ГДЕ
	|	ПриобретениеТоваровУслуг.Ссылка В(&МассивДокументов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка КАК Ссылка,
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.Номенклатура.НаименованиеПолное КАК ТоварНаименованиеПолное,
	|	ВложенныйЗапрос.Номенклатура.Код КАК Код,
	|	ВложенныйЗапрос.Номенклатура.Артикул КАК Артикул,
	|	ВложенныйЗапрос.ЕдиницаИзмерения.Наименование КАК ЕдиницаЦены,
	|	ВложенныйЗапрос.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВложенныйЗапрос.Характеристика.НаименованиеПолное КАК Характеристика,
	|	ВложенныйЗапрос.Серия.Наименование КАК Серия,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) = 1
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ВложенныйЗапрос.Упаковка.Наименование
	|	КОНЕЦ КАК Упаковка,
	|	ВложенныйЗапрос.СтавкаНДС КАК СтавкаНДС,
	|	ВложенныйЗапрос.КОЛИЧЕСТВО КАК КОЛИЧЕСТВО,
	|	ВложенныйЗапрос.СУММА КАК СУММА,
	|	ВложенныйЗапрос.СуммаНДС КАК СуммаНДС,
	|	ВложенныйЗапрос.СуммаСкидки КАК СуммаСкидки,
	|	ВложенныйЗапрос.СуммаБезСкидки КАК СуммаБезСкидки,
	|	ВложенныйЗапрос.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.Ссылка.ВернутьМногооборотнуюТару
	|				И ВложенныйЗапрос.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоВозвратнаяТара,
	|	ВложенныйЗапрос.ЕдиницаХран КАК ЕдиницаХран,
	|	ВложенныйЗапрос.ТоварП КАК ТоварП,
	|	ВложенныйЗапрос.КоличествоП КАК КоличествоП,
	|	ВложенныйЗапрос.ЕдиницаЦеныП КАК ЕдиницаЦеныП,
	|	ВложенныйЗапрос.КоличествоВЕдХран КАК КоличествоВЕдХран,
	|	ВложенныйЗапрос.ЦенаВЕдХран КАК ЦенаВЕдХран,
	|	ВложенныйЗапрос.ЦенаБНДС КАК Цена
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПриобретениеТоваровУслуг.Ссылка КАК Ссылка,
	|		ПриобретениеТоваровУслуг.Номенклатура КАК Номенклатура,
	|		ВЫБОР
	|			КОГДА ПриобретениеТоваровУслуг.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|				ТОГДА 1
	|			ИНАЧЕ &ТекстЗапросаКоэффициентУпаковки2
	|		КОНЕЦ КАК Коэффициент,
	|		ВЫБОР
	|			КОГДА ПриобретениеТоваровУслуг.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|				ТОГДА ПриобретениеТоваровУслуг.Номенклатура.ЕдиницаИзмерения
	|			ИНАЧЕ ПриобретениеТоваровУслуг.Упаковка
	|		КОНЕЦ КАК ЕдиницаИзмерения,
	|		ПриобретениеТоваровУслуг.ПроцентРучнойСкидки КАК ПроцентСкидки,
	|		ПриобретениеТоваровУслуг.Характеристика КАК Характеристика,
	|		ПриобретениеТоваровУслуг.Серия КАК Серия,
	|		ПриобретениеТоваровУслуг.Упаковка КАК Упаковка,
	|		ПриобретениеТоваровУслуг.СтавкаНДС КАК СтавкаНДС,
	|		ПриобретениеТоваровУслуг.Цена КАК Цена,
	|		ПриобретениеТоваровУслуг.КоличествоУпаковок КАК КОЛИЧЕСТВО,
	|		ПриобретениеТоваровУслуг.Сумма КАК СУММА,
	|		ПриобретениеТоваровУслуг.СуммаРучнойСкидки КАК СуммаСкидки,
	|		ПриобретениеТоваровУслуг.Сумма + ПриобретениеТоваровУслуг.СуммаРучнойСкидки КАК СуммаБезСкидки,
	|		ПриобретениеТоваровУслуг.СуммаНДС КАК СуммаНДС,
	|		ПриобретениеТоваровУслуг.НомерСтроки КАК НомерСтроки,
	|		ПриобретениеТоваровУслуг.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаХран,
	|		ПриобретениеТоваровУслуг.НоменклатураПартнера.НаименованиеПолное КАК ТоварП,
	|		ПриобретениеТоваровУслуг.КоличествоУпаковок КАК КоличествоП,
	|		ПриобретениеТоваровУслуг.Количество КАК КоличествоВЕдХран,
	|		ВЫБОР
	|			КОГДА ПриобретениеТоваровУслуг.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|				ТОГДА ПриобретениеТоваровУслуг.Номенклатура.ЕдиницаИзмерения
	|			ИНАЧЕ ПриобретениеТоваровУслуг.Упаковка
	|		КОНЕЦ КАК ЕдиницаЦеныП,
	|		(ПриобретениеТоваровУслуг.СуммаСНДС - ПриобретениеТоваровУслуг.СуммаНДС) / ПриобретениеТоваровУслуг.Количество КАК ЦенаВЕдХран,
	|		(ПриобретениеТоваровУслуг.СуммаСНДС - ПриобретениеТоваровУслуг.СуммаНДС) / ПриобретениеТоваровУслуг.КоличествоУпаковок КАК ЦенаБНДС
	|	ИЗ
	|		Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслуг
	|	ГДЕ
	|		ПриобретениеТоваровУслуг.Ссылка В(&МассивДокументов)
	|		И ПриобретениеТоваровУслуг.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.Ссылка,
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(СуммаСкидки)
	|ПО
	|	Ссылка");
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки1",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
	"ВложенныйЗапрос.Упаковка",
	"ВложенныйЗапрос.Номенклатура"));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаКоэффициентУпаковки2",
	Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
	"ПриобретениеТоваровУслуг.Упаковка",
	"ПриобретениеТоваровУслуг.Номенклатура"));
	
	Запрос.УстановитьПараметр("МассивДокументов", 				МассивОбъектов);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	//
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПриобретениеТоваровУслуг_НакладнаяСНоменклатуройПоставщика";
	
	МассивРезультатов 		= Запрос.ВыполнитьПакет();
	ДанныеПечати			= МассивРезультатов[0].Выбрать();
	ВыборкаПоДокументам 	= МассивРезультатов[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока ДанныеПечати.Следующий() Цикл
		
		// Найдем в выборке товары по текущему документу
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
		НайденСледующий = ВыборкаПоДокументам.НайтиСледующий(СтруктураПоиска);
		
		// Если в накладной только услуги - перейдем к следующему документу
		
		Если НайденСледующий Тогда
			ВыборкаПоТоварам = ВыборкаПоДокументам.Выбрать();
			ЗаголовокСкидки = ФормированиеПечатныхФорм.НужноВыводитьСкидки(ВыборкаПоТоварам, ИспользоватьРучныеСкидки);
			ЕстьСкидки = ЗаголовокСкидки.ЕстьСкидки;
			ВыборкаПоТоварам.Сбросить();
		Иначе
			Продолжить;
		КонецЕсли;
		
		//ИТБК Храмова ВС 06.11.2020 +++
		// Макет необходимо получать для каждого документа, т.к. размеры колонок изменяются динамически.
		//Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПриобретениеТоваровУслуг.ПФ_MXL_ПоступлениеТоваров");
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПриобретениеТоваровУслуг.ИТБК_Макет_ПоступлениеТоваров");
		//ИТБК Храмова ВС 06.11.2020 ---
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент    = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Выводим шапку накладной
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьМакета, ДанныеПечати.Ссылка);
		
		СтруктураДанныхШапки = Новый Структура;
		СтруктураДанныхШапки.Вставить("ТекстЗаголовка", ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(ДанныеПечати, НСтр("ru='Приобретение товаров'")));
		ОбластьМакета.Параметры.Заполнить(СтруктураДанныхШапки);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета                                   = Макет.ПолучитьОбласть("Поставщик");
		СтруктураДанныхПоставщик = Новый Структура;
		ПредставлениеПоставщика = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Поставщик, ДанныеПечати.Дата));
		СтруктураДанныхПоставщик.Вставить("ПредставлениеПоставщика", ПредставлениеПоставщика);
		СтруктураДанныхПоставщик.Вставить("Поставщик", ДанныеПечати.Поставщик);
		//ИТБК +++
		Если ЗначениеЗаполнено(ДанныеПечати.СчетПоставщикаНомер) И ЗначениеЗаполнено(ДанныеПечати.СчетПоставщикаДата) Тогда
			Данные = Новый Структура("Номер,Дата");
			Данные.Номер = ДанныеПечати.СчетПоставщикаНомер;
			Данные.Дата = ДанныеПечати.СчетПоставщикаДата;
			СтруктураДанныхПоставщик.Вставить("СчетПоставщика",ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(Данные));
		Иначе
			СтруктураДанныхПоставщик.Вставить("СчетПоставщика","");
		КонецЕсли;	
		//ИТБК ---
		ОбластьМакета.Параметры.Заполнить(СтруктураДанныхПоставщик);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета                                   = Макет.ПолучитьОбласть("Покупатель");
		СтруктураДанныхПокупатель = Новый Структура;
		//ПредставлениеПолучателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Организация, ДанныеПечати.Дата), "ПолноеНаименование");
		// fix Suetin 2025/10/15
		ПредставлениеПолучателя = ФормированиеПечатныхФорм.ОписаниеОрганизации(
									ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Организация, ДанныеПечати.Дата),
									"ПредставлениеПолучателя, СокращенноеНаименование, ИНН, ЮридическийАдрес, Телефоны");
		// fix Suetin 2025/10/15
		СтруктураДанныхПокупатель.Вставить("ПредставлениеПолучателя", ПредставлениеПолучателя);
		СтруктураДанныхПокупатель.Вставить("Получатель", ДанныеПечати.Организация);
		//ИТБК Храмова ВС 16.11.2020 +++
		Если ЗначениеЗаполнено(ДанныеПечати.Ссылка.НомерВходящегоДокумента) И ЗначениеЗаполнено(ДанныеПечати.Ссылка.ДатаВходящегоДокумента) Тогда
			Данные = Новый Структура("Номер,Дата");
			Данные.Номер = ДанныеПечати.Ссылка.НомерВходящегоДокумента;
			Данные.Дата = ДанныеПечати.Ссылка.ДатаВходящегоДокумента;
			СтруктураДанныхПокупатель.Вставить("ЗаказПоставщику",ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(Данные));
		Иначе
			СтруктураДанныхПокупатель.Вставить("ЗаказПоставщику","");
		КонецЕсли;	
		//ИТБК Храмова ВС 16.11.2020 ---
		
		ОбластьМакета.Параметры.Заполнить(СтруктураДанныхПокупатель);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		//ИТБК Храмова ВС 16.11.2020 +++
		ОбластьМакета                                   = Макет.ПолучитьОбласть("Склад");
		СтруктураДанныхСклад = Новый Структура;
		ПредставлениеСклада = Строка(ДанныеПечати.Склад); //Преобразовать(Строка(ДанныеПечати.Склад));
		СтруктураДанныхСклад.Вставить("Склад", ПредставлениеСклада);
		Если ЗначениеЗаполнено(ДанныеПечати.ЗаказПоставщикуНомер) И ЗначениеЗаполнено(ДанныеПечати.ЗаказПоставщикуДата) Тогда
			Данные = Новый Структура("Номер,Дата");
			Данные.Номер = ДанныеПечати.ЗаказПоставщикуНомер;
			Данные.Дата = ДанныеПечати.ЗаказПоставщикуДата;
			СтруктураДанныхСклад.Вставить("ЗаказПоставщику",ОбщегоНазначенияУТКлиентСервер.СформироватьЗаголовокДокумента(Данные));
		Иначе
			СтруктураДанныхСклад.Вставить("ЗаказПоставщику","");
		КонецЕсли;	
				
		ОбластьМакета.Параметры.Заполнить(СтруктураДанныхСклад);
		ТабличныйДокумент.Вывести(ОбластьМакета);
        //ИТБК Храмова ВС 16.11.2020 +++

		
		// Выводим заголовок таблицы Товары
		
		Если ЕстьСкидки Тогда
			ОбластьКолонкаТовар = Макет.Область("ТоварСоСкидкой");
		Иначе
			ОбластьКолонкаТовар = Макет.Область("Товар");
		КонецЕсли;
		
		Если Не ВыводитьКоды Тогда
			
			Если ЕстьСкидки Тогда
				ОбластьКолонкаТовар.ШиринаКолонки = ОбластьКолонкаТовар.ШиринаКолонки * 1.35;
			Иначе
				ОбластьКолонкаТовар.ШиринаКолонки = ОбластьКолонкаТовар.ШиринаКолонки * 1.2;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЕстьСкидки Тогда
			
			ОбластьНомера  = Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой|НомерСтроки");
			ОбластьКодов   = Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой|КолонкаКодов");
			ОбластьТовар   = Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой|ТоварСоСкидкой");
			ОбластьДанных  = Макет.ПолучитьОбласть("ШапкаТаблицыСоСкидкой|ДанныеСоСкидкой");
			
			СтруктураЗаголовокСкидки = Новый Структура("Скидка, СуммаБезСкидки", 
			ЗаголовокСкидки.Скидка,
			ЗаголовокСкидки.СуммаСкидки);
			ОбластьДанных.Параметры.Заполнить(СтруктураЗаголовокСкидки);
			
		Иначе
			
			ОбластьНомера  = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
			ОбластьКодов   = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаКодов");
			ОбластьТовар   = Макет.ПолучитьОбласть("ШапкаТаблицы|Товар");
			ОбластьДанных  = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
			
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьНомера);
		
		Если ВыводитьКоды Тогда
			СтруктураДанныхКоды = Новый Структура("ИмяКолонкиКодов", КолонкаКодов);
			ОбластьКодов.Параметры.Заполнить(СтруктураДанныхКоды);
			//ТабличныйДокумент.Присоединить(ОбластьКодов);  //ИТБК Храмова  09.11.2020
		КонецЕсли;
		
		ТабличныйДокумент.Присоединить(ОбластьТовар);
		ТабличныйДокумент.Присоединить(ОбластьКодов);  //ИТБК Храмова 09.11.2020
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		
		Если ЕстьСкидки Тогда
			
			ОбластьНомера  = Макет.ПолучитьОбласть("СтрокаТаблицыСоСкидкой|НомерСтроки");
			ОбластьКодов   = Макет.ПолучитьОбласть("СтрокаТаблицыСоСкидкой|КолонкаКодов");
			ОбластьТовар   = Макет.ПолучитьОбласть("СтрокаТаблицыСоСкидкой|ТоварСоСкидкой");
			ОбластьДанных  = Макет.ПолучитьОбласть("СтрокаТаблицыСоСкидкой|ДанныеСоСкидкой");
			
		Иначе
			
			ОбластьНомера  = Макет.ПолучитьОбласть("СтрокаТаблицы|НомерСтроки");
			ОбластьКодов   = Макет.ПолучитьОбласть("СтрокаТаблицы|КолонкаКодов");
			ОбластьТовар   = Макет.ПолучитьОбласть("СтрокаТаблицы|Товар");
			ОбластьДанных  = Макет.ПолучитьОбласть("СтрокаТаблицы|Данные");
			
		КонецЕсли;
		
		Сумма          = 0;
		СуммаНДС       = 0;
		ВсегоСкидок    = 0;
		НомерСтроки    = 0;
		ВсегоБезСкидок = 0;
		
		// Выводим строки таблицы Товары
		
		Пока ВыборкаПоТоварам.Следующий() Цикл
			
			НомерСтроки = НомерСтроки + 1;
			
			СтруктураДанныхНомерСтроки = Новый Структура("НомерСтроки", НомерСтроки);
			ОбластьНомера.Параметры.Заполнить(СтруктураДанныхНомерСтроки);
			ТабличныйДокумент.Вывести(ОбластьНомера);
			
			//ИТБК Храмова 09.11.2020 +++
			//Если ВыводитьКоды Тогда
			//	СтруктураДанныхКоды = Новый Структура("Артикул", ВыборкаПоТоварам[КолонкаКодов]);
			//	ОбластьКодов.Параметры.Заполнить(СтруктураДанныхКоды);
			//	ТабличныйДокумент.Присоединить(ОбластьКодов);
			//КонецЕсли;
			//ИТБК Храмова 09.11.2020 ---
			
			ОбластьТовар.Параметры.Заполнить(ВыборкаПоТоварам);
			
			ДополнительныеПараметрыПолученияНаименованияДляПечати = НоменклатураКлиентСервер.ДополнительныеПараметрыПредставлениеНоменклатурыДляПечати();
			ДополнительныеПараметрыПолученияНаименованияДляПечати.ВозвратнаяТара = ВыборкаПоТоварам.ЭтоВозвратнаяТара;			
			
			Товар = НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
			ВыборкаПоТоварам.ТоварНаименованиеПолное,
			ВыборкаПоТоварам.Характеристика,
			,
			ВыборкаПоТоварам.Серия,
			ДополнительныеПараметрыПолученияНаименованияДляПечати);
			СтруктураДанныхТовар = Новый Структура("Товар", Товар);
			ОбластьТовар.Параметры.Заполнить(СтруктураДанныхТовар);
			
			ТабличныйДокумент.Присоединить(ОбластьТовар);
			
			//ИТБК Храмова 09.11.2020 +++
			Если ВыводитьКоды Тогда
				СтруктураДанныхКоды = Новый Структура("Артикул", ВыборкаПоТоварам[КолонкаКодов]);
				ОбластьКодов.Параметры.Заполнить(СтруктураДанныхКоды);
				ТабличныйДокумент.Присоединить(ОбластьКодов);
			КонецЕсли;
			//ИТБК Храмова 09.11.2020 ---
			
			ОбластьДанных.Параметры.Заполнить(ВыборкаПоТоварам);
			Если ЗаголовокСкидки.ЕстьСкидки Тогда
				СтруктураДанныхСуммаСкидки = Новый Структура("СуммаСкидки", 
				?(ЗаголовокСкидки.ТолькоНаценка,- ВыборкаПоТоварам.СуммаСкидки,ВыборкаПоТоварам.СуммаСкидки));
				ОбластьДанных.Параметры.Заполнить(СтруктураДанныхСуммаСкидки);
			КонецЕсли;
			
			ТабличныйДокумент.Присоединить(ОбластьДанных);
			
			Сумма          = Сумма          + ВыборкаПоТоварам.Сумма;
			СуммаНДС       = СуммаНДС       + ВыборкаПоТоварам.СуммаНДС;
			
			Если ЕстьСкидки Тогда
				ВсегоСкидок    = ВсегоСкидок    + ВыборкаПоТоварам.СуммаСкидки;
				ВсегоБезСкидок = ВсегоБезСкидок + ВыборкаПоТоварам.СуммаБезСкидки;
			КонецЕсли;
			
		КонецЦикла;
		
		// Выводим подвал
		
		Если ЕстьСкидки Тогда
			
			ОбластьНомера  = Макет.ПолучитьОбласть("ПодвалТаблицыСоСкидкой|НомерСтроки");
			ОбластьКодов   = Макет.ПолучитьОбласть("ПодвалТаблицыСоСкидкой|КолонкаКодов");
			ОбластьТовар   = Макет.ПолучитьОбласть("ПодвалТаблицыСоСкидкой|ТоварСоСкидкой");
			ОбластьДанных  = Макет.ПолучитьОбласть("ПодвалТаблицыСоСкидкой|ДанныеСоСкидкой");
			
		Иначе
			
			ОбластьНомера  = Макет.ПолучитьОбласть("ПодвалТаблицы|НомерСтроки");
			ОбластьКодов   = Макет.ПолучитьОбласть("ПодвалТаблицы|КолонкаКодов");
			ОбластьТовар   = Макет.ПолучитьОбласть("ПодвалТаблицы|Товар");
			ОбластьДанных  = Макет.ПолучитьОбласть("ПодвалТаблицы|Данные");
			
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьНомера);
		
		//ИТБК Храмова 09.11.2020 +++
		//Если ВыводитьКоды Тогда
		//	ТабличныйДокумент.Присоединить(ОбластьКодов);
		//КонецЕсли;
		//ИТБК Храмова 09.11.2020 ---
		
		ТабличныйДокумент.Присоединить(ОбластьТовар);
		
		//ИТБК Храмова 09.11.2020 +++
		Если ВыводитьКоды Тогда
			ТабличныйДокумент.Присоединить(ОбластьКодов);
		КонецЕсли;
		//ИТБК Храмова 09.11.2020 ---
		
		СтруктураДанныхВсегоСкидки = Новый Структура;
		Если ЕстьСкидки Тогда
			СтруктураДанныхВсегоСкидки.Вставить("ВсегоСкидок", ?(ЗаголовокСкидки.ТолькоНаценка,-ВсегоСкидок, ВсегоСкидок));
			СтруктураДанныхВсегоСкидки.Вставить("ВсегоБезСкидок", ВсегоБезСкидок);
		КонецЕсли;
		СтруктураДанныхВсегоСкидки.Вставить("Всего",  ФормированиеПечатныхФорм.ФорматСумм(Сумма));
		ОбластьДанных.Параметры.Заполнить(СтруктураДанныхВсегоСкидки);
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		
		// Выводим ИтогоНДС
		
		Если ДанныеПечати.УчитыватьНДС Тогда
			
			Если ЕстьСкидки Тогда
				
				ОбластьНомера  = Макет.ПолучитьОбласть("ПодвалТаблицыНДССоСкидкой|НомерСтроки");
				ОбластьКодов   = Макет.ПолучитьОбласть("ПодвалТаблицыНДССоСкидкой|КолонкаКодов");
				ОбластьТовар   = Макет.ПолучитьОбласть("ПодвалТаблицыНДССоСкидкой|ТоварСоСкидкой");
				ОбластьДанных  = Макет.ПолучитьОбласть("ПодвалТаблицыНДССоСкидкой|ДанныеСоСкидкой");
				
			Иначе
				
				ОбластьНомера  = Макет.ПолучитьОбласть("ПодвалТаблицыНДС|НомерСтроки");
				ОбластьКодов   = Макет.ПолучитьОбласть("ПодвалТаблицыНДС|КолонкаКодов");
				ОбластьТовар   = Макет.ПолучитьОбласть("ПодвалТаблицыНДС|Товар");
				ОбластьДанных  = Макет.ПолучитьОбласть("ПодвалТаблицыНДС|Данные");
				
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьНомера);
			
			//ИТБК Храмова 09.11.2020 +++
			//Если ВыводитьКоды Тогда
			//	ТабличныйДокумент.Присоединить(ОбластьКодов);
			//КонецЕсли;
			//ИТБК Храмова 09.11.2020 ---
			
			ТабличныйДокумент.Присоединить(ОбластьТовар);
			
			//ИТБК Храмова 09.11.2020 +++
			Если ВыводитьКоды Тогда
				ТабличныйДокумент.Присоединить(ОбластьКодов);
			КонецЕсли;
			//ИТБК Храмова 09.11.2020 ---
			
			СтруктураДанныхНДС = Новый Структура;
			СтруктураДанныхНДС.Вставить("ВсегоНДС", ФормированиеПечатныхФорм.ФорматСумм(СуммаНДС));
			СтруктураДанныхНДС.Вставить("НДС", ?(ДанныеПечати.ЦенаВключаетНДС, НСтр("ru='В том числе НДС:'"), НСтр("ru='Сумма НДС:'")));
			ОбластьДанных.Параметры.Заполнить(СтруктураДанныхНДС);
			ТабличныйДокумент.Присоединить(ОбластьДанных);
			
		КонецЕсли;
		
		// Выводим Сумму прописью
		
		ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
		СуммаКПрописи = Сумма + ?(ДанныеПечати.ЦенаВключаетНДС, 0, СуммаНДС);
		
		ИтоговаяСтрока = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Всего наименований %1, на сумму %2'"),
		ВыборкаПоТоварам.Количество(),
		ФормированиеПечатныхФорм.ФорматСумм(СуммаКПрописи, ДанныеПечати.Валюта));
		
		СтруктураДанныхИтоговаяСтрока = Новый Структура;
		СтруктураДанныхИтоговаяСтрока.Вставить("ИтоговаяСтрока", ИтоговаяСтрока);
		СтруктураДанныхИтоговаяСтрока.Вставить("СуммаПрописью", РаботаСКурсамиВалют.СформироватьСуммуПрописью(СуммаКПрописи, ДанныеПечати.Валюта));
		ОбластьМакета.Параметры.Заполнить(СтруктураДанныхИтоговаяСтрока);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Выводим подписи
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		
		Если ЗначениеЗаполнено(ДанныеПечати.ПолучениеПроизвел) Тогда
			СтруктураДанныхПолучениеПроизвел = Новый Структура;
			СтруктураДанныхПолучениеПроизвел.Вставить("ПолучениеПроизвел", ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ДанныеПечати.ПолучениеПроизвел, ДанныеПечати.Дата));
			ОбластьМакета.Параметры.Заполнить(СтруктураДанныхПолучениеПроизвел);
		КонецЕсли;
		//++ ЭЗОИС-----------------------------------------------------------------------------------------
		МенеджерФИО = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ДанныеПечати.Менеджер,ДанныеПечати.Дата);
		Если НЕ ЗначениеЗаполнено(МенеджерФИО) Тогда
			МенеджерФИО = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ДанныеПечати.Менеджер.ФИО,ДанныеПечати.Дата);
		КонецЕсли;
		ОбластьМакета.Параметры.МенеджерФИО = МенеджерФИО;
		//-- ЭЗОИС-----------------------------------------------------------------------------------------
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Ландшафт;        //ИТБК Храмова 09.11.2020 
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

//Функция Преобразовать(Склад)
	
//	КодСимвола = КодСимвола(Склад,1);
//	
//	Если КодСимвола = 1089 Тогда
//		НаименованиеСклада = СокрЛ(СтрЗаменить(Склад,"склад",""));
//	Иначе
//		НаименованиеСклада = СокрЛ(СтрЗаменить(Склад,"Склад",""));
//	КонецЕсли;
//	ДлинаНаименования = СтрДлина(НаименованиеСклада) - 1;
//	ПервыйСимвол = Врег(Лев(НаименованиеСклада,1)); 
//	ОставщиесяСимволы = Прав(НаименованиеСклада,ДлинаНаименования);
//	ИтоговоеНаименование = ПервыйСимвол + ОставщиесяСимволы;
//	Возврат ИтоговоеНаименование;
//	
//КонецФункции	

#КонецЕсли