Функция ЕстьДоизготовления(vs_АктИзготовления) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ первые 1 
		|	ВнутреннееПотребление.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ВнутреннееПотребление КАК ВнутреннееПотребление
		|ГДЕ
		|	ВнутреннееПотребление.vs_ЭтоДоизготовление
		|	И ВнутреннееПотребление.vs_АктИзготовления = &vs_АктИзготовления
		|	И не ВнутреннееПотребление.ПометкаУдаления ";
	
	Запрос.УстановитьПараметр("vs_АктИзготовления", vs_АктИзготовления);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ЕстьДоизготовления = ВыборкаДетальныеЗаписи.Следующий();
	
	Если ЕстьДоизготовления тогда 
		Сообщить("По " + vs_АктИзготовления + " есть доизготовления");
	КонецЕсли;
	
	Возврат  ЕстьДоизготовления;

КонецФункции // ЕстьДоизготовления()   

#Область vs_МатериальныйОтчет

// Процедуры vs_МатериальныйОтчет
//
Процедура vs_МатериальныйОтчет_МО_ПередЗагрузкойНастроекВКомпоновщик(Контекст, КлючСхемы, КлючВарианта, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД, СхемаКД, Объект) Экспорт
	//Справочники.ВидыЦен.НайтиПоРеквизиту("Идентификатор", "ЗакупочнаяЦена").УникальныйИдентификатор()	fcd5639e-7a07-11ed-ab56-00155d439817	УникальныйИдентификатор
	ВидЗакупочнойЦены = Новый СправочникСсылка.ВидыЦен(Новый УникальныйИдентификатор("fcd5639e-7a07-11ed-ab56-00155d439817"));
	ГотоваяПродукция = Новый СправочникСсылка.Номенклатура(Новый УникальныйИдентификатор("0f42f5c0-1f38-11eb-ab3c-00155d439817"));
	СтатьяРасходов = Новый ПланВидовХарактеристикСсылка.СтатьиРасходов(Новый УникальныйИдентификатор("0f42f5c0-1f38-11eb-ab3c-00155d439818"));
	Организация = Новый СправочникСсылка.Организации(Новый УникальныйИдентификатор("cf03dd26-40fc-11ea-ab36-00155d439817"));
	Склад1 = Новый СправочникСсылка.Склады(Новый УникальныйИдентификатор("d0739c74-e305-11ea-ab3a-00155d439817"));
    //СтатьяРасходов = Новый ПланВидовХарактеристикСсылка.СтатьиРасходов(Новый УникальныйИдентификатор("0f42f5c0-1f38-11eb-ab3c-00155d439818"));
    СборкаИзКомплектующих = Перечисления.ХозяйственныеОперации.СборкаТоваров;
	Валюта = Новый СправочникСсылка.Валюты(Новый УникальныйИдентификатор("129e01fe-1f5b-11ea-ab34-00155d439817"));
	БазоваяВалюта = Валюта;
	
	МОДатаВремя = СтрШаблон("Сформировал
							|%1
						  	|%2",Пользователи.АвторизованныйПользователь(),ТекущаяУниверсальнаяДата());
	
	ВидЦены = Неопределено;
	парВидЦены = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НовыеПользовательскиеНастройкиКД, "ВидЦены"); 
	Если парВидЦены = Неопределено Тогда
		парВидЦены = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НовыеНастройкиКД, "ВидЦены");
		Если Не парВидЦены = Неопределено Тогда
			ВидЦены = парВидЦены.Значение;
		КонецЕсли;
	Иначе
		ВидЦены = парВидЦены.Значение;
	КонецЕсли;		
	
	ПериодОтчета = Неопределено;
	парПериод = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НовыеПользовательскиеНастройкиКД, "Период");
	Если парПериод = Неопределено Тогда
		парПериод = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НовыеНастройкиКД, "Период");
		Если Не парПериод = Неопределено Тогда
			ПериодОтчета = парПериод.Значение;
		КонецЕсли;
	Иначе
		ПериодОтчета = парПериод.Значение;
	КонецЕсли;
	ДатаНачала    = ПериодОтчета.ДатаНачала;
	ДатаОкончания = ПериодОтчета.ДатаОкончания;
	Если Не ПериодОтчета = Неопределено Тогда
		МОПериодОтчета = "Период: " + ПредставлениеПериода(НачалоДня(ДатаНачала), КонецДня(ДатаОкончания));
	КонецЕсли;
	
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "ВидЗакупочнойЦены", ВидЗакупочнойЦены);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "ГотоваяПродукция", ГотоваяПродукция);
    //КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "СтатьяРасходов", СтатьяРасходов);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НовыеПользовательскиеНастройкиКД, "ГотоваяПродукция", ГотоваяПродукция);
    //КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НовыеПользовательскиеНастройкиКД, "СтатьяРасходов", СтатьяРасходов);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "Организация", Организация); 
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "Склад1", Склад1); 
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "СтатьяРасходов", СтатьяРасходов); 
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "СборкаИзКомплектующих", СборкаИзКомплектующих); 
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "МОДатаВремя", МОДатаВремя);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "МОПериодОтчета", МОПериодОтчета);
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "ВидЦены", ВидЦены); 
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "ДатаНачала", Новый Граница(ДатаНачала, Видграницы.Включая)); 
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "ДатаОкончания",  Новый Граница(ДатаОкончания, Видграницы.Включая)); 
	
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "ДатаНачала1", ДатаНачала); 
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "ДатаОкончания1", ДатаОкончания); 
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "Валюта", Валюта); 
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "БазоваяВалюта", БазоваяВалюта); 
	
	ОтчетыСервер.ПодключитьСхему(Объект, Контекст, СхемаКД, КлючСхемы);
	////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	//ПараметрыДанных = НовыеНастройкиКД.ПараметрыДанных;
	
	//Если (РольДоступна("ПолныеПрава") или РольДоступна("vs_ОтражениеМатериальногоОтчета")) 
	//	и Контекст.Элементы.Найти("vs_ФормироватьДокументы") <> Неопределено и Контекст.vs_ФормироватьДокументы Тогда   //   ФормаОтчета  Контекст
	//	ПараметрДанных = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ФормироватьДокументы"));
	//	Если ТипЗнч(ПараметрДанных) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
	//		ПараметрДанных.Значение = Истина;
	//		ПараметрДанных.Использование = Истина;
	//	КонецЕсли;
	//КонецЕсли;
	
	//ПараметрДанных = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Организация"));
	//Если ТипЗнч(ПараметрДанных) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
	//	//Справочники.Организации.НайтиПоНаименованию("ЭЗОИС ООО").УникальныйИдентификатор()
	//	ПараметрДанных.Значение = Новый СправочникСсылка.Организации(Новый УникальныйИдентификатор("cf03dd26-40fc-11ea-ab36-00155d439817"));
	//	ПараметрДанных.Использование = Истина;
	//КонецЕсли;
	//ПараметрДанных = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Склад1"));
	//Если ТипЗнч(ПараметрДанных) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
	//	//Справочники.Склады.НайтиПоНаименованию("Цех № 1", Истина).УникальныйИдентификатор() = d0739c74-e305-11ea-ab3a-00155d439817
	//	ПараметрДанных.Значение = Новый СправочникСсылка.Склады(Новый УникальныйИдентификатор("d0739c74-e305-11ea-ab3a-00155d439817"));
	//	ПараметрДанных.Использование = Истина;
	//КонецЕсли;
	//ПараметрДанных = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ГотоваяПродукция"));
	//Если ТипЗнч(ПараметрДанных) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
	//	// Справочники.Номенклатура.НайтиПоНаименованию("ГП", Истина).УникальныйИдентификатор() = 0f42f5c0-1f38-11eb-ab3c-00155d439817
	//	ПараметрДанных.Значение = Новый СправочникСсылка.Номенклатура(Новый УникальныйИдентификатор("0f42f5c0-1f38-11eb-ab3c-00155d439817"));
	//	ПараметрДанных.Использование = Истина;
	//КонецЕсли;
	//ПараметрДанных = НовыеПользовательскиеНастройкиКД.ПолучитьОсновныеНастройкиПоИдентификаторуПользовательскойНастройки("840d7791-1541-4d10-88b9-a897e67b7de0");  // ГотоваяПродукция
	//Если ТипЗнч(ПараметрДанных) = Тип("массив")
	//	и ТипЗнч(ПараметрДанных[0]) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
	//	// Справочники.Номенклатура.НайтиПоНаименованию("ГП", Истина).УникальныйИдентификатор() = 0f42f5c0-1f38-11eb-ab3c-00155d439817
	//	ПараметрДанных[0].Значение = Новый СправочникСсылка.Номенклатура(Новый УникальныйИдентификатор("0f42f5c0-1f38-11eb-ab3c-00155d439817"));
	//	ПараметрДанных[0].Использование = Истина;
	//КонецЕсли;

	//ПараметрДанных = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СтатьяРасходов"));
	//Если ТипЗнч(ПараметрДанных) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
	//	// ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоНаименованию("!!! Списание на расходы", Истина).УникальныйИдентификатор() = ""
	//	ПараметрДанных.Значение = Новый ПланВидовХарактеристикСсылка.СтатьиРасходов(Новый УникальныйИдентификатор("0f42f5c0-1f38-11eb-ab3c-00155d439818"));
	//	ПараметрДанных.Использование = Истина;
	//КонецЕсли;
	//ПараметрДанных = НовыеПользовательскиеНастройкиКД.ПолучитьОсновныеНастройкиПоИдентификаторуПользовательскойНастройки("509fcce0-ce3c-4650-b2dc-792007557df3");  // ГотоваяПродукция
	//Если ТипЗнч(ПараметрДанных) = Тип("массив")
	//	и ТипЗнч(ПараметрДанных[0]) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
	//	// Справочники.Номенклатура.НайтиПоНаименованию("ГП", Истина).УникальныйИдентификатор() = 0f42f5c0-1f38-11eb-ab3c-00155d439817
	//	ПараметрДанных[0].Значение = Новый ПланВидовХарактеристикСсылка.СтатьиРасходов(Новый УникальныйИдентификатор("0f42f5c0-1f38-11eb-ab3c-00155d439818"));
	//	ПараметрДанных[0].Использование = Истина;
	//КонецЕсли;
	
	//ПараметрДанных = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СборкаИзКомплектующих"));
	//Если ТипЗнч(ПараметрДанных) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
	//	ПараметрДанных.Значение = Перечисления.ХозяйственныеОперации.СборкаТоваров;
	//	ПараметрДанных.Использование = Истина;
	//КонецЕсли;
	//////ПараметрДанных = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("МОДатаВремя"));
	//////Если ТипЗнч(ПараметрДанных) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
	//////	ПараметрДанных.Значение = СтрШаблон("Сформировал
	//////											|%1
	//////										  	|%2",Пользователи.АвторизованныйПользователь(),ТекущаяУниверсальнаяДата());
	//////	ПараметрДанных.Использование = Истина;
	//////КонецЕсли;	
	
	//ПараметрДанных = НовыеПользовательскиеНастройкиКД.Элементы.Найти("468d63d5-74fe-4009-b301-09167cde25c4");   // Вид цены
	//Если ТипЗнч(ПараметрДанных) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") и Не ПараметрДанных.Использование Тогда
	//	
	//	//ПолеЦена = ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки.Выбор.ДоступныеПоляВыбора.Элементы.Найти("Цена");
	//	//Если Не ПолеЦена = Неопределено Тогда
	//	//	ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы.Удалить(ПолеЦена);	
	//	//КонецЕсли;	
	//	
	//	Для Каждого ЭлВыбора Из Контекст.Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы Цикл //   ФормаОтчета
	//		Если ЭлВыбора.Поле = Новый ПолеКомпоновкиДанных("Цена") Тогда
	//			ЭлВыбора.использование = Ложь;
	//			//ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы.Удалить(ЭлВыбора);
	//			//ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок.Элементы
	//		ИначеЕсли ЭлВыбора.Поле = Новый ПолеКомпоновкиДанных("Сумма") Тогда
	//			ЭлВыбора.использование = Ложь;
	//			//ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы.Удалить(ЭлВыбора);
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//	Для Каждого ЭлВыбора Из СхемаКомпоновкиДанных.НастройкиПоУмолчанию.Выбор.Элементы Цикл
	//		Если ЭлВыбора.Поле = Новый ПолеКомпоновкиДанных("Цена") Тогда
	//			ЭлВыбора.использование = Ложь;
	//			//ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы.Удалить(ЭлВыбора);
	//			//ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок.Элементы
	//		ИначеЕсли ЭлВыбора.Поле = Новый ПолеКомпоновкиДанных("Сумма") Тогда
	//			ЭлВыбора.использование = Ложь;
	//			//ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы.Удалить(ЭлВыбора);
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//ИначеЕсли ТипЗнч(ПараметрДанных) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") и ПараметрДанных.Использование Тогда
	//	Для Каждого ЭлВыбора Из Контекст.Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы Цикл // ФормаОтчета
	//		Если ЭлВыбора.Поле = Новый ПолеКомпоновкиДанных("Цена") Тогда
	//			ЭлВыбора.использование = Истина;
	//		ИначеЕсли ЭлВыбора.Поле = Новый ПолеКомпоновкиДанных("Сумма") Тогда
	//			ЭлВыбора.использование = Истина;
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//	Для Каждого ЭлВыбора Из СхемаКомпоновкиДанных.НастройкиПоУмолчанию.Выбор.Элементы Цикл
	//		Если ЭлВыбора.Поле = Новый ПолеКомпоновкиДанных("Цена") Тогда
	//			ЭлВыбора.использование = Истина;
	//			//ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы.Удалить(ЭлВыбора);
	//			//ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок.Элементы
	//		ИначеЕсли ЭлВыбора.Поле = Новый ПолеКомпоновкиДанных("Сумма") Тогда
	//			ЭлВыбора.использование = Истина;
	//			Контекст.Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы.Удалить(ЭлВыбора);  //ФормаОтчета
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//КонецЕсли;

	
	
	
	//Для Каждого ЭлементОтбора Из НовыеНастройкиКД.Отбор.Элементы Цикл
	//    ЭлементОтбора.Использование = Ложь;
	//КонецЦикла;

    //Подключать схему не нужно, изменения производились в НовыеНастройкиКД, а не в СхемаКомпоновкиДанных
	
КонецПроцедуры // vs_МатериальныйОтчет_МО_ПослеЗагрузкиНастроекВКомпоновщик()  

Процедура vs_МатериальныйОтчет_МО_ПередФормированиемОтчета(ФормаОтчета, ДополнительныеПараметры, СхемаКомпоновкиДанных) Экспорт
	ПараметрыДанных = ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных;
	//ПользовательскиеНастройки = ФормаОтчета.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки;
	
	Если (РольДоступна("ПолныеПрава") или РольДоступна("vs_ОтражениеМатериальногоОтчета")) 
		и (ФормаОтчета.ВариантыПанелиКлючТекущегоВарианта = "МатериальныйОтчет" 
		или ФормаОтчета.ВариантыПанелиКлючТекущегоВарианта = "19dc71b8-be67-4371-ae6f-26a353ece9bd") Тогда
		Попытка
			Если ФормаОтчета.ЭтотОбъект.vs_ФормироватьДокументы Тогда
				ПараметрДанных = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ФормироватьДокументы"));
				Если ТипЗнч(ПараметрДанных) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
					ПараметрДанных.Значение = Истина;
					ПараметрДанных.Использование = Истина;
				КонецЕсли; 
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

Процедура vs_МатериальныйОтчет_МО_ПередФормированиемОтчета1(ФормаОтчета, ДополнительныеПараметры, СхемаКомпоновкиДанных) Экспорт
	ПараметрыДанных = ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных;
	ПользовательскиеНастройки = ФормаОтчета.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки;
	
	Если (РольДоступна("ПолныеПрава") или РольДоступна("vs_ОтражениеМатериальногоОтчета")) 
		и ФормаОтчета.Элементы.Найти("vs_ФормироватьДокументы") <> Неопределено и ФормаОтчета.vs_ФормироватьДокументы Тогда
		ПараметрДанных = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ФормироватьДокументы"));
		Если ТипЗнч(ПараметрДанных) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			ПараметрДанных.Значение = Истина;
			ПараметрДанных.Использование = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрДанных = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Организация"));
	Если ТипЗнч(ПараметрДанных) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
		//Справочники.Организации.НайтиПоНаименованию("ЭЗОИС ООО").УникальныйИдентификатор()
		ПараметрДанных.Значение = Новый СправочникСсылка.Организации(Новый УникальныйИдентификатор("cf03dd26-40fc-11ea-ab36-00155d439817"));
		ПараметрДанных.Использование = Истина;
	КонецЕсли;
	ПараметрДанных = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Склад1"));
	Если ТипЗнч(ПараметрДанных) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
		//Справочники.Склады.НайтиПоНаименованию("Цех № 1", Истина).УникальныйИдентификатор() = d0739c74-e305-11ea-ab3a-00155d439817
		ПараметрДанных.Значение = Новый СправочникСсылка.Склады(Новый УникальныйИдентификатор("d0739c74-e305-11ea-ab3a-00155d439817"));
		ПараметрДанных.Использование = Истина;
	КонецЕсли;
	ПараметрДанных = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ГотоваяПродукция"));
	Если ТипЗнч(ПараметрДанных) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
		// Справочники.Номенклатура.НайтиПоНаименованию("ГП", Истина).УникальныйИдентификатор() = 0f42f5c0-1f38-11eb-ab3c-00155d439817
		ПараметрДанных.Значение = Новый СправочникСсылка.Номенклатура(Новый УникальныйИдентификатор("0f42f5c0-1f38-11eb-ab3c-00155d439817"));
		ПараметрДанных.Использование = Истина;
	КонецЕсли;
	ПараметрДанных = ПользовательскиеНастройки.ПолучитьОсновныеНастройкиПоИдентификаторуПользовательскойНастройки("840d7791-1541-4d10-88b9-a897e67b7de0");  // ГотоваяПродукция
	Если ТипЗнч(ПараметрДанных) = Тип("массив")
		и ТипЗнч(ПараметрДанных[0]) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
		// Справочники.Номенклатура.НайтиПоНаименованию("ГП", Истина).УникальныйИдентификатор() = 0f42f5c0-1f38-11eb-ab3c-00155d439817
		ПараметрДанных[0].Значение = Новый СправочникСсылка.Номенклатура(Новый УникальныйИдентификатор("0f42f5c0-1f38-11eb-ab3c-00155d439817"));
		ПараметрДанных[0].Использование = Истина;
	КонецЕсли;

	ПараметрДанных = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СтатьяРасходов"));
	Если ТипЗнч(ПараметрДанных) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
		// ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоНаименованию("!!! Списание на расходы", Истина).УникальныйИдентификатор() = ""
		ПараметрДанных.Значение = Новый ПланВидовХарактеристикСсылка.СтатьиРасходов(Новый УникальныйИдентификатор("0f42f5c0-1f38-11eb-ab3c-00155d439818"));
		ПараметрДанных.Использование = Истина;
	КонецЕсли;
	ПараметрДанных = ПользовательскиеНастройки.ПолучитьОсновныеНастройкиПоИдентификаторуПользовательскойНастройки("509fcce0-ce3c-4650-b2dc-792007557df3");  // ГотоваяПродукция
	Если ТипЗнч(ПараметрДанных) = Тип("массив")
		и ТипЗнч(ПараметрДанных[0]) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
		// Справочники.Номенклатура.НайтиПоНаименованию("ГП", Истина).УникальныйИдентификатор() = 0f42f5c0-1f38-11eb-ab3c-00155d439817
		ПараметрДанных[0].Значение = Новый ПланВидовХарактеристикСсылка.СтатьиРасходов(Новый УникальныйИдентификатор("0f42f5c0-1f38-11eb-ab3c-00155d439818"));
		ПараметрДанных[0].Использование = Истина;
	КонецЕсли;
	
	ПараметрДанных = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СборкаИзКомплектующих"));
	Если ТипЗнч(ПараметрДанных) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
		ПараметрДанных.Значение = Перечисления.ХозяйственныеОперации.СборкаТоваров;
		ПараметрДанных.Использование = Истина;
	КонецЕсли;
	ПараметрДанных = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("МОДатаВремя"));
	Если ТипЗнч(ПараметрДанных) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
		ПараметрДанных.Значение = СтрШаблон("Сформировал
												|%1
											  	|%2",Пользователи.АвторизованныйПользователь(),ТекущаяУниверсальнаяДата());
		ПараметрДанных.Использование = Истина;
	КонецЕсли;	
	
	ПараметрДанных = ФормаОтчета.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти("468d63d5-74fe-4009-b301-09167cde25c4");   // Вид цены
	Если ТипЗнч(ПараметрДанных) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") и Не ПараметрДанных.Использование Тогда
		
		//ПолеЦена = ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки.Выбор.ДоступныеПоляВыбора.Элементы.Найти("Цена");
		//Если Не ПолеЦена = Неопределено Тогда
		//	ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы.Удалить(ПолеЦена);	
		//КонецЕсли;	
		
		Для Каждого ЭлВыбора Из ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы Цикл
			Если ЭлВыбора.Поле = Новый ПолеКомпоновкиДанных("Цена") Тогда
				ЭлВыбора.использование = Ложь;
				//ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы.Удалить(ЭлВыбора);
				//ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок.Элементы
			ИначеЕсли ЭлВыбора.Поле = Новый ПолеКомпоновкиДанных("Сумма") Тогда
				ЭлВыбора.использование = Ложь;
				//ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы.Удалить(ЭлВыбора);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ЭлВыбора Из СхемаКомпоновкиДанных.НастройкиПоУмолчанию.Выбор.Элементы Цикл
			Если ЭлВыбора.Поле = Новый ПолеКомпоновкиДанных("Цена") Тогда
				ЭлВыбора.использование = Ложь;
				//ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы.Удалить(ЭлВыбора);
				//ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок.Элементы
			ИначеЕсли ЭлВыбора.Поле = Новый ПолеКомпоновкиДанных("Сумма") Тогда
				ЭлВыбора.использование = Ложь;
				//ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы.Удалить(ЭлВыбора);
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ПараметрДанных) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") и ПараметрДанных.Использование Тогда
		Для Каждого ЭлВыбора Из ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы Цикл
			Если ЭлВыбора.Поле = Новый ПолеКомпоновкиДанных("Цена") Тогда
				ЭлВыбора.использование = Истина;
			ИначеЕсли ЭлВыбора.Поле = Новый ПолеКомпоновкиДанных("Сумма") Тогда
				ЭлВыбора.использование = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ЭлВыбора Из СхемаКомпоновкиДанных.НастройкиПоУмолчанию.Выбор.Элементы Цикл
			Если ЭлВыбора.Поле = Новый ПолеКомпоновкиДанных("Цена") Тогда
				ЭлВыбора.использование = Истина;
				//ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы.Удалить(ЭлВыбора);
				//ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок.Элементы
			ИначеЕсли ЭлВыбора.Поле = Новый ПолеКомпоновкиДанных("Сумма") Тогда
				ЭлВыбора.использование = Истина;
				ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы.Удалить(ЭлВыбора);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры // vs_МатериальныйОтчет_МО_ПередФормированиемОтчета()  

Процедура vs_МатериальныйОтчет_МО_ПриКомпоновкеРезультата(Объект, ДокументРезультат, ДанныеРасшифровки, КомпоновщикНастроек) Экспорт
	ДокументРезультат.Очистить();
	
	//// Применяем пользовательские настройки
	////КомпоновщикНастроек.ЗагрузитьНастройки(КомпоновщикНастроек.ПолучитьНастройки());
	НастройкиОсновнойСхемы 		= КомпоновщикНастроек.ПолучитьНастройки();
	НастройкиКД 				= КомпоновщикНастроек.Настройки;
	//ПараметрыДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	//
	ПользовательскиеНастройки 	= КомпоновщикНастроек.ПользовательскиеНастройки;
	//
	//// Читаем параметры отчета
	//ПериодОтчета  = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период")).Значение;
	//ДатаНачала    = ПериодОтчета.ДатаНачала;
	//ДатаОкончания = ПериодОтчета.ДатаОкончания;
//#Вставка
	//ПараметрыОтчета = Новый Структура;
	Если НастройкиОсновнойСхемы.ДополнительныеСвойства.КлючВарианта = "МатериальныйОтчет" 
		или НастройкиОсновнойСхемы.ДополнительныеСвойства.КлючВарианта = "19dc71b8-be67-4371-ae6f-26a353ece9bd" 
		или НастройкиОсновнойСхемы.ДополнительныеСвойства.КлючВарианта = "vs_АнализПлановогоИФактическогоПотребленияМатериалов" 
		или НастройкиОсновнойСхемы.ДополнительныеСвойства.КлючВарианта = "vs_АнализПлановогоИФактическогоПотребленияМатериаловСРасшифровкой" Тогда
		//Если НастройкиОсновнойСхемы.ДополнительныеСвойства.Свойство("Организация") = Ложь
		//	или НастройкиОсновнойСхемы.ДополнительныеСвойства.Свойство("Организация") = Истина
		//		и Не ЗначениеЗаполнено(НастройкиОсновнойСхемы.ДополнительныеСвойства.Организация) Тогда
		//	НастройкиОсновнойСхемы.ДополнительныеСвойства.Вставить("Организация", Справочники.Организации.НайтиПоРеквизиту("ИНН", "7718506660"));
		//	Организация = НастройкиОсновнойСхемы.ДополнительныеСвойства.Организация; 
		//КонецЕсли;
		Если НастройкиОсновнойСхемы.ДополнительныеСвойства.Свойство("СкладЦеха") = Ложь
			или НастройкиОсновнойСхемы.ДополнительныеСвойства.Свойство("СкладЦеха") = Истина
				и Не ЗначениеЗаполнено(НастройкиОсновнойСхемы.ДополнительныеСвойства.СкладЦеха) Тогда
			НастройкиОсновнойСхемы.ДополнительныеСвойства.Вставить("СкладЦеха", Справочники.Склады.ПустаяСсылка());//   Справочники.Склады.НайтиПоНаименованию("Кладовая (тех)", Истина)
			СкладЦеха = НастройкиОсновнойСхемы.ДополнительныеСвойства.СкладЦеха;
			Подразделение = СкладЦеха.Подразделение;
		//КонецЕсли;
				
				
		//	ПараметрДанных.Значение = Новый СправочникСсылка.Склады(Новый УникальныйИдентификатор("cf03dd26-40fc-11ea-ab36-00155d439817"));
		//	ПараметрДанных.Использование = Истина;
		//
		//	НастройкиОсновнойСхемы.ДополнительныеСвойства.Вставить("СкладЦеха", 
		//	
		//	Справочники.Склады.НайтиПоНаименованию("Кладовая (тех)", Истина)); 
			
			
			//СкладЦеха = НастройкиОсновнойСхемы.ДополнительныеСвойства.СкладЦеха;
			//Подразделение = СкладЦеха.Подразделение;
		КонецЕсли;
		//////////////ВидЦены = Справочники.ВидыЦен.ПустаяСсылка();
		//////////////ПараметрДанных = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВидЦены"));
		//////////////Если ТипЗнч(ПараметрДанных) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") и ЗначениеЗаполнено(ПараметрДанных.Значение) Тогда
		//////////////	ВидЦены = ПараметрДанных.Значение;
		//////////////КонецЕсли;	
		//Если ВидЦеныПараметр.Использование и ЗначениеЗаполнено(ВидЦены) Тогда
		//	ПараметрыОтчета.Вставить("ВидЦены", ВидЦены);
		//КонецЕсли;
		//ПараметрДанных = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("МОДатаВремя"));
		//Если ТипЗнч(ПараметрДанных) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
		//	ПараметрДанных.Значение = СтрШаблон("Сформировал
		//											|%1
		//										  	|%2",Пользователи.АвторизованныйПользователь(),ТекущаяУниверсальнаяДата());
		//	ПараметрДанных.Использование = Истина;
		//КонецЕсли;	
	//КонецЕсли;
//#КонецВставки		
	//ПараметрДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Склад1");
	//ПараметрДанных.Значение = Справочники.Склады.НайтиПоНаименованию("Цех № 1", Истина);
	//ПараметрДанных.Использование=Истина;
	//СборкаИзКомплектующих   = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СборкаИзКомплектующих")).Значение;
	
	ПериодОтчета 			= КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(ПользовательскиеНастройки, "Период").Значение;
	ДатаНачала 				= ПериодОтчета.ДатаНачала;
	ДатаОкончания 			= ПериодОтчета.ДатаОкончания;
	ГотоваяПродукция 		= КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(ПользовательскиеНастройки, "ГотоваяПродукция").Значение;
	СборкаИзКомплектующих 	= КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НастройкиКД, "СборкаИзКомплектующих").Значение;
	Валюта 					= КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НастройкиКД, "Валюта").Значение;
	БазоваяВалюта 			= КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НастройкиКД, "БазоваяВалюта").Значение;
	ВидЦены 				= КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НастройкиКД, "ВидЦены").Значение;
	Если Не КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(ПользовательскиеНастройки, "ВидЦены") = Неопределено Тогда
		ВидЦены 				= КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(ПользовательскиеНастройки, "ВидЦены").Значение;
	КонецЕсли;
	ИспользоватьАктуальныеЦены = Ложь;
	Если НастройкиОсновнойСхемы.ДополнительныеСвойства.КлючВарианта = "vs_АнализПлановогоИФактическогоПотребленияМатериалов" 
		или НастройкиОсновнойСхемы.ДополнительныеСвойства.КлючВарианта = "vs_АнализПлановогоИФактическогоПотребленияМатериаловСРасшифровкой" Тогда
		ДатаЦены = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(ПользовательскиеНастройки, "ДатаЦены").Значение;
		ИспользоватьАктуальныеЦены = Не ЗначениеЗаполнено(ДатаЦены);
		Если Не ИспользоватьАктуальныеЦены Тогда
			ДатаЦены = Новый Граница(КонецДня(ДатаЦены), ВидГраницы.Включая);	
		КонецЕсли;	
	КонецЕсли;
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаНачалаОбщая"      , Новый Граница(Дата(2000,01,01), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ДатаНачала"           , Новый Граница(ДатаНачала, Видграницы.Включая));
	Запрос.УстановитьПараметр("ДатаОкончания"        , Новый Граница(ДатаОкончания, Видграницы.Включая));
	Запрос.УстановитьПараметр("ДатаНачалаОбщая1"      , Дата(2000,01,01));
	Запрос.УстановитьПараметр("ДатаНачала1"           , ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания1"        , ДатаОкончания);
	Запрос.УстановитьПараметр("ГотоваяПродукция"     , ГотоваяПродукция);
	Запрос.УстановитьПараметр("СборкаИзКомплектующих", СборкаИзКомплектующих);
	Запрос.УстановитьПараметр("Наименование", "%(АИ)%");
	ДопизготовлениеПроизводство = Новый Массив();
	ДопизготовлениеПроизводство.Добавить(Новый ПланВидовХарактеристикСсылка.СтатьиРасходов(Новый УникальныйИдентификатор("4e86c433-5bf1-11eb-ab3f-00155d439817")));
	ДопизготовлениеПроизводство.Добавить(Новый ПланВидовХарактеристикСсылка.СтатьиРасходов(Новый УникальныйИдентификатор("fc8bf825-6139-11eb-ab40-00155d439817")));
	Запрос.УстановитьПараметр("ДопизготовлениеПроизводство", ДопизготовлениеПроизводство);
	Запрос.УстановитьПараметр("Валюта", Валюта);	
	Запрос.УстановитьПараметр("БазоваяВалюта", БазоваяВалюта); 
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);  
	Запрос.УстановитьПараметр("ДатаЦены", ДатаЦены);
	// Читаем данные
	//ТабВыпускПродукции = Отчеты.ИТБК_МатериальныйОтчет.ПолучитьВыпускПродукции(ДатаНачала, ДатаОкончания, ГотоваяПродукция, СборкаИзКомплектующих); 
	//ТабВыпускПродукции = ПолучитьВыпускПродукции(Запрос, ДатаНачала, ДатаОкончания, ГотоваяПродукция, СборкаИзКомплектующих);	//всг+
	//ТабЗатратыНаСборку = Отчеты.ИТБК_МатериальныйОтчет.ПолучитьЗатратыНаСборку(ДатаНачала, ДатаОкончания, ГотоваяПродукция, СтатьяРасходов);
	//ТабЗатратыНаСборку = ПолучитьЗатратыНаСборку(Запрос, ДатаНачала, ДатаОкончания, ГотоваяПродукция, СтатьяРасходов);   //всг+
	
	Запрос.Текст = ПолучитьТекстВыпускПродукцииЗатратыНаСборку(ИспользоватьАктуальныеЦены);
	Пакет = Запрос.ВыполнитьПакетСПромежуточнымиДанными();

	МассивУзловАИ      				= Пакет[0].Выгрузить().ВыгрузитьКолонку("Ссылка");
	ТабВыпускПродукцииОбщийИНеГП	= Пакет[3].Выгрузить();
	ТабВыпускПродукцииОбщийИНеГП.Сортировать("ДокументСборки Убыв");
	ТабВыпускПродукцииОбщийИНеГПКопия = ТабВыпускПродукцииОбщийИНеГП.Скопировать();
	//ТабВыпускПродукцииОбщий			= Пакет[5].Выгрузить();
	//ТабВыпускПродукцииОбщий.Сортировать("Регистратор Убыв");
	
	//ТабВыпускПродукции 		= Пакет[3].Выгрузить();
	//ТабВыпускПродукции 		= Пакет[5].Выгрузить(); 
	//ТабВыпускПродукции 		= Пакет[16].Выгрузить();
	ТабВыпускПродукции 		= Пакет[19].Выгрузить();
	ТабВыпускПродукции.Колонки.Добавить("ВидОперации");
	ТабВыпускПродукции.ЗаполнитьЗначения("Сборка", "ВидОперации");
	КонецЕсли;
	//Если НастройкиОсновнойСхемы.ДополнительныеСвойства.КлючВарианта = "vs_АнализПлановогоИФактическогоПотребленияМатериалов" Тогда
	//	ТабВыпускПродукции.Колонки.Добавить("ПлановаяСтоимость",Новый ОписаниеТипов("Число"));
	//	ТабВыпускПродукции.Колонки.Добавить("ФактическаяСтоимость",Новый ОписаниеТипов("Число"));
	//	ТабВыпускПродукции.Колонки.Добавить("ФактическаяСтоимостьДоизготовления",Новый ОписаниеТипов("Число"));
	//	
	//    ДЗ = Новый ДеревоЗначений;
	//    Дз.Колонки.Добавить("Номенклатура", новый ОписаниеТипов("СправочникСсылка.Номенклатура"),"Номенклатура");
	//    Дз.Колонки.Добавить("Характеристика", новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"),"Характеристика");
	//    Дз.Колонки.Добавить("ИД_",новый ОписаниеТипов("строка"),"ИД");
	//    Дз.Колонки.Добавить("РодительИД", новый ОписаниеТипов("Число"),"РодительИД");
	//    Дз.Колонки.Добавить("ИД",новый ОписаниеТипов("Число"),"ИД");
	//    Дз.Колонки.Добавить("Комплектация",новый ОписаниеТипов("СправочникСсылка.ВариантыКомплектацииНоменклатуры"),"Комплектация");
	//    Дз.Колонки.Добавить("Количество",новый ОписаниеТипов("Число"),"Количество");
	//    Дз.Колонки.Добавить("Количество2",новый ОписаниеТипов("Число"),"Количество");
	//    Дз.Колонки.Добавить("Всего",новый ОписаниеТипов("Число"),"Количество");
	//    Дз.Колонки.Добавить("КоличествоМатериалов",новый ОписаниеТипов("Число"),"Количество");
	//    Дз.Колонки.Добавить("Цена",новый ОписаниеТипов("Число"),"Количество");
	//    Дз.Колонки.Добавить("Сумма",новый ОписаниеТипов("Число"),"Количество");
	//	
	//	//ВидЗакупочнойЦены = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НастройкиКД, "ВидЗакупочнойЦены").Значение;  Будем использовать ВидЦены
	//	
	//	//Для Каждого СтрТВП Из ТабВыпускПродукции Цикл
	//	//	Если ТипЗнч(СтрТВП.ДокументСборки) = Тип("ДокументСсылка.СборкаТоваров")
	//	//		и ЗначениеЗаполнено(СтрТВП.ДокументСборки.ВариантКомплектации) Тогда			
	//			Материалы = Новый ТаблицаЗначений();
	//			Материалы.Колонки.Добавить("Номенклатура", 	Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	//			Материалы.Колонки.Добавить("Характеристика",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	//			Материалы.Колонки.Добавить("Количество", 	Новый ОписаниеТипов("Число"));
	//			vs_АнализПлановогоИФактическогоПотребленияМатериалов_МО_ПриКомпоновкеРезультата_ЗаполнитьДеревоСервер(ТабВыпускПродукции,
	//				//ДЗ,ВидЗакупочнойЦены,ВидЗакупочнойЦены.ВалютаЦены,ВидЗакупочнойЦены.ВалютаЦены,,"", 
	//				ДЗ,ВидЦены,ВидЦены.ВалютаЦены,ВидЦены.ВалютаЦены,,"",
	//				Материалы, ИспользоватьАктуальныеЦены, ДатаЦены);	//СтрТВП.ДокументСборки.ВариантКомплектации				
	//				//СтрТВП.ПлановаяСтоимость = Дз.Строки.Итог("Сумма",Истина);
	//				
	//			ПревышенЛимитСтрок = Ложь;
	//			ИсключеннаяНоменклатура = Новый ТаблицаЗначений();	
	//			vs_АнализПлановогоИФактическогоПотребленияМатериалов_МО_ПриКомпоновкеРезультата_ЗаполнитьТекущиеЗатратыНаИзделие(ТабВыпускПродукции,
	//				НастройкиКД, ПревышенЛимитСтрок, ИсключеннаяНоменклатура, ПользовательскиеНастройки, ИспользоватьАктуальныеЦены, ДатаЦены);   //  ПараметрыОтчета
	//	//	КонецЕсли;
	//	//КонецЦикла;
	//КонецЕсли;	
	Если НастройкиОсновнойСхемы.ДополнительныеСвойства.КлючВарианта = "МатериальныйОтчет" 
		или НастройкиОсновнойСхемы.ДополнительныеСвойства.КлючВарианта = "19dc71b8-be67-4371-ae6f-26a353ece9bd" 
		или НастройкиОсновнойСхемы.ДополнительныеСвойства.КлючВарианта = "vs_АнализПлановогоИФактическогоПотребленияМатериалов"
		или НастройкиОсновнойСхемы.ДополнительныеСвойства.КлючВарианта = "vs_АнализПлановогоИФактическогоПотребленияМатериаловСРасшифровкой" Тогда
		//ТаблицаПродукцииРазбор 	= Пакет[5].Выгрузить();
		//ТаблицаПродукцииРазбор 	= Пакет[6].Выгрузить();   
		//ТаблицаПродукцииРазбор 	= Пакет[17].Выгрузить();
		ТаблицаПродукцииРазбор 	= Пакет[20].Выгрузить();
		ТаблицаПродукцииРазбор.Колонки.Добавить("ЭтоЭлемент", Новый ОписаниеТипов("Булево"));
		ТаблицаПродукцииРазбор.Колонки.Добавить("Обработано", Новый ОписаниеТипов("Булево"));
		ТаблицаПродукцииРазбор.Колонки.Добавить("ЭтоАИ", Новый ОписаниеТипов("Булево"));
		ТаблицаПродукцииРазбор.Колонки.Добавить("СкладАИ", Новый ОписаниеТипов("СправочникСсылка.Склады"));

		ТаблицаПродукцииТЗРазобрано = Новый ТаблицаЗначений; 
		ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("АналитикаУчетаНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.КлючиАналитикиУчетаНоменклатуры"));
		ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("РодительНоменклатуры", 	Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("Номенклатура", 	Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("Характеристика", 	Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
		ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("Серия", 			Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
		ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("Склад", 			Новый ОписаниеТипов("СправочникСсылка.Склады"));
		ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("Назначение", 		Новый ОписаниеТипов("СправочникСсылка.Назначения"));
		ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("Количество", 		Новый ОписаниеТипов("Число")); 
		ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("КоличествоУпаковок",Новый ОписаниеТипов("Число")); 
		ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("Цена",Новый ОписаниеТипов("Число")); 
		ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число"));
		ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("КоличествоВариантовКомплектацииНоменклатуры",Новый ОписаниеТипов("Число"));
		ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("ЭтоЭлемент", 		Новый ОписаниеТипов("Булево"));
		ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("Обработано", 		Новый ОписаниеТипов("Булево"));
		ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("ЭтоАИ", 			Новый ОписаниеТипов("Булево"));
		ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("ДокументСборки");

		ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("ВидЗапасов", 		Новый ОписаниеТипов("СправочникСсылка.ВидыЗапасов"));
		ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("НомерГТД", 		Новый ОписаниеТипов("СправочникСсылка.НомераГТД"));
		ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("Помещение", 		Новый ОписаниеТипов("СправочникСсылка.СкладскиеПомещения"));


		ТабЗатратыНаСборку = Новый ТаблицаЗначений;
		ТабЗатратыНаСборку.Колонки.Добавить("АналитикаУчетаНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.КлючиАналитикиУчетаНоменклатуры"));
		ТабЗатратыНаСборку.Колонки.Добавить("РодительНоменклатуры", 	Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТабЗатратыНаСборку.Колонки.Добавить("Номенклатура", 			Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		ТабЗатратыНаСборку.Колонки.Добавить("Характеристика", 			Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
		ТабЗатратыНаСборку.Колонки.Добавить("Серия", 					Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
		ТабЗатратыНаСборку.Колонки.Добавить("Назначение", 				Новый ОписаниеТипов("СправочникСсылка.Назначения"));
		ТабЗатратыНаСборку.Колонки.Добавить("ДокументСборки");
		ТабЗатратыНаСборку.Колонки.Добавить("Склад", 					Новый ОписаниеТипов("СправочникСсылка.Склады"));
		ТабЗатратыНаСборку.Колонки.Добавить("Количество", 				Новый ОписаниеТипов("Число")); 
		ТабЗатратыНаСборку.Колонки.Добавить("КоличествоУпаковок", 		Новый ОписаниеТипов("Число"));
		ТабЗатратыНаСборку.Колонки.Добавить("КоличествоВариантовКомплектацииНоменклатуры",Новый ОписаниеТипов("Число"));
		ТабЗатратыНаСборку.Колонки.Добавить("Цена",Новый ОписаниеТипов("Число"));
	    ТабЗатратыНаСборку.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число"));

		ТабЗатратыНаСборку.Колонки.Добавить("ВидЗапасов", 				Новый ОписаниеТипов("СправочникСсылка.ВидыЗапасов"));
		ТабЗатратыНаСборку.Колонки.Добавить("НомерГТД", 				Новый ОписаниеТипов("СправочникСсылка.НомераГТД"));
		ТабЗатратыНаСборку.Колонки.Добавить("Помещение", 				Новый ОписаниеТипов("СправочникСсылка.СкладскиеПомещения"));

		МассивУдаляемых = Новый Массив;
		ОграничениеЦикла = 0;
		ОсталосьНеразобранныхТекущихКомплектов = ТаблицаПродукцииРазбор.Количество(); 
		Пока ОсталосьНеразобранныхТекущихКомплектов > 0 Цикл
			
			  РазобратьТекущийНабор(ТаблицаПродукцииРазбор, ДатаНачала, ДатаОкончания, МассивУзловАИ, ТабВыпускПродукцииОбщийИНеГП, ГотоваяПродукция, ВидЦены);
			
			  МассивУдаляемых.Очистить();
			  Для Каждого СтрокаРазбор Из ТаблицаПродукцииРазбор Цикл
				  Если СтрокаРазбор.Обработано Тогда
					  МассивУдаляемых.Добавить(СтрокаРазбор);
				  КонецЕсли;	
				  Если СтрокаРазбор.ЭтоЭлемент Тогда
					   	НоваяСтрокаТП = ТаблицаПродукцииТЗРазобрано.Добавить();
					   	ЗаполнитьЗначенияСвойств(НоваяСтрокаТП, СтрокаРазбор);
					   	Если МассивУдаляемых.Найти(СтрокаРазбор)=Неопределено Тогда // fix Suetin 20.12.2023 11:33:53    Этой ошибки не было, появилась, когда аналитику добавил.
					   		МассивУдаляемых.Добавить(СтрокаРазбор);
						КонецЕсли;	
				  КонецЕсли;	
			  КонецЦикла;
			  Для Каждого УдаляемыйЭлемент Из МассивУдаляемых Цикл
				  ТаблицаПродукцииРазбор.Удалить(УдаляемыйЭлемент);   				// fix Suetin 20.12.2023 11:33:53    Этой ошибки удаления не было, появилась, когда аналитику добавил.
			  КонецЦикла;	
			
			
			 ОграничениеЦикла = ОграничениеЦикла + 1;
			 ОсталосьНеразобранныхТекущихКомплектов = ТаблицаПродукцииРазбор.Количество();
			 Если ОграничениеЦикла > 100 Тогда
				  ОсталосьНеразобранныхТекущихКомплектов = 0;
			 КонецЕсли;
			
		КонецЦикла;


		Для Каждого СтрокаРазбор Из ТаблицаПродукцииТЗРазобрано Цикл
			НоваяСтрокаТаблицыРазбор = ТабЗатратыНаСборку.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицыРазбор, СтрокаРазбор);				
		КонецЦикла;
		/////////////////////////////////////////////////////////////////////////////////

		ТабЗатратыНаСборку.Колонки.Добавить("ВидОперации");
		ТабЗатратыНаСборку.ЗаполнитьЗначения("СписаниеЗатрат", "ВидОперации"); 
		ТабЗатратыНаСборку.Колонки.Добавить("Упаковка");
		ТабЗатратыНаСборку.Колонки.Добавить("СтатусУказанияСерий"); 
		ТабЗатратыНаСборку.Колонки.Добавить("ИдентификаторСтроки");
	КонецЕсли;
	/////////////////////////////////////////////////////////////////////////////////////////////////	
	Если НастройкиОсновнойСхемы.ДополнительныеСвойства.КлючВарианта = "vs_АнализПлановогоИФактическогоПотребленияМатериалов" 
		или НастройкиОсновнойСхемы.ДополнительныеСвойства.КлючВарианта = "vs_АнализПлановогоИФактическогоПотребленияМатериаловСРасшифровкой" Тогда
		ТабВыпускПродукции.Колонки.Добавить("ПлановаяСтоимость",Новый ОписаниеТипов("Число"));
		ТабВыпускПродукции.Колонки.Добавить("ФактическаяСтоимость",Новый ОписаниеТипов("Число"));
		ТабВыпускПродукции.Колонки.Добавить("ФактическаяСтоимостьДоизготовления",Новый ОписаниеТипов("Число"));
		ТабВыпускПродукции.Колонки.Добавить("НоменклатураУзел");
		
	    ДЗ = Новый ДеревоЗначений;
	    Дз.Колонки.Добавить("Номенклатура", новый ОписаниеТипов("СправочникСсылка.Номенклатура"),"Номенклатура");
	    Дз.Колонки.Добавить("Характеристика", новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"),"Характеристика");
	    Дз.Колонки.Добавить("ИД_",новый ОписаниеТипов("строка"),"ИД");
	    Дз.Колонки.Добавить("РодительИД", новый ОписаниеТипов("Число"),"РодительИД");
	    Дз.Колонки.Добавить("ИД",новый ОписаниеТипов("Число"),"ИД");
	    Дз.Колонки.Добавить("Комплектация",новый ОписаниеТипов("СправочникСсылка.ВариантыКомплектацииНоменклатуры"),"Комплектация");
	    Дз.Колонки.Добавить("Количество",новый ОписаниеТипов("Число"),"Количество");
	    Дз.Колонки.Добавить("Количество2",новый ОписаниеТипов("Число"),"Количество");
	    Дз.Колонки.Добавить("Всего",новый ОписаниеТипов("Число"),"Количество");
	    Дз.Колонки.Добавить("КоличествоМатериалов",новый ОписаниеТипов("Число"),"Количество");
	    Дз.Колонки.Добавить("Цена",новый ОписаниеТипов("Число"),"Количество");
	    Дз.Колонки.Добавить("Сумма",новый ОписаниеТипов("Число"),"Количество");
		
		//ВидЗакупочнойЦены = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НастройкиКД, "ВидЗакупочнойЦены").Значение;  Будем использовать ВидЦены
		
		//Для Каждого СтрТВП Из ТабВыпускПродукции Цикл
		//	Если ТипЗнч(СтрТВП.ДокументСборки) = Тип("ДокументСсылка.СборкаТоваров")
		//		и ЗначениеЗаполнено(СтрТВП.ДокументСборки.ВариантКомплектации) Тогда			
				Материалы = Новый ТаблицаЗначений();
				Материалы.Колонки.Добавить("Номенклатура", 	Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
				Материалы.Колонки.Добавить("Характеристика",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
				Материалы.Колонки.Добавить("Количество", 	Новый ОписаниеТипов("Число"));
				vs_АнализПлановогоИФактическогоПотребленияМатериалов_МО_ПриКомпоновкеРезультата_ЗаполнитьДеревоСервер(ТабВыпускПродукции,
					//ДЗ,ВидЗакупочнойЦены,ВидЗакупочнойЦены.ВалютаЦены,ВидЗакупочнойЦены.ВалютаЦены,,"", 
					ДЗ,ВидЦены,ВидЦены.ВалютаЦены,ВидЦены.ВалютаЦены,,"",
					Материалы, ИспользоватьАктуальныеЦены, ДатаЦены);	//СтрТВП.ДокументСборки.ВариантКомплектации				
					//СтрТВП.ПлановаяСтоимость = Дз.Строки.Итог("Сумма",Истина);
					
				ПревышенЛимитСтрок = Ложь;
				ИсключеннаяНоменклатура = Новый ТаблицаЗначений();
				//Если НастройкиОсновнойСхемы.ДополнительныеСвойства.КлючВарианта = "vs_АнализПлановогоИФактическогоПотребленияМатериаловСРасшифровкой" Тогда	
					ПотребленоУзлов = Новый ТаблицаЗначений();
					ПотребленоУзлов.Колонки.Добавить("Номенклатура", 	Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
					ПотребленоУзлов.Колонки.Добавить("Характеристика",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
					ПотребленоУзлов.Колонки.Добавить("Серия",Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
					ПотребленоУзлов.Колонки.Добавить("ДокументСборки",Новый ОписаниеТипов("ДокументСсылка.СборкаТоваров"));
					ПотребленоУзлов.Колонки.Добавить("Узел", 	Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
					ПотребленоУзлов.Колонки.Добавить("ХарактеристикаУзла",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
					ПотребленоУзлов.Колонки.Добавить("СерияУзла",Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
					ПотребленоУзлов.Колонки.Добавить("Материал", 	Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
					ПотребленоУзлов.Колонки.Добавить("ХарактеристикаМатериала",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
					ПотребленоУзлов.Колонки.Добавить("СерияМатериала",Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
					ПотребленоУзлов.Колонки.Добавить("КоличествоДоизготовление", 	Новый ОписаниеТипов("Число"));
					ПотребленоУзлов.Колонки.Добавить("ФактическаяСтоимостьДоизготовления", 	Новый ОписаниеТипов("Число"));
					ПотребленоУзлов.Колонки.Добавить("Количество", 		Новый ОписаниеТипов("Число")); 
					ПотребленоУзлов.Колонки.Добавить("КоличествоУпаковок",Новый ОписаниеТипов("Число")); 
					ПотребленоУзлов.Колонки.Добавить("Цена",Новый ОписаниеТипов("Число")); 
					ПотребленоУзлов.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число"));
					ПотребленоУзлов.Колонки.Добавить("ПлановаяСтоимость",Новый ОписаниеТипов("Число"));
					ПотребленоУзлов.Колонки.Добавить("ФактическаяСтоимость", 	Новый ОписаниеТипов("Число"));
					ПотребленоУзлов.Колонки.Добавить("ФСДоизготовления", 	Новый ОписаниеТипов("Число"));

					vs_АнализПлановогоИФактическогоПотребленияМатериалов_МО_ПриКомпоновкеРезультата_ЗаполнитьТекущиеЗатратыНаИзделие(ТабВыпускПродукции,
						НастройкиКД, ПревышенЛимитСтрок, ИсключеннаяНоменклатура, ПользовательскиеНастройки, ИспользоватьАктуальныеЦены, ДатаЦены, 
						ТабЗатратыНаСборку, ТабВыпускПродукцииОбщийИНеГПКопия, ПотребленоУзлов);   //  ПараметрыОтчета
				//Иначе
				//	vs_АнализПлановогоИФактическогоПотребленияМатериалов_МО_ПриКомпоновкеРезультата_ЗаполнитьТекущиеЗатратыНаИзделие(ТабВыпускПродукции,
				//		НастройкиКД, ПревышенЛимитСтрок, ИсключеннаяНоменклатура, ПользовательскиеНастройки, ИспользоватьАктуальныеЦены, ДатаЦены, 
				//		ТабЗатратыНаСборку, ТабВыпускПродукцииОбщийИНеГПКопия);   //  ПараметрыОтчета
				//		
				//КонецЕсли;		
		//	КонецЕсли;
		//КонецЦикла;
	КонецЕсли;	
	////////////////////////////////////////////////////////////////////////////////////////////////////////////
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("Изготовлено", ТабВыпускПродукции);
	Если НастройкиОсновнойСхемы.ДополнительныеСвойства.КлючВарианта = "МатериальныйОтчет" 
		или НастройкиОсновнойСхемы.ДополнительныеСвойства.КлючВарианта = "19dc71b8-be67-4371-ae6f-26a353ece9bd" Тогда 
		ВнешниеНаборыДанных.Вставить("Потреблено" , ТабЗатратыНаСборку);
	ИначеЕсли НастройкиОсновнойСхемы.ДополнительныеСвойства.КлючВарианта = "vs_АнализПлановогоИФактическогоПотребленияМатериалов" 
		или НастройкиОсновнойСхемы.ДополнительныеСвойства.КлючВарианта = "vs_АнализПлановогоИФактическогоПотребленияМатериаловСРасшифровкой" Тогда
		ВнешниеНаборыДанных.Вставить("ПотребленоУзлов" , ПотребленоУзлов);
	КонецЕсли;
	
	// Выводим отчет
	СхемаКД	= Объект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	ДанныеРасшифровки   = Новый ДанныеРасшифровкиКомпоновкиДанных;
    КомпоновщикМакетаКД	= Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКД		        = КомпоновщикМакетаКД.Выполнить(СхемаКД, НастройкиКД, ДанныеРасшифровки);

    ПроцессорКД	= Новый ПроцессорКомпоновкиДанных;                                    
    ПроцессорКД.Инициализировать(МакетКД, ВнешниеНаборыДанных, ДанныеРасшифровки);

    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
    ПроцессорВывода.Вывести(ПроцессорКД);
	
	vs_ФормироватьДокументы = Ложь;
	//ПараметрДанных = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ФормироватьДокументы"));
	//Если ТипЗнч(ПараметрДанных) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных")
	//	и ПараметрДанных.Использование Тогда
	//		vs_ФормироватьДокументы = ПараметрДанных.Значение;
	//КонецЕсли;
	vs_ФормироватьДокументы = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НастройкиКД, "ФормироватьДокументы").Значение;
	// Формируем документы
	Если vs_ФормироватьДокументы Тогда  //  ФормироватьДокументы или 
		////////////////////////////////////ДеревоДанных = Новый ДеревоЗначений;
		
		////////////////////////////////////ВнешниеНаборыДанных.Вставить("Изготовлено", Новый ТаблицаЗначений); // для заполнения документов нужна только таблица списаний
		//// begin fix Suetin 20.12.2023 11:46:43
		//Для Каждого СтрЭлНКД Из НастройкиКД.Выбор.Элементы Цикл
		//	Если СтрЭлНКД.Поле = Новый ПолеКомпоновкиДанных("КоличествоУпаковок") Тогда
		//		СтрЭлНКД.Использование=Истина;
		//	КонецЕсли;	
		//КонецЦикла;	
		//Для Каждого СтрЭлНКД Из НастройкиКД.Структура Цикл
		//	Если СтрЭлНКД.Имя="Сборка" Тогда
		//		АналитикаПрисутствует=Ложь;
		//		НоменклатураПрисутствует=Ложь;
		//		ХарактеристикаПрисутствует=Ложь;
		//		СерияПрисутствует=Ложь;
		//		НазначениеПрисутствует=Ложь; 
		//		ВидЗапасовПрисутствует=Ложь;
		//		НомерГТДПрисутствует=Ложь;
		//		ПомещениеПрисутствует=Ложь;
		//		Для Каждого СтрВ Из СтрЭлНКД.Выбор.Элементы Цикл
		//			Если СтрВ.Поле = Новый ПолеКомпоновкиДанных("АналитикаУчетаНоменклатуры") Тогда
		//				АналитикаПрисутствует=Истина;
		//			КонецЕсли;
		//			Если СтрВ.Поле = Новый ПолеКомпоновкиДанных("Номенклатура") Тогда
		//				НоменклатураПрисутствует=Истина;
		//			КонецЕсли;
		//			Если СтрВ.Поле = Новый ПолеКомпоновкиДанных("Характеристика") Тогда
		//				ХарактеристикаПрисутствует=Истина;
		//			КонецЕсли;
		//			Если СтрВ.Поле = Новый ПолеКомпоновкиДанных("Серия") Тогда
		//				СерияПрисутствует=Истина;
		//			КонецЕсли;
		//			Если СтрВ.Поле = Новый ПолеКомпоновкиДанных("Назначение") Тогда
		//				НазначениеПрисутствует=Истина;
		//			КонецЕсли;
		//			Если СтрВ.Поле = Новый ПолеКомпоновкиДанных("КоличествоУпаковок") Тогда
		//				СтрВ.Использование=Истина;
		//			КонецЕсли;
		//			
		//			Если СтрВ.Поле = Новый ПолеКомпоновкиДанных("ВидЗапасов") Тогда
		//				ВидЗапасовПрисутствует=Истина;
		//			КонецЕсли;
		//			Если СтрВ.Поле = Новый ПолеКомпоновкиДанных("НомерГТД") Тогда
		//				НомерГТДПрисутствует=Истина;
		//			КонецЕсли;
		//			Если СтрВ.Поле = Новый ПолеКомпоновкиДанных("Помещение") Тогда
		//				ПомещениеПрисутствует=Истина;
		//			КонецЕсли;
		//		КонецЦикла;
		//		Если Не АналитикаПрисутствует Тогда
		//			П = СтрЭлНКД.Выбор.Элементы.Вставить(1,Тип("ВыбранноеПолеКомпоновкиДанных"));
		//			П.Поле = Новый ПолеКомпоновкиДанных("АналитикаУчетаНоменклатуры");
		//			П.Заголовок = "Аналитика учета номенклатуры";
		//			Г = СтрЭлНКД.ПоляГруппировки.Элементы.Вставить(0,Тип("ПолеГруппировкиКомпоновкиДанных"));
		//			Г.Поле = Новый ПолеКомпоновкиДанных("АналитикаУчетаНоменклатуры");
		//		КонецЕсли;
		//		Если Не НоменклатураПрисутствует Тогда
		//			П = СтрЭлНКД.Выбор.Элементы.Вставить(2,Тип("ВыбранноеПолеКомпоновкиДанных"));
		//			П.Поле = Новый ПолеКомпоновкиДанных("Номенклатура");
		//			П.Заголовок = "Номенклатура";
		//			Г = СтрЭлНКД.ПоляГруппировки.Элементы.Вставить(1,Тип("ПолеГруппировкиКомпоновкиДанных"));
		//			Г.Поле = Новый ПолеКомпоновкиДанных("Номенклатура");
		//		КонецЕсли; 
		//		Если Не ХарактеристикаПрисутствует Тогда
		//			П = СтрЭлНКД.Выбор.Элементы.Вставить(3,Тип("ВыбранноеПолеКомпоновкиДанных"));
		//			П.Поле = Новый ПолеКомпоновкиДанных("Характеристика");
		//			П.Заголовок = "Характеристика";
		//			Г = СтрЭлНКД.ПоляГруппировки.Элементы.Вставить(2,Тип("ПолеГруппировкиКомпоновкиДанных"));
		//			Г.Поле = Новый ПолеКомпоновкиДанных("Характеристика");
		//		КонецЕсли;
		//		Если Не СерияПрисутствует Тогда 
		//			П = СтрЭлНКД.Выбор.Элементы.Вставить(4,Тип("ВыбранноеПолеКомпоновкиДанных"));
		//			П.Поле = Новый ПолеКомпоновкиДанных("Серия");
		//			П.Заголовок = "Серия";                       
		//			Г = СтрЭлНКД.ПоляГруппировки.Элементы.Вставить(3,Тип("ПолеГруппировкиКомпоновкиДанных"));
		//			Г.Поле = Новый ПолеКомпоновкиДанных("Серия");
		//		КонецЕсли;
		//		Если Не НазначениеПрисутствует Тогда
		//			П = СтрЭлНКД.Выбор.Элементы.Вставить(5,Тип("ВыбранноеПолеКомпоновкиДанных"));
		//			П.Поле = Новый ПолеКомпоновкиДанных("Назначение");
		//			П.Заголовок = "Назначение"; 
		//			Г = СтрЭлНКД.ПоляГруппировки.Элементы.Вставить(4,Тип("ПолеГруппировкиКомпоновкиДанных"));
		//			Г.Поле = Новый ПолеКомпоновкиДанных("Назначение");
		//		КонецЕсли;
		//		
		//		Если Не ВидЗапасовПрисутствует Тогда
		//			П = СтрЭлНКД.Выбор.Элементы.Вставить(6,Тип("ВыбранноеПолеКомпоновкиДанных"));
		//			П.Поле = Новый ПолеКомпоновкиДанных("ВидЗапасов");
		//			П.Заголовок = "Вид запасов"; 
		//			Г = СтрЭлНКД.ПоляГруппировки.Элементы.Вставить(5,Тип("ПолеГруппировкиКомпоновкиДанных"));
		//			Г.Поле = Новый ПолеКомпоновкиДанных("ВидЗапасов");
		//		КонецЕсли;
		//		
		//		Если Не НомерГТДПрисутствует Тогда
		//			П = СтрЭлНКД.Выбор.Элементы.Вставить(7,Тип("ВыбранноеПолеКомпоновкиДанных"));
		//			П.Поле = Новый ПолеКомпоновкиДанных("НомерГТД");
		//			П.Заголовок = "Номер ГТД"; 
		//			Г = СтрЭлНКД.ПоляГруппировки.Элементы.Вставить(6,Тип("ПолеГруппировкиКомпоновкиДанных"));
		//			Г.Поле = Новый ПолеКомпоновкиДанных("НомерГТД");
		//		КонецЕсли;
		//		
		//		Если Не ПомещениеПрисутствует Тогда
		//			П = СтрЭлНКД.Выбор.Элементы.Вставить(8,Тип("ВыбранноеПолеКомпоновкиДанных"));
		//			П.Поле = Новый ПолеКомпоновкиДанных("Помещение");
		//			П.Заголовок = "Помещение"; 
		//			Г = СтрЭлНКД.ПоляГруппировки.Элементы.Вставить(7,Тип("ПолеГруппировкиКомпоновкиДанных"));
		//			Г.Поле = Новый ПолеКомпоновкиДанных("Помещение");
		//		КонецЕсли;
		//		Для Каждого СтрЭКД Из СтрЭлНКД.Структура Цикл
		//			Для Каждого СтрД Из СтрЭКД.Выбор.Элементы Цикл
		//				Если СтрД.Поле = Новый ПолеКомпоновкиДанных("КоличествоУпаковок") Тогда
		//					СтрД.Использование=Истина;
		//				КонецЕсли;
		//			КонецЦикла;	
		//		КонецЦикла;	
		//	КонецЕсли;
		//	Если СтрЭлНКД.Имя="СписаниеЗатрат" Тогда
		//		Для Каждого СтрЭл Из СтрЭлНКД.Структура Цикл
		//			Если Не СтрЭл.Имя="СписаниеЗатратНомеклатура" Тогда Продолжить; КонецЕсли;
		//			АналитикаПрисутствует=Ложь;
		//			НоменклатураПрисутствует=Ложь;
		//			ХарактеристикаПрисутствует=Ложь;
		//			СерияПрисутствует=Ложь;
		//			НазначениеПрисутствует=Ложь;
		//			ВидЗапасовПрисутствует=Ложь;
		//			НомерГТДПрисутствует=Ложь;
		//			ПомещениеПрисутствует=Ложь;
		//			Для Каждого СтрВ Из СтрЭл.Выбор.Элементы Цикл
		//				Если СтрВ.Поле = Новый ПолеКомпоновкиДанных("АналитикаУчетаНоменклатуры") Тогда
		//					АналитикаПрисутствует=Истина;
		//				КонецЕсли;
		//				Если СтрВ.Поле = Новый ПолеКомпоновкиДанных("Номенклатура") Тогда
		//					НоменклатураПрисутствует=Истина;
		//				КонецЕсли;
		//				Если СтрВ.Поле = Новый ПолеКомпоновкиДанных("Характеристика") Тогда
		//					ХарактеристикаПрисутствует=Истина;
		//				КонецЕсли;
		//				Если СтрВ.Поле = Новый ПолеКомпоновкиДанных("Серия") Тогда
		//					СерияПрисутствует=Истина;
		//				КонецЕсли;
		//				Если СтрВ.Поле = Новый ПолеКомпоновкиДанных("Назначение") Тогда
		//					НазначениеПрисутствует=Истина;
		//				КонецЕсли;
		//				Если СтрВ.Поле = Новый ПолеКомпоновкиДанных("КоличествоУпаковок") Тогда
		//				СтрВ.Использование=Истина;
		//			КонецЕсли;
		//			    					
		//				Если СтрВ.Поле = Новый ПолеКомпоновкиДанных("ВидЗапасов") Тогда
		//					ВидЗапасовПрисутствует=Истина;
		//				КонецЕсли;
		//				Если СтрВ.Поле = Новый ПолеКомпоновкиДанных("НомерГТД") Тогда
		//					НомерГТДПрисутствует=Истина;
		//				КонецЕсли;
		//				Если СтрВ.Поле = Новый ПолеКомпоновкиДанных("Помещение") Тогда
		//					ПомещениеПрисутствует=Истина;
		//				КонецЕсли;

		//			КонецЦикла; 
		//			Прервать;
		//		КонецЦикла;	
		//		Если Не АналитикаПрисутствует Тогда
		//			П = СтрЭл.Выбор.Элементы.Вставить(1,Тип("ВыбранноеПолеКомпоновкиДанных"));
		//			П.Поле = Новый ПолеКомпоновкиДанных("АналитикаУчетаНоменклатуры");
		//			П.Заголовок = "Аналитика учета номенклатуры";
		//			Г = СтрЭл.ПоляГруппировки.Элементы.Вставить(0,Тип("ПолеГруппировкиКомпоновкиДанных"));
		//			Г.Поле = Новый ПолеКомпоновкиДанных("АналитикаУчетаНоменклатуры");
		//		КонецЕсли;
		//		Если Не НоменклатураПрисутствует Тогда
		//			П = СтрЭл.Выбор.Элементы.Вставить(2,Тип("ВыбранноеПолеКомпоновкиДанных"));
		//			П.Поле = Новый ПолеКомпоновкиДанных("Номенклатура");
		//			П.Заголовок = "Номенклатура";
		//			Г = СтрЭл.ПоляГруппировки.Элементы.Вставить(1,Тип("ПолеГруппировкиКомпоновкиДанных"));
		//			Г.Поле = Новый ПолеКомпоновкиДанных("Номенклатура");
		//		КонецЕсли; 
		//		Если Не ХарактеристикаПрисутствует Тогда
		//			П = СтрЭл.Выбор.Элементы.Вставить(3,Тип("ВыбранноеПолеКомпоновкиДанных"));
		//			П.Поле = Новый ПолеКомпоновкиДанных("Характеристика");
		//			П.Заголовок = "Характеристика";
		//			Г = СтрЭл.ПоляГруппировки.Элементы.Вставить(2,Тип("ПолеГруппировкиКомпоновкиДанных"));
		//			Г.Поле = Новый ПолеКомпоновкиДанных("Характеристика");
		//		КонецЕсли;
		//		Если Не СерияПрисутствует Тогда 
		//			П = СтрЭл.Выбор.Элементы.Вставить(4,Тип("ВыбранноеПолеКомпоновкиДанных"));
		//			П.Поле = Новый ПолеКомпоновкиДанных("Серия");
		//			П.Заголовок = "Серия";
		//			Г = СтрЭл.ПоляГруппировки.Элементы.Вставить(3,Тип("ПолеГруппировкиКомпоновкиДанных"));
		//			Г.Поле = Новый ПолеКомпоновкиДанных("Серия");
		//		КонецЕсли;
		//		Если Не НазначениеПрисутствует Тогда
		//			П = СтрЭл.Выбор.Элементы.Вставить(5,Тип("ВыбранноеПолеКомпоновкиДанных"));
		//			П.Поле = Новый ПолеКомпоновкиДанных("Назначение");
		//			П.Заголовок = "Назначение";
		//			Г = СтрЭл.ПоляГруппировки.Элементы.Вставить(4,Тип("ПолеГруппировкиКомпоновкиДанных"));
		//			Г.Поле = Новый ПолеКомпоновкиДанных("Назначение");
		//		КонецЕсли;
		//		
		//		Если Не ВидЗапасовПрисутствует Тогда
		//			П = СтрЭл.Выбор.Элементы.Вставить(6,Тип("ВыбранноеПолеКомпоновкиДанных"));
		//			П.Поле = Новый ПолеКомпоновкиДанных("ВидЗапасов");
		//			П.Заголовок = "Вид запасов"; 
		//			Г = СтрЭл.ПоляГруппировки.Элементы.Вставить(5,Тип("ПолеГруппировкиКомпоновкиДанных"));
		//			Г.Поле = Новый ПолеКомпоновкиДанных("ВидЗапасов");
		//		КонецЕсли;
		//		
		//		Если Не НомерГТДПрисутствует Тогда
		//			П = СтрЭл.Выбор.Элементы.Вставить(7,Тип("ВыбранноеПолеКомпоновкиДанных"));
		//			П.Поле = Новый ПолеКомпоновкиДанных("НомерГТД");
		//			П.Заголовок = "Номер ГТД"; 
		//			Г = СтрЭл.ПоляГруппировки.Элементы.Вставить(6,Тип("ПолеГруппировкиКомпоновкиДанных"));
		//			Г.Поле = Новый ПолеКомпоновкиДанных("НомерГТД");
		//		КонецЕсли;
		//		
		//		Если Не ПомещениеПрисутствует Тогда
		//			П = СтрЭл.Выбор.Элементы.Вставить(8,Тип("ВыбранноеПолеКомпоновкиДанных"));
		//			П.Поле = Новый ПолеКомпоновкиДанных("Помещение");
		//			П.Заголовок = "Помещение"; 
		//			Г = СтрЭл.ПоляГруппировки.Элементы.Вставить(7,Тип("ПолеГруппировкиКомпоновкиДанных"));
		//			Г.Поле = Новый ПолеКомпоновкиДанных("Помещение");
		//		КонецЕсли; 
		//		
		//		Для Каждого СтрЭКД Из СтрЭлНКД.Структура Цикл
		//			Для Каждого СтрД Из СтрЭКД.Выбор.Элементы Цикл
		//				Если СтрД.Поле = Новый ПолеКомпоновкиДанных("КоличествоУпаковок") Тогда
		//					СтрД.Использование=Истина;
		//					Прервать;
		//				КонецЕсли;
		//			КонецЦикла;
		//			Прервать;
		//		КонецЦикла;
		//	КонецЕсли;	
		//КонецЦикла;
		//// end fix Suetin 20.12.2023 11:46:47
		//МакетКД = КомпоновщикМакетаКД.Выполнить(СхемаКД, НастройкиКД,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

		//ПроцессорКД = Новый ПроцессорКомпоновкиДанных;
		//ПроцессорКД.Инициализировать(МакетКД, ВнешниеНаборыДанных);

		//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		//ПроцессорВывода.УстановитьОбъект(ДеревоДанных);
		//ПроцессорВывода.Вывести(ПроцессорКД);
		
		ИмяФайлаОтчета    = ПолучитьИмяВременногоФайла("mxl");
		ДокументРезультат.Записать(ИмяФайлаОтчета);
		ДанныеФайлаОтчета = Новый ДвоичныеДанные(ИмяФайлаОтчета);
		АдресФайлаОтчета  = ПоместитьВоВременноеХранилище(ДанныеФайлаОтчета); 
		
		Организация = Неопределено;
		парОрганизация = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НастройкиОсновнойСхемы, "Организация");
		Если Не парОрганизация = Неопределено и парОрганизация.Использование и ЗначениеЗаполнено(парОрганизация.Значение) Тогда
			Организация = парОрганизация.Значение;	
		КонецЕсли;
		//ДокументыПередачи = Отчеты.vs_МатериальныйОтчет.СформироватьДокументыПередачи(ДатаОкончания, Организация, Подразделение, СкладЦеха, ДеревоДанных, АдресФайлаОтчета);
		
	//	МассивСообщений = Новый Массив();
		
		ДокументыПередачи = Отчеты.vs_МатериальныйОтчет.СформироватьДокументыПередачиПоТЗ(ДатаОкончания, Организация, Подразделение, СкладЦеха, ТабЗатратыНаСборку, АдресФайлаОтчета);
		
		//Макет5 = СхемаКД.Макеты.Макет5;
		ТД = Новый ТабличныйДокумент;	
		Для Каждого Док Из ДокументыПередачи Цикл
			//Макет5.Параметры.СообщениеПользователю.Выражение = СтрШаблон("Сформирован документ: %1", Док.Ссылка);
			О = ТД.Область("R1C1:R1C1");
			О.Текст = СтрШаблон("Сформирован документ: %1", Док.Ссылка);
			ДокументРезультат.Вывести(ТД);//    Макет5.Макет
			//ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Сформирован документ: %1", Док));	
		КонецЦикла;
	КонецЕсли;
	
	// Формируем документы
	//Если ФормироватьДокументы Тогда
	//	ДеревоДанных = Новый ДеревоЗначений;
	//	
	//	ВнешниеНаборыДанных.Вставить("Изготовлено", Новый ТаблицаЗначений); // для заполнения документов нужна только таблица списаний
	//	
	//	МакетКД = КомпоновщикМакетаКД.Выполнить(СхемаКД, НастройкиКД,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

	//	ПроцессорКД = Новый ПроцессорКомпоновкиДанных;
	//	ПроцессорКД.Инициализировать(МакетКД, ВнешниеНаборыДанных);

	//	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	//	ПроцессорВывода.УстановитьОбъект(ДеревоДанных);
	//	ПроцессорВывода.Вывести(ПроцессорКД);
	//	
	//	ИмяФайлаОтчета    = ПолучитьИмяВременногоФайла("mxl");
	//	ДокументРезультат.Записать(ИмяФайлаОтчета);
	//	ДанныеФайлаОтчета = Новый ДвоичныеДанные(ИмяФайлаОтчета);
	//	АдресФайлаОтчета  = ПоместитьВоВременноеХранилище(ДанныеФайлаОтчета);
	//	
	//	Отчеты.ИТБК_МатериальныйОтчет.СформироватьДокументыПередачи(ДатаОкончания, Организация, СкладЦеха, ДеревоДанных, АдресФайлаОтчета);
	//КонецЕсли;
	//КонецЕсли;
КонецПроцедуры // vs_МатериальныйОтчет_МО_ФормироватьДокументы()  

Функция ПолучитьТекстВыпускПродукцииЗатратыНаСборку(ИспользоватьАктуальныеЦены)
	ТекстЗапроса = "
	|//////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыНоменклатуры.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ МассивУзловАИ
	|ИЗ
	|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|ГДЕ
	|	НЕ ВидыНоменклатуры.ЭтоГруппа
	|	И ВидыНоменклатуры.Наименование ПОДОБНО &Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыО.Период КАК Период,
	|	ТоварыО.Регистратор КАК Регистратор,
	|	ТоварыО.АналитикаУчетаНоменклатуры КАК КлючАналитикиУчетаНоменклатуры,
	|	КАУН.Номенклатура КАК Номенклатура,
	|	СпрНоменклатура.Родитель КАК РодительНоменклатуры,
	|	СпрНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	КАУН.Характеристика КАК Характеристика,
	|	КАУН.Серия КАК Серия,
	|	КАУН.Назначение КАК Назначение,
	|	КАУН.СкладскаяТерритория КАК Склад,
	|	ТоварыО.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ТоварыО.СтатьяРасходов КАК СтатьяРасходов,
	|	ТоварыО.ВидДвижения КАК ВидДвижения,
	|	СпрНоменклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	СпрВидыНоменклатуры.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
	|	СпрПолитикиУчетаСерий.ТипПолитики КАК ТипПолитикиУчетаСерий,
	|	ТоварыО.ВидЗапасов КАК ВидЗапасов,
	//|	ТоварыО.НомерГТД КАК НомерГТД,
	|	ЕСТЬNULL(СУММА(СпрВариантыКомплектацииНоменклатуры.Количество), 0) КАК КоличествоВариантовКомплектацииНоменклатуры
	|ПОМЕСТИТЬ ТоварыО
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизаций КАК ТоварыО
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КАУН
	|		ПО ТоварыО.АналитикаУчетаНоменклатуры = КАУН.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО (КАУН.Номенклатура = СпрНоменклатура.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК СпрВидыНоменклатуры
	|		ПО (СпрНоменклатура.ВидНоменклатуры = СпрВидыНоменклатуры.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПолитикиУчетаСерий КАК СпрПолитикиУчетаСерий
	|		ПО (СпрВидыНоменклатуры.ПолитикаУчетаСерий = СпрПолитикиУчетаСерий.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК СпрВариантыКомплектацииНоменклатуры
	|		ПО (КАУН.Номенклатура = СпрВариантыКомплектацииНоменклатуры.Владелец)
	|			И (КАУН.Характеристика = СпрВариантыКомплектацииНоменклатуры.Характеристика)
	|ГДЕ
	|	ТоварыО.Период МЕЖДУ &ДатаНачалаОбщая1 И &ДатаОкончания1
	|	И ТоварыО.Активность = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыО.Период,
	|	ТоварыО.Регистратор,
	|	ТоварыО.АналитикаУчетаНоменклатуры,
	|	КАУН.Номенклатура,
	|	СпрНоменклатура.Родитель,
	|	СпрНоменклатура.ЕдиницаИзмерения,
	|	КАУН.Характеристика,
	|	КАУН.Серия,
	|	КАУН.Назначение,
	|	КАУН.СкладскаяТерритория,
	|	ТоварыО.ХозяйственнаяОперация,
	|	ТоварыО.СтатьяРасходов,
	|	ТоварыО.ВидДвижения,
	|	СпрНоменклатура.ВидНоменклатуры,
	|	СпрВидыНоменклатуры.ПолитикаУчетаСерий,
	|	СпрПолитикиУчетаСерий.ТипПолитики,
	|	ТоварыО.ВидЗапасов//,
	//|	ТоварыО.НомерГТД
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	КлючАналитикиУчетаНоменклатуры,
	|	Номенклатура,
	|	Характеристика,
	|	Серия,
	|	Назначение,
	|	Склад
	|;          
	| 	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.Период КАК Период,
	|	Товары.Регистратор КАК Регистратор,
	|	Товары.КлючАналитикиУчетаНоменклатуры КАК КлючАналитикиУчетаНоменклатуры,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.РодительНоменклатуры КАК РодительНоменклатуры,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Серия КАК Серия,
	|	Товары.Назначение КАК Назначение,
	|	Товары.Склад КАК Склад,
	|	Товары.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Товары.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
	|	Товары.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
	|	Товары.ВидЗапасов КАК ВидЗапасов,
	//|	Товары.НомерГТД КАК НомерГТД,
	|	Товары.КоличествоВариантовКомплектацииНоменклатуры КАК КоличествоВариантовКомплектацииНоменклатуры
	|ПОМЕСТИТЬ ВыпускОбщийИНеГП1
	|ИЗ
	|	ТоварыО КАК Товары
	|ГДЕ
	|	Товары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Товары.ХозяйственнаяОперация = &СборкаИзКомплектующих
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	КлючАналитикиУчетаНоменклатуры,
	|	Номенклатура,
	|	Характеристика,
	|	Серия,
	|	Назначение,
	|	Склад
	|;
	|
	
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.Период КАК Период,
	|	Товары.Регистратор КАК ДокументСборки,
	|	Выпуск.КлючАналитикиУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Выпуск.РодительНоменклатуры КАК РодительНоменклатуры,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Назначение КАК Назначение,
	|	Товары.Склад КАК Склад,
	|	Товары.Помещение КАК Помещение,
	|	Товары.Серия КАК Серия,
	|	Выпуск.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Выпуск.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
	|	Выпуск.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
	|	Выпуск.ВидЗапасов КАК ВидЗапасов,
	//|	Выпуск.НомерГТД КАК НомерГТД,
	|	СУММА(Товары.ВНаличииПриход) КАК Количество,
	|	СУММА(Товары.ВНаличииПриход) КАК КоличествоУпаковок,
	|	СУММА(Выпуск.КоличествоВариантовКомплектацииНоменклатуры) КАК КоличествоВариантовКомплектацииНоменклатуры
	|ПОМЕСТИТЬ ВыпускОбщийИНеГП2
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Обороты(
	|			&ДатаНачалаОбщая,
	|			&ДатаОкончания,
	|			Регистратор,
	|			(Номенклатура, Характеристика, Назначение, Склад) В     //, Серия
	|				(ВЫБРАТЬ
	|					Т.Номенклатура,
	|					Т.Характеристика,
	|					Т.Назначение,
	|					Т.Склад	//,
	|					//Т.Серия
	|				ИЗ
	|					ВыпускОбщийИНеГП1 КАК Т)) КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыпускОбщийИНеГП1 КАК Выпуск
	|		ПО Товары.Регистратор = Выпуск.Регистратор
	|			И Товары.Номенклатура = Выпуск.Номенклатура
	|			И Товары.Характеристика = Выпуск.Характеристика
	|			И Товары.Назначение = Выпуск.Назначение
	|			И Товары.Склад = Выпуск.Склад
	|			И (ВЫБОР КОГДА Выпуск.ТипПолитикиУчетаСерий = ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.УчетСебестоимостиПоСериям) ТОГДА
	|				Товары.Серия = Выпуск.Серия ИНАЧЕ ИСТИНА КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Период,
	|	Товары.Назначение,
	|	Товары.Склад,
	|	Товары.Номенклатура,
	|	Выпуск.КлючАналитикиУчетаНоменклатуры,
	|	Выпуск.РодительНоменклатуры,
	|	Товары.Регистратор,
	|	Товары.Характеристика,
	|	Товары.Серия,
	|	Товары.Помещение,
	|	Выпуск.ВидНоменклатуры,
	|	Выпуск.ПолитикаУчетаСерий,
	|	Выпуск.ТипПолитикиУчетаСерий,
	|	Выпуск.ВидЗапасов//,
	//|	Выпуск.НомерГТД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВыпускОбщийИНеГП1
	|; 
	|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	Товары.Период КАК Период,
	//|	Товары.Регистратор КАК Регистратор,
	//|	Товары.КлючАналитикиУчетаНоменклатуры КАК КлючАналитикиУчетаНоменклатуры,
	//|	Товары.Номенклатура КАК Номенклатура,
	//|	Товары.РодительНоменклатуры КАК РодительНоменклатуры,
	//|	Товары.Характеристика КАК Характеристика,
	//|	Товары.Серия КАК Серия,
	//|	Товары.Назначение КАК Назначение,
	//|	Товары.Склад КАК Склад,
	//|	Товары.ВидНоменклатуры КАК ВидНоменклатуры,
	//|	Товары.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
	//|	Товары.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
	//|	Товары.ВидЗапасов КАК ВидЗапасов,
	//|	Товары.НомерГТД КАК НомерГТД,
	//|	Товары.КоличествоВариантовКомплектацииНоменклатуры КАК КоличествоВариантовКомплектацииНоменклатуры
	//|ПОМЕСТИТЬ ВыпускОбщий
	//|ИЗ
	//|	ТоварыО КАК Товары    
	//|ГДЕ
	//|	Товары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//|	И Товары.ХозяйственнаяОперация = &СборкаИзКомплектующих 
	//|	И Товары.РодительНоменклатуры = &ГотоваяПродукция
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	Регистратор,
	//|	КлючАналитикиУчетаНоменклатуры,
	//|	Номенклатура,
	//|	Характеристика,
	//|	Серия,
	//|	Назначение,
	//|	Склад
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	Товары.Период КАК Период,
	//|	Товары.Регистратор КАК Регистратор,
	//|	Товары.КлючАналитикиУчетаНоменклатуры КАК КлючАналитикиУчетаНоменклатуры,
	//|	Товары.Номенклатура КАК Номенклатура,
	//|	Товары.РодительНоменклатуры КАК РодительНоменклатуры,
	//|	Товары.Характеристика КАК Характеристика,
	//|	Товары.Серия КАК Серия,
	//|	Товары.Назначение КАК Назначение,
	//|	Товары.Склад КАК Склад,
	//|	Товары.ВидНоменклатуры КАК ВидНоменклатуры,
	//|	Товары.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
	//|	Товары.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
	//|	Товары.ВидЗапасов КАК ВидЗапасов,
	//|	Товары.НомерГТД КАК НомерГТД,
	//|	Товары.КоличествоВариантовКомплектацииНоменклатуры КАК КоличествоВариантовКомплектацииНоменклатуры
	//|ПОМЕСТИТЬ Выпуск
	//|ИЗ
	//|	ВыпускОбщий КАК Товары
	//|ГДЕ
	//|	НЕ Товары.Период < &ДатаНачала1
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	Регистратор,
	//|	КлючАналитикиУчетаНоменклатуры,
	//|	Номенклатура,
	//|	Характеристика,
	//|	Серия,
	//|	Назначение,
	//|	Склад
	//|;
	//|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.Период КАК Период,
	|	Товары.Регистратор КАК Регистратор,
	|	Товары.КлючАналитикиУчетаНоменклатуры КАК КлючАналитикиУчетаНоменклатуры,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.РодительНоменклатуры КАК РодительНоменклатуры,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Серия КАК Серия,
	|	Товары.Назначение КАК Назначение,
	|	Товары.Склад КАК Склад,
	|	Товары.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Товары.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
	|	Товары.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
	|	Товары.ВидЗапасов КАК ВидЗапасов,
	//|	Товары.НомерГТД КАК НомерГТД,
	|	Товары.КоличествоВариантовКомплектацииНоменклатуры КАК КоличествоВариантовКомплектацииНоменклатуры
	|ПОМЕСТИТЬ Выпуск
	|ИЗ
	|	ТоварыО КАК Товары
	|ГДЕ
	|	НЕ Товары.Период < &ДатаНачала1
	|	И Товары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Товары.ХозяйственнаяОперация = &СборкаИзКомплектующих 
	|	И Товары.РодительНоменклатуры = &ГотоваяПродукция
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	КлючАналитикиУчетаНоменклатуры,
	|	Номенклатура,
	|	Характеристика,
	|	Серия,
	|	Назначение,
	|	Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////

	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.Регистратор КАК Регистратор,
	|	Товары.КлючАналитикиУчетаНоменклатуры КАК КлючАналитикиУчетаНоменклатуры,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.РодительНоменклатуры КАК РодительНоменклатуры,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Серия КАК Серия,
	|	Товары.Назначение КАК Назначение,
	|	Товары.СтатьяРасходов КАК СтатьяРасходов,
	|	Товары.Склад КАК Склад,
	|	Товары.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Товары.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
	|	Товары.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
	|	Товары.ВидЗапасов КАК ВидЗапасов,
	//|	Товары.НомерГТД КАК НомерГТД,
	|	Товары.КоличествоВариантовКомплектацииНоменклатуры КАК КоличествоВариантовКомплектацииНоменклатуры
	|ПОМЕСТИТЬ Списание0
	|ИЗ
	|	ТоварыО КАК Товары
	|ГДЕ
	|	НЕ Товары.Период < &ДатаНачала1
	|	И Товары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И (Товары.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
	|			ИЛИ ТИПЗНАЧЕНИЯ(Товары.Регистратор) = ТИП(Документ.ВнутреннееПотребление)
	|				И Товары.СтатьяРасходов В (&ДопизготовлениеПроизводство))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	КлючАналитикиУчетаНоменклатуры,
	|	Номенклатура,
	|	Характеристика,
	|	Серия,
	|	Назначение,
	|	Склад
	|;
	|
	
	|
	|////////////////////////////////////////////////////////////////////////////////

	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.Регистратор КАК Регистратор,
	|	Товары.КлючАналитикиУчетаНоменклатуры КАК КлючАналитикиУчетаНоменклатуры,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.РодительНоменклатуры КАК РодительНоменклатуры,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Серия КАК Серия,
	|	Товары.Назначение КАК Назначение,
	|	Товары.СтатьяРасходов КАК СтатьяРасходов,
	|	Товары.Склад КАК Склад,
	|	Товары.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Товары.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
	|	Товары.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
	|	Товары.ВидЗапасов КАК ВидЗапасов,
	//|	Товары.НомерГТД КАК НомерГТД,
	|	Товары.КоличествоВариантовКомплектацииНоменклатуры КАК КоличествоВариантовКомплектацииНоменклатуры
	|ПОМЕСТИТЬ Списание
	|ИЗ
	|	Списание0 КАК Товары
	//|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СборкаТоваров КАК Сборка
	//|		ПО ВЫРАЗИТЬ(Товары.ДокРег КАК Документ.СборкаТоваров) = Сборка.Ссылка
	//|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	//|		ПО Сборка.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ  Товары.Регистратор В(ВЫБРАТЬ РАЗЛИЧНЫЕ Т.Регистратор ИЗ Выпуск КАК Т)
	// включить условие списания на ГП
	//|	СпрНоменклатура.Родитель = &ГотоваяПродукция
	|	
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Регистратор КАК Регистратор,
	|	Товары.КлючАналитикиУчетаНоменклатуры КАК КлючАналитикиУчетаНоменклатуры,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.РодительНоменклатуры КАК РодительНоменклатуры,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Серия КАК Серия,
	|	Товары.Назначение КАК Назначение,
	|	Товары.СтатьяРасходов КАК СтатьяРасходов,
	|	Товары.Склад КАК Склад,
	|	Товары.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Товары.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
	|	Товары.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
	|	Товары.ВидЗапасов КАК ВидЗапасов,
	//|	Товары.НомерГТД КАК НомерГТД,
	|	Товары.КоличествоВариантовКомплектацииНоменклатуры КАК КоличествоВариантовКомплектацииНоменклатуры
	|ИЗ
	|	Списание0 КАК Товары
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(Товары.Регистратор) = ТИП(Документ.ВнутреннееПотребление)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	КлючАналитикиУчетаНоменклатуры,
	|	Номенклатура,
	|	Характеристика,
	|	Серия,
	|	Назначение,
	|	Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Списание0
	|;
	
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.Период КАК Период,
	|	Товары.Регистратор КАК Регистратор,
	|	Товары.КлючАналитикиУчетаНоменклатуры КАК КлючАналитикиУчетаНоменклатуры,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.РодительНоменклатуры КАК РодительНоменклатуры,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Серия КАК Серия,
	|	Товары.Назначение КАК Назначение,
	|	Товары.Склад КАК Склад,
	|	Товары.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Товары.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
	|	Товары.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
	|	Товары.ВидЗапасов КАК ВидЗапасов,
	//|	Товары.НомерГТД КАК НомерГТД,
	|	Товары.КоличествоВариантовКомплектацииНоменклатуры КАК КоличествоВариантовКомплектацииНоменклатуры
	|ПОМЕСТИТЬ ПродажаО
	|ИЗ
	|	ТоварыО КАК Товары
	|ГДЕ
	|	НЕ Товары.Период < &ДатаНачала1
	|	И Товары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И Товары.ХозяйственнаяОперация В(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности),
	|									 ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияВРозницу),
	|									 ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту),
	|									 ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет),
	|									 ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКомиссионногоТовара))
	|	И НЕ Товары.РодительНоменклатуры = &ГотоваяПродукция
	|	И ЕСТЬNULL(Товары.КоличествоВариантовКомплектацииНоменклатуры,0) > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	КлючАналитикиУчетаНоменклатуры,
	|	Номенклатура,
	|	Характеристика,
	|	Серия,
	|	Назначение,
	|	Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Регистратор КАК ДокументСборки,
	|	Продажа.КлючАналитикиУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Продажа.РодительНоменклатуры КАК РодительНоменклатуры,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Назначение КАК Назначение,
	|	Товары.Склад КАК Склад,
	|	Товары.Помещение КАК Помещение,
	|	Товары.Серия КАК Серия,
	|	Продажа.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Продажа.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
	|	Продажа.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
	|	Продажа.ВидЗапасов КАК ВидЗапасов,
	//|	Продажа.НомерГТД КАК НомерГТД,
	|	СУММА(Товары.ВНаличииРасход) КАК Количество,
	|	СУММА(Товары.ВНаличииРасход) КАК КоличествоУпаковок,
	|	СУММА(Продажа.КоличествоВариантовКомплектацииНоменклатуры) КАК КоличествоВариантовКомплектацииНоменклатуры
	|ПОМЕСТИТЬ Продажа
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Регистратор,
	|			(Номенклатура, Характеристика, Назначение, Склад) В     //, Серия
	|				(ВЫБРАТЬ
	|					Т.Номенклатура,
	|					Т.Характеристика,
	|					Т.Назначение,
	|					Т.Склад	//,
	|					//Т.Серия
	|				ИЗ
	|					ПродажаО КАК Т)) КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПродажаО КАК Продажа
	|		ПО Товары.Регистратор = Продажа.Регистратор
	|			И Товары.Номенклатура = Продажа.Номенклатура
	|			И Товары.Характеристика = Продажа.Характеристика
	|			И Товары.Назначение = Продажа.Назначение
	|			И Товары.Склад = Продажа.Склад
	|			И (ВЫБОР КОГДА Продажа.ТипПолитикиУчетаСерий = ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.УчетСебестоимостиПоСериям) ТОГДА
	|				Товары.Серия = Продажа.Серия ИНАЧЕ ИСТИНА КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Назначение,
	|	Товары.Склад,
	|	Товары.Номенклатура,
	|	Продажа.КлючАналитикиУчетаНоменклатуры,
	|	Продажа.РодительНоменклатуры,
	|	Товары.Регистратор,
	|	Товары.Характеристика,
	|	Товары.Серия,
	|	Товары.Помещение,
	|	Продажа.ВидНоменклатуры,
	|	Продажа.ПолитикаУчетаСерий,
	|	Продажа.ТипПолитикиУчетаСерий,
	|	Продажа.ВидЗапасов//,
	//|	Продажа.НомерГТД
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПродажаО
	|; 
	|  
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МАКСИМУМ(ВыпускОбщийИНеГП2.Период) КАК Период,
	//|	ВыпускОбщийИНеГП2.ДокументСборки КАК ДокументСборки,
	//|	ВыпускОбщийИНеГП2.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	//|	ВыпускОбщийИНеГП2.РодительНоменклатуры КАК РодительНоменклатуры,
	|	ВыпускОбщийИНеГП2.Номенклатура КАК Номенклатура,
	|	ВыпускОбщийИНеГП2.Характеристика КАК Характеристика,
	|	ВыпускОбщийИНеГП2.Назначение КАК Назначение,
	//|	ВыпускОбщийИНеГП2.Склад КАК Склад,
	//|	ВыпускОбщийИНеГП2.Помещение КАК Помещение,
	|	ВыпускОбщийИНеГП2.Серия КАК Серия	//,
	//|	ВыпускОбщийИНеГП2.ВидНоменклатуры КАК ВидНоменклатуры,
	//|	ВыпускОбщийИНеГП2.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
	//|	ВыпускОбщийИНеГП2.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
	//|	ВыпускОбщийИНеГП2.ВидЗапасов КАК ВидЗапасов,
	//|	ВыпускОбщийИНеГП2.НомерГТД КАК НомерГТД
	|ПОМЕСТИТЬ ПродажаСборкаО
	|ИЗ
	|	Продажа КАК Продажа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыпускОбщийИНеГП2 КАК ВыпускОбщийИНеГП2
	|		ПО Продажа.Номенклатура = ВыпускОбщийИНеГП2.Номенклатура
	|			И Продажа.Характеристика = ВыпускОбщийИНеГП2.Характеристика
	|			И Продажа.Назначение = ВыпускОбщийИНеГП2.Назначение
	//|			И Продажа.Склад = ВыпускОбщийИНеГП2.Склад
	|			И Продажа.Серия = ВыпускОбщийИНеГП2.Серия
	|
	|СГРУППИРОВАТЬ ПО
	//|	ВыпускОбщийИНеГП2.ДокументСборки,
	//|	ВыпускОбщийИНеГП2.АналитикаУчетаНоменклатуры,
	//|	ВыпускОбщийИНеГП2.РодительНоменклатуры,
	|	ВыпускОбщийИНеГП2.Номенклатура,
	|	ВыпускОбщийИНеГП2.Характеристика,
	|	ВыпускОбщийИНеГП2.Назначение,
	//|	ВыпускОбщийИНеГП2.Склад,
	//|	ВыпускОбщийИНеГП2.Помещение,
	|	ВыпускОбщийИНеГП2.Серия	//,
	//|	ВыпускОбщийИНеГП2.ВидНоменклатуры,
	//|	ВыпускОбщийИНеГП2.ПолитикаУчетаСерий,
	//|	ВыпускОбщийИНеГП2.ТипПолитикиУчетаСерий,
	//|	ВыпускОбщийИНеГП2.ВидЗапасов,
	//|	ВыпускОбщийИНеГП2.НомерГТД
	|;
	|
	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВыпускОбщийИНеГП2.ДокументСборки КАК ДокументСборки	//,
	//|	ВыпускОбщийИНеГП2.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	//|	ВыпускОбщийИНеГП2.РодительНоменклатуры КАК РодительНоменклатуры,
	//|	ВыпускОбщийИНеГП2.Номенклатура КАК Номенклатура,
	//|	ВыпускОбщийИНеГП2.Характеристика КАК Характеристика,
	//|	ВыпускОбщийИНеГП2.Назначение КАК Назначение,
	//|	ВыпускОбщийИНеГП2.Склад КАК Склад,
	//|	ВыпускОбщийИНеГП2.Помещение КАК Помещение,
	//|	ВыпускОбщийИНеГП2.Серия КАК Серия,
	//|	ВыпускОбщийИНеГП2.ВидНоменклатуры КАК ВидНоменклатуры,
	//|	ВыпускОбщийИНеГП2.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
	//|	ВыпускОбщийИНеГП2.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
	//|	ВыпускОбщийИНеГП2.ВидЗапасов КАК ВидЗапасов,
	//|	ВыпускОбщийИНеГП2.НомерГТД КАК НомерГТД,
	//|	СУММА(ВыпускОбщийИНеГП2.Количество) КАК Количество,
	//|	СУММА(ВыпускОбщийИНеГП2.КоличествоУпаковок) КАК КоличествоУпаковок,
	//|	СУММА(ВыпускОбщийИНеГП2.КоличествоВариантовКомплектацииНоменклатуры) КАК КоличествоВариантовКомплектацииНоменклатуры
	|ПОМЕСТИТЬ ПродажаСборка
	|ИЗ
	|	ПродажаСборкаО КАК ПродажаСборкаО
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыпускОбщийИНеГП2 КАК ВыпускОбщийИНеГП2
	|		ПО ПродажаСборкаО.Период = ВыпускОбщийИНеГП2.Период
	//|			И ПродажаСборкаО.ДокументСборки = ВыпускОбщийИНеГП2.ДокументСборки
	//|			И ПродажаСборкаО.АналитикаУчетаНоменклатуры = ВыпускОбщийИНеГП2.АналитикаУчетаНоменклатуры
	|			И ПродажаСборкаО.Номенклатура = ВыпускОбщийИНеГП2.Номенклатура
	|			И ПродажаСборкаО.Характеристика = ВыпускОбщийИНеГП2.Характеристика
	|			И ПродажаСборкаО.Назначение = ВыпускОбщийИНеГП2.Назначение
	//|			И ПродажаСборкаО.Склад = ВыпускОбщийИНеГП2.Склад
	|			И ПродажаСборкаО.Серия = ВыпускОбщийИНеГП2.Серия
	|
	//|СГРУППИРОВАТЬ ПО
	//|	ВыпускОбщийИНеГП2.ДокументСборки,
	//|	ВыпускОбщийИНеГП2.АналитикаУчетаНоменклатуры,
	//|	ВыпускОбщийИНеГП2.РодительНоменклатуры,
	//|	ВыпускОбщийИНеГП2.Номенклатура,
	//|	ВыпускОбщийИНеГП2.Характеристика,
	//|	ВыпускОбщийИНеГП2.Назначение,
	//|	ВыпускОбщийИНеГП2.Склад,
	//|	ВыпускОбщийИНеГП2.Помещение,
	//|	ВыпускОбщийИНеГП2.Серия,
	//|	ВыпускОбщийИНеГП2.ВидНоменклатуры,
	//|	ВыпускОбщийИНеГП2.ПолитикаУчетаСерий,
	//|	ВыпускОбщийИНеГП2.ТипПолитикиУчетаСерий,
	//|	ВыпускОбщийИНеГП2.ВидЗапасов,
	//|	ВыпускОбщийИНеГП2.НомерГТД
	
	|
	|; 
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПродажаСборкаО
	|; 
	|
	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.Регистратор КАК Регистратор,
	|	Товары.КлючАналитикиУчетаНоменклатуры КАК КлючАналитикиУчетаНоменклатуры,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.РодительНоменклатуры КАК РодительНоменклатуры,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Серия КАК Серия,
	|	Товары.Назначение КАК Назначение,
	|	Товары.СтатьяРасходов КАК СтатьяРасходов,
	|	Товары.Склад КАК Склад,
	|	Товары.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Товары.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
	|	Товары.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
	|	Товары.ВидЗапасов КАК ВидЗапасов,
	//|	Товары.НомерГТД КАК НомерГТД,
	|	Товары.КоличествоВариантовКомплектацииНоменклатуры КАК КоличествоВариантовКомплектацииНоменклатуры
	|ПОМЕСТИТЬ СписаниеПродажа
	|ИЗ
	|	ТоварыО КАК Товары
	|ГДЕ
	//|	НЕ Товары.Период < &ДатаНачала1
	|	Товары.Регистратор В(ВЫБРАТЬ РАЗЛИЧНЫЕ Т.ДокументСборки ИЗ ПродажаСборка КАК Т)
	|	И Товары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И (Товары.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
	|			ИЛИ ТИПЗНАЧЕНИЯ(Товары.Регистратор) = ТИП(Документ.ВнутреннееПотребление)
	|				И Товары.СтатьяРасходов В (&ДопизготовлениеПроизводство))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор,
	|	КлючАналитикиУчетаНоменклатуры,
	|	Номенклатура,
	|	Характеристика,
	|	Серия,
	|	Назначение,
	|	Склад
	|;
	|

	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПродажаСборка
	|; 
	|
	|////////////////////////////////////////////////////////////////////////////////
	
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ЦеныНоменклатурыСрезПоследних.Цена / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) * ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки2, 1) * ВЫБОР
	|		КОГДА &Валюта <> ЦеныНоменклатурыСрезПоследних.Валюта
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(КурсыВалютыЦены.КурсЗнаменатель, 0) > 0
	|							И ЕСТЬNULL(КурсыВалютыЦены.КурсЧислитель, 0) > 0
	|							И ЕСТЬNULL(КурсыВалюты.КурсЗнаменатель, 0) > 0
	|							И ЕСТЬNULL(КурсыВалюты.КурсЧислитель, 0) > 0
	|						ТОГДА КурсыВалютыЦены.КурсЧислитель * КурсыВалюты.КурсЗнаменатель / (КурсыВалюты.КурсЧислитель * КурсыВалютыЦены.КурсЗнаменатель)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ ЦеныНомХарактеристик
	|ИЗ
	|	ТоварыО КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(";
	Если ИспользоватьАктуальныеЦены Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|				,";
	Иначе
		ТекстЗапроса = ТекстЗапроса + "
		|				&ДатаЦены,";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "
	|				ВидЦены = &ВидЦены
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							ТоварыО.Номенклатура
	|						ИЗ
	|							ТоварыО КАК ТоварыО)
	|					И (Характеристика В
	|							(ВЫБРАТЬ
	|								ТоварыО.Характеристика
	|							ИЗ
	|								ТоварыО КАК ТоварыО)
	|						ИЛИ Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ТаблицаТоваров.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|			И ТаблицаТоваров.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(";
	Если ИспользоватьАктуальныеЦены Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|				,";
	Иначе
		ТекстЗапроса = ТекстЗапроса + "
		|				&ДатаЦены,";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + " БазоваяВалюта = &БазоваяВалюта) КАК КурсыВалютыЦены
	|		ПО (ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютыЦены.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(";
	Если ИспользоватьАктуальныеЦены Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|				,";
	Иначе
		ТекстЗапроса = ТекстЗапроса + "
		|				&ДатаЦены,";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + " Валюта = &Валюта И БазоваяВалюта = &БазоваяВалюта) КАК КурсыВалюты
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	
	|УНИЧТОЖИТЬ ТоварыО
	|; 
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.Регистратор КАК ДокументСборки,
	|	Выпуск.КлючАналитикиУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Выпуск.РодительНоменклатуры КАК РодительНоменклатуры,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Назначение КАК Назначение,
	|	Товары.Склад КАК Склад,
	|	Товары.Помещение КАК Помещение,
	|	Товары.Серия КАК Серия,
	|	Выпуск.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Выпуск.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
	|	Выпуск.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
	|	Выпуск.ВидЗапасов КАК ВидЗапасов,
	//|	Выпуск.НомерГТД КАК НомерГТД,
	|	СУММА(Товары.ВНаличииПриход) КАК Количество,
	|	СУММА(Товары.ВНаличииПриход) КАК КоличествоУпаковок,
	|	СУММА(Выпуск.КоличествоВариантовКомплектацииНоменклатуры) КАК КоличествоВариантовКомплектацииНоменклатуры
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Регистратор,
	|			(Номенклатура, Характеристика, Назначение, Склад) В     //, Серия
	|				(ВЫБРАТЬ
	|					Т.Номенклатура,
	|					Т.Характеристика,
	|					Т.Назначение,
	|					Т.Склад	//,
	|					//Т.Серия
	|				ИЗ
	|					Выпуск КАК Т)) КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Выпуск КАК Выпуск
	|		ПО Товары.Регистратор = Выпуск.Регистратор
	|			И Товары.Номенклатура = Выпуск.Номенклатура
	|			И Товары.Характеристика = Выпуск.Характеристика
	|			И Товары.Назначение = Выпуск.Назначение
	|			И Товары.Склад = Выпуск.Склад
	|			И (ВЫБОР КОГДА Выпуск.ТипПолитикиУчетаСерий = ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.УчетСебестоимостиПоСериям) ТОГДА
	|				Товары.Серия = Выпуск.Серия ИНАЧЕ ИСТИНА КОНЕЦ)
	|           //И ложь
	|СГРУППИРОВАТЬ ПО
	|	Товары.Назначение,
	|	Товары.Склад,
	|	Товары.Номенклатура,
	|	Выпуск.КлючАналитикиУчетаНоменклатуры,
	|	Выпуск.РодительНоменклатуры,
	|	Товары.Регистратор,
	|	Товары.Характеристика,
	|	Товары.Серия,
	|	Товары.Помещение,
	|	Выпуск.ВидНоменклатуры,
	|	Выпуск.ПолитикаУчетаСерий,
	|	Выпуск.ТипПолитикиУчетаСерий,
	|	Выпуск.ВидЗапасов//,
	//|	Выпуск.НомерГТД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Продажа.ДокументСборки КАК ДокументСборки,
	|	Продажа.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Продажа.РодительНоменклатуры КАК РодительНоменклатуры,
	|	Продажа.Номенклатура КАК Номенклатура,
	|	Продажа.Характеристика КАК Характеристика,
	|	Продажа.Назначение КАК Назначение,
	|	Продажа.Склад КАК Склад,
	|	Продажа.Помещение КАК Помещение,
	|	Продажа.Серия КАК Серия,
	|	Продажа.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Продажа.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
	|	Продажа.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
	|	Продажа.ВидЗапасов КАК ВидЗапасов,
	//|	Продажа.НомерГТД КАК НомерГТД,
	|	СУММА(Продажа.Количество) КАК Количество,
	|	СУММА(Продажа.КоличествоУпаковок) КАК КоличествоУпаковок,
	|	СУММА(Продажа.КоличествоВариантовКомплектацииНоменклатуры) КАК КоличествоВариантовКомплектацииНоменклатуры
	|ИЗ
	|	Продажа КАК Продажа
	|
	|СГРУППИРОВАТЬ ПО
	|	Продажа.ДокументСборки,
	|	Продажа.АналитикаУчетаНоменклатуры,
	|	Продажа.РодительНоменклатуры,
	|	Продажа.Номенклатура,
	|	Продажа.Характеристика,
	|	Продажа.Назначение,
	|	Продажа.Склад,
	|	Продажа.Помещение,
	|	Продажа.Серия,
	|	Продажа.ВидНоменклатуры,
	|	Продажа.ПолитикаУчетаСерий,
	|	Продажа.ТипПолитикиУчетаСерий,
	|	Продажа.ВидЗапасов//,
	//|	Продажа.НомерГТД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	МАКСИМУМ(ВыпускОбщийИНеГП2.Период) КАК Период,
	//|	ВыпускОбщийИНеГП2.ДокументСборки КАК ДокументСборки,
	//|	ВыпускОбщийИНеГП2.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	//|	ВыпускОбщийИНеГП2.РодительНоменклатуры КАК РодительНоменклатуры,
	//|	ВыпускОбщийИНеГП2.Номенклатура КАК Номенклатура,
	//|	ВыпускОбщийИНеГП2.Характеристика КАК Характеристика,
	//|	ВыпускОбщийИНеГП2.Назначение КАК Назначение,
	//|	ВыпускОбщийИНеГП2.Склад КАК Склад,
	//|	ВыпускОбщийИНеГП2.Помещение КАК Помещение,
	//|	ВыпускОбщийИНеГП2.Серия КАК Серия,
	//|	ВыпускОбщийИНеГП2.ВидНоменклатуры КАК ВидНоменклатуры,
	//|	ВыпускОбщийИНеГП2.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
	//|	ВыпускОбщийИНеГП2.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
	//|	ВыпускОбщийИНеГП2.ВидЗапасов КАК ВидЗапасов,
	//|	ВыпускОбщийИНеГП2.НомерГТД КАК НомерГТД,
	//|	СУММА(ВыпускОбщийИНеГП2.Количество) КАК Количество,
	//|	СУММА(ВыпускОбщийИНеГП2.КоличествоУпаковок) КАК КоличествоУпаковок,
	//|	СУММА(ВыпускОбщийИНеГП2.КоличествоВариантовКомплектацииНоменклатуры) КАК КоличествоВариантовКомплектацииНоменклатуры
	//|ПОМЕСТИТЬ ПродажаСборка
	//|ИЗ
	//|	ПродажаСборкаО КАК ПродажаСборкаО
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыпускОбщийИНеГП2 КАК ВыпускОбщийИНеГП2
	//|		ПО ПродажаСборкаО.Период = ВыпускОбщийИНеГП2.Период
	//|			И ПродажаСборкаО.ДокументСборки = ВыпускОбщийИНеГП2.ДокументСборки
	//|			И ПродажаСборкаО.АналитикаУчетаНоменклатуры = ВыпускОбщийИНеГП2.АналитикаУчетаНоменклатуры
	//|			И ПродажаСборкаО.Номенклатура = ВыпускОбщийИНеГП2.Номенклатура
	//|			И ПродажаСборкаО.Характеристика = ВыпускОбщийИНеГП2.Характеристика
	//|			И ПродажаСборкаО.Назначение = ВыпускОбщийИНеГП2.Назначение
	//|			И ПродажаСборкаО.Склад = ВыпускОбщийИНеГП2.Склад
	//|			И ПродажаСборкаО.Серия = ВыпускОбщийИНеГП2.Серия
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВыпускОбщийИНеГП2.ДокументСборки,
	//|	ВыпускОбщийИНеГП2.АналитикаУчетаНоменклатуры,
	//|	ВыпускОбщийИНеГП2.РодительНоменклатуры,
	//|	ВыпускОбщийИНеГП2.Номенклатура,
	//|	ВыпускОбщийИНеГП2.Характеристика,
	//|	ВыпускОбщийИНеГП2.Назначение,
	//|	ВыпускОбщийИНеГП2.Склад,
	//|	ВыпускОбщийИНеГП2.Помещение,
	//|	ВыпускОбщийИНеГП2.Серия,
	//|	ВыпускОбщийИНеГП2.ВидНоменклатуры,
	//|	ВыпускОбщийИНеГП2.ПолитикаУчетаСерий,
	//|	ВыпускОбщийИНеГП2.ТипПолитикиУчетаСерий,
	//|	ВыпускОбщийИНеГП2.ВидЗапасов,
	//|	ВыпускОбщийИНеГП2.НомерГТД
	//|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.Регистратор КАК ДокументСборки,
	|	Списание.КлючАналитикиУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Списание.РодительНоменклатуры КАК РодительНоменклатуры,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Назначение КАК Назначение,
	|	Товары.Склад КАК Склад,
	|	Товары.Помещение КАК Помещение,
	|	Товары.Серия КАК Серия,
	|	Списание.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Списание.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
	|	Списание.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
	|	Списание.ВидЗапасов КАК ВидЗапасов,
	//|	Списание.НомерГТД КАК НомерГТД,
	|	СУММА(Товары.ВНаличииРасход) КАК Количество,
	|	СУММА(Товары.ВНаличииРасход) КАК КоличествоУпаковок,
	|	СУММА(Списание.КоличествоВариантовКомплектацииНоменклатуры) КАК КоличествоВариантовКомплектацииНоменклатуры,
	|   МАКСИМУМ(ЦНХ.Цена) КАК Цена,
	|	СУММА(Товары.ВНаличииРасход) * МАКСИМУМ(ЦНХ.Цена) КАК Сумма
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Регистратор,
	|			(Номенклатура, Характеристика, Назначение, Склад) В   // , Серия
	|				(ВЫБРАТЬ
	|					Т.Номенклатура,
	|					Т.Характеристика,
	|					Т.Назначение,
	|					Т.Склад	//,
	|					//Т.Серия
	|				ИЗ
	|					Списание КАК Т)) КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Списание КАК Списание
	|		ПО Товары.Регистратор = Списание.Регистратор
	|			И Товары.Номенклатура = Списание.Номенклатура
	|			И Товары.Характеристика = Списание.Характеристика
	|			И Товары.Назначение = Списание.Назначение
	|			И Товары.Склад = Списание.Склад
	|			И (ВЫБОР КОГДА Списание.ТипПолитикиУчетаСерий = ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.УчетСебестоимостиПоСериям) ТОГДА
	|				Товары.Серия = Списание.Серия ИНАЧЕ ИСТИНА КОНЕЦ)
	|           //И ложь
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныНомХарактеристик КАК ЦНХ
	|		ПО Товары.Номенклатура = ЦНХ.Номенклатура
	|			И Товары.Характеристика = ЦНХ.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Назначение,
	|	Товары.Склад,
	|	Товары.Номенклатура,
	|	Списание.КлючАналитикиУчетаНоменклатуры,
	|	Списание.РодительНоменклатуры,
	|	Товары.Регистратор,
	|	Товары.Характеристика,
	|	Товары.Серия,
	|	Товары.Помещение,
	|	Списание.ВидНоменклатуры,
	|	Списание.ПолитикаУчетаСерий,
	|	Списание.ТипПолитикиУчетаСерий,
	|	Списание.ВидЗапасов//,
	//|	Списание.НомерГТД
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Товары.Регистратор КАК ДокументСборки,
	|	Списание.КлючАналитикиУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Списание.РодительНоменклатуры КАК РодительНоменклатуры,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Назначение КАК Назначение,
	|	Товары.Склад КАК Склад,
	|	Товары.Помещение КАК Помещение,
	|	Товары.Серия КАК Серия,
	|	Списание.ВидНоменклатуры КАК ВидНоменклатуры,
	|	Списание.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
	|	Списание.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
	|	Списание.ВидЗапасов КАК ВидЗапасов,
	//|	Списание.НомерГТД КАК НомерГТД,
	|	СУММА(Товары.ВНаличииРасход) КАК Количество,
	|	СУММА(Товары.ВНаличииРасход) КАК КоличествоУпаковок,
	|	СУММА(Списание.КоличествоВариантовКомплектацииНоменклатуры) КАК КоличествоВариантовКомплектацииНоменклатуры,
	|   МАКСИМУМ(ЦНХ.Цена) КАК Цена,
	|	СУММА(Товары.ВНаличииРасход) * МАКСИМУМ(ЦНХ.Цена) КАК Сумма
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Регистратор,
	|			(Номенклатура, Характеристика, Назначение, Склад) В   // , Серия
	|				(ВЫБРАТЬ
	|					Т.Номенклатура,
	|					Т.Характеристика,
	|					Т.Назначение,
	|					Т.Склад	//,
	|					//Т.Серия
	|				ИЗ
	|					СписаниеПродажа КАК Т)) КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписаниеПродажа КАК Списание
	|		ПО Товары.Регистратор = Списание.Регистратор
	|			И Товары.Номенклатура = Списание.Номенклатура
	|			И Товары.Характеристика = Списание.Характеристика
	|			И Товары.Назначение = Списание.Назначение
	|			И Товары.Склад = Списание.Склад
	|			И (ВЫБОР КОГДА Списание.ТипПолитикиУчетаСерий = ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.УчетСебестоимостиПоСериям) ТОГДА
	|				Товары.Серия = Списание.Серия ИНАЧЕ ИСТИНА КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныНомХарактеристик КАК ЦНХ
	|		ПО Товары.Номенклатура = ЦНХ.Номенклатура
	|			И Товары.Характеристика = ЦНХ.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Назначение,
	|	Товары.Склад,
	|	Товары.Номенклатура,
	|	Списание.КлючАналитикиУчетаНоменклатуры,
	|	Списание.РодительНоменклатуры,
	|	Товары.Регистратор,
	|	Товары.Характеристика,
	|	Товары.Серия,
	|	Товары.Помещение,
	|	Списание.ВидНоменклатуры,
	|	Списание.ПолитикаУчетаСерий,
	|	Списание.ТипПолитикиУчетаСерий,
	|	Списание.ВидЗапасов//,
	//|	Списание.НомерГТД
	
	|
	|; 
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Продажа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Выпуск
	|; 
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Списание
	|; 
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ЦеныНомХарактеристик
	|
	|";
	
	//Если КлючВарианта = "vs_АнализПлановогоИФактическогоПотребленияМатериалов" Тогда
	//	ТекстЗапросаСтруктураУзлов = "
	//	|ВЫБРАТЬ
	//	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура1,
	//	|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика1,
	//	|	ЦеныНоменклатурыСрезПоследних.Цена / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) * ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки2, 1) * ВЫБОР
	//	|		КОГДА &Валюта <> ЦеныНоменклатурыСрезПоследних.Валюта
	//	|			ТОГДА ВЫБОР
	//	|					КОГДА ЕСТЬNULL(КурсыВалютыЦены.КурсЗнаменатель, 0) > 0
	//	|							И ЕСТЬNULL(КурсыВалютыЦены.КурсЧислитель, 0) > 0
	//	|							И ЕСТЬNULL(КурсыВалюты.КурсЗнаменатель, 0) > 0
	//	|							И ЕСТЬNULL(КурсыВалюты.КурсЧислитель, 0) > 0
	//	|						ТОГДА КурсыВалютыЦены.КурсЧислитель * КурсыВалюты.КурсЗнаменатель / (КурсыВалюты.КурсЧислитель * КурсыВалютыЦены.КурсЗнаменатель)
	//	|					ИНАЧЕ 0
	//	|				КОНЕЦ
	//	|		ИНАЧЕ 1
	//	|	КОНЕЦ КАК Цена
	//	|ПОМЕСТИТЬ вт1
	//	|ИЗ
	//	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаОкончания, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&ДатаОкончания, БазоваяВалюта = &БазоваяВалюта) КАК КурсыВалютыЦены
	//	|		ПО (ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютыЦены.Валюта)
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&ДатаОкончания, Валюта = &Валюта И БазоваяВалюта = &БазоваяВалюта) КАК КурсыВалюты
	//	|		ПО (ИСТИНА)
	//	|
	//	|ИНДЕКСИРОВАТЬ ПО
	//	|	Номенклатура1,
	//	|	Характеристика1
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Номенклатура,
	//	|	СУММА(ВариантыКомплектацииНоменклатурыТовары.Количество) КАК Количество,
	//	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец КАК НоменклатураОсн,
	//	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка КАК Ссылка,
	//	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика КАК Характеристика,
	//	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Характеристика КАК ХарактеристикаОсн
	//	|ПОМЕСТИТЬ вт2
	//	|ИЗ
	//	|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
	//	|ГДЕ
	//	|	(ВариантыКомплектацииНоменклатурыТовары.Ссылка.Основной
	//	|				И НЕ ВариантыКомплектацииНоменклатурыТовары.Ссылка.ПометкаУдаления
	//	|				И ВариантыКомплектацииНоменклатурыТовары.Количество <> 0
	//	|				И НЕ ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец = &Владелец
	//	|			ИЛИ ВариантыКомплектацииНоменклатурыТовары.Ссылка = &ВариантКомплектации)
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец,
	//	|	ВариантыКомплектацииНоменклатурыТовары.Номенклатура,
	//	|	ВариантыКомплектацииНоменклатурыТовары.Ссылка,
	//	|	ВариантыКомплектацииНоменклатурыТовары.Характеристика
	//	|
	//	|ИНДЕКСИРОВАТЬ ПО
	//	|	Номенклатура,
	//	|	Характеристика
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	вт2.Номенклатура КАК Номенклатура,
	//	|	вт2.Характеристика КАК Характеристика,
	//	|	вт2.Количество КАК Количество,
	//	|	вт2.НоменклатураОсн КАК НоменклатураОсн,
	//	|	вт2.Ссылка КАК Ссылка,
	//	|	ЕСТЬNULL(вт1.Цена, 0) КАК Цена,
	//	|	вт2.ХарактеристикаОсн КАК ХарактеристикаОсн
	//	|ИЗ
	//	|	вт2 КАК вт2
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ вт1 КАК вт1
	//	|		ПО (вт1.Номенклатура1 = вт2.Номенклатура)
	//	|			И (вт1.Характеристика1 = вт2.Характеристика)
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	вт2.Номенклатура.Наименование,
	//	|   вт2.Характеристика.Наименование
	//	|";
	//	ТекстЗапроса = СтрШаблон("%1; |%2",ТекстЗапроса, ТекстЗапросаСтруктураУзлов);	
	//КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"&ТекстЗапросаКоэффициентУпаковки1",
			Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"ЦеныНоменклатурыСрезПоследних.Упаковка",
			"ЦеныНоменклатурыСрезПоследних.Номенклатура"));
			
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"&ТекстЗапросаКоэффициентУпаковки2",
			Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"ТаблицаТоваров.ЕдиницаИзмерения",
			"ТаблицаТоваров.Номенклатура"));
			
	Возврат ТекстЗапроса;
	
КонецФункции // ПолучитьТекстВыпускПродукцииЗатратыНаСборку()

Процедура РазобратьТекущийНабор(ТаблицаПродукцииРазбор, Знач ПериодОтчетаНачало, Знач ПериодОтчетаКонец, Знач МассивУзловАИ, ТабВыпускПродукцииОбщийИНеГП, Знач ГотоваяПродукция, Знач ВидЦены)


	Для Каждого СтрокаТ Из ТаблицаПродукцииРазбор Цикл
		
		Струк = Новый Структура("Номенклатура,Характеристика,Серия",СтрокаТ.Номенклатура,СтрокаТ.Характеристика,СтрокаТ.Серия);
		ТаблицаЗапросЭтоЭлемент = ТабВыпускПродукцииОбщийИНеГП.НайтиСтроки(Струк);
		
		Если СтрокаТ.РодительНоменклатуры = ГотоваяПродукция
			или СтрокаТ.КоличествоВариантовКомплектацииНоменклатуры = 0 //Тогда
			или ТаблицаЗапросЭтоЭлемент.Количество() = 0 Тогда
			СтрокаТ.ЭтоЭлемент = ИСТИНА; 
			//СтрокаТ.Обработано = ИСТИНА;
			Продолжить;
			
		Иначе

			//ЗапросРазборКомплекта = Новый Запрос("ВЫБРАТЬ
			//|	Товары.Регистратор КАК ДокументСборки,
			//|	Товары.Номенклатура КАК Номенклатура,
			//|	Товары.Характеристика КАК Характеристика,
			//|	Товары.Назначение КАК Назначение,
			//|	Товары.Склад КАК Склад,
			//|	Товары.Помещение КАК Помещение,
			//|	Товары.Серия КАК Серия,
			//|	ЕСТЬNULL(СУММА(&КоличествоКомплектов * Товары.ВНаличииРасход / &КоличествоКомплектовИсходное), 0) КАК Количество,
			//|	ЕСТЬNULL(СУММА(&КоличествоКомплектов * Товары.ВНаличииРасход / &КоличествоКомплектовИсходное), 0) КАК КоличествоУпаковок,
			//|	ТоварыО.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры
			//|ИЗ
			//|	РегистрНакопления.ТоварыНаСкладах.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК Товары
			//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			//|			ТоварыО.Регистратор КАК ДокументСборки,
			//|			ТоварыО.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
			//|			КлючиА.Номенклатура КАК Номенклатура,
			//|			КлючиА.Характеристика КАК Характеристика,
			//|			КлючиА.Назначение КАК Назначение,
			//|			КлючиА.СкладскаяТерритория КАК Склад,
			//|			КлючиА.Серия КАК Серия
			//|		ИЗ
			//|			РегистрНакопления.ТоварыОрганизаций.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК ТоварыО
			//|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиА
			//|				ПО ТоварыО.АналитикаУчетаНоменклатуры = КлючиА.Ссылка
			//|ГДЕ
			//|	ТоварыО.Регистратор = &Регистратор
			//|		
			//|		СГРУППИРОВАТЬ ПО
			//|			ТоварыО.Регистратор,
			//|			КлючиА.Номенклатура,
			//|			КлючиА.Характеристика,
			//|			КлючиА.Назначение,
			//|			КлючиА.СкладскаяТерритория,
			//|			КлючиА.Серия,
			//|			ТоварыО.АналитикаУчетаНоменклатуры) КАК ТоварыО
			//|		ПО Товары.Регистратор = ТоварыО.ДокументСборки
			//|			И Товары.Номенклатура = ТоварыО.Номенклатура
			//|			И Товары.Характеристика = ТоварыО.Характеристика
			//|			И Товары.Назначение = ТоварыО.Назначение
			//|			И Товары.Склад = ТоварыО.Склад
			//|			И (ВЫБОР КОГДА Товары.ТипПолитикиУчетаСерий = ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.УчетСебестоимостиПоСериям) ТОГДА
			//|				Товары.Серия = ТоварыО.Серия ИНАЧЕ ИСТИНА КОНЕЦ)
			//|ГДЕ
			//|	Товары.Регистратор = &Регистратор
			//|
			//|СГРУППИРОВАТЬ ПО
			//|	Товары.Назначение,
			//|	Товары.Характеристика,
			//|	Товары.Серия,
			//|	Товары.Помещение,
			//|	Товары.Склад,
			//|	Товары.Регистратор,
			//|	Товары.Номенклатура,
			//|	ТоварыО.АналитикаУчетаНоменклатуры
			//|
			//|ИМЕЮЩИЕ
			//|	ЕСТЬNULL(СУММА(&КоличествоКомплектов * Товары.ВНаличииРасход / &КоличествоКомплектовИсходное), 0) > 0");
			
			ЗапросРазборКомплекта = Новый Запрос("
			
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ТоварыО.Регистратор КАК ДокументСборки,
			|	ТоварыО.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
			|	ТоварыО.ВидЗапасов КАК ВидЗапасов,   								// fix Suetin 8/29/2024 2:15:12 PM
			|	Ном.ВидНоменклатуры КАК ВидНоменклатуры,                           	// fix Suetin 8/29/2024 2:16:46 PM
			|	ВН.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,                       // fix Suetin 8/29/2024 2:23:24 PM
			|	ПУС.ТипПолитики КАК ТипПолитикиУчетаСерий,                          // fix Suetin 8/29/2024 2:22:56 PM
			|	КлючиА.Номенклатура КАК Номенклатура,
			|	Ном.ЕдиницаИзмерения КАК ЕдиницаИзмерения, 
			|	КлючиА.Характеристика КАК Характеристика,
			|	КлючиА.Назначение КАК Назначение,
			|	КлючиА.СкладскаяТерритория КАК Склад,
			|	КлючиА.Серия КАК Серия
			|ПОМЕСТИТЬ ТоварыОрганизицииО
			|ИЗ
			|	РегистрНакопления.ТоварыОрганизаций.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК ТоварыО
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиА
			|		ПО ТоварыО.АналитикаУчетаНоменклатуры = КлючиА.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
			|		ПО КлючиА.Номенклатура = Ном.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВН
			|		ПО Ном.ВидНоменклатуры = ВН.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПолитикиУчетаСерий КАК ПУС
			|		ПО ВН.ПолитикаУчетаСерий = ПУС.Ссылка
			
			|ГДЕ
			|	ТоварыО.Регистратор = &Регистратор
			|
			|СГРУППИРОВАТЬ ПО
			|	ТоварыО.Регистратор,
			|	КлючиА.Номенклатура,
			|	Ном.ЕдиницаИзмерения,
			|	КлючиА.Характеристика,
			|	КлючиА.Назначение,
			|	КлючиА.СкладскаяТерритория,
			|	КлючиА.Серия,
			|	ТоварыО.АналитикаУчетаНоменклатуры,
			|	ТоварыО.ВидЗапасов,   								// fix Suetin 8/29/2024 2:15:12 PM
			|	Ном.ВидНоменклатуры,                           	// fix Suetin 8/29/2024 2:16:46 PM
			|	ВН.ПолитикаУчетаСерий,                       // fix Suetin 8/29/2024 2:23:24 PM
			|	ПУС.ТипПолитики                          // fix Suetin 8/29/2024 2:22:56 PM
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ТаблицаТоваров.ДокументСборки				 КАК ДокументСборки,
			|	ТаблицаТоваров.АналитикаУчетаНоменклатуры	 КАК АналитикаУчетаНоменклатуры,
			|	ТаблицаТоваров.Номенклатура					 КАК Номенклатура,
			|	ТаблицаТоваров.Характеристика				 КАК Характеристика,
			|	ТаблицаТоваров.ВидЗапасов 					 КАК ВидЗапасов,   							// fix Suetin 8/29/2024 2:15:12 PM
			|	ТаблицаТоваров.ВидНоменклатуры 				 КАК ВидНоменклатуры,                       // fix Suetin 8/29/2024 2:16:46 PM
			|	ТаблицаТоваров.ПолитикаУчетаСерий 			 КАК ПолитикаУчетаСерий,                    // fix Suetin 8/29/2024 2:23:24 PM
			|	ТаблицаТоваров.ТипПолитикиУчетаСерий 		 КАК ТипПолитикиУчетаСерий,                 // fix Suetin 8/29/2024 2:22:56 PM
			|	ТаблицаТоваров.Назначение					 КАК Назначение,
			|	ТаблицаТоваров.Склад						 КАК Склад,
			|	ТаблицаТоваров.Серия						 КАК Серия,
			|	ТаблицаТоваров.ЕдиницаИзмерения				 КАК ЕдиницаИзмерения,
			|	ЦеныНоменклатурыСрезПоследних.Цена / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) * ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки2, 1) * ВЫБОР
			|		КОГДА &Валюта <> ЦеныНоменклатурыСрезПоследних.Валюта
			|			ТОГДА ВЫБОР
			|					КОГДА ЕСТЬNULL(КурсыВалютыЦены.КурсЗнаменатель, 0) > 0
			|							И ЕСТЬNULL(КурсыВалютыЦены.КурсЧислитель, 0) > 0
			|							И ЕСТЬNULL(КурсыВалюты.КурсЗнаменатель, 0) > 0
			|							И ЕСТЬNULL(КурсыВалюты.КурсЧислитель, 0) > 0
			|						ТОГДА КурсыВалютыЦены.КурсЧислитель * КурсыВалюты.КурсЗнаменатель / (КурсыВалюты.КурсЧислитель * КурсыВалютыЦены.КурсЗнаменатель)
			|					ИНАЧЕ 0
			|				КОНЕЦ
			|		ИНАЧЕ 1
			|	КОНЕЦ КАК Цена
			|ПОМЕСТИТЬ ТоварыОрганизиции
			|ИЗ
			|	ТоварыОрганизицииО КАК ТаблицаТоваров
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
			|				&ДатаОкончанияО,
			|				ВидЦены = &ВидЦены
			|					И Номенклатура В
			|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|							ТоварыО.Номенклатура
			|						ИЗ
			|							ТоварыОрганизицииО КАК ТоварыО)
			|					И (Характеристика В
			|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|								ТоварыО.Характеристика
			|							ИЗ
			|								ТоварыОрганизицииО КАК ТоварыО)
			|						ИЛИ Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))) КАК ЦеныНоменклатурыСрезПоследних
			|		ПО ТаблицаТоваров.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
			|			И ТаблицаТоваров.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&ДатаОкончанияО, БазоваяВалюта = &БазоваяВалюта) КАК КурсыВалютыЦены
			|		ПО (ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютыЦены.Валюта)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&ДатаОкончанияО, Валюта = &Валюта И БазоваяВалюта = &БазоваяВалюта) КАК КурсыВалюты
			|		ПО (ИСТИНА)
			|
			//|СГРУППИРОВАТЬ ПО
			//|	ТаблицаТоваров.ДокументСборки,
			//|	ТаблицаТоваров.Номенклатура,
			//|	ТаблицаТоваров.ЕдиницаИзмерения,
			//|	ТаблицаТоваров.Характеристика,
			//|	ТаблицаТоваров.Назначение,
			//|	ТаблицаТоваров.Склад,
			//|	ТаблицаТоваров.Серия,
			//|	ТаблицаТоваров.АналитикаУчетаНоменклатуры
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ТоварыОрганизицииО
			|;
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Товары.Регистратор КАК ДокументСборки,
			|	Товары.Номенклатура КАК Номенклатура,
			|	Товары.Характеристика КАК Характеристика,
			|	Товары.Назначение КАК Назначение,
			|	Товары.Склад КАК Склад,
			|	Товары.Помещение КАК Помещение,
			|	Товары.Серия КАК Серия,
			|	ЕСТЬNULL(СУММА(&КоличествоКомплектов * Товары.ВНаличииРасход / &КоличествоКомплектовИсходное), 0) КАК Количество,
			|	ЕСТЬNULL(СУММА(&КоличествоКомплектов * Товары.ВНаличииРасход / &КоличествоКомплектовИсходное), 0) КАК КоличествоУпаковок	//,
			//|	ПУС.ТипПолитики КАК ТипПолитикиУчетаСерий
			|ПОМЕСТИТЬ ТоварыНаСкладе
			|ИЗ
			|	РегистрНакопления.ТоварыНаСкладах.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК Товары
			//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК Серии
			//|		ПО Товары.Серия = Серии.Ссылка
			//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидН
			//|		ПО (Серии.ВидНоменклатуры = ВидН.Ссылка)
			//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПолитикиУчетаСерий КАК ПУС
			//|		ПО (ВидН.ПолитикаУчетаСерий = ПУС.Ссылка)
			|ГДЕ
			|	Товары.Регистратор = &Регистратор
			|
			|СГРУППИРОВАТЬ ПО
			|	Товары.Назначение,
			|	Товары.Характеристика,
			|	Товары.Серия,
			|	Товары.Помещение,
			|	Товары.Склад,
			|	Товары.Регистратор,
			|	Товары.Номенклатура	//,
			//|	ПУС.ТипПолитики
			|
			|ИМЕЮЩИЕ
			|	ЕСТЬNULL(СУММА(&КоличествоКомплектов * Товары.ВНаличииРасход / &КоличествоКомплектовИсходное), 0) > 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Товары.ДокументСборки 				КАК ДокументСборки,
			|	Товары.Номенклатура 				КАК Номенклатура,
			|	Товары.Характеристика 				КАК Характеристика,
			|	ТоварыО.АналитикаУчетаНоменклатуры 	КАК АналитикаУчетаНоменклатуры,
			|	ТоварыО.ВидЗапасов 					КАК ВидЗапасов,   							// fix Suetin 8/29/2024 2:15:12 PM
			|	ТоварыО.ВидНоменклатуры 			КАК ВидНоменклатуры,                       // fix Suetin 8/29/2024 2:16:46 PM
			|	ТоварыО.ПолитикаУчетаСерий 			КАК ПолитикаУчетаСерий,                    // fix Suetin 8/29/2024 2:23:24 PM
			|	ТоварыО.ТипПолитикиУчетаСерий 		КАК ТипПолитикиУчетаСерий,                 // fix Suetin 8/29/2024 2:22:56 PM
			|	Товары.Назначение 					КАК Назначение,
			|	Товары.Склад 						КАК Склад,
			|	Товары.Помещение 					КАК Помещение,
			|	Товары.Серия 						КАК Серия,
			|	СУММА(Товары.Количество) 			КАК Количество,
			|	СУММА(Товары.КоличествоУпаковок) 	КАК КоличествоУпаковок,
			|	МИНИМУМ(ТоварыО.Цена) 				КАК Цена,
			|	СУММА(Товары.Количество) * МИНИМУМ(ТоварыО.Цена) КАК Сумма
			|ПОМЕСТИТЬ Товары
			|ИЗ
			|	ТоварыНаСкладе КАК Товары
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыОрганизиции КАК ТоварыО
			|		ПО Товары.ДокументСборки = ТоварыО.ДокументСборки
			|			И Товары.Номенклатура = ТоварыО.Номенклатура
			|			И Товары.Характеристика = ТоварыО.Характеристика
			|			И Товары.Назначение = ТоварыО.Назначение
			|			И Товары.Склад = ТоварыО.Склад
			|			И (ВЫБОР
			|				КОГДА ТоварыО.ТипПолитикиУчетаСерий = ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.УчетСебестоимостиПоСериям)
			|					ТОГДА Товары.Серия = ТоварыО.Серия
			|				ИНАЧЕ ИСТИНА
			|			КОНЕЦ)
			|
			|СГРУППИРОВАТЬ ПО
			|	Товары.Назначение,
			|	Товары.Характеристика,
			|	Товары.Серия,
			|	Товары.Помещение,
			|	Товары.Склад,
			|	Товары.ДокументСборки,
			|	Товары.Номенклатура,
			|	ТоварыО.АналитикаУчетаНоменклатуры,
			|	ТоварыО.ВидЗапасов,   						// fix Suetin 8/29/2024 2:15:12 PM
			|	ТоварыО.ВидНоменклатуры,                    // fix Suetin 8/29/2024 2:16:46 PM
			|	ТоварыО.ПолитикаУчетаСерий,                 // fix Suetin 8/29/2024 2:23:24 PM
			|	ТоварыО.ТипПолитикиУчетаСерий               // fix Suetin 8/29/2024 2:22:56 PM
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ВКН.Владелец 						КАК Номенклатура,
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВКН.Ссылка) 	КАК КоличествоВариантовКомплектаций
			|ПОМЕСТИТЬ ВариантыКН
			|ИЗ
			|	Справочник.ВариантыКомплектацииНоменклатуры КАК ВКН
			|ГДЕ
			|	ВКН.ПометкаУдаления = ЛОЖЬ
			|	И ВКН.Владелец В
			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
			|						Т.Номенклатура
			|					ИЗ
			|						Товары КАК Т)
			|
			|СГРУППИРОВАТЬ ПО
			|	ВКН.Владелец
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Товары.ДокументСборки 				КАК ДокументСборки,
			|	Товары.Номенклатура 				КАК Номенклатура,
			|	Товары.Характеристика 				КАК Характеристика,
			|	Товары.АналитикаУчетаНоменклатуры 	КАК АналитикаУчетаНоменклатуры,
			|	Товары.ВидЗапасов 					КАК ВидЗапасов,   							// fix Suetin 8/29/2024 2:15:12 PM
			|	Товары.ВидНоменклатуры 				КАК ВидНоменклатуры,                       // fix Suetin 8/29/2024 2:16:46 PM
			|	Товары.ПолитикаУчетаСерий 			КАК ПолитикаУчетаСерий,                    // fix Suetin 8/29/2024 2:23:24 PM
			|	Товары.ТипПолитикиУчетаСерий 		КАК ТипПолитикиУчетаСерий,                 // fix Suetin 8/29/2024 2:22:56 PM
			|	Товары.Назначение 					КАК Назначение,
			|	Товары.Склад 						КАК Склад,
			|	Товары.Помещение 					КАК Помещение,
			|	Товары.Серия 						КАК Серия,
			|	СУММА(Товары.Количество) 			КАК Количество,
			|	СУММА(Товары.КоличествоУпаковок) 	КАК КоличествоУпаковок,
			|	МИНИМУМ(Товары.Цена) 				КАК Цена,
			|	СУММА(Товары.Сумма) 				КАК Сумма,
			|	СУММА(ЕСТЬNULL(ВариантыКН.КоличествоВариантовКомплектаций, 0)) КАК КоличествоВариантовКомплектацииНоменклатуры
			|ИЗ
			|	Товары КАК Товары
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВариантыКН КАК ВариантыКН
			|		ПО Товары.Номенклатура = ВариантыКН.Номенклатура
			|
			|СГРУППИРОВАТЬ ПО
			|	Товары.Назначение,
			|	Товары.Характеристика,
			|	Товары.Серия,
			|	Товары.Помещение,
			|	Товары.Склад,
			|	Товары.ДокументСборки,
			|	Товары.Номенклатура,
			|	Товары.АналитикаУчетаНоменклатуры,
			|	Товары.ВидЗапасов,   						// fix Suetin 8/29/2024 2:15:12 PM
			|	Товары.ВидНоменклатуры,                    // fix Suetin 8/29/2024 2:16:46 PM
			|	Товары.ПолитикаУчетаСерий,                 // fix Suetin 8/29/2024 2:23:24 PM
			|	Товары.ТипПолитикиУчетаСерий               // fix Suetin 8/29/2024 2:22:56 PM
			|");			
			
			ЗапросРазборКомплекта.Текст = СтрЗаменить(ЗапросРазборКомплекта.Текст,
					"&ТекстЗапросаКоэффициентУпаковки1",
					Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
					"ЦеныНоменклатурыСрезПоследних.Упаковка",
					"ЦеныНоменклатурыСрезПоследних.Номенклатура"));
					
			ЗапросРазборКомплекта.Текст = СтрЗаменить(ЗапросРазборКомплекта.Текст,
					"&ТекстЗапросаКоэффициентУпаковки2",
					Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
					"ТаблицаТоваров.ЕдиницаИзмерения",
					"ТаблицаТоваров.Номенклатура"));
			
			ДокументСборки = ТаблицаЗапросЭтоЭлемент[0].ДокументСборки;
			//Если ТипЗнч(ДокументСборки) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			//	ДокументСборкиДата = Дата(2000,1,1);
			//	ДокументСборкиКоличество = ТаблицаЗапросЭтоЭлемент[0].Количество;
			//Иначе
				ДокументСборкиДата = ДокументСборки.Дата;
				ДокументСборкиКоличество = ДокументСборки.Количество;
			//КонецЕсли;
			
			ЗапросРазборКомплекта.УстановитьПараметр("Регистратор"     				, ДокументСборки);
			ЗапросРазборКомплекта.УстановитьПараметр("ДатаНачала"					, Новый Граница(НачалоДня(ДокументСборкиДата)));
			ЗапросРазборКомплекта.УстановитьПараметр("ДатаОкончания"				, Новый Граница(КонецДня(ДокументСборкиДата)));
			ЗапросРазборКомплекта.УстановитьПараметр("КоличествоКомплектовИсходное"	, ДокументСборкиКоличество);
			ЗапросРазборКомплекта.УстановитьПараметр("КоличествоКомплектовИсходное"	, 
				?(ЗапросРазборКомплекта.Параметры.КоличествоКомплектовИсходное = 0, 1, ЗапросРазборКомплекта.Параметры.КоличествоКомплектовИсходное));
			ЗапросРазборКомплекта.УстановитьПараметр("КоличествоКомплектов"     	, СтрокаТ.Количество);
			
			ЗапросРазборКомплекта.УстановитьПараметр("ДатаОкончанияО"        , Новый Граница(ПериодОтчетаКонец, Видграницы.Включая));
			ЗапросРазборКомплекта.УстановитьПараметр("Валюта", Справочники.Валюты.НайтиПоКоду("643"));	
			ЗапросРазборКомплекта.УстановитьПараметр("БазоваяВалюта", Справочники.Валюты.НайтиПоКоду("643")); 
			ЗапросРазборКомплекта.УстановитьПараметр("ВидЦены", ВидЦены);

			ТаблицаРазборКомплекта = ЗапросРазборКомплекта.Выполнить().Выгрузить();
			
			Для Каждого СтрокаЗапроса2Р Из ТаблицаРазборКомплекта Цикл
				НоваяСтрокаТаблицыРазбор = ТаблицаПродукцииРазбор.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицыРазбор, СтрокаЗапроса2Р);
				ИндексМ = МассивУзловАИ.Найти(СтрокаТ.Номенклатура.ВидНоменклатуры);
				Если ИндексМ <> Неопределено Тогда
				    НоваяСтрокаТаблицыРазбор.ЭтоАИ = ИСТИНА;
					НоваяСтрокаТаблицыРазбор.СкладАИ = СтрокаТ.Склад;
				КонецЕсли;
				Если СтрокаТ.ЭтоАИ Тогда
				    НоваяСтрокаТаблицыРазбор.ЭтоАИ = ИСТИНА;
					НоваяСтрокаТаблицыРазбор.СкладАИ = СтрокаТ.СкладАИ;
				КонецЕсли;
			
			КонецЦикла;
			СтрокаТ.Обработано = ИСТИНА;
			ТабВыпускПродукцииОбщийИНеГП.Удалить(ТаблицаЗапросЭтоЭлемент[0]);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
// Процедуры vs_МатериальныйОтчет

Процедура vs_АнализПлановогоИФактическогоПотребленияМатериалов_МО_ПриКомпоновкеРезультата_ЗаполнитьДеревоСервер(ТабВыпускПродукции,
		ДЗ,Знач ВидЦены,Знач Валюта,Знач БазоваяВалюта,Знач ВариантКомплектации,
		Знач ВариантФормирования = "",Материалы,Знач ИспользоватьАктуальныеЦены, Знач ДатаЦены) Экспорт
    ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура1,
	|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика1,
	//|	ЦеныНоменклатурыСрезПоследних.Цена / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) * ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки2, 1) * ВЫБОР
	//|		КОГДА &Валюта <> ЦеныНоменклатурыСрезПоследних.Валюта
	//|			ТОГДА ВЫБОР
	//|					КОГДА ЕСТЬNULL(КурсыВалютыЦены.КурсЗнаменатель, 0) > 0
	//|							И ЕСТЬNULL(КурсыВалютыЦены.КурсЧислитель, 0) > 0
	//|							И ЕСТЬNULL(КурсыВалюты.КурсЗнаменатель, 0) > 0
	//|							И ЕСТЬNULL(КурсыВалюты.КурсЧислитель, 0) > 0
	//|						ТОГДА КурсыВалютыЦены.КурсЧислитель * КурсыВалюты.КурсЗнаменатель / (КурсыВалюты.КурсЧислитель * КурсыВалютыЦены.КурсЗнаменатель)
	//|					ИНАЧЕ 0
	//|				КОНЕЦ
	//|		ИНАЧЕ 1
	//|	КОНЕЦ КАК Цена
	|	ЦеныНоменклатурыСрезПоследних.Цена * ВЫБОР
	|			КОГДА ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Упаковка, ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|				ТОГДА 1
	|			КОГДА ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Упаковка.Числитель, 0) = 0
	|				ТОГДА 0                                             
	|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Упаковка.Знаменатель, 1) / ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Упаковка.Числитель, 1) КАК ЧИСЛО(17, 7))
	|		КОНЕЦ * ВЫБОР
	|		КОГДА &Валюта <> ЦеныНоменклатурыСрезПоследних.Валюта
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(КурсыВалютыЦены.КурсЗнаменатель, 0) > 0
	|							И ЕСТЬNULL(КурсыВалютыЦены.КурсЧислитель, 0) > 0
	|							И ЕСТЬNULL(КурсыВалюты.КурсЗнаменатель, 0) > 0
	|							И ЕСТЬNULL(КурсыВалюты.КурсЧислитель, 0) > 0
	|						ТОГДА КурсыВалютыЦены.КурсЧислитель * КурсыВалюты.КурсЗнаменатель / (КурсыВалюты.КурсЧислитель * КурсыВалютыЦены.КурсЗнаменатель)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ вт1
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(";
	Если ИспользоватьАктуальныеЦены Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|				,";
	Иначе
		ТекстЗапроса = ТекстЗапроса + "
		|				&ДатаЦены,";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + " ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(";
	Если ИспользоватьАктуальныеЦены Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|				,";
	Иначе
		ТекстЗапроса = ТекстЗапроса + "
		|				&ДатаЦены,";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + " БазоваяВалюта = &БазоваяВалюта) КАК КурсыВалютыЦены
	|		ПО (ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютыЦены.Валюта)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(";
	Если ИспользоватьАктуальныеЦены Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|				,";
	Иначе
		ТекстЗапроса = ТекстЗапроса + "
		|				&ДатаЦены,";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + " Валюта = &Валюта И БазоваяВалюта = &БазоваяВалюта) КАК КурсыВалюты
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура1,
	|	Характеристика1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКНТовары.Ссылка.Владелец КАК НоменклатураОсн,
	|	ВКНТовары.Ссылка.Характеристика КАК ХарактеристикаОсн,
	|	ВКНТовары.Ссылка КАК ВариантКомплектации,
	|	ВКНТовары.Номенклатура КАК Номенклатура,
	|	ВКНТовары.Характеристика КАК Характеристика,
	|	СУММА(ВКНТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ вт2
	|ИЗ
	|	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВКНТовары
	|ГДЕ
	|	(ВКНТовары.Ссылка.Основной
	|				И НЕ ВКНТовары.Ссылка.ПометкаУдаления
	|				И НЕ ВКНТовары.Количество = 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВКНТовары.Ссылка.Владелец,
	|	ВКНТовары.Ссылка.Характеристика,
	|	ВКНТовары.Ссылка,
	|	ВКНТовары.Номенклатура,
	|	ВКНТовары.Характеристика
	|; 
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"&ТекстЗапросаКоэффициентУпаковки1",
			Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"ЦеныНоменклатурыСрезПоследних.Упаковка",
			"ЦеныНоменклатурыСрезПоследних.Номенклатура"));
			
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"&ТекстЗапросаКоэффициентУпаковки2",
			Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"ЦеныНоменклатурыСрезПоследних.Упаковка",
			"ЦеныНоменклатурыСрезПоследних.Номенклатура"));
			
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;    
	Запрос.УстановитьПараметр("ВидЦены", 		ВидЦены); 
	Запрос.УстановитьПараметр("Валюта", 		Валюта);  
	Запрос.УстановитьПараметр("БазоваяВалюта",	БазоваяВалюта);
	Запрос.УстановитьПараметр("ДатаЦены",		ДатаЦены);
	Результат = Запрос.Выполнить();		
	Если Результат.Пустой() Тогда Возврат; КонецЕсли;
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	вт2.НоменклатураОсн КАК НоменклатураОсн,
	|	вт2.ХарактеристикаОсн КАК ХарактеристикаОсн,
	|	вт2.ВариантКомплектации КАК ВариантКомплектации
	|ПОМЕСТИТЬ Т1
	|ИЗ
	|	вт2 КАК вт2
	|ГДЕ
	|	вт2.НоменклатураОсн = &Номенклатура
	|	И вт2.ХарактеристикаОсн = &Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	вт2.НоменклатураОсн КАК НоменклатураОсн,
	|	вт2.ХарактеристикаОсн КАК ХарактеристикаОсн,
	|	вт2.ВариантКомплектации КАК ВариантКомплектации,
	|	вт2.Номенклатура КАК Номенклатура,
	|	вт2.Характеристика КАК Характеристика,
	//|	СУММА(вт2.Количество) КАК Количество
	|	(вт2.Количество) КАК Количество
	|ПОМЕСТИТЬ вт3
	|ИЗ(
	|ВЫБРАТЬ
	|	вт2.НоменклатураОсн КАК НоменклатураОсн,
	|	вт2.ХарактеристикаОсн КАК ХарактеристикаОсн,
	|	вт2.ВариантКомплектации КАК ВариантКомплектации,
	|	вт2.Номенклатура КАК Номенклатура,
	|	вт2.Характеристика КАК Характеристика,
	//|	СУММА(вт2.Количество) КАК Количество
	|	(вт2.Количество) КАК Количество
	|ИЗ
	|	Т1 КАК Т1
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт2 КАК вт2
	|		ПО (Т1.НоменклатураОсн = вт2.НоменклатураОсн
	|			И Т1.ХарактеристикаОсн = вт2.ХарактеристикаОсн
	|			И Т1.ВариантКомплектации = вт2.ВариантКомплектации)
	|
	//|СГРУППИРОВАТЬ ПО
	//|	вт2.НоменклатураОсн,
	//|	вт2.ХарактеристикаОсн,
	//|	вт2.ВариантКомплектации,
	//|	вт2.Номенклатура,
	//|	вт2.Характеристика
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вт2.НоменклатураОсн КАК НоменклатураОсн,
	|	вт2.ХарактеристикаОсн КАК ХарактеристикаОсн,
	|	вт2.ВариантКомплектации КАК ВариантКомплектации,
	|	вт2.Номенклатура КАК Номенклатура,
	|	вт2.Характеристика КАК Характеристика,
	//|	СУММА(вт2.Количество) КАК Количество 
	|	(вт2.Количество) КАК Количество
	|ИЗ
	|	Т1 КАК Т1
	|		ПРАВОЕ СОЕДИНЕНИЕ вт2 КАК вт2
	|		ПО НЕ (Т1.НоменклатураОсн = вт2.НоменклатураОсн
	|			И Т1.ХарактеристикаОсн = вт2.ХарактеристикаОсн
	|			И Т1.ВариантКомплектации = вт2.ВариантКомплектации)) КАК вт2
	|
	//|СГРУППИРОВАТЬ ПО
	//|	вт2.НоменклатураОсн,
	//|	вт2.ХарактеристикаОсн,
	//|	вт2.ВариантКомплектации,
	//|	вт2.Номенклатура,
	//|	вт2.Характеристика
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт3.НоменклатураОсн КАК НоменклатураОсн,
	|	вт3.ХарактеристикаОсн КАК ХарактеристикаОсн,
	|	вт3.ВариантКомплектации КАК ВариантКомплектации,
	|	вт3.Номенклатура КАК Номенклатура,
	|	вт3.Характеристика КАК Характеристика,
	|	спрНоменклатура.Наименование,
	|   спрХарактеристика.Наименование,
	|	вт3.Количество КАК Количество,
	|	ЕСТЬNULL(вт1.Цена, 0) КАК Цена
	|ИЗ
	|	вт3 КАК вт3
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт1 КАК вт1
	|		ПО вт3.Номенклатура = вт1.Номенклатура1
	|			И вт3.Характеристика = вт1.Характеристика1
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатура
	|		ПО вт3.Номенклатура = спрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК спрХарактеристика
	|		ПО вт3.Характеристика = спрХарактеристика.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	спрНоменклатура.Наименование,
	|   спрХарактеристика.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Т1
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ вт3
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	Для Каждого СтрТВП Из ТабВыпускПродукции Цикл
		Запрос.УстановитьПараметр("Номенклатура", 		СтрТВП.Номенклатура);
	    Запрос.УстановитьПараметр("Характеристика", 	СтрТВП.Характеристика);
	    Комплектации = Запрос.Выполнить().Выгрузить();

	    ДЗ.Строки.Очистить();
		Материалы.Очистить();
	    НомерСтроки = 1;
	    нСтр1 = ДЗ;
	    Если ВариантФормирования = "Иерархия" Тогда
	        нСтр1 = ДЗ.Строки.Добавить();
	        нСтр1.Номенклатура 		= СтрТВП.Номенклатура;  
			нСтр1.Характеристика 	= СтрТВП.Характеристика;
	        нСтр1.Ид_ 				= "" ;
	        нСтр1.Ид 				= НомерСтроки ;
	        нСтр1.Количество 		= 1 ;
	        стр2 					= Материалы.Добавить();
	        стр2.Номенклатура 		= нСтр1.Номенклатура; 
			стр2.Характеристика 	= нСтр1.Характеристика;
	        стр2.Количество 		= нСтр1.Количество;
	    КонецЕсли;
	    vs_АнализПлановогоИФактическогоПотребленияМатериалов_МО_ПриКомпоновкеРезультата_ДобавитьСтрокиДерева(Комплектации, ДЗ, СтрТВП.Номенклатура, СтрТВП.Характеристика, нСтр1,,,НомерСтроки,1,ВариантФормирования,Материалы);
	    Если ВариантФормирования = "Иерархия" Тогда
	        для Каждого стр1 из  нСтр1.Строки цикл
	            нСтр1.КоличествоМатериалов = нСтр1.КоличествоМатериалов + стр1.КоличествоМатериалов;
	            нСтр1.Сумма =  нСтр1.Сумма + стр1.Сумма;
	        КонецЦикла;
	     	нСтр1.Количество = 0 ;
		КонецЕсли;
		СтрТВП.ПлановаяСтоимость = Дз.Строки.Итог("Сумма",Истина);
	КонецЦикла;
      
КонецПроцедуры

Процедура vs_АнализПлановогоИФактическогоПотребленияМатериалов_МО_ПриКомпоновкеРезультата_ДобавитьСтрокиДерева(Комплектации, ДЗ, НоменклатураСборки, ХарактеристикаСборки, Родитель, Комплектация = Неопределено, ИД = "",НомерСтроки=0, КоличествоРодителя = 1,ВариантФормирования="",Материалы)
    
    
    //если это не автосборка Если НоменклатураСборки.... тогда Возврат КонецЕсли;
    Если Комплектация = Неопределено тогда
        Комплектация = Комплектации.НайтиСтроки(новый Структура("НоменклатураОсн, ХарактеристикаОсн",НоменклатураСборки, ХарактеристикаСборки));
    КонецЕсли;
    Порядок = 0;
    Для Каждого стр из Комплектация цикл
        
        мКомплектация = Комплектации.найтистроки(новый Структура("НоменклатураОсн, ХарактеристикаОсн",стр.Номенклатура,стр.Характеристика));
        Если ВариантФормирования = "Иерархия"  или  
            ВариантФормирования <> "Иерархия"  и  мКомплектация.количество() = 0 тогда
            Порядок = Порядок + 1;
            нСтр1 = Родитель.Строки.Добавить();
            Если ВариантФормирования = "Иерархия" тогда 
                Родитель.Комплектация = стр.ВариантКомплектации; 
            иначе
                нСтр1.Комплектация = стр.ВариантКомплектации; 
            КонецЕсли;
            нСтр1.Номенклатура = стр.Номенклатура; 
			нСтр1.Характеристика = стр.Характеристика;
            нСтр1.Количество = стр.Количество * КоличествоРодителя / стр.ВариантКомплектации.Количество ;
            нСтр1.Количество2 = стр.Количество  ;
            нСтр1.Цена = стр.Цена ;
            нСтр1.Ид_ = ?(ВариантФормирования = "Иерархия", ИД + ?(ИД <> "", ".","") + формат(Порядок,"ЧГ = 0"),НомерСтроки);
            нСтр1.РодительИД = ?(ВариантФормирования = "Иерархия",Родитель.ИД,0);
            НомерСтроки = НомерСтроки + 1;
            нСтр1.ИД = НомерСтроки;
            
            нСтр1.КоличествоМатериалов =  0;
            нСтр1.Сумма =  0;           
            Если мКомплектация.количество() тогда 
                //если есть комплектация, то добавим в дерево и заполним материалы для нее в рекурсии
                vs_АнализПлановогоИФактическогоПотребленияМатериалов_МО_ПриКомпоновкеРезультата_ДобавитьСтрокиДерева(Комплектации, ДЗ, стр.Номенклатура, стр.Характеристика, нСтр1, мКомплектация, нСтр1.Ид_ ,НомерСтроки,нСтр1.Количество,ВариантФормирования,Материалы);
                для Каждого стр1 из  нСтр1.Строки цикл
                    нСтр1.КоличествоМатериалов = нСтр1.КоличествоМатериалов + стр1.КоличествоМатериалов;
                    нСтр1.Сумма =  нСтр1.Сумма + стр1.Сумма; ;
                КонецЦикла;
            Иначе 
                нСтр1.КоличествоМатериалов =  нСтр1.Количество  ;
                нСтр1.Сумма =  нСтр1.Количество * нСтр1.Цена;
            КонецЕсли;
            стр2 = Материалы.Добавить();
            стр2.Номенклатура 	=  нСтр1.Номенклатура;
			стр2.Характеристика =  нСтр1.Характеристика;
            стр2.Количество 	=  нСтр1.Количество;

		Иначе
			
            vs_АнализПлановогоИФактическогоПотребленияМатериалов_МО_ПриКомпоновкеРезультата_ДобавитьСтрокиДерева(Комплектации, ДЗ, стр.Номенклатура, стр.Характеристика, Родитель, мКомплектация,"" ,НомерСтроки,стр.Количество * КоличествоРодителя / стр.ВариантКомплектации.Количество,ВариантФормирования,Материалы);
            
        КонецЕсли;
        
    КонецЦикла;
    
КонецПроцедуры

Процедура vs_АнализПлановогоИФактическогоПотребленияМатериалов_МО_ПриКомпоновкеРезультата_ЗаполнитьТекущиеЗатратыНаИзделие(ТабВыпускПродукции,
					ПараметрыОтчета, ПревышенЛимитСтрок, ИсключеннаяНоменклатура, ПользовательскиеНастройки, Знач ИспользоватьАктуальныеЦены, 
					Знач ДатаЦены, Знач ТабЗатратыНаСборку, Знач ТабВыпускПродукцииОбщийИНеГПКопия, ПотребленоУзлов = Неопределено)
					
	//ВидЦены = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(ПараметрыОтчета, "ВидЗакупочнойЦены").Значение;
	ВидЦены = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(ПараметрыОтчета, "ВидЦены").Значение;
	
	Для Каждого СтрТВП Из ТабВыпускПродукции Цикл

		СтруктураСерииНоменклатурыДерево = Новый ДеревоЗначений;
	//#Вставка
		СтруктураСерииНоменклатурыДерево.Колонки.Добавить("НоменклатураКод", Новый ОписаниеТипов("Строка"));
		СтруктураСерииНоменклатурыДерево.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число")); 
		СтруктураСерииНоменклатурыДерево.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	//#КонецВставки
		СтруктураСерииНоменклатурыДерево.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		СтруктураСерииНоменклатурыДерево.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
		СтруктураСерииНоменклатурыДерево.Колонки.Добавить("Серия", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
		СтруктураСерииНоменклатурыДерево.Колонки.Добавить("Израсходовано", Новый ОписаниеТипов("Число"));
		СтруктураСерииНоменклатурыДерево.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("Строка"));
		СтруктураСерииНоменклатурыДерево.Колонки.Добавить("НоменклатураПредставление", Новый ОписаниеТипов("Строка"));
		СтруктураСерииНоменклатурыДерево.Колонки.Добавить("СерияПредставление", Новый ОписаниеТипов("Строка"));     
		
		СтруктураСерииНоменклатурыДерево.Колонки.Добавить("НоменклатураУзел", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		СтруктураСерииНоменклатурыДерево.Колонки.Добавить("ХарактеристикаУзел", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
		
		СтруктураСерииКоллекция = СтруктураСерииНоменклатурыДерево.Строки;
		
		СписокНоменклатуры = Новый ТаблицаЗначений; // см. ПроизводствоСервер.СлужебнаяСтруктураТаблицыЗначений
		СписокНоменклатуры.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		СписокНоменклатуры.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
		СписокНоменклатуры.Колонки.Добавить("Серия", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	//#Вставка
		//СписокНоменклатуры.Колонки.Добавить("ВидЦены", Новый ОписаниеТипов("СправочникСсылка.ВидыЦен"));
	//#КонецВставки
		СписокНоменклатуры.Колонки.Добавить("Строки");
			
		НоваяСтрока = СписокНоменклатуры.Добавить();   //////////////////////////////////////////////////////////////////////
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрТВП);
		НоваяСтрока.Строки = СтруктураСерииКоллекция;
		
	
		ОтборПоХарактеристике = ЗначениеЗаполнено(СтрТВП.Характеристика);
		
		УстановитьПривилегированныйРежим(Истина);
		
		СтруктураПоиска = Новый Структура("НоменклатураСписка, ХарактеристикаСписка, СерияСписка");
		КоличествоСтрок = 0;
		ЛимитСтрок = ЛимитСтрок();
		
		Пока СписокНоменклатуры.Количество() <> 0 Цикл
			
			НовыйСписокНоменклатуры = СписокНоменклатуры.СкопироватьКолонки();
			
	//#Удаление
			//ИспользованныеСерии = ИспользованныеСерии(СписокНоменклатуры, ОтборПоХарактеристике);
	//#КонецУдаления		
	//#Вставка
			ИспользованныеСерии = vs_АнализПлановогоИФактическогоПотребленияМатериалов_МО_ПриКомпоновкеРезультата_ИспользованныеСерии(СписокНоменклатуры, ПараметрыОтчета, ОтборПоХарактеристике, ПользовательскиеНастройки, ИспользоватьАктуальныеЦены, ДатаЦены);	//, ?(ЗначениеЗаполнено(ВидЦены),ВидЦены,Неопределено));
	//#КонецВставки
			
			ИспользованныеСерии.Индексы.Добавить("НоменклатураСписка, ХарактеристикаСписка, СерияСписка");
			
			Если НЕ ОтборПоХарактеристике Тогда
				
				ОтборПоХарактеристике = Истина;
				
				СписокНоменклатуры.Очистить();
				
				Колонки = "НоменклатураСписка, ХарактеристикаСписка, СерияСписка";
				ИспользованныеСерииКопия = ИспользованныеСерии.Скопировать(, Колонки);
				ИспользованныеСерииКопия.Свернуть(Колонки);
				
				Для каждого Строка Из ИспользованныеСерииКопия Цикл
					
					НоваяСтрока = СписокНоменклатуры.Добавить();    ///////////////////////////////////////////////////////////////////////////
					НоваяСтрока.Номенклатура = Строка.НоменклатураСписка;
					НоваяСтрока.Характеристика = Строка.ХарактеристикаСписка;
					НоваяСтрока.Серия = Строка.СерияСписка;
					НоваяСтрока.Строки = СтруктураСерииКоллекция;
					
				КонецЦикла;
				
			КонецЕсли;
			
			Для каждого СтрокаНоменклатура Из СписокНоменклатуры Цикл
				
				СтруктураПоиска.НоменклатураСписка = СтрокаНоменклатура.Номенклатура;
				СтруктураПоиска.ХарактеристикаСписка = СтрокаНоменклатура.Характеристика;
				СтруктураПоиска.СерияСписка = СтрокаНоменклатура.Серия;
				
				Для каждого СтрокаСерияМатериала Из ИспользованныеСерии.НайтиСтроки(СтруктураПоиска) Цикл
					
					КоличествоСтрок = КоличествоСтрок + 1;
					Если КоличествоСтрок > ЛимитСтрок Тогда
						ПревышенЛимитСтрок = Истина;
						Прервать;
					КонецЕсли;
					
					НоваяСерия = СтрокаНоменклатура.Строки.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСерия, СтрокаСерияМатериала);
					НоваяСерия.НоменклатураПредставление = НоменклатураКлиентСервер.ПредставлениеНоменклатуры(
						СтрокаСерияМатериала.НоменклатураПредставление,
						СтрокаСерияМатериала.ХарактеристикаПредставление);
						
					Если ЗначениеЗаполнено(НоваяСерия.Серия) Тогда
						
						// Контроль зацикливания
						ЕстьЗацикливание = Ложь;
						
						Родитель = НоваяСерия.Родитель;
						Пока Родитель <> Неопределено Цикл
							Если Родитель.Номенклатура = НоваяСерия.Номенклатура
									И Родитель.Характеристика = НоваяСерия.Характеристика
									И Родитель.Серия = НоваяСерия.Серия Тогда
								ЕстьЗацикливание = Истина;
								Прервать;
							КонецЕслИ;
							Родитель = Родитель.Родитель;
						КонецЦикла;
						
						Если Не ЕстьЗацикливание Тогда
							НоваяНоменклатура = НовыйСписокНоменклатуры.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяНоменклатура, НоваяСерия);
							НоваяНоменклатура.Строки = НоваяСерия.Строки;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла; 
				Если КоличествоСтрок > ЛимитСтрок Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если КоличествоСтрок > ЛимитСтрок Тогда
				Прервать;
			КонецЕсли;
			
			СписокНоменклатуры = НовыйСписокНоменклатуры.Скопировать();
			
		КонецЦикла;
		
		ОбработатьСтрокиД(СтруктураСерииНоменклатурыДерево.Строки);
		
		ТЗ = Новый ТаблицаЗначений();
		Кол = ТЗ.Колонки;
		Кол.Добавить("НоменклатураУзел");   
		Кол.Добавить("Номенклатура");
		Кол.Добавить("Характеристика");
		Кол.Добавить("Серия");
		Кол.Добавить("ЕдиницаИзмерения");
		Кол.Добавить("Израсходовано");
		Кол.Добавить("Цена");
		Кол.Добавить("Сумма");
		
		СтруктураСерии = ЗаполнитьСтрокиРекурсивно(СтруктураСерииНоменклатурыДерево, ТЗ); 
		ТЗ = Неопределено;
		//СтруктураСерии.Свернуть("Номенклатура,Характеристика,Серия,ЕдиницаИзмерения,Цена", "Израсходовано,Сумма");

	
		СтрТВП.ФактическаяСтоимость = СтруктураСерии.Итог("Сумма");  
		СтруктураСерии.Свернуть("НоменклатураУзел");
		СтрТВП.НоменклатураУзел = СтруктураСерии.ВыгрузитьКолонку("НоменклатураУзел");
	КонецЦикла;
	
	Т = Новый ТабличныйДокумент();
	ТаблицаРезультата = Новый ТаблицаЗначений();
	
	О = Отчеты.vs_НевыполненныеОбязательстваПоЗаказуНаСборку.Создать();
	Настройки1 = О.КомпоновщикНастроек.ПолучитьНастройки();
	
	Для Каждого ЭлПД Из ПараметрыОтчета.ПараметрыДанных.Элементы Цикл
		Если Не ЭлПД.Использование Тогда Продолжить; КонецЕсли;
		КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Настройки1, ЭлПД.Параметр, ЭлПД.Значение);
	КонецЦикла;
	Для Каждого ЭлПД Из ПользовательскиеНастройки.Элементы Цикл
		Если Не ЭлПД.Использование Тогда Продолжить; КонецЕсли;
		КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Настройки1, ЭлПД.Параметр, ЭлПД.Значение);
	КонецЦикла;
	
	АктыИзготовления =  ТабВыпускПродукции.ВыгрузитьКолонку("ДокументСборки");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(АктыИзготовления, ТабЗатратыНаСборку.ВыгрузитьКолонку("ДокументСборки"), Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(АктыИзготовления, ТабВыпускПродукцииОбщийИНеГПКопия.ВыгрузитьКолонку("ДокументСборки"), Истина);
	
	НоменклатураДоизготовления = ТабВыпускПродукции.ВыгрузитьКолонку("Номенклатура");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(НоменклатураДоизготовления, ТабЗатратыНаСборку.ВыгрузитьКолонку("Номенклатура"), Истина);
	Для Каждого СтрТВП Из ТабВыпускПродукции Цикл
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(НоменклатураДоизготовления, СтрТВП.НоменклатураУзел, Истина);	
	КонецЦикла;
	
	//КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(Настройки1.Отбор, "АктИзготовления", АктыИзготовления, ВидСравненияКомпоновкиДанных.ВСписке);
	КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(Настройки1.Отбор, "ИзготовленнаяПродукция", НоменклатураДоизготовления, ВидСравненияКомпоновкиДанных.ВСписке);
	
	//ВидЗакупочнойЦены = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(ПараметрыОтчета, "ВидЗакупочнойЦены").Значение;
	//КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Настройки1, "ВидЦены",ВидЗакупочнойЦены); 
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(Настройки1, "ВидЦены", ВидЦены);
	О.КомпоновщикНастроек.ЗагрузитьНастройки(Настройки1);

	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(О.СхемаКомпоновкиДанных,
   		Настройки1, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаРезультата);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Для Каждого СтрТВП Из ТабВыпускПродукции Цикл
		СтруктураОтбора = Новый Структура("ИзготовленнаяПродукция, НоменклатураКДоизготовлению",СтрТВП.Номенклатура, Неопределено);	// Потом Добавить Характеристики
		ИскомыеСтроки = ТаблицаРезультата.НайтиСтроки(СтруктураОтбора);
		ЗаписьЖурналаРегистрации(СтрШаблон("ИзготовленнаяПродукция.%1", СтрТВП.Номенклатура), УровеньЖурналаРегистрации.Информация,, СтрТВП.Номенклатура);
		Для Каждого СтрИС Из ИскомыеСтроки Цикл
			//Если СтрИС.НоменклатураКДоизготовлению = Неопределено Тогда Прервать; КонецЕсли;
			
			ФактическаяСтоимостьДоизготовления = ?(ТипЗнч(СтрИС.СтоимостьКонечныйОстаток)=Тип("Число"),СтрИС.СтоимостьКонечныйОстаток,0);
			Если ФактическаяСтоимостьДоизготовления = 0 Тогда Продолжить; КонецЕсли;
			Если ПотребленоУзлов = Неопределено Тогда
				СтрТВП.ФактическаяСтоимостьДоизготовления = СтрТВП.ФактическаяСтоимостьДоизготовления + ФактическаяСтоимостьДоизготовления;
			Иначе
				СтрПУ = ПотребленоУзлов.Добавить();
				СтрПУ.Номенклатура 				= СтрТВП.Номенклатура;
				СтрПУ.Характеристика 			= СтрТВП.Характеристика;
				СтрПУ.Серия 					= СтрТВП.Серия;  
				СтрПУ.ДокументСборки           	= СтрТВП.ДокументСборки;
				СтрПУ.Материал 					= СтрИС.НоменклатураКДоизготовлению;
				//СтрПУ.ХарактеристикаМатериала = СтрИС.Характеристика;
				//СтрПУ.СерияМатериала			= СтрИС.Серия;
				СтрПУ.КоличествоДоизготовление	= СтрИС.ДоизготовитьКонечныйОстаток;
	            //СтрПУ.ФактическаяСтоимостьДоизготовления = ФактическаяСтоимостьДоизготовления;
				СтрПУ.ФСДоизготовления                   = ФактическаяСтоимостьДоизготовления;
				//СтрТВП.ФактическаяСтоимостьДоизготовления = СтрТВП.ФактическаяСтоимостьДоизготовления + ФактическаяСтоимостьДоизготовления;
			КонецЕсли;
			ЗаписьЖурналаРегистрации(СтрШаблон("ИзготовленнаяПродукция.%1", СтрТВП.Номенклатура), УровеньЖурналаРегистрации.Примечание,, 
				СтрТВП.Номенклатура, СтрШаблон("НоменклатураКДоизготовлению %1
											   | ФактическаяСтоимостьДоизготовления %2", 
				СтрИС.НоменклатураКДоизготовлению, СтрТВП.ФактическаяСтоимостьДоизготовления));
		КонецЦикла;	
	КонецЦикла;
	
	Для Каждого СтрТВП Из ТабВыпускПродукции Цикл
		ЗаписьЖурналаРегистрации(СтрШаблон("ИзготовленнаяПродукция.%1", СтрТВП.Номенклатура), УровеньЖурналаРегистрации.Информация,, СтрТВП.Номенклатура);	
		Для Каждого СтрТВПНУ Из СтрТВП.НоменклатураУзел Цикл	
			СтруктураОтбора = Новый Структура("Номенклатура",СтрТВПНУ.Ссылка);	// Потом Добавить Характеристики   
			ИскомыеСтроки = ТабВыпускПродукцииОбщийИНеГПКопия.НайтиСтроки(СтруктураОтбора);
			Если ИскомыеСтроки.Количество() Тогда
				СтруктураОтбора = Новый Структура("ИзготовленнаяПродукция, Регистратор",СтрТВПНУ.Ссылка, ИскомыеСтроки[0].ДокументСборки);
				//СтруктураОтбора = Новый Структура("ИзготовленнаяПродукция, НоменклатураКДоизготовлению",СтрТВПНУ.Ссылка, Неопределено);
				ИскомыеСтроки = ТаблицаРезультата.НайтиСтроки(СтруктураОтбора);
				Если ИскомыеСтроки.Количество() Тогда
					СтруктураОтбора = Новый Структура("ИзготовленнаяПродукция, ЗаказНаСборку",СтрТВПНУ.Ссылка, ИскомыеСтроки[0].ЗаказНаСборку);
					
					ИскомыеСтроки = ТаблицаРезультата.НайтиСтроки(СтруктураОтбора);
					Для Каждого СтрИС Из ИскомыеСтроки Цикл
						//Если СтрИС.НоменклатураКДоизготовлению = Неопределено Тогда Прервать; КонецЕсли;
						
						ФактическаяСтоимостьДоизготовления = ?(ТипЗнч(СтрИС.СтоимостьКонечныйОстаток)=Тип("Число"),СтрИС.СтоимостьКонечныйОстаток,0);
						Если ФактическаяСтоимостьДоизготовления = 0 Тогда Продолжить; КонецЕсли;
						Если ПотребленоУзлов = Неопределено Тогда
							СтрТВП.ФактическаяСтоимостьДоизготовления = СтрТВП.ФактическаяСтоимостьДоизготовления + ФактическаяСтоимостьДоизготовления;
						Иначе
							СтрПУ = ПотребленоУзлов.Добавить();
							СтрПУ.Номенклатура 				= СтрТВП.Номенклатура;
							СтрПУ.Характеристика 			= СтрТВП.Характеристика;
							СтрПУ.Серия 					= СтрТВП.Серия;
							СтрПУ.ДокументСборки           	= СтрТВП.ДокументСборки;
							СтрПУ.Узел 						= СтрТВПНУ.Ссылка;
							
							СтрПУ.Материал 					= СтрИС.НоменклатураКДоизготовлению;
							//СтрПУ.ХарактеристикаМатериала = СтрИС.Характеристика;
							//СтрПУ.СерияМатериала			= СтрИС.Серия;
							СтрПУ.КоличествоДоизготовление	= СтрИС.ДоизготовитьКонечныйОстаток;
				            //СтрПУ.ФактическаяСтоимостьДоизготовления = ФактическаяСтоимостьДоизготовления;
							СтрПУ.ФСДоизготовления                   = ФактическаяСтоимостьДоизготовления;
							//СтрТВП.ФактическаяСтоимостьДоизготовления = СтрТВП.ФактическаяСтоимостьДоизготовления + ФактическаяСтоимостьДоизготовления;
						КонецЕсли;
						
						ЗаписьЖурналаРегистрации(СтрШаблон("ИзготовленнаяПродукция.%1", СтрТВП.Номенклатура), УровеньЖурналаРегистрации.Примечание,, 
							СтрТВПНУ.Ссылка, 
												 СтрШаблон("НоменклатураКДоизготовлению %1
									  					   | ФактическаяСтоимостьДоизготовления %2", 
							СтрИС.НоменклатураКДоизготовлению, ?(ТипЗнч(СтрИС.СтоимостьКонечныйОстаток)=Тип("Число"),СтрИС.СтоимостьКонечныйОстаток,0)));
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;		
	КонецЦикла;
	
	Для Каждого СтрТВП Из ТабЗатратыНаСборку Цикл
		СтруктураОтбора = Новый Структура("ИзготовленнаяПродукция, НоменклатураКДоизготовлению",СтрТВП.Номенклатура, Неопределено);	// Потом Добавить Характеристики
		ИскомыеСтроки = ТаблицаРезультата.НайтиСтроки(СтруктураОтбора);
		ЗаписьЖурналаРегистрации(СтрШаблон("ИзготовленнаяПродукция.%1", СтрТВП.Номенклатура), УровеньЖурналаРегистрации.Информация,, СтрТВП.Номенклатура);	
		Для Каждого СтрИС Из ИскомыеСтроки Цикл
			//Если СтрИС.НоменклатураКДоизготовлению = Неопределено Тогда Прервать; КонецЕсли; 
						
			ФактическаяСтоимостьДоизготовления = ?(ТипЗнч(СтрИС.СтоимостьКонечныйОстаток)=Тип("Число"),СтрИС.СтоимостьКонечныйОстаток,0); 
			Если ФактическаяСтоимостьДоизготовления = 0 Тогда Продолжить; КонецЕсли;
			Если ПотребленоУзлов = Неопределено Тогда
				СтрТВП.ФактическаяСтоимостьДоизготовления = СтрТВП.ФактическаяСтоимостьДоизготовления + ФактическаяСтоимостьДоизготовления;
			Иначе
				СтрПУ = ПотребленоУзлов.Добавить();
				СтрПУ.Номенклатура 				= СтрТВП.Номенклатура;
				СтрПУ.Характеристика 			= СтрТВП.Характеристика;
				СтрПУ.Серия 					= СтрТВП.Серия;
				СтрПУ.ДокументСборки           	= СтрТВП.ДокументСборки;
				//СтрПУ.Узел 					= СтрТВПНУ.Ссылка;
				
				СтрПУ.Материал 					= СтрИС.НоменклатураКДоизготовлению;
				//СтрПУ.ХарактеристикаМатериала = СтрИС.ХарактеристикаМатериала;
				//СтрПУ.СерияМатериала			= СтрИС.СерияМатериала;
				СтрПУ.КоличествоДоизготовление	= СтрИС.ДоизготовитьКонечныйОстаток;
	            //СтрПУ.ФактическаяСтоимостьДоизготовления = ФактическаяСтоимостьДоизготовления; 
				СтрПУ.ФСДоизготовления                   = ФактическаяСтоимостьДоизготовления;
				//СтрТВП.ФактическаяСтоимостьДоизготовления = СтрТВП.ФактическаяСтоимостьДоизготовления + ФактическаяСтоимостьДоизготовления;
			КонецЕсли;
						
			ЗаписьЖурналаРегистрации(СтрШаблон("ИзготовленнаяПродукция.%1", СтрТВП.Номенклатура), УровеньЖурналаРегистрации.Примечание,, 
				СтрТВП.Номенклатура, СтрШаблон("НоменклатураКДоизготовлению %1
									  			| ФактическаяСтоимостьДоизготовления %2", 
				СтрИС.НоменклатураКДоизготовлению, ?(ТипЗнч(СтрИС.СтоимостьКонечныйОстаток)=Тип("Число"),СтрИС.СтоимостьКонечныйОстаток,0)));
		КонецЦикла;	
	КонецЦикла;
КонецПроцедуры 

Функция vs_АнализПлановогоИФактическогоПотребленияМатериалов_МО_ПриКомпоновкеРезультата_ИспользованныеСерии(СписокНоменклатуры, ПараметрыОтчета, 
		ОтборПоХарактеристике, ПользовательскиеНастройки, ИспользоватьАктуальныеЦены, ДатаЦены)	//, Знач ВидЦены)
	//ВидЦены 		= КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(ПараметрыОтчета, "ВидЗакупочнойЦены").Значение; 
	ВидЦены 		= КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(ПараметрыОтчета, "ВидЦены").Значение;
	ТекстыЗапроса = Новый Массив;
	
	#Область СписокНоменклатуры
	
	ТекстыЗапроса.Добавить(
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СписокНоменклатуры.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(СписокНоменклатуры.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	|	ВЫРАЗИТЬ(СписокНоменклатуры.Серия КАК Справочник.СерииНоменклатуры) КАК Серия
	|ПОМЕСТИТЬ СписокНоменклатуры
	|ИЗ
	|	&СписокНоменклатуры КАК СписокНоменклатуры
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Серия");
	
	#КонецОбласти
	
	//++ НЕ УТ

	//++ Локализация
	#Область ПоступлениеСерийПриПроизводстве21
	
	
	ТекстыЗапроса.Добавить(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДвижениеСерии.Номенклатура КАК Номенклатура,
	|	ДвижениеСерии.Характеристика КАК Характеристика,
	|	ДвижениеСерии.Серия КАК Серия,
	|	ВЫРАЗИТЬ(ДвижениеСерии.Документ КАК Документ.ВыпускПродукции) КАК Документ,
	|	ДвижениеСерии.КоличествоОборот КАК Количество
	|ПОМЕСТИТЬ ПоступлениеСерииПоВыпуску
	|ИЗ
	|	РегистрНакопления.ДвиженияСерийТоваров.Обороты(
	|			,
	|			,
	|			,
	|			&ОтборПоСпискуНоменклатуры
	|				И СкладскаяОперация = ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ПриемкаПродукцииИзПроизводства)
	|				И Документ ССЫЛКА Документ.ВыпускПродукции) КАК ДвижениеСерии
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Серия,
	|	Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоступлениеСерииПоВыпуску.Номенклатура КАК Номенклатура,
	|	ПоступлениеСерииПоВыпуску.Характеристика КАК Характеристика,
	|	ПоступлениеСерииПоВыпуску.Серия КАК Серия,
	|	ТаблицаТовары.Распоряжение КАК Распоряжение,
	|	ПоступлениеСерииПоВыпуску.Количество КАК Количество
	|ПОМЕСТИТЬ ПоступлениеСерииВыпускПоРаспоряжению
	|ИЗ
	|	ПоступлениеСерииПоВыпуску КАК ПоступлениеСерииПоВыпуску
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВыпускПродукции КАК ТаблицаДокумента
	|		ПО (ТаблицаДокумента.Ссылка = ПоступлениеСерииПоВыпуску.Документ)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВыпускПродукции.Товары КАК ТаблицаТовары
	|		ПО (ТаблицаТовары.Ссылка = ПоступлениеСерииПоВыпуску.Документ)
	|			И (ТаблицаТовары.Номенклатура = ПоступлениеСерииПоВыпуску.Номенклатура)
	|ГДЕ
	|	ТаблицаДокумента.ВыпускПоРаспоряжениям
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Распоряжение");
	
	#КонецОбласти
	//-- Локализация

	//-- НЕ УТ
	
	//++ НЕ УТ

	//++ Локализация
	#Область ДокументыПоступленияСерийПриПроизводстве21
	
	
	ТекстыЗапроса.Добавить(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.Характеристика КАК Характеристика,
	|	ВложенныйЗапрос.Серия КАК Серия,
	|	ВложенныйЗапрос.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ РаспределениеЗатратНаВыпускБезРаспоряжений
	|ИЗ
	|	(ВЫБРАТЬ
	|		РаспределениеЗатрат.Номенклатура КАК Номенклатура,
	|		РаспределениеЗатрат.Характеристика КАК Характеристика,
	|		РаспределениеЗатрат.Серия КАК Серия,
	|		РаспределениеЗатрат.Ссылка КАК Ссылка
	|	ИЗ
	|		Документ.РаспределениеПроизводственныхЗатрат.ВыпускиБезРаспоряжения КАК РаспределениеЗатрат
	|	ГДЕ
	|		&ОтборПоНоменклатуреРаспределениеЗатрат
	|		И РаспределениеЗатрат.Ссылка.Проведен
	|	
	//++ Устарело_Производство21
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПоступлениеСерииПоВыпуску.Номенклатура,
	|		ПоступлениеСерииПоВыпуску.Характеристика,
	|		ПоступлениеСерииПоВыпуску.Серия,
	|		ТаблицаВыходныеИзделия.Ссылка
	|	ИЗ
	|		ПоступлениеСерииПоВыпуску КАК ПоступлениеСерииПоВыпуску
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СписаниеЗатратНаВыпуск.ВыходныеИзделия КАК ТаблицаВыходныеИзделия
	|		ПО ТаблицаВыходныеИзделия.Распоряжение = ПоступлениеСерииПоВыпуску.Документ
	|			И ТаблицаВыходныеИзделия.Номенклатура = ПоступлениеСерииПоВыпуску.Номенклатура
	|			И ТаблицаВыходныеИзделия.Характеристика = ПоступлениеСерииПоВыпуску.Характеристика
	|			И ТаблицаВыходныеИзделия.Ссылка.Проведен) КАК ВложенныйЗапрос
	//-- Устарело_Производство21
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка");
	
	#КонецОбласти
	//-- Локализация

	#Область ПоступлениеСерийПриПроизводстве22
	
	ТекстыЗапроса.Добавить(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДвижениеСерии.Номенклатура КАК Номенклатура,
	|	ДвижениеСерии.Характеристика КАК Характеристика,
	|	ДвижениеСерии.Серия КАК Серия,
	|	ДвижениеСерии.Документ КАК Документ
	|ПОМЕСТИТЬ ПоступлениеСерийПриПроизводствеБезЗаказа
	|ИЗ
	|	РегистрНакопления.ДвиженияСерийТоваров.Обороты(
	|			,
	|			,
	|			,
	|			&ОтборПоСпискуНоменклатуры
	|				И СкладскаяОперация = ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ПроизводствоПродукции)
	|				И Документ ССЫЛКА Документ.ПроизводствоБезЗаказа) КАК ДвижениеСерии
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Документ");
	
	
	#КонецОбласти
	
	#Область ПоступлениеСерийПриПроизводствеНаСтороне
	
	ТекстыЗапроса.Добавить(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДвижениеСерии.Номенклатура КАК Номенклатура,
	|	ДвижениеСерии.Характеристика КАК Характеристика,
	|	ДвижениеСерии.Серия КАК Серия,
	|	ДвижениеСерии.Документ КАК Документ
	|ПОМЕСТИТЬ ПоступлениеСерийПриПроизводствеНаСтороне
	|ИЗ
	|	РегистрНакопления.ДвиженияСерийТоваров.Обороты(
	|			,
	|			,
	|			,
	|			&ОтборПоСпискуНоменклатуры
	|				И СкладскаяОперация = ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ПроизводствоПродукции)
	|				И ТИПЗНАЧЕНИЯ(Документ) = ТИП(Документ.ОтчетПереработчика2_5)) КАК ДвижениеСерии
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Документ");
	
	#КонецОбласти
	
	//-- НЕ УТ
	
	
	#Область ПоступлениеСерийПриСборке
	
	ТекстыЗапроса.Добавить(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДвижениеСерии.Номенклатура КАК Номенклатура,
	|	ДвижениеСерии.Характеристика КАК Характеристика,
	|	ДвижениеСерии.Серия КАК Серия,
	|	ВЫРАЗИТЬ(ДвижениеСерии.Документ КАК Документ.СборкаТоваров) КАК Документ,
//#Вставка
	|	ВЫРАЗИТЬ(СбТ.ЗаказНаСборку КАК Документ.ЗаказНаСборку) КАК ЗаказНаСборку,
//#КонецВставки
	|	ДвижениеСерии.КоличествоОборот КАК Количество
	|ПОМЕСТИТЬ ПоступлениеСерииПоСборке
	|ИЗ
	|	РегистрНакопления.ДвиженияСерийТоваров.Обороты(
	|			,
	|			,
	|			,
	|			&ОтборПоСпискуНоменклатуры
	|				И СкладскаяОперация В (ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ПриемкаСобранныхКомплектов),
	|										ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ПриемкаКомплектующихПослеРазборки))) КАК ДвижениеСерии
//#Вставка
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.СборкаТоваров КАК СбТ
	|		ПО ВЫРАЗИТЬ(ДвижениеСерии.Документ КАК Документ.СборкаТоваров) = СбТ.Ссылка
//#КонецВставки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	Серия,
	|	Документ");
	
	#КонецОбласти
	
	#Область РасходСерий
	
	ТекстыЗапроса.Добавить(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.НоменклатураСписка КАК НоменклатураСписка,
	|	ВложенныйЗапрос.ХарактеристикаСписка КАК ХарактеристикаСписка, 
	|	ВложенныйЗапрос.СерияСписка КАК СерияСписка,
//#Вставка
	|	ВложенныйЗапрос.Номенклатура.Код КАК НоменклатураКод,
	|" + ?(ЗначениеЗаполнено(ВидЦены), "
	//|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена1,
	|	ЦеныНоменклатурыСрезПоследних.Цена / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) * ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки2, 1) * ВЫБОР
	|		КОГДА &Валюта <> ЦеныНоменклатурыСрезПоследних.Валюта
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(КурсыВалютыЦены.КурсЗнаменатель, 0) > 0
	|							И ЕСТЬNULL(КурсыВалютыЦены.КурсЧислитель, 0) > 0
	|							И ЕСТЬNULL(КурсыВалюты.КурсЗнаменатель, 0) > 0
	|							И ЕСТЬNULL(КурсыВалюты.КурсЧислитель, 0) > 0
	|						ТОГДА КурсыВалютыЦены.КурсЧислитель * КурсыВалюты.КурсЗнаменатель / (КурсыВалюты.КурсЧислитель * КурсыВалютыЦены.КурсЗнаменатель)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Цена,
	|	СУММА(ЦеныНоменклатурыСрезПоследних.Цена / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) * ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки2, 1) * ВЫБОР
	|		КОГДА &Валюта <> ЦеныНоменклатурыСрезПоследних.Валюта
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(КурсыВалютыЦены.КурсЗнаменатель, 0) > 0
	|							И ЕСТЬNULL(КурсыВалютыЦены.КурсЧислитель, 0) > 0
	|							И ЕСТЬNULL(КурсыВалюты.КурсЗнаменатель, 0) > 0
	|							И ЕСТЬNULL(КурсыВалюты.КурсЧислитель, 0) > 0
	|						ТОГДА КурсыВалютыЦены.КурсЧислитель * КурсыВалюты.КурсЗнаменатель / (КурсыВалюты.КурсЧислитель * КурсыВалютыЦены.КурсЗнаменатель)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 1
	|	КОНЕЦ * ВложенныйЗапрос.Израсходовано) КАК Сумма,","") + "
//#КонецВставки
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.Номенклатура.Представление КАК НоменклатураПредставление,
	|	ВложенныйЗапрос.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВложенныйЗапрос.Характеристика КАК Характеристика,
	|	ВложенныйЗапрос.Характеристика.Представление КАК ХарактеристикаПредставление,
	|	ВложенныйЗапрос.Серия КАК Серия,
	|	ВложенныйЗапрос.Серия.Представление КАК СерияПредставление,
	|	СУММА(ВложенныйЗапрос.Израсходовано) КАК Израсходовано
//#Вставка
	|ПОМЕСТИТЬ КонечнаяТаблица
//#КонецВставки
	|ИЗ
	|(
//#Удаление
//	|	ВЫБРАТЬ
//	|		ПоступлениеСерииПоСборке.Номенклатура КАК НоменклатураСписка,
//	|		ПоступлениеСерииПоСборке.Характеристика КАК ХарактеристикаСписка,
//	|		ПоступлениеСерииПоСборке.Серия КАК СерияСписка,
//	|		ИспользованныеСерии.Номенклатура КАК Номенклатура,
//	|		ИспользованныеСерии.Характеристика КАК Характеристика,
//	|		ИспользованныеСерии.Серия КАК Серия,
//	|		ИспользованныеСерии.КоличествоОборот КАК Израсходовано
//	|	ИЗ
//	|			РегистрНакопления.ДвиженияСерийТоваров.Обороты(
//	|				,
//	|				,
//	|				,
//	|				Документ В
//	|						(ВЫБРАТЬ
//	|							ПоступлениеСерииПоСборке.Документ
//	|						ИЗ
//	|							ПоступлениеСерииПоСборке)
//	|					И СкладскаяОперация В (ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ОтгрузкаКомплектующихДляСборки),
//	|											ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ОтгрузкаКомплектовДляРазборки))) КАК ИспользованныеСерии
//	|			ЛЕВОЕ СОЕДИНЕНИЕ ПоступлениеСерииПоСборке КАК ПоступлениеСерииПоСборке
//	|			ПО (ПоступлениеСерииПоСборке.Документ = ИспользованныеСерии.Документ)
//	//++ НЕ УТ
//#КонецУдаления
//#Вставка
	|	ВЫБРАТЬ
	|		ПоступлениеСерииПоСборке.Номенклатура КАК НоменклатураСписка,
	|		ПоступлениеСерииПоСборке.Характеристика КАК ХарактеристикаСписка,
	|		ПоступлениеСерииПоСборке.Серия КАК СерияСписка,
	|		ИспользованныеСерии.Номенклатура КАК Номенклатура,
	|		ИспользованныеСерии.Характеристика КАК Характеристика,
	|		ИспользованныеСерии.Серия КАК Серия,
	|		ИспользованныеСерии.ВНаличии КАК Израсходовано
	|	ИЗ
	|			РегистрНакопления.ТоварыНаСкладах КАК ИспользованныеСерии
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПоступлениеСерииПоСборке КАК ПоступлениеСерииПоСборке
	|			ПО (ПоступлениеСерииПоСборке.Документ = ИспользованныеСерии.Регистратор)
	|	ГДЕ
	|		ИспользованныеСерии.Активность = ИСТИНА
	|		И ИспользованныеСерии.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И ИспользованныеСерии.Регистратор В
	|						(ВЫБРАТЬ
	|							ПоступлениеСерииПоСборке.Документ
	|						ИЗ
	|							ПоступлениеСерииПоСборке)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	//|	ВЫБРАТЬ
	//|		ПоступлениеСерииПоСборке.Номенклатура КАК НоменклатураСписка,
	//|		ПоступлениеСерииПоСборке.Характеристика КАК ХарактеристикаСписка,
	//|		ПоступлениеСерииПоСборке.Серия КАК СерияСписка,
	////|		ИспользованныеСерии.Номенклатура КАК Номенклатура,
	//|		ЕСТЬNULL(ТС.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	//|		ЕСТЬNULL(ТС.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	//|		ЕСТЬNULL(ТС.Серия, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК Серия,
	//|		ВЫБОР 
	//|			КОГДА ЕСТЬNULL(ТС.ВНаличии, 0) = 0 ТОГДА 
	//|           	ИспользованныеСерии.ДоизготовитьРасход
	//|           ИНАЧЕ
	//|				ТС.ВНаличии
	//| 		КОНЕЦ КАК Израсходовано
	//|	ИЗ
	//|			РегистрНакопления.ИТБК_Доизготовление.Обороты(
	//|				,
	//|				,
	//|				Регистратор,
	//|				АктИзготовления В
	//|						(ВЫБРАТЬ
	//|							ПоступлениеСерииПоСборке.ЗаказНаСборку
	//|						ИЗ
	//|							ПоступлениеСерииПоСборке)) КАК ИспользованныеСерии
	//|			ЛЕВОЕ СОЕДИНЕНИЕ ПоступлениеСерииПоСборке КАК ПоступлениеСерииПоСборке
	//|			ПО (ПоступлениеСерииПоСборке.ЗаказНаСборку = ИспользованныеСерии.АктИзготовления)
	//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах КАК ТС
	//|			ПО (ТС.Регистратор = ИспользованныеСерии.Регистратор)
	//|				И (ТС.Номенклатура = ИспользованныеСерии.Номенклатура)
	
	//|	ВЫБРАТЬ
	//|		ПоступлениеСерииПоСборке.Номенклатура КАК НоменклатураСписка,
	//|		ПоступлениеСерииПоСборке.Характеристика КАК ХарактеристикаСписка,
	//|		ПоступлениеСерииПоСборке.Серия КАК СерияСписка,
	////|		ИспользованныеСерии.Номенклатура КАК Номенклатура,
	//|		ЕСТЬNULL(ТС.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	//|		ЕСТЬNULL(ТС.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	//|		ЕСТЬNULL(ТС.Серия, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК Серия,
	//|		ВЫБОР 
	//|			КОГДА ЕСТЬNULL(ТС.ВНаличии, 0) = 0 ТОГДА 
	//|           	ИспользованныеСерии.ДоизготовитьРасход
	//|           ИНАЧЕ
	//|				ТС.ВНаличии
	//| 		КОНЕЦ КАК Израсходовано
	//|	ИЗ
	//|			РегистрНакопления.ДвиженияНоменклатураДоходыРасходы.Обороты(
	//|				,
	//|				,
	//|				Регистратор,
	//|				) КАК ИспользованныеСерии
	//|			ЛЕВОЕ СОЕДИНЕНИЕ ПоступлениеСерииПоСборке КАК ПоступлениеСерииПоСборке
	//|			ПО (ПоступлениеСерииПоСборке.ЗаказНаСборку = ИспользованныеСерии.Регистратор)
	//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах КАК ТС
	//|			ПО (ТС.Регистратор = ИспользованныеСерии.Регистратор)
	//|				И (ТС.Номенклатура = ИспользованныеСерии.Номенклатура)
	//|	ГДЕ ИспользованныеСерии.Регистратор В
	//|						(ВЫБРАТЬ
	//|							ПоступлениеСерииПоСборке.ЗаказНаСборку
	//|						ИЗ
	//|							ПоступлениеСерииПоСборке)  
	|		
	|		ВЫБРАТЬ
	|		ВЗ.НоменклатураСписка КАК НоменклатураСписка,
	|		ВЗ.ХарактеристикаСписка КАК ХарактеристикаСписка,
	|		ВЗ.СерияСписка КАК СерияСписка,
	|		ЕСТЬNULL(ТС.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	|		ЕСТЬNULL(ТС.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	|		ЕСТЬNULL(ТС.Серия, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК Серия,
	|		СУММА(ВЫБОР
	|				КОГДА ЕСТЬNULL(ТС.ВНаличии, 0) = 0
	|					ТОГДА ВЗ.КоличествоОборот
	|				ИНАЧЕ ТС.ВНаличии
	|			КОНЕЦ) КАК Израсходовано
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ПоступлениеСерииПоСборке.Номенклатура КАК НоменклатураСписка,
	|			ПоступлениеСерииПоСборке.Характеристика КАК ХарактеристикаСписка,
	|			ПоступлениеСерииПоСборке.Серия КАК СерияСписка,
	|			ВП.Ссылка КАК Регистратор,
	|			АУН.Номенклатура КАК Номенклатура,
	|			АУН.Характеристика КАК Характеристика,
	|			ИспользованныеСерии.КоличествоОборот КАК КоличествоОборот
	|		ИЗ
	|			ПоступлениеСерииПоСборке КАК ПоступлениеСерииПоСборке
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВнутреннееПотребление КАК ВП
	|				ПО ПоступлениеСерииПоСборке.ЗаказНаСборку = ВП.ИТБК_АктИзготовления
	|					И (ВП.ИТБК_ЭтоДоизготовление)
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВнутреннееПотребление.ВидыЗапасов КАК ВПВЗ
	|				ПО (ВП.Ссылка = ВПВЗ.Ссылка)
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ДвиженияНоменклатураДоходыРасходы.Обороты(, , Регистратор, ) КАК ИспользованныеСерии
	|				ПО (ВПВЗ.АналитикаУчетаНоменклатуры = ИспользованныеСерии.АналитикаУчетаНоменклатуры)
	|				И (ВПВЗ.Ссылка = ИспользованныеСерии.Регистратор)
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АУН
	|				ПО (ИспользованныеСерии.АналитикаУчетаНоменклатуры = АУН.Ссылка)
	|		ГДЕ
	|			ВП.ИТБК_АктИзготовления В
	|					(ВЫБРАТЬ
	|						ПоступлениеСерииПоСборке.ЗаказНаСборку
	|					ИЗ
	|						ПоступлениеСерииПоСборке)) КАК ВЗ
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах КАК ТС
	|			ПО (ВЗ.Регистратор = ТС.Регистратор)
	|				И (ВЗ.Номенклатура = ТС.Номенклатура)
	|				И (ВЗ.Характеристика = ТС.Характеристика)
    |
	|	СГРУППИРОВАТЬ ПО
	|		ВЗ.НоменклатураСписка,
	|		ВЗ.ХарактеристикаСписка,
	|		ВЗ.СерияСписка,
	|		ЕСТЬNULL(ТС.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)),
	|		ЕСТЬNULL(ТС.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)),
	|		ЕСТЬNULL(ТС.Серия, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка))
	
//#КонецВставки

	//++ Локализация
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		РаспределениеЗатратНаВыпускБезРаспоряжений.Номенклатура,
	|		РаспределениеЗатратНаВыпускБезРаспоряжений.Характеристика,
	|		РаспределениеЗатратНаВыпускБезРаспоряжений.Серия,
	|		ИспользованныеСерии.Номенклатура,
	|		ИспользованныеСерии.Характеристика,
	|		ИспользованныеСерии.Серия,
	|		ИспользованныеСерии.КоличествоОборот
	|	ИЗ
	|		РегистрНакопления.ДвиженияСерийТоваров.Обороты(
	|				,
	|				,
	|				,
	|				Документ В
	|						(ВЫБРАТЬ
	|							РаспределениеЗатратНаВыпускБезРаспоряжений.Ссылка
	|						ИЗ
	|							РаспределениеЗатратНаВыпускБезРаспоряжений)
	|					И СкладскаяОперация = ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.СписаниеМатериаловНаЗатраты)) КАК ИспользованныеСерии
	|			ЛЕВОЕ СОЕДИНЕНИЕ РаспределениеЗатратНаВыпускБезРаспоряжений КАК РаспределениеЗатратНаВыпускБезРаспоряжений
	|			ПО (РаспределениеЗатратНаВыпускБезРаспоряжений.Ссылка = ИспользованныеСерии.Документ)
	//-- Локализация
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	// Производство без заказа
	|	ВЫБРАТЬ
	|		ПоступлениеСерий.Номенклатура КАК НоменклатураСписка,
	|		ПоступлениеСерий.Характеристика КАК ХарактеристикаСписка,
	|		ПоступлениеСерий.Серия КАК СерияСписка,
	|		ИспользованныеСерии.Номенклатура КАК Номенклатура,
	|		ИспользованныеСерии.Характеристика КАК Характеристика,
	|		ИспользованныеСерии.Серия КАК Серия,
	|		ИспользованныеСерии.КоличествоОборот КАК Израсходовано
	|	ИЗ
	|		РегистрНакопления.ДвиженияСерийТоваров.Обороты(
	|				,
	|				,
	|				,
	|				Документ В
	|						(ВЫБРАТЬ
	|							ПоступлениеСерий.Документ
	|						ИЗ
	|							ПоступлениеСерийПриПроизводствеБезЗаказа КАК ПоступлениеСерий)
	|					И СкладскаяОперация = ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ПотреблениеМатериаловПриПроизводстве)) КАК ИспользованныеСерии
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПоступлениеСерийПриПроизводствеБезЗаказа КАК ПоступлениеСерий
	|			ПО (ПоступлениеСерий.Документ = ИспользованныеСерии.Документ)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	// Распределение материалов на производство без заказа
	|	ВЫБРАТЬ
	|		ПоступлениеСерий.Номенклатура КАК НоменклатураСписка,
	|		ПоступлениеСерий.Характеристика КАК ХарактеристикаСписка,
	|		ПоступлениеСерий.Серия КАК СерияСписка,
	|		ИспользованныеСерии.Номенклатура КАК Номенклатура,
	|		ИспользованныеСерии.Характеристика КАК Характеристика,
	|		ИспользованныеСерии.Серия КАК Серия,
	|		ИспользованныеСерии.КоличествоОборот КАК Израсходовано
	|	ИЗ
	|		РегистрНакопления.ДвиженияСерийТоваров.Обороты(
	|				,
	|				,
	|				,
	|				Документ В
	|					(ВЫБРАТЬ
	|						РаспределениеЗатрат.Ссылка КАК Ссылка
	|					ИЗ
	|						ПоступлениеСерийПриПроизводствеБезЗаказа КАК ПоступлениеСерий
	|							ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеПроизводственныхЗатрат.ПартииПроизводства КАК РаспределениеЗатрат
	|							ПО
	|								ПоступлениеСерий.Документ = РаспределениеЗатрат.ПартияПроизводства.Документ)) КАК ИспользованныеСерии
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеПроизводственныхЗатрат.ПартииПроизводства КАК РаспределениеЗатрат
	|			ПО ИспользованныеСерии.Документ = РаспределениеЗатрат.Ссылка
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПоступлениеСерийПриПроизводствеБезЗаказа КАК ПоступлениеСерий
	|			ПО (РаспределениеЗатрат.ПартияПроизводства.Документ = ПоступлениеСерий.Документ)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	// Производство на стороне
	|	ВЫБРАТЬ
	|		ПоступлениеСерий.Номенклатура КАК НоменклатураСписка,
	|		ПоступлениеСерий.Характеристика КАК ХарактеристикаСписка,
	|		ПоступлениеСерий.Серия КАК СерияСписка,
	|		ИспользованныеСерии.Номенклатура КАК Номенклатура,
	|		ИспользованныеСерии.Характеристика КАК Характеристика,
	|		ИспользованныеСерии.Серия КАК Серия,
	|		ИспользованныеСерии.КоличествоОборот КАК Израсходовано
	|	ИЗ
	|		РегистрНакопления.ДвиженияСерийТоваров.Обороты(
	|				,
	|				,
	|				,
	|				Документ В
	|						(ВЫБРАТЬ
	|							ПоступлениеСерий.Документ
	|						ИЗ
	|							ПоступлениеСерийПриПроизводствеНаСтороне КАК ПоступлениеСерий)
	|					И СкладскаяОперация = ЗНАЧЕНИЕ(Перечисление.СкладскиеОперации.ДвижениеВФинансовомУчете)
	|			) КАК ИспользованныеСерии
	|			
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПоступлениеСерийПриПроизводствеНаСтороне КАК ПоступлениеСерий
	|			ПО (ПоступлениеСерий.Документ = ИспользованныеСерии.Документ)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	// Распределение материалов на производство на стороне
	|	ВЫБРАТЬ
	|		ПоступлениеСерий.Номенклатура КАК НоменклатураСписка,
	|		ПоступлениеСерий.Характеристика КАК ХарактеристикаСписка,
	|		ПоступлениеСерий.Серия КАК СерияСписка,
	|		ИспользованныеСерии.Номенклатура КАК Номенклатура,
	|		ИспользованныеСерии.Характеристика КАК Характеристика,
	|		ИспользованныеСерии.Серия КАК Серия,
	|		ИспользованныеСерии.КоличествоОборот КАК Израсходовано
	|	ИЗ
	|		РегистрНакопления.ДвиженияСерийТоваров.Обороты(
	|				,
	|				,
	|				,
	|				Документ В
	|					(ВЫБРАТЬ
	|						РаспределениеЗатрат.Ссылка КАК Ссылка
	|					ИЗ
	|						ПоступлениеСерийПриПроизводствеНаСтороне КАК ПоступлениеСерий
	|						
	|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РаспределениеПроизводственныхЗатрат.ПартииПроизводства КАК РаспределениеЗатрат
	|						ПО ПоступлениеСерий.Документ = РаспределениеЗатрат.ПартияПроизводства.Документ)
	|			) КАК ИспользованныеСерии
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РаспределениеПроизводственныхЗатрат.ПартииПроизводства КАК РаспределениеЗатрат
	|			ПО ИспользованныеСерии.Документ = РаспределениеЗатрат.Ссылка
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПоступлениеСерийПриПроизводствеНаСтороне КАК ПоступлениеСерий
	|			ПО (РаспределениеЗатрат.ПартияПроизводства.Документ = ПоступлениеСерий.Документ)
	//-- НЕ УТ
	|) КАК ВложенныйЗапрос
//#Вставка
	|" + ?(ЗначениеЗаполнено(ВидЦены), "
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(" + ?(ЗначениеЗаполнено(ИспользоватьАктуальныеЦены) и ИспользоватьАктуальныеЦены,",","&ДатаЦены,") + " ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
	|			ПО (ВложенныйЗапрос.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура)
	|			И (ВложенныйЗапрос.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(" + ?(ЗначениеЗаполнено(ИспользоватьАктуальныеЦены) и ИспользоватьАктуальныеЦены,",","&ДатаЦены,") + " БазоваяВалюта = &БазоваяВалюта) КАК КурсыВалютыЦены
	|			ПО (ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютыЦены.Валюта)
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(" + ?(ЗначениеЗаполнено(ИспользоватьАктуальныеЦены) и ИспользоватьАктуальныеЦены,",","&ДатаЦены,") + " Валюта = &Валюта И БазоваяВалюта = &БазоваяВалюта) КАК КурсыВалюты
	|			ПО (ИСТИНА)","") + "
	|
//#КонецВставки
	|ГДЕ
	|	НЕ(ВложенныйЗапрос.НоменклатураСписка = ВложенныйЗапрос.Номенклатура
	|		И ВложенныйЗапрос.ХарактеристикаСписка = ВложенныйЗапрос.Характеристика
	|		И ВложенныйЗапрос.СерияСписка = ВложенныйЗапрос.Серия)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.НоменклатураСписка,
	|	ВложенныйЗапрос.ХарактеристикаСписка,
	|	ВложенныйЗапрос.СерияСписка,
//#Вставка
	|	ВложенныйЗапрос.Номенклатура.Код,
	|" + ?(ЗначениеЗаполнено(ВидЦены), "
	//|	ЦеныНоменклатурыСрезПоследних.Цена,
	|	ЦеныНоменклатурыСрезПоследних.Цена / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) * ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки2, 1) * ВЫБОР
	|		КОГДА &Валюта <> ЦеныНоменклатурыСрезПоследних.Валюта
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(КурсыВалютыЦены.КурсЗнаменатель, 0) > 0
	|							И ЕСТЬNULL(КурсыВалютыЦены.КурсЧислитель, 0) > 0
	|							И ЕСТЬNULL(КурсыВалюты.КурсЗнаменатель, 0) > 0
	|							И ЕСТЬNULL(КурсыВалюты.КурсЧислитель, 0) > 0
	|						ТОГДА КурсыВалютыЦены.КурсЧислитель * КурсыВалюты.КурсЗнаменатель / (КурсыВалюты.КурсЧислитель * КурсыВалютыЦены.КурсЗнаменатель)
	|					ИНАЧЕ 0
	|				КОНЕЦ
	|		ИНАЧЕ 1
	|	КОНЕЦ,","") + "
//#КонецВставки
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.Характеристика,
	|	ВложенныйЗапрос.Серия
	|;
		
	|/////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВК.Владелец КАК Номенклатура,
	|	ВК.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ТаблицаИсключений 
	|ИЗ
	|	Справочник.ВариантыКомплектацииНоменклатуры КАК ВК
	|ГДЕ 
	|	(ВК.Владелец, ВК.Характеристика) В(ВЫБРАТЬ РАЗЛИЧНЫЕ КТ.Номенклатура, КТ.Характеристика ИЗ КонечнаяТаблица КАК КТ)
	|    И НЕ ВК.ПометкаУдаления
    |;
	|/////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.НоменклатураСписка КАК НоменклатураСписка,
	|	ВложенныйЗапрос.ХарактеристикаСписка КАК ХарактеристикаСписка, 
	|	ВложенныйЗапрос.СерияСписка КАК СерияСписка,
	|	ВложенныйЗапрос.НоменклатураКод КАК НоменклатураКод,
	|	ВложенныйЗапрос.Цена КАК Цена,
	|	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма,
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.НоменклатураПредставление КАК НоменклатураПредставление,
	|	ВложенныйЗапрос.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВложенныйЗапрос.Характеристика КАК Характеристика,
	|	ВложенныйЗапрос.ХарактеристикаПредставление КАК ХарактеристикаПредставление,
	|	ВложенныйЗапрос.Серия КАК Серия,
	|	ВложенныйЗапрос.СерияПредставление КАК СерияПредставление,
	|	СУММА(ВложенныйЗапрос.Израсходовано) КАК Израсходовано,
	|   ТИ.Номенклатура КАК НоменклатураУзел, 
	|   ТИ.Характеристика КАК ХарактеристикаУзел
	|ИЗ
	|	КонечнаяТаблица КАК ВложенныйЗапрос
	|	ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаИсключений КАК ТИ
	|	ПО ВложенныйЗапрос.Номенклатура = ТИ.Номенклатура 
	|		И ВложенныйЗапрос.Характеристика = ТИ.Характеристика
	//|ГДЕ
	//|    ТИ.Номенклатура ЕСТЬ NULL 
	//|    И ТИ.Характеристика ЕСТЬ NULL
    |
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.НоменклатураСписка,
	|	ВложенныйЗапрос.ХарактеристикаСписка,
	|	ВложенныйЗапрос.СерияСписка,
	|	ВложенныйЗапрос.НоменклатураКод,
	|	ВложенныйЗапрос.Цена,
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.НоменклатураПредставление,
	|	ВложенныйЗапрос.ЕдиницаИзмерения,
	|	ВложенныйЗапрос.Характеристика,
	|	ВложенныйЗапрос.ХарактеристикаПредставление,
	|	ВложенныйЗапрос.Серия,
	|	ВложенныйЗапрос.СерияПредставление,
	|   ТИ.Номенклатура, 
	|   ТИ.Характеристика	
    |
	
	|УПОРЯДОЧИТЬ ПО
	|	НоменклатураПредставление,
	|	ХарактеристикаПредставление,
	|	СерияПредставление");
	
	#КонецОбласти
	
	Разделитель = 
	"
	|;
	|/////////////////////////////////////////////////////////////
	|";
	ТекстЗапроса = СтрСоединить(ТекстыЗапроса, Разделитель);
	
	Если ОтборПоХарактеристике Тогда
		
		ОтборПоСпискуНенклатуры = 
		"(Номенклатура, Характеристика, Серия) В
		|					(ВЫБРАТЬ
		|						СписокНоменклатуры.Номенклатура,
		|						СписокНоменклатуры.Характеристика,
		|						СписокНоменклатуры.Серия
		|					ИЗ
		|						СписокНоменклатуры)";
		
		ОтборПоНоменклатуреРаспределениеЗатрат = 
		"(РаспределениеЗатрат.Номенклатура, РаспределениеЗатрат.Характеристика, РаспределениеЗатрат.Серия) В
		|					(ВЫБРАТЬ
		|						СписокНоменклатуры.Номенклатура,
		|						СписокНоменклатуры.Характеристика,
		|						СписокНоменклатуры.Серия
		|					ИЗ
		|						СписокНоменклатуры КАК СписокНоменклатуры)";
		
	Иначе
		
		ОтборПоСпискуНенклатуры = 
		"(Номенклатура, Серия) В
		|					(ВЫБРАТЬ
		|						СписокНоменклатуры.Номенклатура,
		|						СписокНоменклатуры.Серия
		|					ИЗ
		|						СписокНоменклатуры)";
		
		ОтборПоНоменклатуреРаспределениеЗатрат = 
		"(РаспределениеЗатрат.Номенклатура, РаспределениеЗатрат.Серия) В
		|					(ВЫБРАТЬ
		|						СписокНоменклатуры.Номенклатура,
		|						СписокНоменклатуры.Серия
		|					ИЗ
		|						СписокНоменклатуры КАК СписокНоменклатуры)";
		
	КонецЕсли;
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ОтборПоСпискуНоменклатуры",
		ОтборПоСпискуНенклатуры);
		
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ОтборПоНоменклатуреРаспределениеЗатрат",
		ОтборПоНоменклатуреРаспределениеЗатрат);
//#Вставка
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"&ТекстЗапросаКоэффициентУпаковки1",
			Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"ЦеныНоменклатурыСрезПоследних.Упаковка",
			"ЦеныНоменклатурыСрезПоследних.Номенклатура"));
			
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
			"&ТекстЗапросаКоэффициентУпаковки2",
			Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
			"ВложенныйЗапрос.Номенклатура.ЕдиницаИзмерения",
			"ВложенныйЗапрос.Номенклатура"));
//#КонецВставки
		
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
//#Вставка
	Валюта 			= КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(ПараметрыОтчета, "Валюта").Значение;  
	БазоваяВалюта 	= КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(ПараметрыОтчета, "БазоваяВалюта").Значение;
	Запрос.УстановитьПараметр("ВидЦены"			, ВидЦены);
	Запрос.УстановитьПараметр("Валюта"			, Валюта);
	Запрос.УстановитьПараметр("БазоваяВалюта"	, БазоваяВалюта);
	//ПериодОтчета 			= КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(ПользовательскиеНастройки, "Период").Значение;
	//ДатаНачала 				= ПериодОтчета.ДатаНачала;
	//ДатаОкончания 			= ПериодОтчета.ДатаОкончания;
	Запрос.УстановитьПараметр("ДатаЦены"		, ДатаЦены);
//#КонецВставки
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ОбработатьСтрокиД(СтрокиД)
	СтрокиИ=СтрокиД.НайтиСтроки(Новый Структура("Сумма",0));
	Если СтрокиИ.Количество() Тогда
		Для каждого СтрокаД Из СтрокиИ Цикл
			//Если СтрокаД.Сумма=0 Тогда
			ОбработатьСтрокиД(СтрокаД.Строки);
			СтрокаД.Сумма = СтрокаД.Строки.Итог("Сумма");
		    СтрокаД.Цена = СтрокаД.Сумма / ?(СтрокаД.Израсходовано=0,1,СтрокаД.Израсходовано);
			//КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Функция ЗаполнитьСтрокиРекурсивно(СтруктураСерииДерево, ТЗ)

	Для каждого СтрокаДерева Из СтруктураСерииДерево.Строки Цикл
		Если Не ЗначениеЗаполнено(СтрокаДерева.НоменклатураУзел) Тогда
			СтрТЗ = ТЗ.Добавить();
			ЗаполнитьЗначенияСвойств(СтрТЗ, СтрокаДерева);
			Если ЗначениеЗаполнено(СтрокаДерева.Родитель)
				и ЗначениеЗаполнено(СтрокаДерева.Родитель.НоменклатураУзел) Тогда
				СтрТЗ.НоменклатураУзел = СтрокаДерева.Родитель.НоменклатураУзел;
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьСтрокиРекурсивно(СтрокаДерева, ТЗ);
		
	КонецЦикла; 
	Возврат(ТЗ);	
КонецФункции

Функция ЛимитСтрок()
	Возврат 100000;
КонецФункции

Процедура vs_НевыполненныеОбязательстваПоЗаказуНаСборку_МО_ПередЗагрузкойНастроекВКомпоновщик(Контекст, КлючСхемы, КлючВарианта, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД, СхемаКД, Объект) Экспорт
	Валюта = Новый СправочникСсылка.Валюты(Новый УникальныйИдентификатор("129e01fe-1f5b-11ea-ab34-00155d439817"));
	БазоваяВалюта = Валюта;
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "Валюта", Валюта); 
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(НовыеНастройкиКД, "БазоваяВалюта", БазоваяВалюта); 
КонецПроцедуры
	
#КонецОбласти