
&Перед("УстановитьОформлениеЗадач")
Процедура vs_УстановитьОформлениеЗадач(Знач СписокЗадачИлиЕгоУсловноеОформление)
	Если СписокЗадачИлиЕгоУсловноеОформление.ОсновнаяТаблица = "Задача.ЗадачаИсполнителя" 
		или СписокЗадачИлиЕгоУсловноеОформление.ОсновнаяТаблица = "Задача.ЗадачаИсполнителя.ЗадачиПоИсполнителю" Тогда
		СхемаЗапроса = Новый СхемаЗапроса();
		СхемаЗапроса.УстановитьТекстЗапроса(СписокЗадачИлиЕгоУсловноеОформление.ТекстЗапроса);
		Запрос = СхемаЗапроса.ПакетЗапросов[СхемаЗапроса.ПакетЗапросов.Количество() - 1];
	
		КолонкаСсылкиНаименование = Запрос.Колонки.Найти("Наименование"); 
		//КолонкаСсылкиПредставление = Запрос.Колонки.Найти("Представление");
		
		Если Не КолонкаСсылкиНаименование = Неопределено Тогда
			Поз = СтрНайти(КолонкаСсылкиНаименование.Поля[0],"Сделка",,,1);
			Если Поз = 0 Тогда
				Поз = СтрНайти(КолонкаСсылкиНаименование.Поля[0],".",,,1);
				КореньВыражения = "";
				Если Не Поз = 0 Тогда
					КореньВыражения = СтрШаблон("%1.",Лев(КолонкаСсылкиНаименование.Поля[0], Поз-1));
				КонецЕсли;
				НовоеВыражениеСхемыЗапроса = СтрШаблон("ВЫБОР
													|		КОГДА ЕСТЬNULL(%1Сделка, ЗНАЧЕНИЕ(Справочник.СделкиСКлиентами.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СделкиСКлиентами.ПустаяСсылка)
													|			ТОГДА %1Наименование
													|		КОГДА ЕСТЬNULL(%1Сделка, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
													|			ТОГДА %1Наименование
													|		ИНАЧЕ %1Наименование + "" Сделка "" + %1Сделка.Наименование
													|	КОНЕЦ", КореньВыражения);	
				ИндексКолонки     = Запрос.Колонки.Индекс(КолонкаСсылкиНаименование);
				Для каждого ОператорЗапроса Из Запрос.Операторы Цикл  
					ОператорЗапроса.ВыбираемыеПоля.Установить(ИндексКолонки,  Новый ВыражениеСхемыЗапроса(НовоеВыражениеСхемыЗапроса));
				КонецЦикла;
				СписокЗадачИлиЕгоУсловноеОформление.ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
