Функция vs_ОтборПоСвойствамОбъекта_6()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>Проведен</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>true</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Проведен</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|	<!-- // begin fix Suetin 09.10.2020 4:58:06<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>ПроведеноБанком</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>true</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>ПроведеноБанком</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>// end fix Suetin 09.10.2020 4:58:49 -->
			|</ОтборПоСвойствамОбъекта>" ;
КонецФункции

Функция vs_ОтборПоСвойствамОбъекта_1()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>Проведен</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>true</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Проведен</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|	<!-- // fix -->
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Строка</ТипСвойстваОбъекта>
			|		<ВидСравнения>НеРавно</ВидСравнения>
			|		<СвойствоОбъекта>НомерПоДаннымКлиента</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты></ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>НомерПоДаннымКлиента</Наименование>
			|				<Тип>Строка</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|	<!-- // fix -->
			|	</ОтборПоСвойствамОбъекта>
			|";
КонецФункции

Функция vs_ОтборПоСвойствамОбъекта_1_Документ_ПередачаМатериаловВПроизводство()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>Проведен</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<!-- <ЗначениеКонстанты>true</ЗначениеКонстанты>// fix Designer27.10.2020 14:37:25 -->
			|		<ЗначениеКонстанты>false</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Проведен</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|	<!--  // fix Designer27.10.2020 14:37:25 -->
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>ИТБК_ТехническийДокумент</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>true</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Технический документ (vssoft)</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|	<!--  // fix Designer27.10.2020 14:37:25 -->
			|</ОтборПоСвойствамОбъекта>
			|";
КонецФункции

Функция vs_ОтборПоСвойствамПланаОбмена_2_Документ_ВнутреннееПотребление()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<!-- //////////////////////////////////////// -->
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>ПланВидовХарактеристикСсылка.СтатьиРасходов</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>[vs_СтатьиРасходов].vs_СтатьяРасходов</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>vs_СтатьяРасходов</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>vs_СтатьяРасходов</Наименование>
			|				<Тип>ПланВидовХарактеристикСсылка.СтатьиРасходов</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>[vs_СтатьиРасходов]</Наименование>
			|				<Вид>ТабличнаяЧасть</Вид>
			|			</Свойство>
			|			<Свойство>
			|				<Наименование>vs_СтатьяРасходов</Наименование>
			|				<Тип>ПланВидовХарактеристикСсылка.СтатьиРасходов</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<!-- //////////////////////////////////////// -->
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Дата</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ДатаНачалаВыгрузкиДокументов</СвойствоПланаОбмена>
			|		<ВидСравнения>БольшеИлиРавно</ВидСравнения>
			|		<СвойствоОбъекта>Дата</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Дата</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ДатаНачалаВыгрузкиДокументов</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>[Организации].Организация</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Организация</СвойствоОбъекта>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>[Организации]</Наименование>
			|					<Вид>ТабличнаяЧасть</Вид>
			|				</Свойство>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|		<Группа>
			|			<БулевоЗначениеГруппы>И</БулевоЗначениеГруппы>
			|			<ЭлементОтбора>
			|				<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|				<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|				<СвойствоПланаОбмена>ИспользоватьОтборПоОрганизациям</СвойствоПланаОбмена>
			|				<ВидСравнения>Равно</ВидСравнения>
			|				<СвойствоОбъекта>false</СвойствоОбъекта>
			|				<ТаблицаСвойствПланаОбмена>
			|					<Свойство>
			|						<Наименование>ИспользоватьОтборПоОрганизациям</Наименование>
			|						<Тип>Булево</Тип>
			|						<Вид>Реквизит</Вид>
			|					</Свойство>
			|				</ТаблицаСвойствПланаОбмена>
			|			</ЭлементОтбора>
			|			<Группа>
			|				<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|				<ЭлементОтбора>
			|					<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|					<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|					<СвойствоПланаОбмена>УправленческаяОрганизация</СвойствоПланаОбмена>
			|					<ВидСравнения>НеРавно</ВидСравнения>
			|					<СвойствоОбъекта>Организация</СвойствоОбъекта>
			|					<ТаблицаСвойствОбъекта>
			|						<Свойство>
			|							<Наименование>Организация</Наименование>
			|							<Тип>СправочникСсылка.Организации</Тип>
			|							<Вид>Реквизит</Вид>
			|						</Свойство>
			|					</ТаблицаСвойствОбъекта>
			|					<ТаблицаСвойствПланаОбмена>
			|						<Свойство>
			|							<Наименование>УправленческаяОрганизация</Наименование>
			|							<Тип>СправочникСсылка.Организации</Тип>
			|							<Вид>Реквизит</Вид>
			|						</Свойство>
			|					</ТаблицаСвойствПланаОбмена>
			|				</ЭлементОтбора>
			|				<ЭлементОтбора>
			|					<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|					<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|					<СвойствоПланаОбмена>ВыгружатьУправленческуюОрганизацию</СвойствоПланаОбмена>
			|					<ВидСравнения>Равно</ВидСравнения>
			|					<СвойствоОбъекта>true</СвойствоОбъекта>
			|					<ТаблицаСвойствПланаОбмена>
			|						<Свойство>
			|							<Наименование>ВыгружатьУправленческуюОрганизацию</Наименование>
			|							<Тип>Булево</Тип>
			|							<Вид>Реквизит</Вид>
			|						</Свойство>
			|					</ТаблицаСвойствПланаОбмена>
			|				</ЭлементОтбора>
			|			</Группа>
			|		</Группа>
			|	</Группа>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>СправочникСсылка.Склады</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>[Склады].Склад</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Склад</СвойствоОбъекта>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Склад</Наименование>
			|					<Тип>СправочникСсылка.Склады</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>[Склады]</Наименование>
			|					<Вид>ТабличнаяЧасть</Вид>
			|				</Свойство>
			|				<Свойство>
			|					<Наименование>Склад</Наименование>
			|					<Тип>СправочникСсылка.Склады</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>ИспользоватьОтборПоСкладам</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>false</СвойствоОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>ИспользоватьОтборПоСкладам</Наименование>
			|					<Тип>Булево</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|	</Группа>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Строка</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ВариантНастройки</СвойствоПланаОбмена>
			|		<ВидСравнения>НеРавно</ВидСравнения>
			|		<СвойствоОбъекта>ОбменУП2ЗУП3</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ВариантНастройки</Наименование>
			|				<Тип>Строка</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Строка</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ВариантНастройки</СвойствоПланаОбмена>
			|		<ВидСравнения>НеРавно</ВидСравнения>
			|		<СвойствоОбъекта>ОбменКасса</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ВариантНастройки</Наименование>
			|				<Тип>Строка</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Строка</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ВариантНастройки</СвойствоПланаОбмена>
			|		<ВидСравнения>НеРавно</ВидСравнения>
			|		<СвойствоОбъекта>ОбменУПРМК</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ВариантНастройки</Наименование>
			|				<Тип>Строка</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамПланаОбмена>" ;
КонецФункции

&ИзменениеИКонтроль("ДобавитьПРО_Документ_СписаниеБезналичныхДенежныхСредств")
Процедура vs_ДобавитьПРО_Документ_СписаниеБезналичныхДенежныхСредств(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_СписаниеБезналичныхДенежныхСредств";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.СписаниеБезналичныхДенежныхСредств";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Истина;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Истина;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
#Удаление
		Документ_СписаниеБезналичныхДенежныхСредств_ОтборПоСвойствамПланаОбмена(),
		Документ_СписаниеБезналичныхДенежныхСредств_ОтборПоСвойствамОбъекта());
#КонецУдаления
#Вставка
	// fix Suetin 1/12/2024 3:02:21 AM	ПроведеноБанком любое состояние
		//ОтборПоСвойствамОбъекта_6());
		Документ_СписаниеБезналичныхДенежныхСредств_ОтборПоСвойствамПланаОбмена(),
		Документ_СписаниеБезналичныхДенежныхСредств_ОтборПоСвойствамОбъекта());
#КонецВставки
КонецПроцедуры

&ИзменениеИКонтроль("ДобавитьПРО_Документ_ЗаказКлиента")
Процедура vs_ДобавитьПРО_Документ_ЗаказКлиента(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_ЗаказКлиента";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.ЗаказКлиента";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Истина;
	НовоеПравило.ЕстьОбработчикПриОбработке = Истина;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Истина;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Истина;
		
	УстановитьОтборы(НовоеПравило, 
		Документ_ЗаказКлиента_ОтборПоСвойствамПланаОбмена(),
#Удаление
		ОтборПоСвойствамОбъекта_4());
#КонецУдаления
#Вставка
		// fix Suetin 1/12/2024 3:02:21 AM	НомерПоДаннымКлиента должен быть заполнен
		vs_ОтборПоСвойствамОбъекта_5());

#КонецВставки
КонецПроцедуры

&ИзменениеИКонтроль("Документ_ДвижениеПродукцииИМатериалов_ОтборПоСвойствамОбъекта")
Функция vs_Документ_ДвижениеПродукцииИМатериалов_ОтборПоСвойствамОбъекта()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>Проведен</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
#Удаление
			|		<ЗначениеКонстанты>true</ЗначениеКонстанты>
#КонецУдаления
#Вставка
	|		<!-- // fix Designer09.10.2020 15:36:19<ЗначениеКонстанты>true</ЗначениеКонстанты> -->
	|		<ЗначениеКонстанты>false</ЗначениеКонстанты>
#КонецВставки
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Проведен</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>ПеречислениеСсылка.ХозяйственныеОперации</ТипСвойстваОбъекта>
#Удаление
			|		<ВидСравнения>НеРавно</ВидСравнения>
#КонецУдаления
#Вставка	
	|		<!-- // fix Designer09.10.2020 15:36:19<ВидСравнения>НеРавно</ВидСравнения> -->
	|		<ВидСравнения>Равно</ВидСравнения>
#КонецВставки	
			|		<СвойствоОбъекта>ХозяйственнаяОперация</СвойствоОбъекта>
			|		<Вид>АлгоритмЗначения</Вид>
#Удаление	
			|		<ЗначениеКонстанты>Значение = Перечисления.ХозяйственныеОперации.ПеремещениеПолуфабрикатов;</ЗначениеКонстанты>
#КонецУдаления
#Вставка	
	|		<!-- // fix Designer09.10.2020 15:36:19<ЗначениеКонстанты>Значение = Перечисления.ХозяйственныеОперации.ПеремещениеПолуфабрикатов;</ЗначениеКонстанты> -->
	|		<ЗначениеКонстанты>Значение = Перечисления.ХозяйственныеОперации.ПередачаМатериаловВКладовую;</ЗначениеКонстанты>
#КонецВставки	
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>ХозяйственнаяОперация</Наименование>
			|				<Тип>ПеречислениеСсылка.ХозяйственныеОперации</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
#Удаление	
			|	<ЭлементОтбора>
#КонецУдаления
#Вставка	
	|		<!-- // fix Designer09.10.2020 15:36:19<ЭлементОтбора>
#КонецВставки	
			|		<ТипСвойстваОбъекта>ПеречислениеСсылка.СтатусыДвиженияПродукцииИМатериалов</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>Статус</СвойствоОбъекта>
			|		<Вид>АлгоритмЗначения</Вид>
			|		<ЗначениеКонстанты>Значение = Перечисления.СтатусыДвиженияПродукцииИМатериалов.Принято;</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Статус</Наименование>
			|				<Тип>ПеречислениеСсылка.СтатусыДвиженияПродукцииИМатериалов</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
#Удаление	
			|	</ЭлементОтбора>
#КонецУдаления
#Вставка	
	|	</ЭлементОтбора> -->
#КонецВставки	
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>ВнутренняяПереработка</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>false</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>ВнутренняяПереработка</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|</ОтборПоСвойствамОбъекта>";
КонецФункции

&ИзменениеИКонтроль("ДобавитьПРО_Документ_ПередачаМатериаловВПроизводство")
Процедура vs_ДобавитьПРО_Документ_ПередачаМатериаловВПроизводство(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_ПередачаМатериаловВПроизводство";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.ПередачаМатериаловВПроизводство";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Истина;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Истина;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
		Документ_ПередачаМатериаловВПроизводство_ОтборПоСвойствамПланаОбмена(),
#Удаление
		ОтборПоСвойствамОбъекта_4());
#КонецУдаления
#Вставка
// проверить!!!
		//ОтборПоСвойствамОбъекта_5());
		vs_ОтборПоСвойствамОбъекта_1_Документ_ПередачаМатериаловВПроизводство());
#КонецВставки
КонецПроцедуры

&ИзменениеИКонтроль("ДобавитьПРО_Документ_ВнутреннееПотребление")
Процедура vs_ДобавитьПРО_Документ_ВнутреннееПотребление(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_ВнутреннееПотребление";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.ВнутреннееПотребление";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Истина;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Истина;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
#Удаление
		ОтборПоСвойствамПланаОбмена_16(),
#КонецУдаления
#Вставка
// Проверить!!! было ОтборПоСвойствамПланаОбмена_17(),
		vs_ОтборПоСвойствамПланаОбмена_2_Документ_ВнутреннееПотребление(),
#КонецВставки
		Документ_ВнутреннееПотребление_ОтборПоСвойствамОбъекта());
КонецПроцедуры

&ИзменениеИКонтроль("Документ_ВнутреннееПотребление_ОтборПоСвойствамОбъекта")
Функция vs_Документ_ВнутреннееПотребление_ОтборПоСвойствамОбъекта()
	Возврат "<ОтборПоСвойствамОбъекта>
	|	<ЭлементОтбора>
	|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
	|		<ВидСравнения>Равно</ВидСравнения>
	|		<СвойствоОбъекта>Проведен</СвойствоОбъекта>
	|		<Вид>ЗначениеКонстанты</Вид>
	|		<ЗначениеКонстанты>true</ЗначениеКонстанты>
	|		<ТаблицаСвойствОбъекта>
	|			<Свойство>
	|				<Наименование>Проведен</Наименование>
	|				<Тип>Булево</Тип>
	|				<Вид>Свойство</Вид>
	|			</Свойство>
	|		</ТаблицаСвойствОбъекта>
	|	</ЭлементОтбора>
#Вставка
    |
	|	<!--  // fix Designer27.10.2020 14:37:25 -->
	|	<ЭлементОтбора>
	|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
	|		<ВидСравнения>Равно</ВидСравнения>
	|		<СвойствоОбъекта>ИТБК_ЭтоДоизготовление</СвойствоОбъекта>
	|		<Вид>ЗначениеКонстанты</Вид>
	|		<ЗначениеКонстанты>false</ЗначениеКонстанты>
	|		<ТаблицаСвойствОбъекта>
	|			<Свойство>
	|				<Наименование>Документ доизготовления (vssoft)</Наименование>
	|				<Тип>Булево</Тип>
	|				<Вид>Свойство</Вид>
	|			</Свойство>
	|		</ТаблицаСвойствОбъекта>
	|	</ЭлементОтбора>
	|	<!--  // fix Designer27.10.2020 14:37:25 -->
#КонецВставки
	|	<Группа>
	|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
	|		<ЭлементОтбора>
	|			<ТипСвойстваОбъекта>ПеречислениеСсылка.ХозяйственныеОперации</ТипСвойстваОбъекта>
	|			<ВидСравнения>Равно</ВидСравнения>
	|			<СвойствоОбъекта>ХозяйственнаяОперация</СвойствоОбъекта>
	|			<Вид>АлгоритмЗначения</Вид>
	|			<ЗначениеКонстанты>Значение = Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию;</ЗначениеКонстанты>
	|			<ТаблицаСвойствОбъекта>
	|				<Свойство>
	|					<Наименование>ХозяйственнаяОперация</Наименование>
	|					<Тип>ПеречислениеСсылка.ХозяйственныеОперации</Тип>
	|					<Вид>Реквизит</Вид>
	|				</Свойство>
	|			</ТаблицаСвойствОбъекта>
	|		</ЭлементОтбора>
	|		<ЭлементОтбора>
	|			<ТипСвойстваОбъекта>ПеречислениеСсылка.ХозяйственныеОперации</ТипСвойстваОбъекта>
	|			<ВидСравнения>Равно</ВидСравнения>
	|			<СвойствоОбъекта>ХозяйственнаяОперация</СвойствоОбъекта>
	|			<Вид>АлгоритмЗначения</Вид>
	|			<ЗначениеКонстанты>Значение = Перечисления.ХозяйственныеОперации.ПередачаВЭксплуатацию;</ЗначениеКонстанты>
	|			<ТаблицаСвойствОбъекта>
	|				<Свойство>
	|					<Наименование>ХозяйственнаяОперация</Наименование>
	|					<Тип>ПеречислениеСсылка.ХозяйственныеОперации</Тип>
	|					<Вид>Реквизит</Вид>
	|				</Свойство>
	|			</ТаблицаСвойствОбъекта>
	|		</ЭлементОтбора>
	|	</Группа>
	|</ОтборПоСвойствамОбъекта>";
КонецФункции

Функция vs_ОтборПоСвойствамПланаОбмена_2_Документ_СборкаТоваров()
	Возврат "<ОтборПоСвойствамПланаОбмена>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Дата</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ДатаНачалаВыгрузкиДокументов</СвойствоПланаОбмена>
			|		<ВидСравнения>БольшеИлиРавно</ВидСравнения>
			|		<СвойствоОбъекта>Дата</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Дата</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ДатаНачалаВыгрузкиДокументов</Наименование>
			|				<Тип>Дата</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>[Организации].Организация</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Организация</СвойствоОбъекта>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>[Организации]</Наименование>
			|					<Вид>ТабличнаяЧасть</Вид>
			|				</Свойство>
			|				<Свойство>
			|					<Наименование>Организация</Наименование>
			|					<Тип>СправочникСсылка.Организации</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|		<Группа>
			|			<БулевоЗначениеГруппы>И</БулевоЗначениеГруппы>
			|			<ЭлементОтбора>
			|				<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|				<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|				<СвойствоПланаОбмена>ИспользоватьОтборПоОрганизациям</СвойствоПланаОбмена>
			|				<ВидСравнения>Равно</ВидСравнения>
			|				<СвойствоОбъекта>false</СвойствоОбъекта>
			|				<ТаблицаСвойствПланаОбмена>
			|					<Свойство>
			|						<Наименование>ИспользоватьОтборПоОрганизациям</Наименование>
			|						<Тип>Булево</Тип>
			|						<Вид>Реквизит</Вид>
			|					</Свойство>
			|				</ТаблицаСвойствПланаОбмена>
			|			</ЭлементОтбора>
			|			<Группа>
			|				<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|				<ЭлементОтбора>
			|					<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|					<ТипСвойстваОбъекта>СправочникСсылка.Организации</ТипСвойстваОбъекта>
			|					<СвойствоПланаОбмена>УправленческаяОрганизация</СвойствоПланаОбмена>
			|					<ВидСравнения>НеРавно</ВидСравнения>
			|					<СвойствоОбъекта>Организация</СвойствоОбъекта>
			|					<ТаблицаСвойствОбъекта>
			|						<Свойство>
			|							<Наименование>Организация</Наименование>
			|							<Тип>СправочникСсылка.Организации</Тип>
			|							<Вид>Реквизит</Вид>
			|						</Свойство>
			|					</ТаблицаСвойствОбъекта>
			|					<ТаблицаСвойствПланаОбмена>
			|						<Свойство>
			|							<Наименование>УправленческаяОрганизация</Наименование>
			|							<Тип>СправочникСсылка.Организации</Тип>
			|							<Вид>Реквизит</Вид>
			|						</Свойство>
			|					</ТаблицаСвойствПланаОбмена>
			|				</ЭлементОтбора>
			|				<ЭлементОтбора>
			|					<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|					<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|					<СвойствоПланаОбмена>ВыгружатьУправленческуюОрганизацию</СвойствоПланаОбмена>
			|					<ВидСравнения>Равно</ВидСравнения>
			|					<СвойствоОбъекта>true</СвойствоОбъекта>
			|					<ТаблицаСвойствПланаОбмена>
			|						<Свойство>
			|							<Наименование>ВыгружатьУправленческуюОрганизацию</Наименование>
			|							<Тип>Булево</Тип>
			|							<Вид>Реквизит</Вид>
			|						</Свойство>
			|					</ТаблицаСвойствПланаОбмена>
			|				</ЭлементОтбора>
			|			</Группа>
			|		</Группа>
			|	</Группа>
			|	<Группа>
			|		<БулевоЗначениеГруппы>ИЛИ</БулевоЗначениеГруппы>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>СправочникСсылка.Склады</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>[Склады].Склад</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>Склад</СвойствоОбъекта>
			|			<ТаблицаСвойствОбъекта>
			|				<Свойство>
			|					<Наименование>Склад</Наименование>
			|					<Тип>СправочникСсылка.Склады</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>[Склады]</Наименование>
			|					<Вид>ТабличнаяЧасть</Вид>
			|				</Свойство>
			|				<Свойство>
			|					<Наименование>Склад</Наименование>
			|					<Тип>СправочникСсылка.Склады</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|		<ЭлементОтбора>
			|			<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|			<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|			<СвойствоПланаОбмена>ИспользоватьОтборПоСкладам</СвойствоПланаОбмена>
			|			<ВидСравнения>Равно</ВидСравнения>
			|			<СвойствоОбъекта>false</СвойствоОбъекта>
			|			<ТаблицаСвойствПланаОбмена>
			|				<Свойство>
			|					<Наименование>ИспользоватьОтборПоСкладам</Наименование>
			|					<Тип>Булево</Тип>
			|					<Вид>Реквизит</Вид>
			|				</Свойство>
			|			</ТаблицаСвойствПланаОбмена>
			|		</ЭлементОтбора>
			|	</Группа>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Строка</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ВариантНастройки</СвойствоПланаОбмена>
			|		<ВидСравнения>НеРавно</ВидСравнения>
			|		<СвойствоОбъекта>ОбменУП2ЗУП3</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ВариантНастройки</Наименование>
			|				<Тип>Строка</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Строка</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ВариантНастройки</СвойствоПланаОбмена>
			|		<ВидСравнения>НеРавно</ВидСравнения>
			|		<СвойствоОбъекта>ОбменКасса</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ВариантНастройки</Наименование>
			|				<Тип>Строка</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Строка</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ВариантНастройки</СвойствоПланаОбмена>
			|		<ВидСравнения>НеРавно</ВидСравнения>
			|		<СвойствоОбъекта>ОбменУПРМК</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ВариантНастройки</Наименование>
			|				<Тип>Строка</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			
			|	<!--       // begin fix Designer 2025.12.10 -->
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>false</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Справочник.ВидыНоменклатуры</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>[vs_ВидыНоменклатуры].vs_ВидНоменклатуры</СвойствоПланаОбмена>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>Номенклатура.ВидНоменклатуры</СвойствоОбъекта>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Номенклатура</Наименование>
			|				<Тип>Справочник.Номенклатура</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|			<Свойство>
			|				<Наименование>ВидНоменклатуры</Наименование>
			|				<Тип>Справочник.ВидыНоменклатуры</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>[vs_ВидыНоменклатуры]</Наименование>
			|				<Вид>ТабличнаяЧасть</Вид>
			|			</Свойство>
			|			<Свойство>
			|				<Наименование>vs_ВидНоменклатуры</Наименование>
			|				<Тип>Справочник.ВидыНоменклатуры</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<!--       // end fix Designer 2025.12.10 -->
			
			|</ОтборПоСвойствамПланаОбмена>" ;
	        А="
			|	</ЭлементОтбора>
			|	<!--       // begin fix Designer02.11.2020 12:45:50 -->
			|	<ЭлементОтбора>
			|		<ЭтоСтрокаКонстанты>true</ЭтоСтрокаКонстанты>
			|		<ТипСвойстваОбъекта>Строка</ТипСвойстваОбъекта>
			|		<СвойствоПланаОбмена>ВариантНастройки</СвойствоПланаОбмена>
			|		<ВидСравнения>НеРавно</ВидСравнения>
			|		<СвойствоОбъекта>ОбменУниверсальный</СвойствоОбъекта>
			|		<ТаблицаСвойствПланаОбмена>
			|			<Свойство>
			|				<Наименование>ВариантНастройки</Наименование>
			|				<Тип>Строка</Тип>
			|				<Вид>Реквизит</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствПланаОбмена>
			|	</ЭлементОтбора>
			|	<!--       // end fix Designer02.11.2020 12:46:13 -->
			|</ОтборПоСвойствамПланаОбмена>" ;
	
КонецФункции

&ИзменениеИКонтроль("ДобавитьПРО_Документ_СборкаТоваров")
Процедура vs_ДобавитьПРО_Документ_СборкаТоваров(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();
	
	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "Документ_СборкаТоваров";
	
	НовоеПравило.ОбъектМетаданныхИмя = "Документ.СборкаТоваров";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";	
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработке = Истина;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Истина;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;
		
	УстановитьОтборы(НовоеПравило, 
#Удаление
		ОтборПоСвойствамПланаОбмена_16(),
#КонецУдаления
#Вставка
//// Проверить!!!	 ОтборПоСвойствамПланаОбмена_17(), 15
		vs_ОтборПоСвойствамПланаОбмена_2_Документ_СборкаТоваров(),
#КонецВставки
		Документ_СборкаТоваров_ОтборПоСвойствамОбъекта());
КонецПроцедуры

Функция vs_ОтборПоСвойствамОбъекта_5()
	Возврат "<ОтборПоСвойствамОбъекта>
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Булево</ТипСвойстваОбъекта>
			|		<ВидСравнения>Равно</ВидСравнения>
			|		<СвойствоОбъекта>Проведен</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты>true</ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>Проведен</Наименование>
			|				<Тип>Булево</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|	<!-- // fix -->
			|	<ЭлементОтбора>
			|		<ТипСвойстваОбъекта>Строка</ТипСвойстваОбъекта>
			|		<ВидСравнения>НеРавно</ВидСравнения>
			|		<СвойствоОбъекта>НомерПоДаннымКлиента</СвойствоОбъекта>
			|		<Вид>ЗначениеКонстанты</Вид>
			|		<ЗначениеКонстанты></ЗначениеКонстанты>
			|		<ТаблицаСвойствОбъекта>
			|			<Свойство>
			|				<Наименование>НомерПоДаннымКлиента</Наименование>
			|				<Тип>Строка</Тип>
			|				<Вид>Свойство</Вид>
			|			</Свойство>
			|		</ТаблицаСвойствОбъекта>
			|	</ЭлементОтбора>
			|	<!-- // fix -->
			|</ОтборПоСвойствамОбъекта>" ;
КонецФункции

&ИзменениеИКонтроль("ДобавитьПРО_РегистрСведений_СостоянияПоОбъектамУчетаЭДО")
Процедура vs_ДобавитьПРО_РегистрСведений_СостоянияПоОбъектамУчетаЭДО(ПравилаРегистрацииОбъектов, ИмяМенеджераРегистрации)
	НовоеПравило = ПравилаРегистрацииОбъектов.Добавить();

	НовоеПравило.ИмяМенеджераРегистрации = ИмяМенеджераРегистрации; 
	НовоеПравило.Идентификатор = "РегистрСведений_СостоянияПоОбъектамУчетаЭДО";

	НовоеПравило.ОбъектМетаданныхИмя = "РегистрСведений.СостоянияПоОбъектамУчетаЭДО";
	НовоеПравило.ИмяПланаОбмена = "СинхронизацияДанныхЧерезУниверсальныйФормат";
#Удаление
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиСправочников";	
#КонецУдаления
#Вставка
	НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиДокументов";
	//НовоеПравило.ИмяРеквизитаФлага = "РежимВыгрузкиСправочников";	
#КонецВставки
	НовоеПравило.ПравилоПоСвойствамОбъектаПустое = Ложь; 
	НовоеПравило.ПакетноеВыполнениеОбработчиков = Ложь;
	НовоеПравило.ЕстьОбработчикПередОбработкой = Истина;
	НовоеПравило.ЕстьОбработчикПриОбработке = Ложь;
	НовоеПравило.ЕстьОбработчикПриОбработкеДополнительный = Ложь;
	НовоеПравило.ЕстьОбработчикПослеОбработки = Ложь;

	УстановитьОтборы(НовоеПравило, 
	РегистрСведений_СостоянияПоОбъектамУчетаЭДО_ОтборПоСвойствамПланаОбмена(),
	ПустойОтборПоСвойствамОбъекта());
КонецПроцедуры
