#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&После("ОбработкаПроведения")
Процедура vs_ОбработкаПроведения(Отказ, РежимПроведения)
	//Набор = Движения.vs_Доизготовление;
	//для Каждого  стр из vs_Доизготовить цикл
	//	Если  стр.Количество  > 0 тогда
	//		стрДвижения = набор.добавитьПриход();
	//		стрДвижения.Период = Дата;
	//		стрДвижения.АктИзготовления = ИТБК_АктИзготовления;
	//		стрДвижения.Номенклатура = стр.Номенклатура;
	//		стрДвижения.Доизготовить = стр.Количество;
	//	КонецЕсли;
	//КонецЦикла;
	//набор.записывать = Истина;
	//Набор.Записать();
	//
	//Набор = Движения.ИТБК_Доизготовление;
	//для Каждого  стр из vs_Доизготовить цикл
	//	Если  стр.Количество  > 0 тогда
	//		стрДвижения = набор.добавитьПриход();
	//		стрДвижения.Период = Дата;
	//		стрДвижения.АктИзготовления = ИТБК_АктИзготовления;
	//		стрДвижения.Номенклатура = стр.Номенклатура;
	//		стрДвижения.Доизготовить = стр.Количество;
	//	КонецЕсли;
	//КонецЦикла;
	//набор.записывать = Истина;
	//Набор.Записать();
	
КонецПроцедуры

&Перед("ПередЗаписью")
Процедура vs_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения тогда
		Отказ = vs_ОбщийМодуль.ЕстьДоизготовления(vs_АктИзготовления);
	КонецЕсли;
	// begin fix Designer29.09.2023 10:26:08
	Если Не Отказ и Не РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Если Дата = КонецДня(Дата) Тогда
			Дата = Дата - 60*60+1;
		КонецЕсли;
		// begin fix Designer 2025.12.21
		Т = "
		|ВЫБРАТЬ
	    |	ЦеныНоменклатуры.Цена КАК ПлановаяСтоимость,
	    |	ЦеныНоменклатуры.Цена * &Количество КАК СуммаПлановая
	    |ИЗ
	    |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	    |			&ДатаЦены,
	    |			ВидЦены = &ВидЦены
	    |				И Номенклатура = &Номенклатура
	    |				И Характеристика = &Характеристика) КАК ЦеныНоменклатуры";
		Запрос = Новый Запрос(Т);
		Запрос.УстановитьПараметр("ДатаЦены", Новый Граница(Дата, Видграницы.Включая));
		//Справочники.ВидыЦен.НайтиПоНаименованию("");
		Запрос.УстановитьПараметр("ВидЦены", Новый СправочникСсылка.ВидыЦен(Новый УникальныйИдентификатор("27e7634d-71dc-11eb-ab40-00155d439817")));
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("Характеристика", Характеристика);
		Запрос.УстановитьПараметр("Количество", Количество);
		Рез = Запрос.Выполнить();
		Если Не Рез.Пустой() Тогда
			Выб = Рез.Выбрать();
			Если Выб.Следующий() Тогда
				ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выб);
			КонецЕсли;
		КонецЕсли;
		// end fix Designer 2025.12.21
	КонецЕсли;	
КонецПроцедуры

&После("ПередЗаписью")
Процедура vs_ПередЗаписью1(Отказ, РежимЗаписи, РежимПроведения)
	
	//никитина 28.09.20
	//заполним серию
	СтрокаСерии = Серии.Найти(Номенклатура,"Номенклатура");
	Если СтрокаСерии <> Неопределено тогда
		ИТБК_Серия = СтрокаСерии.Серия;	
	иначе
		ИТБК_Серия = Серия
	КонецЕсли;

КонецПроцедуры

&Перед("ОбработкаПроверкиЗаполнения")
Процедура vs_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	МассивНепроверяемыхРеквизитов.Добавить("ИТБК_Серия");
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

КонецПроцедуры

#КонецЕсли
