&НаКлиенте
Процедура vs_ЗаполнитьСчетНаОплату(Кнопка)
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("НомерСтроки", Элементы.РасшифровкаПлатежа.ТекущаяСтрока);
	ООоЗ = Новый ОписаниеОповещения ("vs_ЗаполнитьНомерСчетаНаОплату", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВводСтроки(ООоЗ,,"Введите номер счета поставщика",6,Ложь);
КонецПроцедуры

&НаКлиенте
Процедура vs_ЗаполнитьНомерСчетаНаОплату(Результат,ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда Возврат; КонецЕсли;
	ДополнительныеПараметры.Вставить("Номер", Результат);
	ООоЗ = Новый ОписаниеОповещения ("vs_ЗаполнитьДатуСчетаНаОплату", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВводДаты(ООоЗ,,"Введите дату счета поставщика",ЧастиДаты.Дата);
КонецПроцедуры

&НаКлиенте
Процедура vs_ЗаполнитьДатуСчетаНаОплату(Результат,ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда Возврат; КонецЕсли;
	СтрокаТЧ = Объект.РасшифровкаПлатежа.НайтиПоИдентификатору(ДополнительныеПараметры.НомерСтроки);
	СтрокаТЧ.Комментарий = СтрШаблон("%1%2%3%4","Счет № ",ДополнительныеПараметры.Номер," от ",Формат(Результат, "ДФ=дд.MM.гггг")); 
	ЭтотОбъект.Модифицированность=Истина;
КонецПроцедуры
