
&Перед("ПриИзмененииСтатуса")
Процедура vs_ПриИзмененииСтатуса(Форма, ТекущаяДата)
	Если Форма.ИмяФормы	= "Документ.КоммерческоеПредложениеКлиенту.Форма.ФормаДокумента" Тогда
		Если Форма.Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыКоммерческихПредложенийКлиентам.Черновик")
			и Не Форма.Объект.Ссылка.Статус = ПредопределенноеЗначение("Перечисление.СтатусыКоммерческихПредложенийКлиентам.Черновик") Тогда
			Если Форма.Объект.Согласован Тогда
				Форма.Объект.Согласован = Ложь;
				Форма.Модифицированность = Истина;
	        КонецЕсли;
		ИначеЕсли Форма.Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыКоммерческихПредложенийКлиентам.Отменено")
			и Не Форма.Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыКоммерческихПредложенийКлиентам.Отменено") Тогда
			Если Форма.Объект.Согласован Тогда
				Форма.Объект.Согласован = Ложь;
				Форма.Модифицированность = Истина;
	        КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры
