
&ИзменениеИКонтроль("ЗаписатьИЗакрытьВыполнить")
Функция vs_ЗаписатьИЗакрытьВыполнить(Форма, ВыполнитьЗадачу, ПараметрыОповещения)

	ОчиститьСообщения();

	НовыйОбъект = Форма.Объект.Ссылка.Пустая();
	ТекстОповещения = "";
	Если ПараметрыОповещения = Неопределено Тогда
		ПараметрыОповещения = Новый Структура;
	КонецЕсли;
	Если НЕ Форма.НачальныйПризнакВыполнения И ВыполнитьЗадачу Тогда
		Если НЕ Форма.Записать(Новый Структура("ВыполнитьЗадачу", Истина)) Тогда
			Возврат Ложь;
		КонецЕсли;
		ТекстОповещения = НСтр("ru = 'Задача выполнена'");
	Иначе
		Если НЕ Форма.Записать() Тогда
			Возврат Ложь;
		КонецЕсли;
		ТекстОповещения = ?(НовыйОбъект, НСтр("ru = 'Задача создана'"), НСтр("ru = 'Задача изменена'"));
	КонецЕсли;

	Оповестить("Запись_ЗадачаИсполнителя", ПараметрыОповещения, Форма.Объект.Ссылка);
	ПоказатьОповещениеПользователя(ТекстОповещения,
	ПолучитьНавигационнуюСсылку(Форма.Объект.Ссылка),
	Строка(Форма.Объект.Ссылка),
	БиблиотекаКартинок.ДиалогИнформация);
#Удаление
	Форма.Закрыть();
#КонецУдаления
#Вставка
// Здесь можно описать новое поведение.
//	Форма.Закрыть();

#КонецВставки
	Возврат Истина;

КонецФункции
