#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Задать настройки формы отчета.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения
//         - Неопределено
//   КлючВарианта - Строка
//                - Неопределено
//   Настройки - см. ОтчетыКлиентСервер.НастройкиОтчетаПоУмолчанию
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	
	//Настройки.ОтключитьСтандартноеКонтекстноеМеню = Истина;
	//Настройки.РазрешеноИзменятьСтруктуру = Ложь;
	//Настройки.ФормироватьСразу = Истина;
	//Настройки.События.ПриСозданииНаСервере = Истина;
	//Настройки.События.ПриОпределенииИспользуемыхТаблиц = Истина;
	Настройки.События.ПередЗагрузкойНастроекВКомпоновщик = Истина;
	//Настройки.События.ПослеЗагрузкиНастроекВКомпоновщик = Истина;
	Настройки.События.ПередФормированиемОтчета = Истина;
	//Настройки.События.ПриОпределенииПараметровВыбора = Истина;
	//Если (РольДоступна("ПолныеПрава") или РольДоступна("vs_ОтражениеМатериальногоОтчета")) Тогда
	//	Форма.Элементы.vs_Отразить.Доступность = Истина;
	//Иначе
	//	Форма.Элементы.vs_Отразить.Доступность = Ложь;
	//КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗагрузкойНастроекВКомпоновщик(Контекст, КлючСхемы, КлючВарианта, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД) Экспорт
	vs_ОбщийМодуль.vs_МатериальныйОтчет_МО_ПередЗагрузкойНастроекВКомпоновщик(Контекст, КлючСхемы, КлючВарианта, НовыеНастройкиКД, НовыеПользовательскиеНастройкиКД, СхемаКомпоновкиДанных, ЭтотОбъект);
КонецПроцедуры

// Параметры:
//   ФормаОтчета - ФормаКлиентскогоПриложения
//   ДополнительныеПараметры - Структура:
//     * ТекстПредупреждения - Строка
//     * ИмяПараметраХраненияОтказаОтПредупреждения - Строка
//
Процедура ПередФормированиемОтчета(ФормаОтчета, ДополнительныеПараметры) Экспорт
	vs_ОбщийМодуль.vs_МатериальныйОтчет_МО_ПередФормированиемОтчета(ФормаОтчета, ДополнительныеПараметры, СхемаКомпоновкиДанных);
КонецПроцедуры


//Процедура ПослеЗагрузкиНастроекВКомпоновщик(ДополнительныеПараметры) Экспорт
//	//vs_ОбщийМодуль.vs_МатериальныйОтчет_МО_ПослеЗагрузкиНастроекВКомпоновщик(ДополнительныеПараметры); 
//КонецПроцедуры	
	
// Параметры:
//  ДокументРезультат - ТабличныйДокумент
//  ДанныеРасшифровки - ДанныеРасшифровкиКомпоновкиДанных
//  СтандартнаяОбработка - Булево
//
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	vs_ОбщийМодуль.vs_МатериальныйОтчет_МО_ПриКомпоновкеРезультата(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, КомпоновщикНастроек); 
	
КонецПроцедуры // ПриКомпоновкеРезультата() 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Функция ПолучитьТекстВыпускПродукцииЗатратыНаСборку()
//	ТекстЗапроса = "
//	|//////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВидыНоменклатуры.Ссылка КАК Ссылка
//	|ПОМЕСТИТЬ МассивУзловАИ
//	|ИЗ
//	|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
//	|ГДЕ
//	|	НЕ ВидыНоменклатуры.ЭтоГруппа
//	|	И ВидыНоменклатуры.Наименование ПОДОБНО &Наименование
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ТоварыО.Период КАК Период,
//	|	ТоварыО.Регистратор КАК Регистратор,
//	|	ТоварыО.АналитикаУчетаНоменклатуры КАК КлючАналитикиУчетаНоменклатуры,
//	|	КАУН.Номенклатура КАК Номенклатура,
//	|	СпрНоменклатура.Родитель КАК РодительНоменклатуры,
//	|	СпрНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
//	|	КАУН.Характеристика КАК Характеристика,
//	|	КАУН.Серия КАК Серия,
//	|	КАУН.Назначение КАК Назначение,
//	|	КАУН.СкладскаяТерритория КАК Склад,
//	|	ТоварыО.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
//	|	ТоварыО.СтатьяРасходов КАК СтатьяРасходов,
//	|	ТоварыО.ВидДвижения КАК ВидДвижения,
//	|	СпрНоменклатура.ВидНоменклатуры КАК ВидНоменклатуры,
//	|	СпрВидыНоменклатуры.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
//	|	СпрПолитикиУчетаСерий.ТипПолитики КАК ТипПолитикиУчетаСерий,
//	|	ТоварыО.ВидЗапасов КАК ВидЗапасов,
//	//|	ТоварыО.НомерГТД КАК НомерГТД,
//	|	ЕСТЬNULL(СУММА(СпрВариантыКомплектацииНоменклатуры.Количество), 0) КАК КоличествоВариантовКомплектацииНоменклатуры
//	|ПОМЕСТИТЬ ТоварыО
//	|ИЗ
//	|	РегистрНакопления.ТоварыОрганизаций КАК ТоварыО
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КАУН
//	|		ПО ТоварыО.АналитикаУчетаНоменклатуры = КАУН.Ссылка
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
//	|		ПО (КАУН.Номенклатура = СпрНоменклатура.Ссылка)
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК СпрВидыНоменклатуры
//	|		ПО (СпрНоменклатура.ВидНоменклатуры = СпрВидыНоменклатуры.Ссылка)
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПолитикиУчетаСерий КАК СпрПолитикиУчетаСерий
//	|		ПО (СпрВидыНоменклатуры.ПолитикаУчетаСерий = СпрПолитикиУчетаСерий.Ссылка)
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК СпрВариантыКомплектацииНоменклатуры
//	|		ПО (КАУН.Номенклатура = СпрВариантыКомплектацииНоменклатуры.Владелец)
//	|			И (КАУН.Характеристика = СпрВариантыКомплектацииНоменклатуры.Характеристика)
//	|ГДЕ
//	|	ТоварыО.Период МЕЖДУ &ДатаНачалаОбщая1 И &ДатаОкончания1
//	|	И ТоварыО.Активность = ИСТИНА
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ТоварыО.Период,
//	|	ТоварыО.Регистратор,
//	|	ТоварыО.АналитикаУчетаНоменклатуры,
//	|	КАУН.Номенклатура,
//	|	СпрНоменклатура.Родитель,
//	|	СпрНоменклатура.ЕдиницаИзмерения,
//	|	КАУН.Характеристика,
//	|	КАУН.Серия,
//	|	КАУН.Назначение,
//	|	КАУН.СкладскаяТерритория,
//	|	ТоварыО.ХозяйственнаяОперация,
//	|	ТоварыО.СтатьяРасходов,
//	|	ТоварыО.ВидДвижения,
//	|	СпрНоменклатура.ВидНоменклатуры,
//	|	СпрВидыНоменклатуры.ПолитикаУчетаСерий,
//	|	СпрПолитикиУчетаСерий.ТипПолитики,
//	|	ТоварыО.ВидЗапасов//,
//	//|	ТоварыО.НомерГТД
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Регистратор,
//	|	КлючАналитикиУчетаНоменклатуры,
//	|	Номенклатура,
//	|	Характеристика,
//	|	Серия,
//	|	Назначение,
//	|	Склад
//	|;          
//	| 	
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	Товары.Период КАК Период,
//	|	Товары.Регистратор КАК Регистратор,
//	|	Товары.КлючАналитикиУчетаНоменклатуры КАК КлючАналитикиУчетаНоменклатуры,
//	|	Товары.Номенклатура КАК Номенклатура,
//	|	Товары.РодительНоменклатуры КАК РодительНоменклатуры,
//	|	Товары.Характеристика КАК Характеристика,
//	|	Товары.Серия КАК Серия,
//	|	Товары.Назначение КАК Назначение,
//	|	Товары.Склад КАК Склад,
//	|	Товары.ВидНоменклатуры КАК ВидНоменклатуры,
//	|	Товары.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
//	|	Товары.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
//	|	Товары.ВидЗапасов КАК ВидЗапасов,
//	//|	Товары.НомерГТД КАК НомерГТД,
//	|	Товары.КоличествоВариантовКомплектацииНоменклатуры КАК КоличествоВариантовКомплектацииНоменклатуры
//	|ПОМЕСТИТЬ ВыпускОбщийИНеГП1
//	|ИЗ
//	|	ТоварыО КАК Товары
//	|ГДЕ
//	|	Товары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
//	|	И Товары.ХозяйственнаяОперация = &СборкаИзКомплектующих
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Регистратор,
//	|	КлючАналитикиУчетаНоменклатуры,
//	|	Номенклатура,
//	|	Характеристика,
//	|	Серия,
//	|	Назначение,
//	|	Склад
//	|;
//	|
//	
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	Товары.Период КАК Период,
//	|	Товары.Регистратор КАК ДокументСборки,
//	|	Выпуск.КлючАналитикиУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//	|	Выпуск.РодительНоменклатуры КАК РодительНоменклатуры,
//	|	Товары.Номенклатура КАК Номенклатура,
//	|	Товары.Характеристика КАК Характеристика,
//	|	Товары.Назначение КАК Назначение,
//	|	Товары.Склад КАК Склад,
//	|	Товары.Помещение КАК Помещение,
//	|	Товары.Серия КАК Серия,
//	|	Выпуск.ВидНоменклатуры КАК ВидНоменклатуры,
//	|	Выпуск.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
//	|	Выпуск.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
//	|	Выпуск.ВидЗапасов КАК ВидЗапасов,
//	//|	Выпуск.НомерГТД КАК НомерГТД,
//	|	СУММА(Товары.ВНаличииПриход) КАК Количество,
//	|	СУММА(Товары.ВНаличииПриход) КАК КоличествоУпаковок,
//	|	СУММА(Выпуск.КоличествоВариантовКомплектацииНоменклатуры) КАК КоличествоВариантовКомплектацииНоменклатуры
//	|ПОМЕСТИТЬ ВыпускОбщийИНеГП2
//	|ИЗ
//	|	РегистрНакопления.ТоварыНаСкладах.Обороты(
//	|			&ДатаНачалаОбщая,
//	|			&ДатаОкончания,
//	|			Регистратор,
//	|			(Номенклатура, Характеристика, Назначение, Склад) В     //, Серия
//	|				(ВЫБРАТЬ
//	|					Т.Номенклатура,
//	|					Т.Характеристика,
//	|					Т.Назначение,
//	|					Т.Склад	//,
//	|					//Т.Серия
//	|				ИЗ
//	|					ВыпускОбщийИНеГП1 КАК Т)) КАК Товары
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыпускОбщийИНеГП1 КАК Выпуск
//	|		ПО Товары.Регистратор = Выпуск.Регистратор
//	|			И Товары.Номенклатура = Выпуск.Номенклатура
//	|			И Товары.Характеристика = Выпуск.Характеристика
//	|			И Товары.Назначение = Выпуск.Назначение
//	|			И Товары.Склад = Выпуск.Склад
//	|			И (ВЫБОР КОГДА Выпуск.ТипПолитикиУчетаСерий = ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.УчетСебестоимостиПоСериям) ТОГДА
//	|				Товары.Серия = Выпуск.Серия ИНАЧЕ ИСТИНА КОНЕЦ)
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	Товары.Период,
//	|	Товары.Назначение,
//	|	Товары.Склад,
//	|	Товары.Номенклатура,
//	|	Выпуск.КлючАналитикиУчетаНоменклатуры,
//	|	Выпуск.РодительНоменклатуры,
//	|	Товары.Регистратор,
//	|	Товары.Характеристика,
//	|	Товары.Серия,
//	|	Товары.Помещение,
//	|	Выпуск.ВидНоменклатуры,
//	|	Выпуск.ПолитикаУчетаСерий,
//	|	Выпуск.ТипПолитикиУчетаСерий,
//	|	Выпуск.ВидЗапасов//,
//	//|	Выпуск.НомерГТД
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|УНИЧТОЖИТЬ ВыпускОбщийИНеГП1
//	|; 
//	|
//	//|////////////////////////////////////////////////////////////////////////////////
//	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	//|	Товары.Период КАК Период,
//	//|	Товары.Регистратор КАК Регистратор,
//	//|	Товары.КлючАналитикиУчетаНоменклатуры КАК КлючАналитикиУчетаНоменклатуры,
//	//|	Товары.Номенклатура КАК Номенклатура,
//	//|	Товары.РодительНоменклатуры КАК РодительНоменклатуры,
//	//|	Товары.Характеристика КАК Характеристика,
//	//|	Товары.Серия КАК Серия,
//	//|	Товары.Назначение КАК Назначение,
//	//|	Товары.Склад КАК Склад,
//	//|	Товары.ВидНоменклатуры КАК ВидНоменклатуры,
//	//|	Товары.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
//	//|	Товары.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
//	//|	Товары.ВидЗапасов КАК ВидЗапасов,
//	//|	Товары.НомерГТД КАК НомерГТД,
//	//|	Товары.КоличествоВариантовКомплектацииНоменклатуры КАК КоличествоВариантовКомплектацииНоменклатуры
//	//|ПОМЕСТИТЬ ВыпускОбщий
//	//|ИЗ
//	//|	ТоварыО КАК Товары    
//	//|ГДЕ
//	//|	Товары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
//	//|	И Товары.ХозяйственнаяОперация = &СборкаИзКомплектующих 
//	//|	И Товары.РодительНоменклатуры = &ГотоваяПродукция
//	//|
//	//|ИНДЕКСИРОВАТЬ ПО
//	//|	Регистратор,
//	//|	КлючАналитикиУчетаНоменклатуры,
//	//|	Номенклатура,
//	//|	Характеристика,
//	//|	Серия,
//	//|	Назначение,
//	//|	Склад
//	//|;
//	//|
//	//|////////////////////////////////////////////////////////////////////////////////
//	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	//|	Товары.Период КАК Период,
//	//|	Товары.Регистратор КАК Регистратор,
//	//|	Товары.КлючАналитикиУчетаНоменклатуры КАК КлючАналитикиУчетаНоменклатуры,
//	//|	Товары.Номенклатура КАК Номенклатура,
//	//|	Товары.РодительНоменклатуры КАК РодительНоменклатуры,
//	//|	Товары.Характеристика КАК Характеристика,
//	//|	Товары.Серия КАК Серия,
//	//|	Товары.Назначение КАК Назначение,
//	//|	Товары.Склад КАК Склад,
//	//|	Товары.ВидНоменклатуры КАК ВидНоменклатуры,
//	//|	Товары.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
//	//|	Товары.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
//	//|	Товары.ВидЗапасов КАК ВидЗапасов,
//	//|	Товары.НомерГТД КАК НомерГТД,
//	//|	Товары.КоличествоВариантовКомплектацииНоменклатуры КАК КоличествоВариантовКомплектацииНоменклатуры
//	//|ПОМЕСТИТЬ Выпуск
//	//|ИЗ
//	//|	ВыпускОбщий КАК Товары
//	//|ГДЕ
//	//|	НЕ Товары.Период < &ДатаНачала1
//	//|
//	//|ИНДЕКСИРОВАТЬ ПО
//	//|	Регистратор,
//	//|	КлючАналитикиУчетаНоменклатуры,
//	//|	Номенклатура,
//	//|	Характеристика,
//	//|	Серия,
//	//|	Назначение,
//	//|	Склад
//	//|;
//	//|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	Товары.Период КАК Период,
//	|	Товары.Регистратор КАК Регистратор,
//	|	Товары.КлючАналитикиУчетаНоменклатуры КАК КлючАналитикиУчетаНоменклатуры,
//	|	Товары.Номенклатура КАК Номенклатура,
//	|	Товары.РодительНоменклатуры КАК РодительНоменклатуры,
//	|	Товары.Характеристика КАК Характеристика,
//	|	Товары.Серия КАК Серия,
//	|	Товары.Назначение КАК Назначение,
//	|	Товары.Склад КАК Склад,
//	|	Товары.ВидНоменклатуры КАК ВидНоменклатуры,
//	|	Товары.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
//	|	Товары.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
//	|	Товары.ВидЗапасов КАК ВидЗапасов,
//	//|	Товары.НомерГТД КАК НомерГТД,
//	|	Товары.КоличествоВариантовКомплектацииНоменклатуры КАК КоличествоВариантовКомплектацииНоменклатуры
//	|ПОМЕСТИТЬ Выпуск
//	|ИЗ
//	|	ТоварыО КАК Товары
//	|ГДЕ
//	|	НЕ Товары.Период < &ДатаНачала1
//	|	И Товары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
//	|	И Товары.ХозяйственнаяОперация = &СборкаИзКомплектующих 
//	|	И Товары.РодительНоменклатуры = &ГотоваяПродукция
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Регистратор,
//	|	КлючАналитикиУчетаНоменклатуры,
//	|	Номенклатура,
//	|	Характеристика,
//	|	Серия,
//	|	Назначение,
//	|	Склад
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////

//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	Товары.Регистратор КАК Регистратор,
//	|	Товары.КлючАналитикиУчетаНоменклатуры КАК КлючАналитикиУчетаНоменклатуры,
//	|	Товары.Номенклатура КАК Номенклатура,
//	|	Товары.РодительНоменклатуры КАК РодительНоменклатуры,
//	|	Товары.Характеристика КАК Характеристика,
//	|	Товары.Серия КАК Серия,
//	|	Товары.Назначение КАК Назначение,
//	|	Товары.СтатьяРасходов КАК СтатьяРасходов,
//	|	Товары.Склад КАК Склад,
//	|	Товары.ВидНоменклатуры КАК ВидНоменклатуры,
//	|	Товары.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
//	|	Товары.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
//	|	Товары.ВидЗапасов КАК ВидЗапасов,
//	//|	Товары.НомерГТД КАК НомерГТД,
//	|	Товары.КоличествоВариантовКомплектацииНоменклатуры КАК КоличествоВариантовКомплектацииНоменклатуры
//	|ПОМЕСТИТЬ Списание0
//	|ИЗ
//	|	ТоварыО КАК Товары
//	|ГДЕ
//	|	НЕ Товары.Период < &ДатаНачала1
//	|	И Товары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
//	|	И (Товары.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
//	|			ИЛИ ТИПЗНАЧЕНИЯ(Товары.Регистратор) = ТИП(Документ.ВнутреннееПотребление)
//	|				И Товары.СтатьяРасходов В (&ДопизготовлениеПроизводство))
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Регистратор,
//	|	КлючАналитикиУчетаНоменклатуры,
//	|	Номенклатура,
//	|	Характеристика,
//	|	Серия,
//	|	Назначение,
//	|	Склад
//	|;
//	|
//	
//	|
//	|////////////////////////////////////////////////////////////////////////////////

//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	Товары.Регистратор КАК Регистратор,
//	|	Товары.КлючАналитикиУчетаНоменклатуры КАК КлючАналитикиУчетаНоменклатуры,
//	|	Товары.Номенклатура КАК Номенклатура,
//	|	Товары.РодительНоменклатуры КАК РодительНоменклатуры,
//	|	Товары.Характеристика КАК Характеристика,
//	|	Товары.Серия КАК Серия,
//	|	Товары.Назначение КАК Назначение,
//	|	Товары.СтатьяРасходов КАК СтатьяРасходов,
//	|	Товары.Склад КАК Склад,
//	|	Товары.ВидНоменклатуры КАК ВидНоменклатуры,
//	|	Товары.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
//	|	Товары.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
//	|	Товары.ВидЗапасов КАК ВидЗапасов,
//	//|	Товары.НомерГТД КАК НомерГТД,
//	|	Товары.КоличествоВариантовКомплектацииНоменклатуры КАК КоличествоВариантовКомплектацииНоменклатуры
//	|ПОМЕСТИТЬ Списание
//	|ИЗ
//	|	Списание0 КАК Товары
//	//|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СборкаТоваров КАК Сборка
//	//|		ПО ВЫРАЗИТЬ(Товары.ДокРег КАК Документ.СборкаТоваров) = Сборка.Ссылка
//	//|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
//	//|		ПО Сборка.Номенклатура = СпрНоменклатура.Ссылка
//	|ГДЕ  Товары.Регистратор В(ВЫБРАТЬ РАЗЛИЧНЫЕ Т.Регистратор ИЗ Выпуск КАК Т)
//	// включить условие списания на ГП
//	//|	СпрНоменклатура.Родитель = &ГотоваяПродукция
//	|	
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	Товары.Регистратор КАК Регистратор,
//	|	Товары.КлючАналитикиУчетаНоменклатуры КАК КлючАналитикиУчетаНоменклатуры,
//	|	Товары.Номенклатура КАК Номенклатура,
//	|	Товары.РодительНоменклатуры КАК РодительНоменклатуры,
//	|	Товары.Характеристика КАК Характеристика,
//	|	Товары.Серия КАК Серия,
//	|	Товары.Назначение КАК Назначение,
//	|	Товары.СтатьяРасходов КАК СтатьяРасходов,
//	|	Товары.Склад КАК Склад,
//	|	Товары.ВидНоменклатуры КАК ВидНоменклатуры,
//	|	Товары.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
//	|	Товары.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
//	|	Товары.ВидЗапасов КАК ВидЗапасов,
//	//|	Товары.НомерГТД КАК НомерГТД,
//	|	Товары.КоличествоВариантовКомплектацииНоменклатуры КАК КоличествоВариантовКомплектацииНоменклатуры
//	|ИЗ
//	|	Списание0 КАК Товары
//	|ГДЕ
//	|	ТИПЗНАЧЕНИЯ(Товары.Регистратор) = ТИП(Документ.ВнутреннееПотребление)
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Регистратор,
//	|	КлючАналитикиУчетаНоменклатуры,
//	|	Номенклатура,
//	|	Характеристика,
//	|	Серия,
//	|	Назначение,
//	|	Склад
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|УНИЧТОЖИТЬ Списание0
//	|;
//	
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	Товары.Период КАК Период,
//	|	Товары.Регистратор КАК Регистратор,
//	|	Товары.КлючАналитикиУчетаНоменклатуры КАК КлючАналитикиУчетаНоменклатуры,
//	|	Товары.Номенклатура КАК Номенклатура,
//	|	Товары.РодительНоменклатуры КАК РодительНоменклатуры,
//	|	Товары.Характеристика КАК Характеристика,
//	|	Товары.Серия КАК Серия,
//	|	Товары.Назначение КАК Назначение,
//	|	Товары.Склад КАК Склад,
//	|	Товары.ВидНоменклатуры КАК ВидНоменклатуры,
//	|	Товары.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
//	|	Товары.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
//	|	Товары.ВидЗапасов КАК ВидЗапасов,
//	//|	Товары.НомерГТД КАК НомерГТД,
//	|	Товары.КоличествоВариантовКомплектацииНоменклатуры КАК КоличествоВариантовКомплектацииНоменклатуры
//	|ПОМЕСТИТЬ ПродажаО
//	|ИЗ
//	|	ТоварыО КАК Товары
//	|ГДЕ
//	|	НЕ Товары.Период < &ДатаНачала1
//	|	И Товары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
//	|	И Товары.ХозяйственнаяОперация В(ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности),
//	|									 ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияВРозницу),
//	|									 ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту),
//	|									 ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиентуРеглУчет),
//	|									 ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКомиссионногоТовара))
//	|	И НЕ Товары.РодительНоменклатуры = &ГотоваяПродукция
//	|	И ЕСТЬNULL(Товары.КоличествоВариантовКомплектацииНоменклатуры,0) > 0
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Регистратор,
//	|	КлючАналитикиУчетаНоменклатуры,
//	|	Номенклатура,
//	|	Характеристика,
//	|	Серия,
//	|	Назначение,
//	|	Склад
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	Товары.Регистратор КАК ДокументСборки,
//	|	Продажа.КлючАналитикиУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//	|	Продажа.РодительНоменклатуры КАК РодительНоменклатуры,
//	|	Товары.Номенклатура КАК Номенклатура,
//	|	Товары.Характеристика КАК Характеристика,
//	|	Товары.Назначение КАК Назначение,
//	|	Товары.Склад КАК Склад,
//	|	Товары.Помещение КАК Помещение,
//	|	Товары.Серия КАК Серия,
//	|	Продажа.ВидНоменклатуры КАК ВидНоменклатуры,
//	|	Продажа.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
//	|	Продажа.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
//	|	Продажа.ВидЗапасов КАК ВидЗапасов,
//	//|	Продажа.НомерГТД КАК НомерГТД,
//	|	СУММА(Товары.ВНаличииРасход) КАК Количество,
//	|	СУММА(Товары.ВНаличииРасход) КАК КоличествоУпаковок,
//	|	СУММА(Продажа.КоличествоВариантовКомплектацииНоменклатуры) КАК КоличествоВариантовКомплектацииНоменклатуры
//	|ПОМЕСТИТЬ Продажа
//	|ИЗ
//	|	РегистрНакопления.ТоварыНаСкладах.Обороты(
//	|			&ДатаНачала,
//	|			&ДатаОкончания,
//	|			Регистратор,
//	|			(Номенклатура, Характеристика, Назначение, Склад) В     //, Серия
//	|				(ВЫБРАТЬ
//	|					Т.Номенклатура,
//	|					Т.Характеристика,
//	|					Т.Назначение,
//	|					Т.Склад	//,
//	|					//Т.Серия
//	|				ИЗ
//	|					ПродажаО КАК Т)) КАК Товары
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПродажаО КАК Продажа
//	|		ПО Товары.Регистратор = Продажа.Регистратор
//	|			И Товары.Номенклатура = Продажа.Номенклатура
//	|			И Товары.Характеристика = Продажа.Характеристика
//	|			И Товары.Назначение = Продажа.Назначение
//	|			И Товары.Склад = Продажа.Склад
//	|			И (ВЫБОР КОГДА Продажа.ТипПолитикиУчетаСерий = ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.УчетСебестоимостиПоСериям) ТОГДА
//	|				Товары.Серия = Продажа.Серия ИНАЧЕ ИСТИНА КОНЕЦ)
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	Товары.Назначение,
//	|	Товары.Склад,
//	|	Товары.Номенклатура,
//	|	Продажа.КлючАналитикиУчетаНоменклатуры,
//	|	Продажа.РодительНоменклатуры,
//	|	Товары.Регистратор,
//	|	Товары.Характеристика,
//	|	Товары.Серия,
//	|	Товары.Помещение,
//	|	Продажа.ВидНоменклатуры,
//	|	Продажа.ПолитикаУчетаСерий,
//	|	Продажа.ТипПолитикиУчетаСерий,
//	|	Продажа.ВидЗапасов//,
//	//|	Продажа.НомерГТД
//	|;
//	|////////////////////////////////////////////////////////////////////////////////
//	|УНИЧТОЖИТЬ ПродажаО
//	|; 
//	|  
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	МАКСИМУМ(ВыпускОбщийИНеГП2.Период) КАК Период,
//	//|	ВыпускОбщийИНеГП2.ДокументСборки КАК ДокументСборки,
//	//|	ВыпускОбщийИНеГП2.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//	//|	ВыпускОбщийИНеГП2.РодительНоменклатуры КАК РодительНоменклатуры,
//	|	ВыпускОбщийИНеГП2.Номенклатура КАК Номенклатура,
//	|	ВыпускОбщийИНеГП2.Характеристика КАК Характеристика,
//	|	ВыпускОбщийИНеГП2.Назначение КАК Назначение,
//	//|	ВыпускОбщийИНеГП2.Склад КАК Склад,
//	//|	ВыпускОбщийИНеГП2.Помещение КАК Помещение,
//	|	ВыпускОбщийИНеГП2.Серия КАК Серия	//,
//	//|	ВыпускОбщийИНеГП2.ВидНоменклатуры КАК ВидНоменклатуры,
//	//|	ВыпускОбщийИНеГП2.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
//	//|	ВыпускОбщийИНеГП2.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
//	//|	ВыпускОбщийИНеГП2.ВидЗапасов КАК ВидЗапасов,
//	//|	ВыпускОбщийИНеГП2.НомерГТД КАК НомерГТД
//	|ПОМЕСТИТЬ ПродажаСборкаО
//	|ИЗ
//	|	Продажа КАК Продажа
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыпускОбщийИНеГП2 КАК ВыпускОбщийИНеГП2
//	|		ПО Продажа.Номенклатура = ВыпускОбщийИНеГП2.Номенклатура
//	|			И Продажа.Характеристика = ВыпускОбщийИНеГП2.Характеристика
//	|			И Продажа.Назначение = ВыпускОбщийИНеГП2.Назначение
//	//|			И Продажа.Склад = ВыпускОбщийИНеГП2.Склад
//	|			И Продажа.Серия = ВыпускОбщийИНеГП2.Серия
//	|
//	|СГРУППИРОВАТЬ ПО
//	//|	ВыпускОбщийИНеГП2.ДокументСборки,
//	//|	ВыпускОбщийИНеГП2.АналитикаУчетаНоменклатуры,
//	//|	ВыпускОбщийИНеГП2.РодительНоменклатуры,
//	|	ВыпускОбщийИНеГП2.Номенклатура,
//	|	ВыпускОбщийИНеГП2.Характеристика,
//	|	ВыпускОбщийИНеГП2.Назначение,
//	//|	ВыпускОбщийИНеГП2.Склад,
//	//|	ВыпускОбщийИНеГП2.Помещение,
//	|	ВыпускОбщийИНеГП2.Серия	//,
//	//|	ВыпускОбщийИНеГП2.ВидНоменклатуры,
//	//|	ВыпускОбщийИНеГП2.ПолитикаУчетаСерий,
//	//|	ВыпускОбщийИНеГП2.ТипПолитикиУчетаСерий,
//	//|	ВыпускОбщийИНеГП2.ВидЗапасов,
//	//|	ВыпускОбщийИНеГП2.НомерГТД
//	|;
//	|
//	
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ВыпускОбщийИНеГП2.ДокументСборки КАК ДокументСборки	//,
//	//|	ВыпускОбщийИНеГП2.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//	//|	ВыпускОбщийИНеГП2.РодительНоменклатуры КАК РодительНоменклатуры,
//	//|	ВыпускОбщийИНеГП2.Номенклатура КАК Номенклатура,
//	//|	ВыпускОбщийИНеГП2.Характеристика КАК Характеристика,
//	//|	ВыпускОбщийИНеГП2.Назначение КАК Назначение,
//	//|	ВыпускОбщийИНеГП2.Склад КАК Склад,
//	//|	ВыпускОбщийИНеГП2.Помещение КАК Помещение,
//	//|	ВыпускОбщийИНеГП2.Серия КАК Серия,
//	//|	ВыпускОбщийИНеГП2.ВидНоменклатуры КАК ВидНоменклатуры,
//	//|	ВыпускОбщийИНеГП2.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
//	//|	ВыпускОбщийИНеГП2.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
//	//|	ВыпускОбщийИНеГП2.ВидЗапасов КАК ВидЗапасов,
//	//|	ВыпускОбщийИНеГП2.НомерГТД КАК НомерГТД,
//	//|	СУММА(ВыпускОбщийИНеГП2.Количество) КАК Количество,
//	//|	СУММА(ВыпускОбщийИНеГП2.КоличествоУпаковок) КАК КоличествоУпаковок,
//	//|	СУММА(ВыпускОбщийИНеГП2.КоличествоВариантовКомплектацииНоменклатуры) КАК КоличествоВариантовКомплектацииНоменклатуры
//	|ПОМЕСТИТЬ ПродажаСборка
//	|ИЗ
//	|	ПродажаСборкаО КАК ПродажаСборкаО
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыпускОбщийИНеГП2 КАК ВыпускОбщийИНеГП2
//	|		ПО ПродажаСборкаО.Период = ВыпускОбщийИНеГП2.Период
//	//|			И ПродажаСборкаО.ДокументСборки = ВыпускОбщийИНеГП2.ДокументСборки
//	//|			И ПродажаСборкаО.АналитикаУчетаНоменклатуры = ВыпускОбщийИНеГП2.АналитикаУчетаНоменклатуры
//	|			И ПродажаСборкаО.Номенклатура = ВыпускОбщийИНеГП2.Номенклатура
//	|			И ПродажаСборкаО.Характеристика = ВыпускОбщийИНеГП2.Характеристика
//	|			И ПродажаСборкаО.Назначение = ВыпускОбщийИНеГП2.Назначение
//	//|			И ПродажаСборкаО.Склад = ВыпускОбщийИНеГП2.Склад
//	|			И ПродажаСборкаО.Серия = ВыпускОбщийИНеГП2.Серия
//	|
//	//|СГРУППИРОВАТЬ ПО
//	//|	ВыпускОбщийИНеГП2.ДокументСборки,
//	//|	ВыпускОбщийИНеГП2.АналитикаУчетаНоменклатуры,
//	//|	ВыпускОбщийИНеГП2.РодительНоменклатуры,
//	//|	ВыпускОбщийИНеГП2.Номенклатура,
//	//|	ВыпускОбщийИНеГП2.Характеристика,
//	//|	ВыпускОбщийИНеГП2.Назначение,
//	//|	ВыпускОбщийИНеГП2.Склад,
//	//|	ВыпускОбщийИНеГП2.Помещение,
//	//|	ВыпускОбщийИНеГП2.Серия,
//	//|	ВыпускОбщийИНеГП2.ВидНоменклатуры,
//	//|	ВыпускОбщийИНеГП2.ПолитикаУчетаСерий,
//	//|	ВыпускОбщийИНеГП2.ТипПолитикиУчетаСерий,
//	//|	ВыпускОбщийИНеГП2.ВидЗапасов,
//	//|	ВыпускОбщийИНеГП2.НомерГТД
//	
//	|
//	|; 
//	|////////////////////////////////////////////////////////////////////////////////
//	|УНИЧТОЖИТЬ ПродажаСборкаО
//	|; 
//	|
//	
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	Товары.Регистратор КАК Регистратор,
//	|	Товары.КлючАналитикиУчетаНоменклатуры КАК КлючАналитикиУчетаНоменклатуры,
//	|	Товары.Номенклатура КАК Номенклатура,
//	|	Товары.РодительНоменклатуры КАК РодительНоменклатуры,
//	|	Товары.Характеристика КАК Характеристика,
//	|	Товары.Серия КАК Серия,
//	|	Товары.Назначение КАК Назначение,
//	|	Товары.СтатьяРасходов КАК СтатьяРасходов,
//	|	Товары.Склад КАК Склад,
//	|	Товары.ВидНоменклатуры КАК ВидНоменклатуры,
//	|	Товары.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
//	|	Товары.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
//	|	Товары.ВидЗапасов КАК ВидЗапасов,
//	//|	Товары.НомерГТД КАК НомерГТД,
//	|	Товары.КоличествоВариантовКомплектацииНоменклатуры КАК КоличествоВариантовКомплектацииНоменклатуры
//	|ПОМЕСТИТЬ СписаниеПродажа
//	|ИЗ
//	|	ТоварыО КАК Товары
//	|ГДЕ
//	//|	НЕ Товары.Период < &ДатаНачала1
//	|	Товары.Регистратор В(ВЫБРАТЬ РАЗЛИЧНЫЕ Т.ДокументСборки ИЗ ПродажаСборка КАК Т)
//	|	И Товары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
//	|	И (Товары.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
//	|			ИЛИ ТИПЗНАЧЕНИЯ(Товары.Регистратор) = ТИП(Документ.ВнутреннееПотребление)
//	|				И Товары.СтатьяРасходов В (&ДопизготовлениеПроизводство))
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Регистратор,
//	|	КлючАналитикиУчетаНоменклатуры,
//	|	Номенклатура,
//	|	Характеристика,
//	|	Серия,
//	|	Назначение,
//	|	Склад
//	|;
//	|

//	|////////////////////////////////////////////////////////////////////////////////
//	|УНИЧТОЖИТЬ ПродажаСборка
//	|; 
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
//	|	ТаблицаТоваров.Характеристика КАК Характеристика,
//	|	ЦеныНоменклатурыСрезПоследних.Цена / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) * ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки2, 1) * ВЫБОР
//	|		КОГДА &Валюта <> ЦеныНоменклатурыСрезПоследних.Валюта
//	|			ТОГДА ВЫБОР
//	|					КОГДА ЕСТЬNULL(КурсыВалютыЦены.КурсЗнаменатель, 0) > 0
//	|							И ЕСТЬNULL(КурсыВалютыЦены.КурсЧислитель, 0) > 0
//	|							И ЕСТЬNULL(КурсыВалюты.КурсЗнаменатель, 0) > 0
//	|							И ЕСТЬNULL(КурсыВалюты.КурсЧислитель, 0) > 0
//	|						ТОГДА КурсыВалютыЦены.КурсЧислитель * КурсыВалюты.КурсЗнаменатель / (КурсыВалюты.КурсЧислитель * КурсыВалютыЦены.КурсЗнаменатель)
//	|					ИНАЧЕ 0
//	|				КОНЕЦ
//	|		ИНАЧЕ 1
//	|	КОНЕЦ КАК Цена
//	|ПОМЕСТИТЬ ЦеныНомХарактеристик
//	|ИЗ
//	|	ТоварыО КАК ТаблицаТоваров
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
//	|				&ДатаОкончания,
//	|				ВидЦены = &ВидЦены
//	|					И Номенклатура В
//	|						(ВЫБРАТЬ
//	|							ТоварыО.Номенклатура
//	|						ИЗ
//	|							ТоварыО КАК ТоварыО)
//	|					И (Характеристика В
//	|							(ВЫБРАТЬ
//	|								ТоварыО.Характеристика
//	|							ИЗ
//	|								ТоварыО КАК ТоварыО)
//	|						ИЛИ Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))) КАК ЦеныНоменклатурыСрезПоследних
//	|		ПО ТаблицаТоваров.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
//	|			И ТаблицаТоваров.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&ДатаОкончания, БазоваяВалюта = &БазоваяВалюта) КАК КурсыВалютыЦены
//	|		ПО (ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютыЦены.Валюта)
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&ДатаОкончания, Валюта = &Валюта И БазоваяВалюта = &БазоваяВалюта) КАК КурсыВалюты
//	|		ПО (ИСТИНА)
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	
//	|УНИЧТОЖИТЬ ТоварыО
//	|; 
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	Товары.Регистратор КАК ДокументСборки,
//	|	Выпуск.КлючАналитикиУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//	|	Выпуск.РодительНоменклатуры КАК РодительНоменклатуры,
//	|	Товары.Номенклатура КАК Номенклатура,
//	|	Товары.Характеристика КАК Характеристика,
//	|	Товары.Назначение КАК Назначение,
//	|	Товары.Склад КАК Склад,
//	|	Товары.Помещение КАК Помещение,
//	|	Товары.Серия КАК Серия,
//	|	Выпуск.ВидНоменклатуры КАК ВидНоменклатуры,
//	|	Выпуск.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
//	|	Выпуск.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
//	|	Выпуск.ВидЗапасов КАК ВидЗапасов,
//	//|	Выпуск.НомерГТД КАК НомерГТД,
//	|	СУММА(Товары.ВНаличииПриход) КАК Количество,
//	|	СУММА(Товары.ВНаличииПриход) КАК КоличествоУпаковок,
//	|	СУММА(Выпуск.КоличествоВариантовКомплектацииНоменклатуры) КАК КоличествоВариантовКомплектацииНоменклатуры
//	|ИЗ
//	|	РегистрНакопления.ТоварыНаСкладах.Обороты(
//	|			&ДатаНачала,
//	|			&ДатаОкончания,
//	|			Регистратор,
//	|			(Номенклатура, Характеристика, Назначение, Склад) В     //, Серия
//	|				(ВЫБРАТЬ
//	|					Т.Номенклатура,
//	|					Т.Характеристика,
//	|					Т.Назначение,
//	|					Т.Склад	//,
//	|					//Т.Серия
//	|				ИЗ
//	|					Выпуск КАК Т)) КАК Товары
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Выпуск КАК Выпуск
//	|		ПО Товары.Регистратор = Выпуск.Регистратор
//	|			И Товары.Номенклатура = Выпуск.Номенклатура
//	|			И Товары.Характеристика = Выпуск.Характеристика
//	|			И Товары.Назначение = Выпуск.Назначение
//	|			И Товары.Склад = Выпуск.Склад
//	|			И (ВЫБОР КОГДА Выпуск.ТипПолитикиУчетаСерий = ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.УчетСебестоимостиПоСериям) ТОГДА
//	|				Товары.Серия = Выпуск.Серия ИНАЧЕ ИСТИНА КОНЕЦ)
//	|           //И ложь
//	|СГРУППИРОВАТЬ ПО
//	|	Товары.Назначение,
//	|	Товары.Склад,
//	|	Товары.Номенклатура,
//	|	Выпуск.КлючАналитикиУчетаНоменклатуры,
//	|	Выпуск.РодительНоменклатуры,
//	|	Товары.Регистратор,
//	|	Товары.Характеристика,
//	|	Товары.Серия,
//	|	Товары.Помещение,
//	|	Выпуск.ВидНоменклатуры,
//	|	Выпуск.ПолитикаУчетаСерий,
//	|	Выпуск.ТипПолитикиУчетаСерий,
//	|	Выпуск.ВидЗапасов//,
//	//|	Выпуск.НомерГТД
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	Продажа.ДокументСборки КАК ДокументСборки,
//	|	Продажа.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//	|	Продажа.РодительНоменклатуры КАК РодительНоменклатуры,
//	|	Продажа.Номенклатура КАК Номенклатура,
//	|	Продажа.Характеристика КАК Характеристика,
//	|	Продажа.Назначение КАК Назначение,
//	|	Продажа.Склад КАК Склад,
//	|	Продажа.Помещение КАК Помещение,
//	|	Продажа.Серия КАК Серия,
//	|	Продажа.ВидНоменклатуры КАК ВидНоменклатуры,
//	|	Продажа.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
//	|	Продажа.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
//	|	Продажа.ВидЗапасов КАК ВидЗапасов,
//	//|	Продажа.НомерГТД КАК НомерГТД,
//	|	СУММА(Продажа.Количество) КАК Количество,
//	|	СУММА(Продажа.КоличествоУпаковок) КАК КоличествоУпаковок,
//	|	СУММА(Продажа.КоличествоВариантовКомплектацииНоменклатуры) КАК КоличествоВариантовКомплектацииНоменклатуры
//	|ИЗ
//	|	Продажа КАК Продажа
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	Продажа.ДокументСборки,
//	|	Продажа.АналитикаУчетаНоменклатуры,
//	|	Продажа.РодительНоменклатуры,
//	|	Продажа.Номенклатура,
//	|	Продажа.Характеристика,
//	|	Продажа.Назначение,
//	|	Продажа.Склад,
//	|	Продажа.Помещение,
//	|	Продажа.Серия,
//	|	Продажа.ВидНоменклатуры,
//	|	Продажа.ПолитикаУчетаСерий,
//	|	Продажа.ТипПолитикиУчетаСерий,
//	|	Продажа.ВидЗапасов//,
//	//|	Продажа.НомерГТД
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	//|ВЫБРАТЬ
//	//|	МАКСИМУМ(ВыпускОбщийИНеГП2.Период) КАК Период,
//	//|	ВыпускОбщийИНеГП2.ДокументСборки КАК ДокументСборки,
//	//|	ВыпускОбщийИНеГП2.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//	//|	ВыпускОбщийИНеГП2.РодительНоменклатуры КАК РодительНоменклатуры,
//	//|	ВыпускОбщийИНеГП2.Номенклатура КАК Номенклатура,
//	//|	ВыпускОбщийИНеГП2.Характеристика КАК Характеристика,
//	//|	ВыпускОбщийИНеГП2.Назначение КАК Назначение,
//	//|	ВыпускОбщийИНеГП2.Склад КАК Склад,
//	//|	ВыпускОбщийИНеГП2.Помещение КАК Помещение,
//	//|	ВыпускОбщийИНеГП2.Серия КАК Серия,
//	//|	ВыпускОбщийИНеГП2.ВидНоменклатуры КАК ВидНоменклатуры,
//	//|	ВыпускОбщийИНеГП2.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
//	//|	ВыпускОбщийИНеГП2.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
//	//|	ВыпускОбщийИНеГП2.ВидЗапасов КАК ВидЗапасов,
//	//|	ВыпускОбщийИНеГП2.НомерГТД КАК НомерГТД,
//	//|	СУММА(ВыпускОбщийИНеГП2.Количество) КАК Количество,
//	//|	СУММА(ВыпускОбщийИНеГП2.КоличествоУпаковок) КАК КоличествоУпаковок,
//	//|	СУММА(ВыпускОбщийИНеГП2.КоличествоВариантовКомплектацииНоменклатуры) КАК КоличествоВариантовКомплектацииНоменклатуры
//	//|ПОМЕСТИТЬ ПродажаСборка
//	//|ИЗ
//	//|	ПродажаСборкаО КАК ПродажаСборкаО
//	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВыпускОбщийИНеГП2 КАК ВыпускОбщийИНеГП2
//	//|		ПО ПродажаСборкаО.Период = ВыпускОбщийИНеГП2.Период
//	//|			И ПродажаСборкаО.ДокументСборки = ВыпускОбщийИНеГП2.ДокументСборки
//	//|			И ПродажаСборкаО.АналитикаУчетаНоменклатуры = ВыпускОбщийИНеГП2.АналитикаУчетаНоменклатуры
//	//|			И ПродажаСборкаО.Номенклатура = ВыпускОбщийИНеГП2.Номенклатура
//	//|			И ПродажаСборкаО.Характеристика = ВыпускОбщийИНеГП2.Характеристика
//	//|			И ПродажаСборкаО.Назначение = ВыпускОбщийИНеГП2.Назначение
//	//|			И ПродажаСборкаО.Склад = ВыпускОбщийИНеГП2.Склад
//	//|			И ПродажаСборкаО.Серия = ВыпускОбщийИНеГП2.Серия
//	//|
//	//|СГРУППИРОВАТЬ ПО
//	//|	ВыпускОбщийИНеГП2.ДокументСборки,
//	//|	ВыпускОбщийИНеГП2.АналитикаУчетаНоменклатуры,
//	//|	ВыпускОбщийИНеГП2.РодительНоменклатуры,
//	//|	ВыпускОбщийИНеГП2.Номенклатура,
//	//|	ВыпускОбщийИНеГП2.Характеристика,
//	//|	ВыпускОбщийИНеГП2.Назначение,
//	//|	ВыпускОбщийИНеГП2.Склад,
//	//|	ВыпускОбщийИНеГП2.Помещение,
//	//|	ВыпускОбщийИНеГП2.Серия,
//	//|	ВыпускОбщийИНеГП2.ВидНоменклатуры,
//	//|	ВыпускОбщийИНеГП2.ПолитикаУчетаСерий,
//	//|	ВыпускОбщийИНеГП2.ТипПолитикиУчетаСерий,
//	//|	ВыпускОбщийИНеГП2.ВидЗапасов,
//	//|	ВыпускОбщийИНеГП2.НомерГТД
//	//|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	Товары.Регистратор КАК ДокументСборки,
//	|	Списание.КлючАналитикиУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//	|	Списание.РодительНоменклатуры КАК РодительНоменклатуры,
//	|	Товары.Номенклатура КАК Номенклатура,
//	|	Товары.Характеристика КАК Характеристика,
//	|	Товары.Назначение КАК Назначение,
//	|	Товары.Склад КАК Склад,
//	|	Товары.Помещение КАК Помещение,
//	|	Товары.Серия КАК Серия,
//	|	Списание.ВидНоменклатуры КАК ВидНоменклатуры,
//	|	Списание.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
//	|	Списание.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
//	|	Списание.ВидЗапасов КАК ВидЗапасов,
//	//|	Списание.НомерГТД КАК НомерГТД,
//	|	СУММА(Товары.ВНаличииРасход) КАК Количество,
//	|	СУММА(Товары.ВНаличииРасход) КАК КоличествоУпаковок,
//	|	СУММА(Списание.КоличествоВариантовКомплектацииНоменклатуры) КАК КоличествоВариантовКомплектацииНоменклатуры,
//	|   МАКСИМУМ(ЦНХ.Цена) КАК Цена,
//	|	СУММА(Товары.ВНаличииРасход) * МАКСИМУМ(ЦНХ.Цена) КАК Сумма
//	|ИЗ
//	|	РегистрНакопления.ТоварыНаСкладах.Обороты(
//	|			&ДатаНачала,
//	|			&ДатаОкончания,
//	|			Регистратор,
//	|			(Номенклатура, Характеристика, Назначение, Склад) В   // , Серия
//	|				(ВЫБРАТЬ
//	|					Т.Номенклатура,
//	|					Т.Характеристика,
//	|					Т.Назначение,
//	|					Т.Склад	//,
//	|					//Т.Серия
//	|				ИЗ
//	|					Списание КАК Т)) КАК Товары
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Списание КАК Списание
//	|		ПО Товары.Регистратор = Списание.Регистратор
//	|			И Товары.Номенклатура = Списание.Номенклатура
//	|			И Товары.Характеристика = Списание.Характеристика
//	|			И Товары.Назначение = Списание.Назначение
//	|			И Товары.Склад = Списание.Склад
//	|			И (ВЫБОР КОГДА Списание.ТипПолитикиУчетаСерий = ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.УчетСебестоимостиПоСериям) ТОГДА
//	|				Товары.Серия = Списание.Серия ИНАЧЕ ИСТИНА КОНЕЦ)
//	|           //И ложь
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныНомХарактеристик КАК ЦНХ
//	|		ПО Товары.Номенклатура = ЦНХ.Номенклатура
//	|			И Товары.Характеристика = ЦНХ.Характеристика
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	Товары.Назначение,
//	|	Товары.Склад,
//	|	Товары.Номенклатура,
//	|	Списание.КлючАналитикиУчетаНоменклатуры,
//	|	Списание.РодительНоменклатуры,
//	|	Товары.Регистратор,
//	|	Товары.Характеристика,
//	|	Товары.Серия,
//	|	Товары.Помещение,
//	|	Списание.ВидНоменклатуры,
//	|	Списание.ПолитикаУчетаСерий,
//	|	Списание.ТипПолитикиУчетаСерий,
//	|	Списание.ВидЗапасов//,
//	//|	Списание.НомерГТД
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	Товары.Регистратор КАК ДокументСборки,
//	|	Списание.КлючАналитикиУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//	|	Списание.РодительНоменклатуры КАК РодительНоменклатуры,
//	|	Товары.Номенклатура КАК Номенклатура,
//	|	Товары.Характеристика КАК Характеристика,
//	|	Товары.Назначение КАК Назначение,
//	|	Товары.Склад КАК Склад,
//	|	Товары.Помещение КАК Помещение,
//	|	Товары.Серия КАК Серия,
//	|	Списание.ВидНоменклатуры КАК ВидНоменклатуры,
//	|	Списание.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,
//	|	Списание.ТипПолитикиУчетаСерий КАК ТипПолитикиУчетаСерий,
//	|	Списание.ВидЗапасов КАК ВидЗапасов,
//	//|	Списание.НомерГТД КАК НомерГТД,
//	|	СУММА(Товары.ВНаличииРасход) КАК Количество,
//	|	СУММА(Товары.ВНаличииРасход) КАК КоличествоУпаковок,
//	|	СУММА(Списание.КоличествоВариантовКомплектацииНоменклатуры) КАК КоличествоВариантовКомплектацииНоменклатуры,
//	|   МАКСИМУМ(ЦНХ.Цена) КАК Цена,
//	|	СУММА(Товары.ВНаличииРасход) * МАКСИМУМ(ЦНХ.Цена) КАК Сумма
//	|ИЗ
//	|	РегистрНакопления.ТоварыНаСкладах.Обороты(
//	|			&ДатаНачала,
//	|			&ДатаОкончания,
//	|			Регистратор,
//	|			(Номенклатура, Характеристика, Назначение, Склад) В   // , Серия
//	|				(ВЫБРАТЬ
//	|					Т.Номенклатура,
//	|					Т.Характеристика,
//	|					Т.Назначение,
//	|					Т.Склад	//,
//	|					//Т.Серия
//	|				ИЗ
//	|					СписаниеПродажа КАК Т)) КАК Товары
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписаниеПродажа КАК Списание
//	|		ПО Товары.Регистратор = Списание.Регистратор
//	|			И Товары.Номенклатура = Списание.Номенклатура
//	|			И Товары.Характеристика = Списание.Характеристика
//	|			И Товары.Назначение = Списание.Назначение
//	|			И Товары.Склад = Списание.Склад
//	|			И (ВЫБОР КОГДА Списание.ТипПолитикиУчетаСерий = ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.УчетСебестоимостиПоСериям) ТОГДА
//	|				Товары.Серия = Списание.Серия ИНАЧЕ ИСТИНА КОНЕЦ)
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныНомХарактеристик КАК ЦНХ
//	|		ПО Товары.Номенклатура = ЦНХ.Номенклатура
//	|			И Товары.Характеристика = ЦНХ.Характеристика
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	Товары.Назначение,
//	|	Товары.Склад,
//	|	Товары.Номенклатура,
//	|	Списание.КлючАналитикиУчетаНоменклатуры,
//	|	Списание.РодительНоменклатуры,
//	|	Товары.Регистратор,
//	|	Товары.Характеристика,
//	|	Товары.Серия,
//	|	Товары.Помещение,
//	|	Списание.ВидНоменклатуры,
//	|	Списание.ПолитикаУчетаСерий,
//	|	Списание.ТипПолитикиУчетаСерий,
//	|	Списание.ВидЗапасов//,
//	//|	Списание.НомерГТД
//	
//	|
//	|; 
//	|////////////////////////////////////////////////////////////////////////////////
//	|УНИЧТОЖИТЬ Продажа
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|УНИЧТОЖИТЬ Выпуск
//	|; 
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|УНИЧТОЖИТЬ Списание
//	|; 
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|УНИЧТОЖИТЬ ЦеныНомХарактеристик
//	|
//	|";
//	
//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
//			"&ТекстЗапросаКоэффициентУпаковки1",
//			Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
//			"ЦеныНоменклатурыСрезПоследних.Упаковка",
//			"ЦеныНоменклатурыСрезПоследних.Номенклатура"));
//			
//	ТекстЗапроса = СтрЗаменить(ТекстЗапроса,
//			"&ТекстЗапросаКоэффициентУпаковки2",
//			Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
//			"ТаблицаТоваров.ЕдиницаИзмерения",
//			"ТаблицаТоваров.Номенклатура"));
//			
//	Возврат ТекстЗапроса;
//	
//КонецФункции // ПолучитьТекстВыпускПродукцииЗатратыНаСборку()

////Процедура РазобратьТекущийНабор(ТаблицаПродукцииРазбор, Знач ПериодОтчетаНачало, Знач ПериодОтчетаКонец, Знач МассивУзловАИ, Знач ТабВыпускПродукцииОбщийИНеГП, Знач ГотоваяПродукция)

//Процедура РазобратьТекущийНабор(ТаблицаПродукцииРазбор, Знач ПериодОтчетаНачало, Знач ПериодОтчетаКонец, Знач МассивУзловАИ, ТабВыпускПродукцииОбщийИНеГП, Знач ГотоваяПродукция, Знач ВидЦены)


//	Для Каждого СтрокаТ Из ТаблицаПродукцииРазбор Цикл
//		
//		Струк = Новый Структура("Номенклатура,Характеристика,Серия",СтрокаТ.Номенклатура,СтрокаТ.Характеристика,СтрокаТ.Серия);
//		ТаблицаЗапросЭтоЭлемент = ТабВыпускПродукцииОбщийИНеГП.НайтиСтроки(Струк);
//		
//		Если СтрокаТ.РодительНоменклатуры = ГотоваяПродукция
//			или СтрокаТ.КоличествоВариантовКомплектацииНоменклатуры = 0 //Тогда
//			или ТаблицаЗапросЭтоЭлемент.Количество() = 0 Тогда
//			СтрокаТ.ЭтоЭлемент = ИСТИНА; 
//			//СтрокаТ.Обработано = ИСТИНА;
//			Продолжить;
//			
//		Иначе

//			//ЗапросРазборКомплекта = Новый Запрос("ВЫБРАТЬ
//			//|	Товары.Регистратор КАК ДокументСборки,
//			//|	Товары.Номенклатура КАК Номенклатура,
//			//|	Товары.Характеристика КАК Характеристика,
//			//|	Товары.Назначение КАК Назначение,
//			//|	Товары.Склад КАК Склад,
//			//|	Товары.Помещение КАК Помещение,
//			//|	Товары.Серия КАК Серия,
//			//|	ЕСТЬNULL(СУММА(&КоличествоКомплектов * Товары.ВНаличииРасход / &КоличествоКомплектовИсходное), 0) КАК Количество,
//			//|	ЕСТЬNULL(СУММА(&КоличествоКомплектов * Товары.ВНаличииРасход / &КоличествоКомплектовИсходное), 0) КАК КоличествоУпаковок,
//			//|	ТоварыО.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры
//			//|ИЗ
//			//|	РегистрНакопления.ТоварыНаСкладах.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК Товары
//			//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//			//|			ТоварыО.Регистратор КАК ДокументСборки,
//			//|			ТоварыО.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//			//|			КлючиА.Номенклатура КАК Номенклатура,
//			//|			КлючиА.Характеристика КАК Характеристика,
//			//|			КлючиА.Назначение КАК Назначение,
//			//|			КлючиА.СкладскаяТерритория КАК Склад,
//			//|			КлючиА.Серия КАК Серия
//			//|		ИЗ
//			//|			РегистрНакопления.ТоварыОрганизаций.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК ТоварыО
//			//|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиА
//			//|				ПО ТоварыО.АналитикаУчетаНоменклатуры = КлючиА.Ссылка
//			//|ГДЕ
//			//|	ТоварыО.Регистратор = &Регистратор
//			//|		
//			//|		СГРУППИРОВАТЬ ПО
//			//|			ТоварыО.Регистратор,
//			//|			КлючиА.Номенклатура,
//			//|			КлючиА.Характеристика,
//			//|			КлючиА.Назначение,
//			//|			КлючиА.СкладскаяТерритория,
//			//|			КлючиА.Серия,
//			//|			ТоварыО.АналитикаУчетаНоменклатуры) КАК ТоварыО
//			//|		ПО Товары.Регистратор = ТоварыО.ДокументСборки
//			//|			И Товары.Номенклатура = ТоварыО.Номенклатура
//			//|			И Товары.Характеристика = ТоварыО.Характеристика
//			//|			И Товары.Назначение = ТоварыО.Назначение
//			//|			И Товары.Склад = ТоварыО.Склад
//			//|			И (ВЫБОР КОГДА Товары.ТипПолитикиУчетаСерий = ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.УчетСебестоимостиПоСериям) ТОГДА
//			//|				Товары.Серия = ТоварыО.Серия ИНАЧЕ ИСТИНА КОНЕЦ)
//			//|ГДЕ
//			//|	Товары.Регистратор = &Регистратор
//			//|
//			//|СГРУППИРОВАТЬ ПО
//			//|	Товары.Назначение,
//			//|	Товары.Характеристика,
//			//|	Товары.Серия,
//			//|	Товары.Помещение,
//			//|	Товары.Склад,
//			//|	Товары.Регистратор,
//			//|	Товары.Номенклатура,
//			//|	ТоварыО.АналитикаУчетаНоменклатуры
//			//|
//			//|ИМЕЮЩИЕ
//			//|	ЕСТЬNULL(СУММА(&КоличествоКомплектов * Товары.ВНаличииРасход / &КоличествоКомплектовИсходное), 0) > 0");
//			
//			ЗапросРазборКомплекта = Новый Запрос("
//			
//			|ВЫБРАТЬ РАЗЛИЧНЫЕ
//			|	ТоварыО.Регистратор КАК ДокументСборки,
//			|	ТоварыО.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//			|	ТоварыО.ВидЗапасов КАК ВидЗапасов,   								// fix Suetin 8/29/2024 2:15:12 PM
//			|	Ном.ВидНоменклатуры КАК ВидНоменклатуры,                           	// fix Suetin 8/29/2024 2:16:46 PM
//			|	ВН.ПолитикаУчетаСерий КАК ПолитикаУчетаСерий,                       // fix Suetin 8/29/2024 2:23:24 PM
//			|	ПУС.ТипПолитики КАК ТипПолитикиУчетаСерий,                          // fix Suetin 8/29/2024 2:22:56 PM
//			|	КлючиА.Номенклатура КАК Номенклатура,
//			|	Ном.ЕдиницаИзмерения КАК ЕдиницаИзмерения, 
//			|	КлючиА.Характеристика КАК Характеристика,
//			|	КлючиА.Назначение КАК Назначение,
//			|	КлючиА.СкладскаяТерритория КАК Склад,
//			|	КлючиА.Серия КАК Серия
//			|ПОМЕСТИТЬ ТоварыОрганизицииО
//			|ИЗ
//			|	РегистрНакопления.ТоварыОрганизаций.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК ТоварыО
//			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиА
//			|		ПО ТоварыО.АналитикаУчетаНоменклатуры = КлючиА.Ссылка
//			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
//			|		ПО КлючиА.Номенклатура = Ном.Ссылка
//			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВН
//			|		ПО Ном.ВидНоменклатуры = ВН.Ссылка
//			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПолитикиУчетаСерий КАК ПУС
//			|		ПО ВН.ПолитикаУчетаСерий = ПУС.Ссылка
//			
//			|ГДЕ
//			|	ТоварыО.Регистратор = &Регистратор
//			|
//			|СГРУППИРОВАТЬ ПО
//			|	ТоварыО.Регистратор,
//			|	КлючиА.Номенклатура,
//			|	Ном.ЕдиницаИзмерения,
//			|	КлючиА.Характеристика,
//			|	КлючиА.Назначение,
//			|	КлючиА.СкладскаяТерритория,
//			|	КлючиА.Серия,
//			|	ТоварыО.АналитикаУчетаНоменклатуры,
//			|	ТоварыО.ВидЗапасов,   								// fix Suetin 8/29/2024 2:15:12 PM
//			|	Ном.ВидНоменклатуры,                           	// fix Suetin 8/29/2024 2:16:46 PM
//			|	ВН.ПолитикаУчетаСерий,                       // fix Suetin 8/29/2024 2:23:24 PM
//			|	ПУС.ТипПолитики                          // fix Suetin 8/29/2024 2:22:56 PM
//			|;
//			|
//			|////////////////////////////////////////////////////////////////////////////////
//			
//			|ВЫБРАТЬ РАЗЛИЧНЫЕ
//			|	ТаблицаТоваров.ДокументСборки				 КАК ДокументСборки,
//			|	ТаблицаТоваров.АналитикаУчетаНоменклатуры	 КАК АналитикаУчетаНоменклатуры,
//			|	ТаблицаТоваров.Номенклатура					 КАК Номенклатура,
//			|	ТаблицаТоваров.Характеристика				 КАК Характеристика,
//			|	ТаблицаТоваров.ВидЗапасов 					 КАК ВидЗапасов,   							// fix Suetin 8/29/2024 2:15:12 PM
//			|	ТаблицаТоваров.ВидНоменклатуры 				 КАК ВидНоменклатуры,                       // fix Suetin 8/29/2024 2:16:46 PM
//			|	ТаблицаТоваров.ПолитикаУчетаСерий 			 КАК ПолитикаУчетаСерий,                    // fix Suetin 8/29/2024 2:23:24 PM
//			|	ТаблицаТоваров.ТипПолитикиУчетаСерий 		 КАК ТипПолитикиУчетаСерий,                 // fix Suetin 8/29/2024 2:22:56 PM
//			|	ТаблицаТоваров.Назначение					 КАК Назначение,
//			|	ТаблицаТоваров.Склад						 КАК Склад,
//			|	ТаблицаТоваров.Серия						 КАК Серия,
//			|	ТаблицаТоваров.ЕдиницаИзмерения				 КАК ЕдиницаИзмерения,
//			|	ЦеныНоменклатурыСрезПоследних.Цена / ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки1, 1) * ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки2, 1) * ВЫБОР
//			|		КОГДА &Валюта <> ЦеныНоменклатурыСрезПоследних.Валюта
//			|			ТОГДА ВЫБОР
//			|					КОГДА ЕСТЬNULL(КурсыВалютыЦены.КурсЗнаменатель, 0) > 0
//			|							И ЕСТЬNULL(КурсыВалютыЦены.КурсЧислитель, 0) > 0
//			|							И ЕСТЬNULL(КурсыВалюты.КурсЗнаменатель, 0) > 0
//			|							И ЕСТЬNULL(КурсыВалюты.КурсЧислитель, 0) > 0
//			|						ТОГДА КурсыВалютыЦены.КурсЧислитель * КурсыВалюты.КурсЗнаменатель / (КурсыВалюты.КурсЧислитель * КурсыВалютыЦены.КурсЗнаменатель)
//			|					ИНАЧЕ 0
//			|				КОНЕЦ
//			|		ИНАЧЕ 1
//			|	КОНЕЦ КАК Цена
//			|ПОМЕСТИТЬ ТоварыОрганизиции
//			|ИЗ
//			|	ТоварыОрганизицииО КАК ТаблицаТоваров
//			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
//			|				&ДатаОкончанияО,
//			|				ВидЦены = &ВидЦены
//			|					И Номенклатура В
//			|						(ВЫБРАТЬ РАЗЛИЧНЫЕ
//			|							ТоварыО.Номенклатура
//			|						ИЗ
//			|							ТоварыОрганизицииО КАК ТоварыО)
//			|					И (Характеристика В
//			|							(ВЫБРАТЬ РАЗЛИЧНЫЕ
//			|								ТоварыО.Характеристика
//			|							ИЗ
//			|								ТоварыОрганизицииО КАК ТоварыО)
//			|						ИЛИ Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))) КАК ЦеныНоменклатурыСрезПоследних
//			|		ПО ТаблицаТоваров.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
//			|			И ТаблицаТоваров.Характеристика = ЦеныНоменклатурыСрезПоследних.Характеристика
//			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&ДатаОкончанияО, БазоваяВалюта = &БазоваяВалюта) КАК КурсыВалютыЦены
//			|		ПО (ЦеныНоменклатурыСрезПоследних.Валюта = КурсыВалютыЦены.Валюта)
//			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтносительныеКурсыВалют.СрезПоследних(&ДатаОкончанияО, Валюта = &Валюта И БазоваяВалюта = &БазоваяВалюта) КАК КурсыВалюты
//			|		ПО (ИСТИНА)
//			|
//			//|СГРУППИРОВАТЬ ПО
//			//|	ТаблицаТоваров.ДокументСборки,
//			//|	ТаблицаТоваров.Номенклатура,
//			//|	ТаблицаТоваров.ЕдиницаИзмерения,
//			//|	ТаблицаТоваров.Характеристика,
//			//|	ТаблицаТоваров.Назначение,
//			//|	ТаблицаТоваров.Склад,
//			//|	ТаблицаТоваров.Серия,
//			//|	ТаблицаТоваров.АналитикаУчетаНоменклатуры
//			|;
//			|
//			|////////////////////////////////////////////////////////////////////////////////
//			|УНИЧТОЖИТЬ ТоварыОрганизицииО
//			|;
//			|////////////////////////////////////////////////////////////////////////////////
//			|ВЫБРАТЬ
//			|	Товары.Регистратор КАК ДокументСборки,
//			|	Товары.Номенклатура КАК Номенклатура,
//			|	Товары.Характеристика КАК Характеристика,
//			|	Товары.Назначение КАК Назначение,
//			|	Товары.Склад КАК Склад,
//			|	Товары.Помещение КАК Помещение,
//			|	Товары.Серия КАК Серия,
//			|	ЕСТЬNULL(СУММА(&КоличествоКомплектов * Товары.ВНаличииРасход / &КоличествоКомплектовИсходное), 0) КАК Количество,
//			|	ЕСТЬNULL(СУММА(&КоличествоКомплектов * Товары.ВНаличииРасход / &КоличествоКомплектовИсходное), 0) КАК КоличествоУпаковок	//,
//			//|	ПУС.ТипПолитики КАК ТипПолитикиУчетаСерий
//			|ПОМЕСТИТЬ ТоварыНаСкладе
//			|ИЗ
//			|	РегистрНакопления.ТоварыНаСкладах.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК Товары
//			//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК Серии
//			//|		ПО Товары.Серия = Серии.Ссылка
//			//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидН
//			//|		ПО (Серии.ВидНоменклатуры = ВидН.Ссылка)
//			//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПолитикиУчетаСерий КАК ПУС
//			//|		ПО (ВидН.ПолитикаУчетаСерий = ПУС.Ссылка)
//			|ГДЕ
//			|	Товары.Регистратор = &Регистратор
//			|
//			|СГРУППИРОВАТЬ ПО
//			|	Товары.Назначение,
//			|	Товары.Характеристика,
//			|	Товары.Серия,
//			|	Товары.Помещение,
//			|	Товары.Склад,
//			|	Товары.Регистратор,
//			|	Товары.Номенклатура	//,
//			//|	ПУС.ТипПолитики
//			|
//			|ИМЕЮЩИЕ
//			|	ЕСТЬNULL(СУММА(&КоличествоКомплектов * Товары.ВНаличииРасход / &КоличествоКомплектовИсходное), 0) > 0
//			|;
//			|
//			|////////////////////////////////////////////////////////////////////////////////
//			|ВЫБРАТЬ
//			|	Товары.ДокументСборки 				КАК ДокументСборки,
//			|	Товары.Номенклатура 				КАК Номенклатура,
//			|	Товары.Характеристика 				КАК Характеристика,
//			|	ТоварыО.АналитикаУчетаНоменклатуры 	КАК АналитикаУчетаНоменклатуры,
//			|	ТоварыО.ВидЗапасов 					КАК ВидЗапасов,   							// fix Suetin 8/29/2024 2:15:12 PM
//			|	ТоварыО.ВидНоменклатуры 			КАК ВидНоменклатуры,                       // fix Suetin 8/29/2024 2:16:46 PM
//			|	ТоварыО.ПолитикаУчетаСерий 			КАК ПолитикаУчетаСерий,                    // fix Suetin 8/29/2024 2:23:24 PM
//			|	ТоварыО.ТипПолитикиУчетаСерий 		КАК ТипПолитикиУчетаСерий,                 // fix Suetin 8/29/2024 2:22:56 PM
//			|	Товары.Назначение 					КАК Назначение,
//			|	Товары.Склад 						КАК Склад,
//			|	Товары.Помещение 					КАК Помещение,
//			|	Товары.Серия 						КАК Серия,
//			|	СУММА(Товары.Количество) 			КАК Количество,
//			|	СУММА(Товары.КоличествоУпаковок) 	КАК КоличествоУпаковок,
//			|	МИНИМУМ(ТоварыО.Цена) 				КАК Цена,
//			|	СУММА(Товары.Количество) * МИНИМУМ(ТоварыО.Цена) КАК Сумма
//			|ПОМЕСТИТЬ Товары
//			|ИЗ
//			|	ТоварыНаСкладе КАК Товары
//			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыОрганизиции КАК ТоварыО
//			|		ПО Товары.ДокументСборки = ТоварыО.ДокументСборки
//			|			И Товары.Номенклатура = ТоварыО.Номенклатура
//			|			И Товары.Характеристика = ТоварыО.Характеристика
//			|			И Товары.Назначение = ТоварыО.Назначение
//			|			И Товары.Склад = ТоварыО.Склад
//			|			И (ВЫБОР
//			|				КОГДА ТоварыО.ТипПолитикиУчетаСерий = ЗНАЧЕНИЕ(Перечисление.ТипыПолитикУказанияСерий.УчетСебестоимостиПоСериям)
//			|					ТОГДА Товары.Серия = ТоварыО.Серия
//			|				ИНАЧЕ ИСТИНА
//			|			КОНЕЦ)
//			|
//			|СГРУППИРОВАТЬ ПО
//			|	Товары.Назначение,
//			|	Товары.Характеристика,
//			|	Товары.Серия,
//			|	Товары.Помещение,
//			|	Товары.Склад,
//			|	Товары.ДокументСборки,
//			|	Товары.Номенклатура,
//			|	ТоварыО.АналитикаУчетаНоменклатуры,
//			|	ТоварыО.ВидЗапасов,   						// fix Suetin 8/29/2024 2:15:12 PM
//			|	ТоварыО.ВидНоменклатуры,                    // fix Suetin 8/29/2024 2:16:46 PM
//			|	ТоварыО.ПолитикаУчетаСерий,                 // fix Suetin 8/29/2024 2:23:24 PM
//			|	ТоварыО.ТипПолитикиУчетаСерий               // fix Suetin 8/29/2024 2:22:56 PM
//			|;
//			|
//			|////////////////////////////////////////////////////////////////////////////////
//			|ВЫБРАТЬ РАЗЛИЧНЫЕ
//			|	ВКН.Владелец 						КАК Номенклатура,
//			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВКН.Ссылка) 	КАК КоличествоВариантовКомплектаций
//			|ПОМЕСТИТЬ ВариантыКН
//			|ИЗ
//			|	Справочник.ВариантыКомплектацииНоменклатуры КАК ВКН
//			|ГДЕ
//			|	ВКН.ПометкаУдаления = ЛОЖЬ
//			|	И ВКН.Владелец В
//			|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
//			|						Т.Номенклатура
//			|					ИЗ
//			|						Товары КАК Т)
//			|
//			|СГРУППИРОВАТЬ ПО
//			|	ВКН.Владелец
//			|;
//			|
//			|////////////////////////////////////////////////////////////////////////////////
//			|ВЫБРАТЬ
//			|	Товары.ДокументСборки 				КАК ДокументСборки,
//			|	Товары.Номенклатура 				КАК Номенклатура,
//			|	Товары.Характеристика 				КАК Характеристика,
//			|	Товары.АналитикаУчетаНоменклатуры 	КАК АналитикаУчетаНоменклатуры,
//			|	Товары.ВидЗапасов 					КАК ВидЗапасов,   							// fix Suetin 8/29/2024 2:15:12 PM
//			|	Товары.ВидНоменклатуры 				КАК ВидНоменклатуры,                       // fix Suetin 8/29/2024 2:16:46 PM
//			|	Товары.ПолитикаУчетаСерий 			КАК ПолитикаУчетаСерий,                    // fix Suetin 8/29/2024 2:23:24 PM
//			|	Товары.ТипПолитикиУчетаСерий 		КАК ТипПолитикиУчетаСерий,                 // fix Suetin 8/29/2024 2:22:56 PM
//			|	Товары.Назначение 					КАК Назначение,
//			|	Товары.Склад 						КАК Склад,
//			|	Товары.Помещение 					КАК Помещение,
//			|	Товары.Серия 						КАК Серия,
//			|	СУММА(Товары.Количество) 			КАК Количество,
//			|	СУММА(Товары.КоличествоУпаковок) 	КАК КоличествоУпаковок,
//			|	МИНИМУМ(Товары.Цена) 				КАК Цена,
//			|	СУММА(Товары.Сумма) 				КАК Сумма,
//			|	СУММА(ЕСТЬNULL(ВариантыКН.КоличествоВариантовКомплектаций, 0)) КАК КоличествоВариантовКомплектацииНоменклатуры
//			|ИЗ
//			|	Товары КАК Товары
//			|		ЛЕВОЕ СОЕДИНЕНИЕ ВариантыКН КАК ВариантыКН
//			|		ПО Товары.Номенклатура = ВариантыКН.Номенклатура
//			|
//			|СГРУППИРОВАТЬ ПО
//			|	Товары.Назначение,
//			|	Товары.Характеристика,
//			|	Товары.Серия,
//			|	Товары.Помещение,
//			|	Товары.Склад,
//			|	Товары.ДокументСборки,
//			|	Товары.Номенклатура,
//			|	Товары.АналитикаУчетаНоменклатуры,
//			|	Товары.ВидЗапасов,   						// fix Suetin 8/29/2024 2:15:12 PM
//			|	Товары.ВидНоменклатуры,                    // fix Suetin 8/29/2024 2:16:46 PM
//			|	Товары.ПолитикаУчетаСерий,                 // fix Suetin 8/29/2024 2:23:24 PM
//			|	Товары.ТипПолитикиУчетаСерий               // fix Suetin 8/29/2024 2:22:56 PM
//			|");			
//			
//			ЗапросРазборКомплекта.Текст = СтрЗаменить(ЗапросРазборКомплекта.Текст,
//					"&ТекстЗапросаКоэффициентУпаковки1",
//					Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
//					"ЦеныНоменклатурыСрезПоследних.Упаковка",
//					"ЦеныНоменклатурыСрезПоследних.Номенклатура"));
//					
//			ЗапросРазборКомплекта.Текст = СтрЗаменить(ЗапросРазборКомплекта.Текст,
//					"&ТекстЗапросаКоэффициентУпаковки2",
//					Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
//					"ТаблицаТоваров.ЕдиницаИзмерения",
//					"ТаблицаТоваров.Номенклатура"));
//			
//			ДокументСборки = ТаблицаЗапросЭтоЭлемент[0].ДокументСборки;
//			//Если ТипЗнч(ДокументСборки) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
//			//	ДокументСборкиДата = Дата(2000,1,1);
//			//	ДокументСборкиКоличество = ТаблицаЗапросЭтоЭлемент[0].Количество;
//			//Иначе
//				ДокументСборкиДата = ДокументСборки.Дата;
//				ДокументСборкиКоличество = ДокументСборки.Количество;
//			//КонецЕсли;
//			
//			ЗапросРазборКомплекта.УстановитьПараметр("Регистратор"     				, ДокументСборки);
//			ЗапросРазборКомплекта.УстановитьПараметр("ДатаНачала"					, Новый Граница(НачалоДня(ДокументСборкиДата)));
//			ЗапросРазборКомплекта.УстановитьПараметр("ДатаОкончания"				, Новый Граница(КонецДня(ДокументСборкиДата)));
//			ЗапросРазборКомплекта.УстановитьПараметр("КоличествоКомплектовИсходное"	, ДокументСборкиКоличество);
//			ЗапросРазборКомплекта.УстановитьПараметр("КоличествоКомплектовИсходное"	, 
//				?(ЗапросРазборКомплекта.Параметры.КоличествоКомплектовИсходное = 0, 1, ЗапросРазборКомплекта.Параметры.КоличествоКомплектовИсходное));
//			ЗапросРазборКомплекта.УстановитьПараметр("КоличествоКомплектов"     	, СтрокаТ.Количество);
//			
//			ЗапросРазборКомплекта.УстановитьПараметр("ДатаОкончанияО"        , Новый Граница(ПериодОтчетаКонец, Видграницы.Включая));
//			ЗапросРазборКомплекта.УстановитьПараметр("Валюта", Справочники.Валюты.НайтиПоКоду("643"));	
//			ЗапросРазборКомплекта.УстановитьПараметр("БазоваяВалюта", Справочники.Валюты.НайтиПоКоду("643")); 
//			ЗапросРазборКомплекта.УстановитьПараметр("ВидЦены", ВидЦены);

//			ТаблицаРазборКомплекта = ЗапросРазборКомплекта.Выполнить().Выгрузить();
//			
//			Для Каждого СтрокаЗапроса2Р Из ТаблицаРазборКомплекта Цикл
//				НоваяСтрокаТаблицыРазбор = ТаблицаПродукцииРазбор.Добавить();
//				ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицыРазбор, СтрокаЗапроса2Р);
//				ИндексМ = МассивУзловАИ.Найти(СтрокаТ.Номенклатура.ВидНоменклатуры);
//				Если ИндексМ <> Неопределено Тогда
//				    НоваяСтрокаТаблицыРазбор.ЭтоАИ = ИСТИНА;
//					НоваяСтрокаТаблицыРазбор.СкладАИ = СтрокаТ.Склад;
//				КонецЕсли;
//				Если СтрокаТ.ЭтоАИ Тогда
//				    НоваяСтрокаТаблицыРазбор.ЭтоАИ = ИСТИНА;
//					НоваяСтрокаТаблицыРазбор.СкладАИ = СтрокаТ.СкладАИ;
//				КонецЕсли;
//			
//			КонецЦикла;
//			СтрокаТ.Обработано = ИСТИНА;
//			ТабВыпускПродукцииОбщийИНеГП.Удалить(ТаблицаЗапросЭтоЭлемент[0]);
//		КонецЕсли;
//	КонецЦикла;
//КонецПроцедуры


#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли

//Функция vs_СформироватьДокументы(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка) Экспорт
//	ДеревоДанных = Новый ДеревоЗначений;
//	
//	ВнешниеНаборыДанных.Вставить("Изготовлено", Новый ТаблицаЗначений); // для заполнения документов нужна только таблица списаний
//	// begin fix Suetin 20.12.2023 11:46:43
//	Для Каждого СтрЭлНКД Из НастройкиКД.Выбор.Элементы Цикл
//		Если СтрЭлНКД.Поле = Новый ПолеКомпоновкиДанных("КоличествоУпаковок") Тогда
//			СтрЭлНКД.Использование=Истина;
//		КонецЕсли;	
//	КонецЦикла;	
//	Для Каждого СтрЭлНКД Из НастройкиКД.Структура Цикл
//		Если СтрЭлНКД.Имя="Сборка" Тогда
//			АналитикаПрисутствует=Ложь;
//			НоменклатураПрисутствует=Ложь;
//			ХарактеристикаПрисутствует=Ложь;
//			СерияПрисутствует=Ложь;
//			НазначениеПрисутствует=Ложь; 
//			ВидЗапасовПрисутствует=Ложь;
//			НомерГТДПрисутствует=Ложь;
//			ПомещениеПрисутствует=Ложь;
//			Для Каждого СтрВ Из СтрЭлНКД.Выбор.Элементы Цикл
//				Если СтрВ.Поле = Новый ПолеКомпоновкиДанных("АналитикаУчетаНоменклатуры") Тогда
//					АналитикаПрисутствует=Истина;
//				КонецЕсли;
//				Если СтрВ.Поле = Новый ПолеКомпоновкиДанных("Номенклатура") Тогда
//					НоменклатураПрисутствует=Истина;
//				КонецЕсли;
//				Если СтрВ.Поле = Новый ПолеКомпоновкиДанных("Характеристика") Тогда
//					ХарактеристикаПрисутствует=Истина;
//				КонецЕсли;
//				Если СтрВ.Поле = Новый ПолеКомпоновкиДанных("Серия") Тогда
//					СерияПрисутствует=Истина;
//				КонецЕсли;
//				Если СтрВ.Поле = Новый ПолеКомпоновкиДанных("Назначение") Тогда
//					НазначениеПрисутствует=Истина;
//				КонецЕсли;
//				Если СтрВ.Поле = Новый ПолеКомпоновкиДанных("КоличествоУпаковок") Тогда
//					СтрВ.Использование=Истина;
//				КонецЕсли;
//				
//				Если СтрВ.Поле = Новый ПолеКомпоновкиДанных("ВидЗапасов") Тогда
//					ВидЗапасовПрисутствует=Истина;
//				КонецЕсли;
//				Если СтрВ.Поле = Новый ПолеКомпоновкиДанных("НомерГТД") Тогда
//					НомерГТДПрисутствует=Истина;
//				КонецЕсли;
//				Если СтрВ.Поле = Новый ПолеКомпоновкиДанных("Помещение") Тогда
//					ПомещениеПрисутствует=Истина;
//				КонецЕсли;
//			КонецЦикла;
//			Если Не АналитикаПрисутствует Тогда
//				П = СтрЭлНКД.Выбор.Элементы.Вставить(1,Тип("ВыбранноеПолеКомпоновкиДанных"));
//				П.Поле = Новый ПолеКомпоновкиДанных("АналитикаУчетаНоменклатуры");
//				П.Заголовок = "Аналитика учета номенклатуры";
//				Г = СтрЭлНКД.ПоляГруппировки.Элементы.Вставить(0,Тип("ПолеГруппировкиКомпоновкиДанных"));
//				Г.Поле = Новый ПолеКомпоновкиДанных("АналитикаУчетаНоменклатуры");
//			КонецЕсли;
//			Если Не НоменклатураПрисутствует Тогда
//				П = СтрЭлНКД.Выбор.Элементы.Вставить(2,Тип("ВыбранноеПолеКомпоновкиДанных"));
//				П.Поле = Новый ПолеКомпоновкиДанных("Номенклатура");
//				П.Заголовок = "Номенклатура";
//				Г = СтрЭлНКД.ПоляГруппировки.Элементы.Вставить(1,Тип("ПолеГруппировкиКомпоновкиДанных"));
//				Г.Поле = Новый ПолеКомпоновкиДанных("Номенклатура");
//			КонецЕсли; 
//			Если Не ХарактеристикаПрисутствует Тогда
//				П = СтрЭлНКД.Выбор.Элементы.Вставить(3,Тип("ВыбранноеПолеКомпоновкиДанных"));
//				П.Поле = Новый ПолеКомпоновкиДанных("Характеристика");
//				П.Заголовок = "Характеристика";
//				Г = СтрЭлНКД.ПоляГруппировки.Элементы.Вставить(2,Тип("ПолеГруппировкиКомпоновкиДанных"));
//				Г.Поле = Новый ПолеКомпоновкиДанных("Характеристика");
//			КонецЕсли;
//			Если Не СерияПрисутствует Тогда 
//				П = СтрЭлНКД.Выбор.Элементы.Вставить(4,Тип("ВыбранноеПолеКомпоновкиДанных"));
//				П.Поле = Новый ПолеКомпоновкиДанных("Серия");
//				П.Заголовок = "Серия";                       
//				Г = СтрЭлНКД.ПоляГруппировки.Элементы.Вставить(3,Тип("ПолеГруппировкиКомпоновкиДанных"));
//				Г.Поле = Новый ПолеКомпоновкиДанных("Серия");
//			КонецЕсли;
//			Если Не НазначениеПрисутствует Тогда
//				П = СтрЭлНКД.Выбор.Элементы.Вставить(5,Тип("ВыбранноеПолеКомпоновкиДанных"));
//				П.Поле = Новый ПолеКомпоновкиДанных("Назначение");
//				П.Заголовок = "Назначение"; 
//				Г = СтрЭлНКД.ПоляГруппировки.Элементы.Вставить(4,Тип("ПолеГруппировкиКомпоновкиДанных"));
//				Г.Поле = Новый ПолеКомпоновкиДанных("Назначение");
//			КонецЕсли;
//			
//			Если Не ВидЗапасовПрисутствует Тогда
//				П = СтрЭлНКД.Выбор.Элементы.Вставить(6,Тип("ВыбранноеПолеКомпоновкиДанных"));
//				П.Поле = Новый ПолеКомпоновкиДанных("ВидЗапасов");
//				П.Заголовок = "Вид запасов"; 
//				Г = СтрЭлНКД.ПоляГруппировки.Элементы.Вставить(5,Тип("ПолеГруппировкиКомпоновкиДанных"));
//				Г.Поле = Новый ПолеКомпоновкиДанных("ВидЗапасов");
//			КонецЕсли;
//			
//			Если Не НомерГТДПрисутствует Тогда
//				П = СтрЭлНКД.Выбор.Элементы.Вставить(7,Тип("ВыбранноеПолеКомпоновкиДанных"));
//				П.Поле = Новый ПолеКомпоновкиДанных("НомерГТД");
//				П.Заголовок = "Номер ГТД"; 
//				Г = СтрЭлНКД.ПоляГруппировки.Элементы.Вставить(6,Тип("ПолеГруппировкиКомпоновкиДанных"));
//				Г.Поле = Новый ПолеКомпоновкиДанных("НомерГТД");
//			КонецЕсли;
//			
//			Если Не ПомещениеПрисутствует Тогда
//				П = СтрЭлНКД.Выбор.Элементы.Вставить(8,Тип("ВыбранноеПолеКомпоновкиДанных"));
//				П.Поле = Новый ПолеКомпоновкиДанных("Помещение");
//				П.Заголовок = "Помещение"; 
//				Г = СтрЭлНКД.ПоляГруппировки.Элементы.Вставить(7,Тип("ПолеГруппировкиКомпоновкиДанных"));
//				Г.Поле = Новый ПолеКомпоновкиДанных("Помещение");
//			КонецЕсли;
//			Для Каждого СтрЭКД Из СтрЭлНКД.Структура Цикл
//				Для Каждого СтрД Из СтрЭКД.Выбор.Элементы Цикл
//					Если СтрД.Поле = Новый ПолеКомпоновкиДанных("КоличествоУпаковок") Тогда
//						СтрД.Использование=Истина;
//					КонецЕсли;
//				КонецЦикла;	
//			КонецЦикла;	
//		КонецЕсли;
//		Если СтрЭлНКД.Имя="СписаниеЗатрат" Тогда
//			Для Каждого СтрЭл Из СтрЭлНКД.Структура Цикл
//				Если Не СтрЭл.Имя="СписаниеЗатратНомеклатура" Тогда Продолжить; КонецЕсли;
//				АналитикаПрисутствует=Ложь;
//				НоменклатураПрисутствует=Ложь;
//				ХарактеристикаПрисутствует=Ложь;
//				СерияПрисутствует=Ложь;
//				НазначениеПрисутствует=Ложь;
//				ВидЗапасовПрисутствует=Ложь;
//				НомерГТДПрисутствует=Ложь;
//				ПомещениеПрисутствует=Ложь;
//				Для Каждого СтрВ Из СтрЭл.Выбор.Элементы Цикл
//					Если СтрВ.Поле = Новый ПолеКомпоновкиДанных("АналитикаУчетаНоменклатуры") Тогда
//						АналитикаПрисутствует=Истина;
//					КонецЕсли;
//					Если СтрВ.Поле = Новый ПолеКомпоновкиДанных("Номенклатура") Тогда
//						НоменклатураПрисутствует=Истина;
//					КонецЕсли;
//					Если СтрВ.Поле = Новый ПолеКомпоновкиДанных("Характеристика") Тогда
//						ХарактеристикаПрисутствует=Истина;
//					КонецЕсли;
//					Если СтрВ.Поле = Новый ПолеКомпоновкиДанных("Серия") Тогда
//						СерияПрисутствует=Истина;
//					КонецЕсли;
//					Если СтрВ.Поле = Новый ПолеКомпоновкиДанных("Назначение") Тогда
//						НазначениеПрисутствует=Истина;
//					КонецЕсли;
//					Если СтрВ.Поле = Новый ПолеКомпоновкиДанных("КоличествоУпаковок") Тогда
//					СтрВ.Использование=Истина;
//				КонецЕсли;
//				    					
//					Если СтрВ.Поле = Новый ПолеКомпоновкиДанных("ВидЗапасов") Тогда
//						ВидЗапасовПрисутствует=Истина;
//					КонецЕсли;
//					Если СтрВ.Поле = Новый ПолеКомпоновкиДанных("НомерГТД") Тогда
//						НомерГТДПрисутствует=Истина;
//					КонецЕсли;
//					Если СтрВ.Поле = Новый ПолеКомпоновкиДанных("Помещение") Тогда
//						ПомещениеПрисутствует=Истина;
//					КонецЕсли;

//				КонецЦикла; 
//				Прервать;
//			КонецЦикла;	
//			Если Не АналитикаПрисутствует Тогда
//				П = СтрЭл.Выбор.Элементы.Вставить(1,Тип("ВыбранноеПолеКомпоновкиДанных"));
//				П.Поле = Новый ПолеКомпоновкиДанных("АналитикаУчетаНоменклатуры");
//				П.Заголовок = "Аналитика учета номенклатуры";
//				Г = СтрЭл.ПоляГруппировки.Элементы.Вставить(0,Тип("ПолеГруппировкиКомпоновкиДанных"));
//				Г.Поле = Новый ПолеКомпоновкиДанных("АналитикаУчетаНоменклатуры");
//			КонецЕсли;
//			Если Не НоменклатураПрисутствует Тогда
//				П = СтрЭл.Выбор.Элементы.Вставить(2,Тип("ВыбранноеПолеКомпоновкиДанных"));
//				П.Поле = Новый ПолеКомпоновкиДанных("Номенклатура");
//				П.Заголовок = "Номенклатура";
//				Г = СтрЭл.ПоляГруппировки.Элементы.Вставить(1,Тип("ПолеГруппировкиКомпоновкиДанных"));
//				Г.Поле = Новый ПолеКомпоновкиДанных("Номенклатура");
//			КонецЕсли; 
//			Если Не ХарактеристикаПрисутствует Тогда
//				П = СтрЭл.Выбор.Элементы.Вставить(3,Тип("ВыбранноеПолеКомпоновкиДанных"));
//				П.Поле = Новый ПолеКомпоновкиДанных("Характеристика");
//				П.Заголовок = "Характеристика";
//				Г = СтрЭл.ПоляГруппировки.Элементы.Вставить(2,Тип("ПолеГруппировкиКомпоновкиДанных"));
//				Г.Поле = Новый ПолеКомпоновкиДанных("Характеристика");
//			КонецЕсли;
//			Если Не СерияПрисутствует Тогда 
//				П = СтрЭл.Выбор.Элементы.Вставить(4,Тип("ВыбранноеПолеКомпоновкиДанных"));
//				П.Поле = Новый ПолеКомпоновкиДанных("Серия");
//				П.Заголовок = "Серия";
//				Г = СтрЭл.ПоляГруппировки.Элементы.Вставить(3,Тип("ПолеГруппировкиКомпоновкиДанных"));
//				Г.Поле = Новый ПолеКомпоновкиДанных("Серия");
//			КонецЕсли;
//			Если Не НазначениеПрисутствует Тогда
//				П = СтрЭл.Выбор.Элементы.Вставить(5,Тип("ВыбранноеПолеКомпоновкиДанных"));
//				П.Поле = Новый ПолеКомпоновкиДанных("Назначение");
//				П.Заголовок = "Назначение";
//				Г = СтрЭл.ПоляГруппировки.Элементы.Вставить(4,Тип("ПолеГруппировкиКомпоновкиДанных"));
//				Г.Поле = Новый ПолеКомпоновкиДанных("Назначение");
//			КонецЕсли;
//			
//			Если Не ВидЗапасовПрисутствует Тогда
//				П = СтрЭл.Выбор.Элементы.Вставить(6,Тип("ВыбранноеПолеКомпоновкиДанных"));
//				П.Поле = Новый ПолеКомпоновкиДанных("ВидЗапасов");
//				П.Заголовок = "Вид запасов"; 
//				Г = СтрЭл.ПоляГруппировки.Элементы.Вставить(5,Тип("ПолеГруппировкиКомпоновкиДанных"));
//				Г.Поле = Новый ПолеКомпоновкиДанных("ВидЗапасов");
//			КонецЕсли;
//			
//			Если Не НомерГТДПрисутствует Тогда
//				П = СтрЭл.Выбор.Элементы.Вставить(7,Тип("ВыбранноеПолеКомпоновкиДанных"));
//				П.Поле = Новый ПолеКомпоновкиДанных("НомерГТД");
//				П.Заголовок = "Номер ГТД"; 
//				Г = СтрЭл.ПоляГруппировки.Элементы.Вставить(6,Тип("ПолеГруппировкиКомпоновкиДанных"));
//				Г.Поле = Новый ПолеКомпоновкиДанных("НомерГТД");
//			КонецЕсли;
//			
//			Если Не ПомещениеПрисутствует Тогда
//				П = СтрЭл.Выбор.Элементы.Вставить(8,Тип("ВыбранноеПолеКомпоновкиДанных"));
//				П.Поле = Новый ПолеКомпоновкиДанных("Помещение");
//				П.Заголовок = "Помещение"; 
//				Г = СтрЭл.ПоляГруппировки.Элементы.Вставить(7,Тип("ПолеГруппировкиКомпоновкиДанных"));
//				Г.Поле = Новый ПолеКомпоновкиДанных("Помещение");
//			КонецЕсли; 
//			
//			Для Каждого СтрЭКД Из СтрЭлНКД.Структура Цикл
//				Для Каждого СтрД Из СтрЭКД.Выбор.Элементы Цикл
//					Если СтрД.Поле = Новый ПолеКомпоновкиДанных("КоличествоУпаковок") Тогда
//						СтрД.Использование=Истина;
//						Прервать;
//					КонецЕсли;
//				КонецЦикла;
//				Прервать;
//			КонецЦикла;
//		КонецЕсли;	
//	КонецЦикла;
//	// end fix Suetin 20.12.2023 11:46:47
//	МакетКД = КомпоновщикМакетаКД.Выполнить(СхемаКД, НастройкиКД,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

//	ПроцессорКД = Новый ПроцессорКомпоновкиДанных;
//	ПроцессорКД.Инициализировать(МакетКД, ВнешниеНаборыДанных);

//	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
//	ПроцессорВывода.УстановитьОбъект(ДеревоДанных);
//	ПроцессорВывода.Вывести(ПроцессорКД);
//	
//	ИмяФайлаОтчета    = ПолучитьИмяВременногоФайла("mxl");
//	ДокументРезультат.Записать(ИмяФайлаОтчета);
//	ДанныеФайлаОтчета = Новый ДвоичныеДанные(ИмяФайлаОтчета);
//	АдресФайлаОтчета  = ПоместитьВоВременноеХранилище(ДанныеФайлаОтчета);
//	
//	Отчеты.vs_МатериальныйОтчет.СформироватьДокументыПередачи(ДатаОкончания, Организация, СкладЦеха, ДеревоДанных, АдресФайлаОтчета);
//КонецФункции



//	//ТекстЗапроса = "
//	//|ВЫБРАТЬ
//	//|	Товары.Регистратор КАК ДокументСборки,
//	//|	Товары.Номенклатура КАК Номенклатура,
//	//|	Товары.Характеристика КАК Характеристика,
//	//|	Товары.Назначение КАК Назначение,
//	//|	Товары.Склад КАК Склад,
//	//|	Товары.Помещение КАК Помещение,
//	//|	Товары.Серия КАК Серия,
//	//|	Товары.ВНаличииПриход КАК Количество
//	//|ПОМЕСТИТЬ СборкиПоВыпускуГП
//	//|ИЗ
//	//|	РегистрНакопления.ТоварыНаСкладах.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК Товары
//	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
//	//|			ТоварыОрганизацийОбороты.Регистратор КАК ДокументСборки
//	//|		ИЗ
//	//|			РегистрНакопления.ТоварыОрганизаций.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК ТоварыОрганизацийОбороты
//	//|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций КАК ТоварыОрганизаций
//	//|				ПО ТоварыОрганизацийОбороты.Регистратор = ТоварыОрганизаций.Регистратор
//	//|					И ТоварыОрганизацийОбороты.АналитикаУчетаНоменклатуры = ТоварыОрганизаций.АналитикаУчетаНоменклатуры
//	//|					И ТоварыОрганизацийОбороты.Организация = ТоварыОрганизаций.Организация
//	//|					И ТоварыОрганизацийОбороты.ВидЗапасов = ТоварыОрганизаций.ВидЗапасов
//	//|					И ТоварыОрганизацийОбороты.НомерГТД = ТоварыОрганизаций.НомерГТД
//	//|					И (ТоварыОрганизаций.Активность = ИСТИНА)
//	//|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КАУН
//	//|				ПО ТоварыОрганизаций.АналитикаУчетаНоменклатуры = КАУН.Ссылка
//	//|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
//	//|				ПО (КАУН.Номенклатура = СпрНоменклатура.Ссылка)
//	//|		ГДЕ
//	//|			ТоварыОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
//	//|			И СпрНоменклатура.Родитель = &ГотоваяПродукция
//	//|			И ТоварыОрганизаций.ХозяйственнаяОперация = &СборкаИзКомплектующих) КАК Т
//	//|		ПО Товары.Регистратор = Т.ДокументСборки
//	//|;
//	//|//////////////////////////////////////////////////////
//	//|ВЫБРАТЬ
//	//|	ВидыНоменклатуры.Ссылка КАК Ссылка
//	//|ПОМЕСТИТЬ МассивУзловАИ
//	//|ИЗ
//	//|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
//	//|ГДЕ
//	//|	НЕ ВидыНоменклатуры.ЭтоГруппа
//	//|	И ВидыНоменклатуры.Наименование ПОДОБНО &Наименование
//	//|;
//	//|//////////////////////////////////////////////////////
//	//|
//	//
//	//	//|
//	//	//|////////////////////////////////////////////////////////////////////////////////
//	//	//|ВЫБРАТЬ
//	//	//|	ТоварыОрганизаций.Номенклатура КАК Номенклатура,
//	//	//|	СУММА(ТоварыОрганизаций.Количество) КАК Количество,
//	//	//|	ТоварыОрганизаций.Регистратор КАК Регистратор,
//	//	//|	ТоварыОрганизаций.Регистратор.Склад КАК РегистраторСклад
//	//	//|ПОМЕСТИТЬ СборкиИСписания
//	//	//|ИЗ
//	//	//|	РегистрНакопления.ТоварыОрганизаций КАК ТоварыОрганизаций
//	//	//|ГДЕ
//	//	//|	ТоварыОрганизаций.Регистратор В
//	//	//|			(ВЫБРАТЬ
//	//	//|				СГП.ДокументСборки
//	//	//|			ИЗ
//	//	//|				СборкиПоВыпускуГП КАК СГП)
//	//	//|	И ТоварыОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
//	//	//|
//	//	//|СГРУППИРОВАТЬ ПО
//	//	//|	ТоварыОрганизаций.Номенклатура,
//	//	//|	ТоварыОрганизаций.Регистратор,
//	//	//|	ТоварыОрганизаций.Регистратор.Склад
//	//	
//	//|ВЫБРАТЬ
//	//|	Товары.Регистратор КАК ДокументСборки,
//	//|	Товары.Номенклатура КАК Номенклатура,
//	//|	Товары.Характеристика КАК Характеристика,
//	//|	Товары.Назначение КАК Назначение,
//	//|	Товары.Склад КАК Склад,
//	//|	Товары.Помещение КАК Помещение,
//	//|	Товары.Серия КАК Серия,
//	//|	Товары.ВНаличииРасход КАК Количество
//	//|ПОМЕСТИТЬ СборкиИСписания
//	//|ИЗ
//	//|	РегистрНакопления.ТоварыНаСкладах.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК Товары
//	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
//	//|			ТоварыОрганизацийОбороты.Регистратор КАК ДокументСборки
//	//|		ИЗ
//	//|			РегистрНакопления.ТоварыОрганизаций.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК ТоварыОрганизацийОбороты
//	//|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций КАК ТоварыОрганизаций
//	//|				ПО ТоварыОрганизацийОбороты.Регистратор = ТоварыОрганизаций.Регистратор
//	//|					И ТоварыОрганизацийОбороты.АналитикаУчетаНоменклатуры = ТоварыОрганизаций.АналитикаУчетаНоменклатуры
//	//|					И ТоварыОрганизацийОбороты.Организация = ТоварыОрганизаций.Организация
//	//|					И ТоварыОрганизацийОбороты.ВидЗапасов = ТоварыОрганизаций.ВидЗапасов
//	//|					И ТоварыОрганизацийОбороты.НомерГТД = ТоварыОрганизаций.НомерГТД
//	//|					И (ТоварыОрганизаций.Активность = ИСТИНА)
//	////|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КАУН
//	////|				ПО ТоварыОрганизаций.АналитикаУчетаНоменклатуры = КАУН.Ссылка
//	////|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
//	////|				ПО (КАУН.Номенклатура = СпрНоменклатура.Ссылка)
//	//|		ГДЕ
//	//|			ТоварыОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
//	//|			И ТоварыОрганизаций.Регистратор В
//	//|			(ВЫБРАТЬ
//	//|				СГП.ДокументСборки
//	//|			ИЗ
//	//|				СборкиПоВыпускуГП КАК СГП)
//	//|			И ТоварыОрганизаций.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)) КАК Т
//	//|		ПО Товары.Регистратор = Т.ДокументСборки
//	//	
//	//	
//	//	
//	//	
//	//	
//	//	|
//	//	|ОБЪЕДИНИТЬ ВСЕ
//	//	|
//	//	
//	//|ВЫБРАТЬ
//	//|	Товары.Регистратор КАК ДокументСборки,
//	//|	Товары.Номенклатура КАК Номенклатура,
//	//|	Товары.Характеристика КАК Характеристика,
//	//|	Товары.Назначение КАК Назначение,
//	//|	Товары.Склад КАК Склад,
//	//|	Товары.Помещение КАК Помещение,
//	//|	Товары.Серия КАК Серия,
//	//|	Товары.ВНаличииРасход КАК Количество
//	////|ПОМЕСТИТЬ СборкиИСписания
//	//|ИЗ
//	//|	РегистрНакопления.ТоварыНаСкладах.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК Товары
//	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
//	//|			ТоварыОрганизацийОбороты.Регистратор КАК ДокументСборки
//	//|		ИЗ
//	//|			РегистрНакопления.ТоварыОрганизаций.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК ТоварыОрганизацийОбороты
//	//|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций КАК ТоварыОрганизаций
//	//|				ПО ТоварыОрганизацийОбороты.Регистратор = ТоварыОрганизаций.Регистратор
//	//|					И ТоварыОрганизацийОбороты.АналитикаУчетаНоменклатуры = ТоварыОрганизаций.АналитикаУчетаНоменклатуры
//	//|					И ТоварыОрганизацийОбороты.Организация = ТоварыОрганизаций.Организация
//	//|					И ТоварыОрганизацийОбороты.ВидЗапасов = ТоварыОрганизаций.ВидЗапасов
//	//|					И ТоварыОрганизацийОбороты.НомерГТД = ТоварыОрганизаций.НомерГТД
//	//|					И (ТоварыОрганизаций.Активность = ИСТИНА)
//	////|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КАУН
//	////|				ПО ТоварыОрганизаций.АналитикаУчетаНоменклатуры = КАУН.Ссылка
//	////|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
//	////|				ПО (КАУН.Номенклатура = СпрНоменклатура.Ссылка)
//	//|		ГДЕ
//	//|			ТоварыОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
//	//|	И ТИПЗНАЧЕНИЯ(ТоварыОрганизаций.Регистратор) = ТИП(Документ.ВнутреннееПотребление)
//	//|	И (ТоварыОрганизаций.СтатьяРасходов В(&ДопизготовлениеПроизводство))
//	//|			//И ТоварыОрганизаций.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)) КАК Т
//	//|) КАК Т
//	//|		ПО Товары.Регистратор = Т.ДокументСборки
//	//	
//	//	
//	//	//|ВЫБРАТЬ
//	//	//|	ТоварыОрганизаций.Номенклатура,
//	//	//|	СУММА(ТоварыОрганизаций.Количество),		
//	//	//|	ТоварыОрганизаций.Регистратор,
//	//	//|	ТоварыОрганизаций.Регистратор.Склад
//	//	//|ИЗ
//	//	//|	РегистрНакопления.ТоварыОрганизаций КАК ТоварыОрганизаций
//	//	//|ГДЕ
//	//	//|	ТоварыОрганизаций.Активность
//	//	//|	И ТоварыОрганизаций.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
//	//	//|	И ТоварыОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
//	//	//|	И ТИПЗНАЧЕНИЯ(ТоварыОрганизаций.Регистратор) = ТИП(Документ.ВнутреннееПотребление)
//	//	//|	И (ТоварыОрганизаций.СтатьяРасходов = &Допизготовление
//	//	//|			ИЛИ ТоварыОрганизаций.СтатьяРасходов = &Производство)
//	//	//|
//	//	//|СГРУППИРОВАТЬ ПО
//	//	//|	ТоварыОрганизаций.Регистратор,
//	//	//|	ТоварыОрганизаций.Номенклатура,
//	//	//|	ТоварыОрганизаций.Регистратор.Склад
//	//	|;
//	//	|
//	//|////////////////////////////////////////////////////////////////////////////////
//	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	//|	Товары.ДокументСборки КАК ДокументСборки,
//	//|	Товары.Номенклатура КАК Номенклатура,
//	//|	Товары.Характеристика КАК Характеристика,
//	//|	Товары.Назначение КАК Назначение,
//	//|	Товары.Склад КАК Склад,
//	//|	Товары.Помещение КАК Помещение,
//	//|	Товары.Серия КАК Серия,
//	//|	СУММА(Товары.Количество) КАК Количество
//	////
//	////	|	СборкиИСписания.Номенклатура КАК Номенклатура,
//	////	|	СУММА(СборкиИСписания.Количество) КАК Количество,
//	////	|	СборкиИСписания.Регистратор КАК ДокументСборки,
//	////	|	СборкиИСписания.РегистраторСклад КАК Склад
//	//|ИЗ
//	//|	СборкиИСписания КАК Товары
//	//|
//	//|СГРУППИРОВАТЬ ПО
//	//|	Товары.ДокументСборки,
//	//|	Товары.Номенклатура,
//	//|	Товары.Характеристика,
//	//|	Товары.Назначение,
//	//|	Товары.Склад,
//	//|	Товары.Помещение,
//	//|	Товары.Серия
//	//|";  
//	
//	ТекстЗапроса = "
//	|//////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВидыНоменклатуры.Ссылка КАК Ссылка
//	|ПОМЕСТИТЬ МассивУзловАИ
//	|ИЗ
//	|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
//	|ГДЕ
//	|	НЕ ВидыНоменклатуры.ЭтоГруппа
//	|	И ВидыНоменклатуры.Наименование ПОДОБНО &Наименование
//	|;
//	|//////////////////////////////////////////////////////
//    |
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	Товары.Период КАК Период,
//	|	Товары.Регистратор КАК Регистратор,
//	|	Товары.АналитикаУчетаНоменклатуры КАК КлючАналитикиУчетаНоменклатуры,
//	|	Товары.Номенклатура КАК Номенклатура,
//	|	Товары.РодительНоменклатуры КАК РодительНоменклатуры,
//	|	Товары.Характеристика КАК Характеристика,
//	|	Товары.Серия КАК Серия,
//	|	Товары.Назначение КАК Назначение,
//	|	Товары.Склад КАК Склад,
//	|	Товары.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
//	|	Товары.СтатьяРасходов КАК СтатьяРасходов,
//	|	Товары.ВидЗапасов КАК ВидЗапасов,
//	|	Товары.НомерГТД КАК НомерГТД,
//	|	Товары.ВидДвижения КАК ВидДвижения,
//	|	Товары.Количество КАК Количество,
//	|	Товары.Количество КАК КоличествоУпаковок
//	|ПОМЕСТИТЬ ТоварыО
//	|ИЗ (
//	|ВЫБРАТЬ
//	|	Товары.Период КАК Период,
//	|	Товары.Регистратор КАК Регистратор,
//	|	Товары.АналитикаУчетаНоменклатуры КАК КлючАналитикиУчетаНоменклатуры,
//	|	КАУН.Номенклатура КАК Номенклатура,
//	|	СпрНоменклатура.Родитель КАК РодительНоменклатуры,
//	|	КАУН.Характеристика КАК Характеристика,
//	|	КАУН.Серия КАК Серия,
//	|	КАУН.Назначение КАК Назначение,
//	|	КАУН.СкладскаяТерритория КАК Склад,
//	|	Товары.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
//	|	Товары.СтатьяРасходов КАК СтатьяРасходов,
//	|	Товары.ВидЗапасов КАК ВидЗапасов,
//	|	Товары.НомерГТД КАК НомерГТД,
//	|	Товары.ВидДвижения КАК ВидДвижения,
//	|	Товары.Количество КАК Количество,
//	|	Товары.Количество КАК КоличествоУпаковок
//	|ИЗ
//	|	РегистрНакопления.ТоварыОрганизаций КАК Товары
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КАУН
//	|		ПО Товары.АналитикаУчетаНоменклатуры = КАУН.Ссылка
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
//	|		ПО (КАУН.Номенклатура = СпрНоменклатура.Ссылка)
//	|ГДЕ
//	|	Товары.Период МЕЖДУ &ДатаНачалаОбщая1 И &ДатаОкончания1
//	|	И Товары.Активность = ИСТИНА ) КАК Товары
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Регистратор,
//	|	КлючАналитикиУчетаНоменклатуры,
//	|	Номенклатура,
//	|	Характеристика,
//	|	Серия,
//	|	Назначение,
//	|	Склад
//	|;
//	| 	
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	Товары.Период КАК Период,
//	|	Товары.Регистратор КАК Регистратор,
//	|	Товары.КлючАналитикиУчетаНоменклатуры КАК КлючАналитикиУчетаНоменклатуры,
//	|	Товары.Номенклатура КАК Номенклатура,
//	|	Товары.РодительНоменклатуры КАК РодительНоменклатуры,
//	|	Товары.Характеристика КАК Характеристика,
//	|	Товары.Серия КАК Серия,
//	|	Товары.Назначение КАК Назначение,
//	|	Товары.Склад КАК Склад,
//	|	Товары.Количество КАК Количество,
//	|	Товары.КоличествоУпаковок КАК КоличествоУпаковок
//	|ПОМЕСТИТЬ ВыпускОбщий
//	|ИЗ
//	|	ТоварыО КАК Товары
//	|ГДЕ
//	|	Товары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
//	|	И Товары.ХозяйственнаяОперация = &СборкаИзКомплектующих
//	|	И Товары.РодительНоменклатуры = &ГотоваяПродукция
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Регистратор,
//	|	КлючАналитикиУчетаНоменклатуры,
//	|	Номенклатура,
//	|	Характеристика,
//	|	Серия,
//	|	Назначение,
//	|	Склад
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	Товары.Период КАК Период,
//	|	Товары.Регистратор КАК Регистратор,
//	|	Товары.КлючАналитикиУчетаНоменклатуры КАК КлючАналитикиУчетаНоменклатуры,
//	|	Товары.Номенклатура КАК Номенклатура,
//	|	Товары.РодительНоменклатуры КАК РодительНоменклатуры,
//	|	Товары.Характеристика КАК Характеристика,
//	|	Товары.Серия КАК Серия,
//	|	Товары.Назначение КАК Назначение,
//	|	Товары.Склад КАК Склад,
//	|	Сумма(Товары.Количество) КАК Количество,
//	|	Сумма(Товары.КоличествоУпаковок) КАК КоличествоУпаковок
//	|ПОМЕСТИТЬ Выпуск
//	|ИЗ
//	|	ВыпускОбщий КАК Товары
//	|ГДЕ
//	|	НЕ Товары.Период < &ДатаНачала1
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	Товары.Период,
//	|	Товары.Регистратор,
//	|	Товары.КлючАналитикиУчетаНоменклатуры,
//	|	Товары.Номенклатура,
//	|	Товары.РодительНоменклатуры,
//	|	Товары.Характеристика,
//	|	Товары.Серия,
//	|	Товары.Назначение,
//	|	Товары.Склад
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Регистратор,
//	|	КлючАналитикиУчетаНоменклатуры,
//	|	Номенклатура,
//	|	Характеристика,
//	|	Серия,
//	|	Назначение,
//	|	Склад
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	Товары.Регистратор КАК Регистратор,
//	|	Товары.КлючАналитикиУчетаНоменклатуры КАК КлючАналитикиУчетаНоменклатуры,
//	|	Товары.Номенклатура КАК Номенклатура,
//	|	Товары.РодительНоменклатуры КАК РодительНоменклатуры,
//	|	Товары.Характеристика КАК Характеристика,
//	|	Товары.Серия КАК Серия,
//	|	Товары.Назначение КАК Назначение,
//	|	Товары.СтатьяРасходов КАК СтатьяРасходов,
//	|	Товары.Склад КАК Склад,
//	|	Товары.Количество КАК Количество,
//	|	Товары.КоличествоУпаковок КАК КоличествоУпаковок
//	|ПОМЕСТИТЬ Списание
//	|ИЗ
//	|	ТоварыО КАК Товары
//	|ГДЕ
//	|	НЕ Товары.Период < &ДатаНачала1
//	|	И Товары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
//	|	И (Товары.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
//	|			ИЛИ ТИПЗНАЧЕНИЯ(Товары.Регистратор) = ТИП(Документ.ВнутреннееПотребление)
//	|				И Товары.СтатьяРасходов В (&ДопизготовлениеПроизводство))
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Регистратор,
//	|	КлючАналитикиУчетаНоменклатуры,
//	|	Номенклатура,
//	|	Характеристика,
//	|	Серия,
//	|	Назначение,
//	|	Склад
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	Товары.Регистратор КАК ДокументСборки,
//	|	Списание.КлючАналитикиУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//	|	Товары.Номенклатура КАК Номенклатура,
//	|	Товары.Характеристика КАК Характеристика,
//	|	Товары.Назначение КАК Назначение,
//	|	Товары.Склад КАК Склад,
//	|	Товары.Помещение КАК Помещение,
//	|	Товары.Серия КАК Серия,
//	|	СУММА(Товары.ВНаличииРасход) КАК Количество,
//	|	СУММА(Товары.ВНаличииРасход) КАК КоличествоУпаковок
//	|ИЗ
//	|	РегистрНакопления.ТоварыНаСкладах.Обороты(
//	|			&ДатаНачала,
//	|			&ДатаОкончания,
//	|			Регистратор,
//	|			(Номенклатура, Характеристика, Назначение, Склад, Серия) В
//	|				(ВЫБРАТЬ
//	|					Т.Номенклатура,
//	|					Т.Характеристика,
//	|					Т.Назначение,
//	|					Т.Склад,
//	|					Т.Серия
//	|				ИЗ
//	|					Списание КАК Т)) КАК Товары
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Списание КАК Списание
//	|		ПО Товары.Регистратор = Списание.Регистратор
//	|			И Товары.Номенклатура = Списание.Номенклатура
//	|			И Товары.Характеристика = Списание.Характеристика
//	|			И Товары.Назначение = Списание.Назначение
//	|			И Товары.Склад = Списание.Склад
//	|			И Товары.Серия = Списание.Серия
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	Товары.Назначение,
//	|	Товары.Склад,
//	|	Товары.Номенклатура,
//	|	Списание.КлючАналитикиУчетаНоменклатуры,
//	|	Товары.Регистратор,
//	|	Товары.Характеристика,
//	|	Товары.Серия,
//	|	Товары.Помещение";
//	
//	ТекстЗапроса = "
//	|ВЫБРАТЬ
//	|	ВидыНоменклатуры.Ссылка КАК Ссылка
//	|ПОМЕСТИТЬ МассивУзловАИ
//	|ИЗ
//	|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
//	|ГДЕ
//	|	НЕ ВидыНоменклатуры.ЭтоГруппа
//	|	И ВидыНоменклатуры.Наименование ПОДОБНО &Наименование
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	ТоварыНаСкладах.Период КАК Период,
//	|	ТоварыНаСкладах.Регистратор КАК Регистратор,
//	|	Товары.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//	|	ТоварыНаСкладах.Номенклатура КАК Номенклатура,
//	|	Товары.РодительНоменклатуры КАК РодительНоменклатуры,
//	|	ТоварыНаСкладах.Характеристика КАК Характеристика,
//	|	ТоварыНаСкладах.Серия КАК Серия,
//	|	ТоварыНаСкладах.Назначение КАК Назначение,
//	|	ТоварыНаСкладах.Склад КАК Склад,
//	|	Товары.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
//	|	Товары.СтатьяРасходов КАК СтатьяРасходов,
//	|	Товары.ВидЗапасов КАК ВидЗапасов,
//	|	Товары.НомерГТД КАК НомерГТД,
//	|	ТоварыНаСкладах.Помещение КАК Помещение,
//	|	ТоварыНаСкладах.ВидДвижения КАК ВидДвижения,
//	|	СУММА(ТоварыНаСкладах.ВНаличии) КАК Количество,
//	|	СУММА(ТоварыНаСкладах.ВНаличии) КАК КоличествоУпаковок
//	|ПОМЕСТИТЬ ТоварыО
//	|ИЗ
//	|	РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//	|			Товары.Период КАК Период,
//	|			Товары.Регистратор КАК Регистратор,
//	|			Товары.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//	|			КАУН.Номенклатура КАК Номенклатура,
//	|			СпрНоменклатура.Родитель КАК РодительНоменклатуры,
//	|			КАУН.Характеристика КАК Характеристика,
//	|			КАУН.Серия КАК Серия,
//	|			КАУН.Назначение КАК Назначение,
//	|			КАУН.СкладскаяТерритория КАК Склад,
//	|			Товары.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
//	|			Товары.СтатьяРасходов КАК СтатьяРасходов,
//	|			Товары.ВидЗапасов КАК ВидЗапасов,
//	|			Товары.НомерГТД КАК НомерГТД,
//	|			Товары.ВидДвижения КАК ВидДвижения,
//	|			Товары.Количество КАК Количество,
//	|			Товары.Количество КАК КоличествоУпаковок
//	|		ИЗ
//	|			РегистрНакопления.ТоварыОрганизаций КАК Товары
//	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КАУН
//	|				ПО Товары.АналитикаУчетаНоменклатуры = КАУН.Ссылка
//	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
//	|				ПО (КАУН.Номенклатура = СпрНоменклатура.Ссылка)
//	|		ГДЕ
//	|			Товары.Период МЕЖДУ &ДатаНачалаОбщая1 И &ДатаОкончания1
//	|			И Товары.Активность = ИСТИНА) КАК Товары
//	|		ПО ТоварыНаСкладах.Регистратор = Товары.Регистратор
//	|			И ТоварыНаСкладах.ВидДвижения = Товары.ВидДвижения
//	|			И ТоварыНаСкладах.Номенклатура = Товары.Номенклатура
//	|			И ТоварыНаСкладах.Характеристика = Товары.Характеристика
//	|			И ТоварыНаСкладах.Назначение = Товары.Назначение
//	|			И ТоварыНаСкладах.Склад = Товары.Склад
//	|			И (ВЫБОР
//	|				КОГДА ТоварыНаСкладах.Серия = Товары.Серия
//	|					ТОГДА ИСТИНА
//	|				КОГДА ЕСТЬNULL(Товары.Серия, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
//	|					ТОГДА ИСТИНА
//	|				ИНАЧЕ ЛОЖЬ
//	|			КОНЕЦ)
//	|ГДЕ
//	|	ТоварыНаСкладах.Период МЕЖДУ &ДатаНачалаОбщая1 И &ДатаОкончания1
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	Товары.АналитикаУчетаНоменклатуры,
//	|	Товары.РодительНоменклатуры,
//	|	ТоварыНаСкладах.Серия,
//	|	Товары.ХозяйственнаяОперация,
//	|	Товары.СтатьяРасходов,
//	|	Товары.ВидЗапасов,
//	|	Товары.НомерГТД,
//	|	ТоварыНаСкладах.Помещение,
//	|	ТоварыНаСкладах.Период,
//	|	ТоварыНаСкладах.Регистратор,
//	|	ТоварыНаСкладах.Номенклатура,
//	|	ТоварыНаСкладах.Характеристика,
//	|	ТоварыНаСкладах.Назначение,
//	|	ТоварыНаСкладах.Склад,
//	|	ТоварыНаСкладах.ВидДвижения
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Регистратор,
//	|	АналитикаУчетаНоменклатуры,
//	|	Номенклатура,
//	|	Характеристика,
//	|	Серия,
//	|	Назначение,
//	|	Склад
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	Товары.Период КАК Период,
//	|	Товары.Регистратор КАК Регистратор,
//	|	Товары.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//	|	Товары.Номенклатура КАК Номенклатура,
//	|	Товары.РодительНоменклатуры КАК РодительНоменклатуры,
//	|	Товары.Характеристика КАК Характеристика,
//	|	Товары.Серия КАК Серия,
//	|	Товары.Назначение КАК Назначение,
//	|	Товары.Склад КАК Склад,
//	|	Товары.Количество КАК Количество,
//	|	Товары.КоличествоУпаковок КАК КоличествоУпаковок,
//	|	Товары.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
//	|	Товары.СтатьяРасходов КАК СтатьяРасходов,
//	|	Товары.ВидЗапасов КАК ВидЗапасов,
//	|	Товары.НомерГТД КАК НомерГТД,
//	|	Товары.Помещение КАК Помещение
//	|ПОМЕСТИТЬ ВыпускОбщий
//	|ИЗ
//	|	ТоварыО КАК Товары
//	|ГДЕ
//	|	Товары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
//	|	И Товары.ХозяйственнаяОперация = &СборкаИзКомплектующих
//	|	И Товары.РодительНоменклатуры = &ГотоваяПродукция
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Регистратор,
//	|	АналитикаУчетаНоменклатуры,
//	|	Номенклатура,
//	|	Характеристика,
//	|	Серия,
//	|	Назначение,
//	|	Склад
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	Товары.Период КАК Период,
//	|	Товары.Регистратор КАК Регистратор,
//	|	Товары.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//	|	Товары.Номенклатура КАК Номенклатура,
//	|	Товары.РодительНоменклатуры КАК РодительНоменклатуры,
//	|	Товары.Характеристика КАК Характеристика,
//	|	Товары.Серия КАК Серия,
//	|	Товары.Назначение КАК Назначение,
//	|	Товары.Склад КАК Склад,
//	|	СУММА(Товары.Количество) КАК Количество,
//	|	СУММА(Товары.КоличествоУпаковок) КАК КоличествоУпаковок,
//	|	Товары.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
//	|	Товары.СтатьяРасходов КАК СтатьяРасходов,
//	|	Товары.ВидЗапасов КАК ВидЗапасов,
//	|	Товары.НомерГТД КАК НомерГТД,
//	|	Товары.Помещение КАК Помещение
//	|ПОМЕСТИТЬ Выпуск
//	|ИЗ
//	|	ВыпускОбщий КАК Товары
//	|ГДЕ
//	|	НЕ Товары.Период < &ДатаНачала1
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	Товары.Период,
//	|	Товары.Регистратор,
//	|	Товары.АналитикаУчетаНоменклатуры,
//	|	Товары.Номенклатура,
//	|	Товары.РодительНоменклатуры,
//	|	Товары.Характеристика,
//	|	Товары.Серия,
//	|	Товары.Назначение,
//	|	Товары.Склад,
//	|	Товары.ХозяйственнаяОперация,
//	|	Товары.СтатьяРасходов,
//	|	Товары.ВидЗапасов,
//	|	Товары.НомерГТД,
//	|	Товары.Помещение
//	|
//	//|ИНДЕКСИРОВАТЬ ПО
//	//|	Регистратор,
//	//|	АналитикаУчетаНоменклатуры,
//	//|	Номенклатура,
//	//|	Характеристика,
//	//|	Серия,
//	//|	Назначение,
//	//|	Склад
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	|	Товары.Регистратор КАК Регистратор,
//	|	Товары.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//	|	Товары.Номенклатура КАК Номенклатура,
//	|	Товары.РодительНоменклатуры КАК РодительНоменклатуры,
//	|	Товары.Характеристика КАК Характеристика,
//	|	Товары.Серия КАК Серия,
//	|	Товары.Назначение КАК Назначение,
//	|	Товары.СтатьяРасходов КАК СтатьяРасходов,
//	|	Товары.Склад КАК Склад,
//	|	СУММА(Товары.Количество) КАК Количество,
//	|	СУММА(Товары.КоличествоУпаковок) КАК КоличествоУпаковок,
//	|	Товары.ВидЗапасов КАК ВидЗапасов,
//	|	Товары.НомерГТД КАК НомерГТД,
//	|	Товары.Помещение КАК Помещение
//	//|ПОМЕСТИТЬ Списание
//	|ИЗ
//	|	ТоварыО КАК Товары
//	|ГДЕ
//	|	НЕ Товары.Период < &ДатаНачала1
//	|	И Товары.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
//	|	И (Товары.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)
//	|			ИЛИ ТИПЗНАЧЕНИЯ(Товары.Регистратор) = ТИП(Документ.ВнутреннееПотребление)
//	|				И Товары.СтатьяРасходов В (&ДопизготовлениеПроизводство))
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	Товары.Помещение,
//	|	Товары.НомерГТД,
//	|	Товары.Регистратор,
//	|	Товары.АналитикаУчетаНоменклатуры,
//	|	Товары.Номенклатура,
//	|	Товары.РодительНоменклатуры,
//	|	Товары.Характеристика,
//	|	Товары.Серия,
//	|	Товары.Назначение,
//	|	Товары.Склад,
//	|	Товары.ВидЗапасов,
//	|	Товары.СтатьяРасходов
//	|
//	//|ИНДЕКСИРОВАТЬ ПО
//	//|	Регистратор,
//	//|	КлючАналитикиУчетаНоменклатуры,
//	//|	Номенклатура,
//	//|	Характеристика,
//	//|	Серия,
//	//|	Назначение,
//	//|	Склад
//	//|;
//	//|
//	//|////////////////////////////////////////////////////////////////////////////////
//	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
//	//|	Товары.Регистратор КАК ДокументСборки,
//	//|	Списание.КлючАналитикиУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
//	//|	Товары.Номенклатура КАК Номенклатура,
//	//|	Товары.Характеристика КАК Характеристика,
//	//|	Товары.Назначение КАК Назначение,
//	//|	Товары.Склад КАК Склад,
//	//|	Товары.Помещение КАК Помещение,
//	//|	Товары.Серия КАК Серия,
//	//|	СУММА(Товары.ВНаличииРасход) КАК Количество,
//	//|	СУММА(Товары.ВНаличииРасход) КАК КоличествоУпаковок
//	//|ИЗ
//	//|	РегистрНакопления.ТоварыНаСкладах.Обороты(
//	//|			&ДатаНачала,
//	//|			&ДатаОкончания,
//	//|			Регистратор,
//	//|			(Номенклатура, Характеристика, Назначение, Склад, Серия) В
//	//|				(ВЫБРАТЬ
//	//|					Т.Номенклатура,
//	//|					Т.Характеристика,
//	//|					Т.Назначение,
//	//|					Т.Склад,
//	//|					Т.Серия
//	//|				ИЗ
//	//|					Списание КАК Т)) КАК Товары
//	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Списание КАК Списание
//	//|		ПО Товары.Регистратор = Списание.Регистратор
//	//|			И Товары.Номенклатура = Списание.Номенклатура
//	//|			И Товары.Характеристика = Списание.Характеристика
//	//|			И Товары.Назначение = Списание.Назначение
//	//|			И Товары.Склад = Списание.Склад
//	//|			И Товары.Серия = Списание.Серия
//	//|
//	//|СГРУППИРОВАТЬ ПО
//	//|	Товары.Назначение,
//	//|	Товары.Склад,
//	//|	Товары.Номенклатура,
//	//|	Списание.КлючАналитикиУчетаНоменклатуры,
//	//|	Товары.Регистратор,
//	//|	Товары.Характеристика,
//	//|	Товары.Серия,
//	//|	Товары.Помещение
//	|";



//Функция ПолучитьЗатратыНаСборку(Запрос, ДатаНачала, ДатаОкончания, ГруппаГП, СтатьяРасходов) Экспорт        //всг++
//	
//	    //ГруппаГП = Справочники.Номенклатура.НайтиПоНаименованию("ГП");
//	    МассивУзловАИ = Новый Массив;
//		
//		ЗапросАИ = Новый Запрос;
//		ЗапросАИ.Текст = 
//			"ВЫБРАТЬ
//			|	ВидыНоменклатуры.Ссылка КАК Ссылка
//			|ИЗ
//			|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
//			|ГДЕ
//			|	НЕ ВидыНоменклатуры.ЭтоГруппа
//			|	И ВидыНоменклатуры.Наименование ПОДОБНО &Наименование";
//		
//		ЗапросАИ.УстановитьПараметр("Наименование", "%(АИ)%");
//		
//		РезультатЗапросаАИ = ЗапросАИ.Выполнить();
//		
//		ВыборкаАИ = РезультатЗапросаАИ.Выбрать();
//		
//		Пока ВыборкаАИ.Следующий() Цикл
//			МассивУзловАИ.Добавить(ВыборкаАИ.Ссылка);			
//		КонецЦикла;
//				

//		///запрос по первому уровню сборки готового продукта (сбока и внутренне потребление)
//		Запрос = Новый Запрос(
//		"ВЫБРАТЬ
//		|	ТоварыОрганизаций.Регистратор КАК ДокументСборки
//		|ПОМЕСТИТЬ СборкиПоВыпускуГП
//		|ИЗ
//		|	РегистрНакопления.ТоварыОрганизаций КАК ТоварыОрганизаций
//		|ГДЕ
//		|	ТоварыОрганизаций.Активность
//		|	И ТоварыОрганизаций.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
//		|	И ТоварыОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
//		|	И ТоварыОрганизаций.АналитикаУчетаНоменклатуры.Номенклатура.Родитель = &ГруппаГП
//		|	И ТоварыОрганизаций.ХозяйственнаяОперация = &СборкаИзКомплектующих
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	ТоварыОрганизаций.Регистратор
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ТоварыОрганизаций.Номенклатура КАК Номенклатура,
//		|	СУММА(ТоварыОрганизаций.Количество) КАК Количество,
//		|	ТоварыОрганизаций.Регистратор КАК Регистратор,
//		|	ТоварыОрганизаций.Регистратор.Склад КАК РегистраторСклад
//		|ПОМЕСТИТЬ СборкиИСписания
//		|ИЗ
//		|	РегистрНакопления.ТоварыОрганизаций КАК ТоварыОрганизаций
//		|ГДЕ
//		|	ТоварыОрганизаций.Регистратор В
//		|			(ВЫБРАТЬ
//		|				СГП.ДокументСборки
//		|			ИЗ
//		|				СборкиПоВыпускуГП КАК СГП)
//		|	И ТоварыОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	ТоварыОрганизаций.Номенклатура,
//		|	ТоварыОрганизаций.Регистратор,
//		|	ТоварыОрганизаций.Регистратор.Склад
//		|
//		|ОБЪЕДИНИТЬ ВСЕ
//		|
//		|ВЫБРАТЬ
//		|	ТоварыОрганизаций.Номенклатура,
//		|	СУММА(ТоварыОрганизаций.Количество),		
//		|	ТоварыОрганизаций.Регистратор,
//		|	ТоварыОрганизаций.Регистратор.Склад
//		|ИЗ
//		|	РегистрНакопления.ТоварыОрганизаций КАК ТоварыОрганизаций
//		|ГДЕ
//		|	ТоварыОрганизаций.Активность
//		|	И ТоварыОрганизаций.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
//		|	И ТоварыОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
//		|	И ТИПЗНАЧЕНИЯ(ТоварыОрганизаций.Регистратор) = ТИП(Документ.ВнутреннееПотребление)
//		|	И (ТоварыОрганизаций.СтатьяРасходов = &Допизготовление
//		|			ИЛИ ТоварыОрганизаций.СтатьяРасходов = &Производство)
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	ТоварыОрганизаций.Регистратор,
//		|	ТоварыОрганизаций.Номенклатура,
//		|	ТоварыОрганизаций.Регистратор.Склад
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	СборкиИСписания.Номенклатура КАК Номенклатура,
//		|	СУММА(СборкиИСписания.Количество) КАК Количество,
//		|	СборкиИСписания.Регистратор КАК ДокументСборки,
//		|	СборкиИСписания.РегистраторСклад КАК Склад
//		|ИЗ
//		|	СборкиИСписания КАК СборкиИСписания
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	СборкиИСписания.Номенклатура,
//		|	СборкиИСписания.Регистратор,
//		|	СборкиИСписания.РегистраторСклад");
//		
//		
//		Запрос.УстановитьПараметр("ДатаНачала"           , ДатаНачала);
//		Запрос.УстановитьПараметр("ДатаОкончания"        , ДатаОкончания);
//		Запрос.УстановитьПараметр("ГруппаГП"     , ГруппаГП);
//		Запрос.УстановитьПараметр("СборкаИзКомплектующих", Перечисления.ХозяйственныеОперации.СборкаТоваров);
//		Запрос.УстановитьПараметр("Допизготовление"        , ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоНаименованию("!!! Доизготовление")); 
//		Запрос.УстановитьПараметр("Производство"        , ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоНаименованию("!! Списание в производство (в мат.отчет)")); 
//		
//		
//		ТаблицаПродукцииРазбор = Запрос.Выполнить().Выгрузить();
//		ТаблицаПродукцииРазбор.Колонки.Добавить("ЭтоЭлемент", Новый ОписаниеТипов("Булево"));
//		ТаблицаПродукцииРазбор.Колонки.Добавить("Обработано", Новый ОписаниеТипов("Булево"));
//		ТаблицаПродукцииРазбор.Колонки.Добавить("ЭтоАИ", Новый ОписаниеТипов("Булево"));
//		ТаблицаПродукцииРазбор.Колонки.Добавить("СкладАИ", Новый ОписаниеТипов("СправочникСсылка.Склады"));

//		ТаблицаПродукцииТЗРазобрано = Новый ТаблицаЗначений;
//		ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
//		ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
//		ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
//		ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("ЭтоЭлемент", Новый ОписаниеТипов("Булево"));
//		ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("Обработано", Новый ОписаниеТипов("Булево"));
//		ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("ЭтоАИ", Новый ОписаниеТипов("Булево"));
//		ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("ДокументСборки");

//		
//		ТаблицаПродукцииИтог = Новый ТаблицаЗначений;
//		ТаблицаПродукцииИтог.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
//		ТаблицаПродукцииИтог.Колонки.Добавить("ДокументСборки");
//		ТаблицаПродукцииИтог.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
//		ТаблицаПродукцииИтог.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
//	
//	
//		МассивУдаляемых = Новый Массив;
//		ОграничениеЦикла = 0;
//		ОсталосьНеразобранныхТекущихКомплектов = ТаблицаПродукцииРазбор.Количество(); 
//		Пока  ОсталосьНеразобранныхТекущихКомплектов > 0 Цикл
//			
//			  РазобратьТекущийНабор(ТаблицаПродукцииРазбор, ДатаНачала, ДатаОкончания, МассивУзловАИ);
//			
//			  МассивУдаляемых.Очистить();
//			  Для Каждого СтрокаРазбор Из ТаблицаПродукцииРазбор Цикл
//				  Если СтрокаРазбор.Обработано Тогда
//					  МассивУдаляемых.Добавить(СтрокаРазбор);
//				  КонецЕсли;	
//				  Если СтрокаРазбор.ЭтоЭлемент Тогда
//					   НоваяСтрокаТП = ТаблицаПродукцииТЗРазобрано.Добавить();
//					   ЗаполнитьЗначенияСвойств(НоваяСтрокаТП, СтрокаРазбор);
//					   МассивУдаляемых.Добавить(СтрокаРазбор);
//				  КонецЕсли;	
//			  КонецЦикла;
//			  Для Каждого УдаляемыйЭлемент Из МассивУдаляемых Цикл
//				  ТаблицаПродукцииРазбор.Удалить(УдаляемыйЭлемент);
//			  КонецЦикла;	
//			
//			
//			 ОграничениеЦикла = ОграничениеЦикла + 1;
//			 ОсталосьНеразобранныхТекущихКомплектов = ТаблицаПродукцииРазбор.Количество();
//			 Если ОграничениеЦикла > 100 Тогда
//				  ОсталосьНеразобранныхТекущихКомплектов = 0;
//			 КонецЕсли;
//			
//		КонецЦикла;
//		

//		Для Каждого СтрокаРазбор Из ТаблицаПродукцииТЗРазобрано Цикл
//			НоваяСтрокаТаблицыРазбор = ТаблицаПродукцииИтог.Добавить();
//			ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицыРазбор, СтрокаРазбор);				
//	    КонецЦикла;
//	
//		Возврат  ТаблицаПродукцииИтог;

//КонецФункции


	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ
	//|	ТоварыОрганизаций.Номенклатура КАК Номенклатура,
	//|	ТоварыОрганизаций.Регистратор КАК ДокументСборки,
	//|	СУММА(ТоварыОрганизаций.Количество) КАК Количество
	//|ИЗ
	//|	РегистрНакопления.ТоварыОрганизаций КАК ТоварыОрганизаций
	//|ГДЕ
	//|	ТоварыОрганизаций.Активность
	//|	И ТоварыОрганизаций.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	//|	И ТоварыОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//|	И ТоварыОрганизаций.АналитикаУчетаНоменклатуры.Номенклатура.Родитель = &ГотоваяПродукция
	//|	И ТоварыОрганизаций.ХозяйственнаяОперация = &СборкаИзКомплектующих
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ТоварыОрганизаций.Номенклатура,
	//|	ТоварыОрганизаций.Регистратор"); 
	//
	//Запрос.УстановитьПараметр("ДатаНачала"           , ДатаНачала);
	//Запрос.УстановитьПараметр("ДатаОкончания"        , ДатаОкончания);
	//Запрос.УстановитьПараметр("ГотоваяПродукция"     , ГотоваяПродукция);
	//Запрос.УстановитьПараметр("СборкаИзКомплектующих", СборкаИзКомплектующих);
	//
	//З = Запрос.Выполнить().Выгрузить();
	


	
	
	
//Функция ТекстЗапросаРазблюдовкаПоСериям()
//	
//	Возврат "ВЫБРАТЬ
//	        |	ТЗСерииНоменклатуры.Номенклатура КАК Номенклатура,
//	        |	ТЗСерииНоменклатуры.Серия КАК Серия
//	        |ПОМЕСТИТЬ ВТСерииНоменклатуры
//	        |ИЗ
//	        |	&ТЗСерииНоменклатуры КАК ТЗСерииНоменклатуры
//	        |
//	        |ИНДЕКСИРОВАТЬ ПО
//	        |	Номенклатура,
//	        |	Серия
//	        |;
//	        |
//	        |////////////////////////////////////////////////////////////////////////////////
//	        |ВЫБРАТЬ
//	        |	ТоварыНаСкладах.Регистратор КАК Регистратор,
//	        |	ТоварыНаСкладах.Номенклатура КАК Номенклатура,
//	        |	ТоварыНаСкладах.Серия КАК Серия,
//	        |	СУММА(ТоварыНаСкладах.ВНаличии) КАК Количество
//	        |ПОМЕСТИТЬ ВТТоварыНаСкладах
//	        |ИЗ
//	        |	РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
//	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСерииНоменклатуры КАК ВТСерииНоменклатуры
//	        |		ПО (ТоварыНаСкладах.Активность)
//	        |			И (ТоварыНаСкладах.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
//	        |			И ТоварыНаСкладах.Номенклатура = ВТСерииНоменклатуры.Номенклатура
//	        |			И ТоварыНаСкладах.Серия = ВТСерииНоменклатуры.Серия
//	        |			И (ТоварыНаСкладах.Регистратор ССЫЛКА Документ.СборкаТоваров)
//	        |
//	        |СГРУППИРОВАТЬ ПО
//	        |	ТоварыНаСкладах.Номенклатура,
//	        |	ТоварыНаСкладах.Серия,
//	        |	ТоварыНаСкладах.Регистратор
//	        |
//	        |ИНДЕКСИРОВАТЬ ПО
//	        |	Регистратор
//	        |;
//	        |
//	        |////////////////////////////////////////////////////////////////////////////////
//	        |ВЫБРАТЬ
//	        |	ВТТоварыНаСкладах.Номенклатура КАК Номенклатура,
//	        |	ВТТоварыНаСкладах.Серия КАК Серия,
//	        |	СУММА(ВТТоварыНаСкладах.Количество) КАК Количество,
//	        |	ТоварыНаСкладах.Номенклатура КАК Комплектующее,
//	        |	ТоварыНаСкладах.Серия КАК СерияКомплектующего,
//	        |	ВЫБОР
//	        |		КОГДА ТоварыНаСкладах.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
//	        |			ТОГДА ЛОЖЬ
//	        |		ИНАЧЕ ИСТИНА
//	        |	КОНЕЦ КАК СерияУказана,
//	        |	ЕСТЬNULL(ВариантыКомплектацииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)) КАК ВариантКомплектации,
//	        |	ВЫБОР
//	        |		КОГДА ЕСТЬNULL(ВариантыКомплектацииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)
//	        |			ТОГДА ЛОЖЬ
//	        |		ИНАЧЕ ИСТИНА
//	        |	КОНЕЦ КАК ВариантКомплектацииУказан,
//	        |	СУММА(ТоварыНаСкладах.ВНаличии) КАК КоличествоКомплектующих
//	        |ИЗ
//	        |	ВТТоварыНаСкладах КАК ВТТоварыНаСкладах
//	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
//	        |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
//	        |			ПО ТоварыНаСкладах.Номенклатура = ВариантыКомплектацииНоменклатуры.Владелец
//	        |				И (ВариантыКомплектацииНоменклатуры.Основной)
//	        |				И (НЕ ВариантыКомплектацииНоменклатуры.ПометкаУдаления)
//	        |		ПО (ТоварыНаСкладах.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
//	        |			И ВТТоварыНаСкладах.Регистратор = ТоварыНаСкладах.Регистратор
//	        |
//	        |СГРУППИРОВАТЬ ПО
//	        |	ВТТоварыНаСкладах.Номенклатура,
//	        |	ВТТоварыНаСкладах.Серия,
//	        |	ТоварыНаСкладах.Номенклатура,
//	        |	ТоварыНаСкладах.Серия,
//	        |	ВЫБОР
//	        |		КОГДА ТоварыНаСкладах.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
//	        |			ТОГДА ЛОЖЬ
//	        |		ИНАЧЕ ИСТИНА
//	        |	КОНЕЦ,
//	        |	ЕСТЬNULL(ВариантыКомплектацииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)),
//	        |	ВЫБОР
//	        |		КОГДА ЕСТЬNULL(ВариантыКомплектацииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)
//	        |			ТОГДА ЛОЖЬ
//	        |		ИНАЧЕ ИСТИНА
//	        |	КОНЕЦ";
// 
//	
//КонецФункции // ТекстЗапросаРазблюдовкаПоСериям()

//Функция ТекстЗапросаРазблюдовкаПоСпецификациям()
//	
//	Возврат "ВЫБРАТЬ
//	        |	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец КАК Номенклатура,
//	        |	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Количество КАК Количество,
//	        |	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Комплектующее,
//	        |	ВариантыКомплектацииНоменклатурыТовары.Количество КАК КоличествоКомплектующих,
//	        |	ЕСТЬNULL(ВариантыКомплектацииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)) КАК ВариантКомплектации,
//	        |	ВЫБОР
//	        |		КОГДА ЕСТЬNULL(ВариантыКомплектацииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)
//	        |			ТОГДА ЛОЖЬ
//	        |		ИНАЧЕ ИСТИНА
//	        |	КОНЕЦ КАК ВариантКомплектацииУказан
//	        |ИЗ
//	        |	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
//	        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
//	        |		ПО ВариантыКомплектацииНоменклатурыТовары.Номенклатура = ВариантыКомплектацииНоменклатуры.Владелец
//	        |			И (ВариантыКомплектацииНоменклатуры.Основной)
//	        |			И (НЕ ВариантыКомплектацииНоменклатуры.ПометкаУдаления)
//	        |ГДЕ
//	        |	ВариантыКомплектацииНоменклатурыТовары.Ссылка В(&ВариантыКомплектации)";	
//	
//КонецФункции // ТекстЗапросаРазблюдовкаПоСпецификациям()

//Функция ПолучитьЗатратыНаСборкуСтарый(ДатаНачала, ДатаОкончания, ГотоваяПродукция, СтатьяРасходов) Экспорт
//	
//	Запрос = Новый Запрос(
//	"ВЫБРАТЬ
//	|	ТоварыОрганизаций.Регистратор КАК Регистратор,
//	|	ТоварыОрганизаций.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура
//	|ПОМЕСТИТЬ ВТТоварыОрганизаций
//	|ИЗ
//	|	РегистрНакопления.ТоварыОрганизаций КАК ТоварыОрганизаций
//	|ГДЕ
//	|	ТоварыОрганизаций.Активность
//	|	И ТоварыОрганизаций.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
//	|	И ТоварыОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
//	|	И ТоварыОрганизаций.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеТоваров)
//	|	И ТоварыОрганизаций.АналитикаРасходов.Родитель = &ГотоваяПродукция
//	|
//	|ОБЪЕДИНИТЬ
//	|
//	|ВЫБРАТЬ
//	|	ТоварыОрганизаций.Регистратор,
//	|	ТоварыОрганизаций.АналитикаУчетаНоменклатуры.Номенклатура
//	|ИЗ
//	|	РегистрНакопления.ТоварыОрганизаций КАК ТоварыОрганизаций
//	|ГДЕ
//	|	ТоварыОрганизаций.Активность
//	|	И ТоварыОрганизаций.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
//	|	И ТоварыОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
//	|	И ТоварыОрганизаций.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеТоваров)
//	|	И ТоварыОрганизаций.КорАналитикаУчетаНоменклатуры.Номенклатура.Родитель = &ГотоваяПродукция
//	|
//	|ОБЪЕДИНИТЬ
//	|
//	|ВЫБРАТЬ
//	|	ТоварыОрганизаций.Регистратор,
//	|	ТоварыОрганизаций.АналитикаУчетаНоменклатуры.Номенклатура
//	|ИЗ
//	|	РегистрНакопления.ТоварыОрганизаций КАК ТоварыОрганизаций
//	|ГДЕ
//	|	ТоварыОрганизаций.Активность
//	|	И ТоварыОрганизаций.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
//	|	И ТоварыОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
//	|	И ТоварыОрганизаций.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеТоваров)
//	|	И ТоварыОрганизаций.СтатьяРасходов = &СтатьяРасходов
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Номенклатура
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ТоварыНаСкладахОбороты.Номенклатура КАК Номенклатура,
//	|	ТоварыНаСкладахОбороты.Склад КАК Склад,
//	|	ТоварыНаСкладахОбороты.Серия КАК Серия,
//	|	ВЫБОР
//	|		КОГДА ТоварыНаСкладахОбороты.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяССылка)
//	|			ТОГДА ЛОЖЬ
//	|		ИНАЧЕ ИСТИНА
//	|	КОНЕЦ КАК СерияУказана,
//	|	ЕСТЬNULL(ВариантыКомплектацииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)) КАК ВариантКомплектации,
//	|	ВЫБОР
//	|		КОГДА ЕСТЬNULL(ВариантыКомплектацииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)
//	|			ТОГДА ЛОЖЬ
//	|		ИНАЧЕ ИСТИНА
//	|	КОНЕЦ КАК ВариантКомплектацииУказан,
//	|	ТоварыНаСкладахОбороты.Регистратор КАК ДокументСборки,
//	|	ВЫБОР
//	|		КОГДА ТоварыНаСкладахОбороты.Номенклатура.Родитель = &ГотоваяПродукция
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК ЭтоГотоваяПродукция,
//	|	СУММА(ТоварыНаСкладахОбороты.ВНаличииРасход) КАК Количество
//	|ИЗ
//	|	РегистрНакопления.ТоварыНаСкладах.Обороты(
//	|			&ДатаНачала,
//	|			&ДатаОкончания,
//	|			Регистратор,
//	|			Номенклатура В
//	|				(ВЫБРАТЬ
//	|					ВТТоварыОрганизаций.Номенклатура КАК Номенклатура
//	|				ИЗ
//	|					ВТТоварыОрганизаций КАК ВТТоварыОрганизаций)) КАК ТоварыНаСкладахОбороты
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТоварыОрганизаций КАК ВТТоварыОрганизаций
//	|		ПО ТоварыНаСкладахОбороты.Номенклатура = ВТТоварыОрганизаций.Номенклатура
//	|			И ТоварыНаСкладахОбороты.Регистратор = ВТТоварыОрганизаций.Регистратор
//	|			И (ТоварыНаСкладахОбороты.ВНаличииРасход <> 0)
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
//	|		ПО ТоварыНаСкладахОбороты.Номенклатура = ВариантыКомплектацииНоменклатуры.Владелец
//	|			И (ВариантыКомплектацииНоменклатуры.Основной)
//	|			И (НЕ ВариантыКомплектацииНоменклатуры.ПометкаУдаления)
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ТоварыНаСкладахОбороты.Номенклатура,
//	|	ТоварыНаСкладахОбороты.Серия,
//	|	ТоварыНаСкладахОбороты.Склад,
//	|	ЕСТЬNULL(ВариантыКомплектацииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)),
//	|	ВЫБОР
//	|		КОГДА ЕСТЬNULL(ВариантыКомплектацииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)
//	|			ТОГДА ЛОЖЬ
//	|		ИНАЧЕ ИСТИНА
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА ТоварыНаСкладахОбороты.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяССылка)
//	|			ТОГДА ЛОЖЬ
//	|		ИНАЧЕ ИСТИНА
//	|	КОНЕЦ,
//	|	ТоварыНаСкладахОбороты.Регистратор,
//	|	ВЫБОР
//	|		КОГДА ТоварыНаСкладахОбороты.Номенклатура.Родитель = &ГотоваяПродукция
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ");
//	
//	Запрос.УстановитьПараметр("ДатаНачала"      , ДатаНачала);
//	Запрос.УстановитьПараметр("ДатаОкончания"   , ДатаОкончания);
//	Запрос.УстановитьПараметр("ГотоваяПродукция", ГотоваяПродукция);
//	Запрос.УстановитьПараметр("СтатьяРасходов"  , СтатьяРасходов);
//	
//	ТабЗатратыНаСборку = Запрос.Выполнить().Выгрузить();
//	
//	ЕстьУзлы = Истина;
//	
//	Пока ЕстьУзлы Цикл
//		ЕстьУзлы = Ложь;
//		
//		///////////////////////////////
//		// разблюдовка по спецификациям
//		Запрос.Текст = ТекстЗапросаРазблюдовкаПоСпецификациям();
//		
//		ТабЗатратыДляРазблюдовки = ТабЗатратыНаСборку.НайтиСтроки(Новый Структура("СерияУказана,ВариантКомплектацииУказан,ЭтоГотоваяПродукция", Ложь, Истина, Ложь));
//		
//		// Номенклатура,Склад,Серия,СерияУказана,ВариантКомплектации,ВариантКомплектацииУказан,ДокументСборки,ЭтоГотоваяПродукция,Количество
//		Пока ТабЗатратыДляРазблюдовки.Количество() > 0 Цикл
//			ВариантыКомплектации = ТабЗатратыНаСборку.ВыгрузитьКолонку("ВариантКомплектации");
//			
//			// запрос в цикле детектед, а куда деваться?
//			Запрос.УстановитьПараметр("ВариантыКомплектации", ВариантыКомплектации);
//			ТабСпецификацииНаСборку = Запрос.Выполнить().Выгрузить();
//			
//			Для Каждого СтрЗатратыДляРазблюдовки Из ТабЗатратыДляРазблюдовки Цикл
//				ТекущаяСпецификация = ТабСпецификацииНаСборку.НайтиСтроки(Новый Структура("Номенклатура", СтрЗатратыДляРазблюдовки.Номенклатура));
//				
//				// добавляем разблюдовку узла в затраты и исключаем узел
//				Для Каждого СтрТекущаяСпецификация Из ТекущаяСпецификация Цикл
//					СтрЗатратыНаСборку = ТабЗатратыНаСборку.Добавить();
//					СтрЗатратыНаСборку.Номенклатура              = СтрТекущаяСпецификация.Комплектующее;
//					СтрЗатратыНаСборку.Склад                     = СтрЗатратыДляРазблюдовки.Склад;
//					СтрЗатратыНаСборку.Серия                     = Справочники.СерииНоменклатуры.ПустаяСсылка();
//					СтрЗатратыНаСборку.СерияУказана              = Ложь;
//					СтрЗатратыНаСборку.ВариантКомплектации       = СтрТекущаяСпецификация.ВариантКомплектации;
//					СтрЗатратыНаСборку.ВариантКомплектацииУказан = СтрТекущаяСпецификация.ВариантКомплектацииУказан;
//					СтрЗатратыНаСборку.ДокументСборки            = СтрЗатратыДляРазблюдовки.ДокументСборки;
//					СтрЗатратыНаСборку.ЭтоГотоваяПродукция       = Ложь;
//					СтрЗатратыНаСборку.Количество                = СтрЗатратыДляРазблюдовки.Количество * СтрТекущаяСпецификация.КоличествоКомплектующих / СтрТекущаяСпецификация.Количество;
//					
//					ЕстьУзлы = Истина;
//				КонецЦикла;
//				
//				ТабЗатратыНаСборку.Удалить(СтрЗатратыДляРазблюдовки);
//			КонецЦикла;
//			
//			// разблюдовываем глубже
//			ТабЗатратыДляРазблюдовки = ТабЗатратыНаСборку.НайтиСтроки(Новый Структура("СерияУказана,ВариантКомплектацииУказан,ЭтоГотоваяПродукция", Ложь, Истина, Ложь));
//		КонецЦикла;
//		
//		////////////////////////
//		// разблюдовка по сериям
//		Запрос.Текст = ТекстЗапросаРазблюдовкаПоСериям();
//		
//		ТабЗатратыДляРазблюдовки = ТабЗатратыНаСборку.НайтиСтроки(Новый Структура("СерияУказана,ЭтоГотоваяПродукция", Истина, Ложь));
//		
//		// Номенклатура,Склад,Серия,СерияУказана,ВариантКомплектации,ВариантКомплектацииУказан,ДокументСборки,ЭтоГотоваяПродукция,Количество
//		Пока ТабЗатратыДляРазблюдовки.Количество() > 0 Цикл
//			ТабСерииНоменклатуры = ТабЗатратыНаСборку.Скопировать(Новый Структура("СерияУказана,ЭтоГотоваяПродукция", Истина, Ложь), "Номенклатура,Серия");
//			
//			// эх...
//			Запрос.УстановитьПараметр("ТЗСерииНоменклатуры", ТабСерииНоменклатуры);
//			ТабСпецификацииНаСборку = Запрос.Выполнить().Выгрузить();
//			
//			Для Каждого СтрЗатратыДляРазблюдовки Из ТабЗатратыДляРазблюдовки Цикл
//				ТекущаяСпецификация = ТабСпецификацииНаСборку.НайтиСтроки(Новый Структура("Номенклатура,Серия", СтрЗатратыДляРазблюдовки.Номенклатура, СтрЗатратыДляРазблюдовки.Серия));
//				
//				// добавляем разблюдовку узла в затраты и исключаем узел
//				Для Каждого СтрТекущаяСпецификация Из ТекущаяСпецификация Цикл
//					СтрЗатратыНаСборку = ТабЗатратыНаСборку.Добавить();
//					СтрЗатратыНаСборку.Номенклатура              = СтрТекущаяСпецификация.Комплектующее;
//					СтрЗатратыНаСборку.Склад                     = СтрЗатратыДляРазблюдовки.Склад;
//					СтрЗатратыНаСборку.Серия                     = СтрТекущаяСпецификация.СерияКомплектующего;
//					СтрЗатратыНаСборку.СерияУказана              = СтрТекущаяСпецификация.СерияУказана;
//					СтрЗатратыНаСборку.ВариантКомплектации       = СтрТекущаяСпецификация.ВариантКомплектации;
//					СтрЗатратыНаСборку.ВариантКомплектацииУказан = СтрТекущаяСпецификация.ВариантКомплектацииУказан;
//					СтрЗатратыНаСборку.ДокументСборки            = СтрЗатратыДляРазблюдовки.ДокументСборки;
//					СтрЗатратыНаСборку.ЭтоГотоваяПродукция       = Ложь;
//					СтрЗатратыНаСборку.Количество                = СтрЗатратыДляРазблюдовки.Количество * СтрТекущаяСпецификация.КоличествоКомплектующих / СтрТекущаяСпецификация.Количество;
//					
//					ЕстьУзлы = Истина;
//				КонецЦикла;
//				
//				ТабЗатратыНаСборку.Удалить(СтрЗатратыДляРазблюдовки);
//			КонецЦикла;
//			
//			// разблюдовываем глубже
//			ТабЗатратыДляРазблюдовки = ТабЗатратыНаСборку.НайтиСтроки(Новый Структура("СерияУказана,ЭтоГотоваяПродукция", Истина, Ложь));
//		КонецЦикла;
//	КонецЦикла; // Пока ЕстьУзлы Цикл
//	
//	ТабЗатратыНаСборку.Свернуть("Номенклатура,Склад, ДокументСборки", "Количество");
//	
//	Возврат ТабЗатратыНаСборку;
//	
//КонецФункции // ПолучитьЗатратыНаСборку()
