#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Отбор.Свойство("Налог") Или Не ЗначениеЗаполнено(Параметры.Отбор.Налог) Тогда
		ВызватьИсключение НСтр("ru='Не поддерживается использование формы без указания налога'");
	КонецЕсли;
	
	Налог = Параметры.Отбор.Налог;
	
	АвтоЗаголовок = Ложь;
	
	Если Налог = Перечисления.ВидыИмущественныхНалогов.НалогНаИмущество Тогда
		Заголовок = Нстр("ru='Основания льгот по налогу на имущество'");
	ИначеЕсли Налог = Перечисления.ВидыИмущественныхНалогов.ТранспортныйНалог Тогда
		Заголовок = Нстр("ru='Основания льгот по транспортному налогу'");
	ИначеЕсли Налог = Перечисления.ВидыИмущественныхНалогов.ЗемельныйНалог Тогда
		Заголовок = Нстр("ru='Основания льгот по земельному налогу'");
	Иначе
		ВызватьИсключение СтрШаблон(НСтр("ru='Неподдерживаемый вид налога: %1'"), Налог);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Запись_ОснованияЛьготПоИмущественнымНалогам" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Если Копирование Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Элементы.Список.Обновить();
	Элементы.Список.ТекущаяСтрока = ВыбранноеЗначение;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьЛьготуНалогНаИмущество(Команда)
	СоздатьЛьготу(ПредопределенноеЗначение("Перечисление.ВидыИмущественныхНалогов.НалогНаИмущество"));
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЛьготуТранспортныйНалог(Команда)
	СоздатьЛьготу(ПредопределенноеЗначение("Перечисление.ВидыИмущественныхНалогов.ТранспортныйНалог"));
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЛьготуЗемельныйНалог(Команда)
	СоздатьЛьготу(ПредопределенноеЗначение("Перечисление.ВидыИмущественныхНалогов.ЗемельныйНалог"));
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СоздатьЛьготу(Налог)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура("Налог", Налог));
	ОткрытьФорму("Справочник.ОснованияЛьготПоИмущественнымНалогам.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект)

КонецПроцедуры

#КонецОбласти