
//&Перед("ОбработкаПроверкиЗаполнения")
//Процедура vs_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
//	СтруктураОтбора = Новый Структура("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "ОплатаПоДоговоруБезСчета_0a8b9b3ad54541998932dc50d98ccd96"));
//	ИскомыеСтроки = ДополнительныеРеквизиты.НайтиСтроки(СтруктураОтбора);
//	Если ИскомыеСтроки.Количество()
//		и ИскомыеСтроки[0].Значение Тогда
//	Иначе
//		ПроверяемыеРеквизиты.Добавить("НомерПоДаннымПоставщика");	
//		ПроверяемыеРеквизиты.Добавить("ДатаПоДаннымПоставщика");
//	КонецЕсли;
//КонецПроцедуры
