
//&Вместо("ОбработкаПроведения")
//Процедура ИТБК_ОбработкаПроведения(Отказ, РежимПроведения)
//	Если не ПроведеноБанком Тогда 
//		ОбработкаУдаленияПроведения(Отказ);
//		Если не Отказ Тогда 
//			
//			Движения.ДенежныеСредстваКВыплате.Записывать = Истина;
//			Движение = Движения.ДенежныеСредстваКВыплате.Добавить();
//			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
//			Движение.Период = Дата;
//			Движение.ЗаявкаНаРасходованиеДенежныхСредств = 1;
//			Движение.БанковскийСчетКасса = 1;
//			Движение.Получатель = 1;
//			Движение.Организация = 1;
//			Движение.Сумма = 1;
//			Движение.ХозяйственнаяОперация = 1;
//			
//			
//		КонецЕсли;	
//	иначе
//		// Вставить содержимое метода.
//		ПродолжитьВызов(Отказ, РежимПроведения);
//	КонецЕсли;	
//	
//КонецПроцедуры


//&После("ОбработкаПроведения")
//Процедура ИТБК_ОбработкаПроведения(Отказ, РежимПроведения)
//	Если не ПроведеноБанком Тогда 
//	ОбработкаУдаленияПроведения(Отказ);	
//	КонецЕсли;	
//КонецПроцедуры


//&Перед("ОбработкаПроведения")
//Процедура ИТБК_ОбработкаПроведения1(Отказ, РежимПроведения)
//	//Сообщить(Движения.ДенежныеСредстваБезналичные.Количество());
//	Если не ПроведеноБанком Тогда 
//		ОбработкаУдаленияПроведения(Отказ);	

//		Возврат;
//	КонецЕсли;
//КонецПроцедуры

