
&НаКлиенте
Процедура vs_ПриОткрытииПосле(Отказ)
	vs_ПриОткрытииПослеНаСервере();
КонецПроцедуры

&НаСервере
Процедура vs_ПриОткрытииПослеНаСервере()
	список.ТекстЗапроса = "
	|ВЫБРАТЬ
	|	vs_ДоизготовлениеОстатки.АктИзготовления КАК АктИзготовления,
	|	vs_ДоизготовлениеОстатки.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ Вт0
	|ИЗ
	|	РегистрНакопления.vs_Доизготовление.Остатки КАК vs_ДоизготовлениеОстатки
	|ГДЕ
	|	vs_ДоизготовлениеОстатки.ДоизготовитьОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Вт0.АктИзготовления КАК АктИзготовления
	|ПОМЕСТИТЬ Вт1
	|ИЗ
	|	Вт0 КАК Вт0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|"+
	список.ТекстЗапроса ;   	
	
	список.ТекстЗапроса = СтрЗаменить(список.ТекстЗапроса,"ИЗ
	|	Документ.ЗаказНаСборку КАК ДокументЗаказНаСборку", ",
	|	НЕ Вт1.АктИзготовления ЕСТЬ NULL КАК ТребуетсяДоизготовление
	|ИЗ
	|	Документ.ЗаказНаСборку КАК ДокументЗаказНаСборку ЛЕВОЕ СОЕДИНЕНИЕ Вт1 КАК Вт1
	|	ПО ДокументЗаказНаСборку.Ссылка = Вт1.АктИзготовления");
	
	
	НЭ = Элементы.Добавить("ТребуетсяДоизготовление",Тип("ПолеФормы"),Элементы.Список);
	НЭ.ПутьКДанным = "Список.ТребуетсяДоизготовление";
	НЭ.Вид = ВидПоляФормы.ПолеФлажка;
	
КонецПроцедуры
