////////////////////////////////////////////////////////////////////////////////
// Подсистема "Рабочие места охраны труда"
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура УстановитьРабочееМестоКомментарий(Форма) Экспорт
	
	Элемент = Форма.Элементы.Найти("РабочееМестоКомментарий");
	Если Элемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИзменитьРабочееМесто = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(Форма, "Объект.ИзменитьРабочееМесто");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "РабочееМестоКомментарий", "Видимость", ИзменитьРабочееМесто);
	
	Если ИзменитьРабочееМесто Тогда
		Если ЗначениеЗаполнено(Форма.ТекущееРабочееМесто) Тогда
			Форма.РабочееМестоКомментарий = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Ранее сотрудник занимал рабочее место ""%1""'"), Форма.ТекущееРабочееМесто);
		Иначе
			Форма.РабочееМестоКомментарий = НСтр("ru = 'Сотруднику еще не назначено рабочее место'");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти