
//&ИзменениеИКонтроль("ОбработатьДанныеДляПереходаНаНовуюВерсию")
//Процедура vs_ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры)
//	
//	МетаданныеРегистра = СоздатьНаборЗаписей().Метаданные();
//	ПолноеИмяРегистра = МетаданныеРегистра.ПолноеИмя();
//	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
//	
//	Если ОбновляемыеДанные.Количество() = 0 Тогда
//		Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяРегистра);
//		Возврат;
//	КонецЕсли;
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//		|	ВЫБОР
//		|		КОГДА ДанныеРегистра.ОбъектРасчетов <> &ОбъектРасчетовПустаяСсылка
//		|			ТОГДА ДанныеРегистра.ОбъектРасчетов
//		|		ИНАЧЕ ЕСТЬNULL(ОбъектыРасчетов.Ссылка, &ОбъектРасчетовПустаяСсылка)
//		|	КОНЕЦ КАК ОбъектРасчетов,
//		|	ДанныеРегистра.Регистратор КАК Регистратор,
//		|	ДанныеРегистра.НомерСтроки,
//		|	ДанныеРегистра.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
//#Удаление
//		|	ДанныеРегистра.УдалитьОбъектРасчетов КАК ИсточникОбъектаРасчетов
//#КонецУдаления
//#Вставка
//		|	ДанныеРегистра.УдалитьОбъектРасчетов КАК ИсточникОбъектаРасчетов,
//		|	ДанныеРегистра.Валюта КАК Валюта
//#КонецВставки
//		|ИЗ
//		|	РегистрНакопления.РасчетыСКлиентамиПланОплат КАК ДанныеРегистра
//		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК Аналитика
//		|			ПО ДанныеРегистра.АналитикаУчетаПоПартнерам = Аналитика.Ссылка
//		|			
//		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договора
//		|			ПО Договора.Ссылка = Аналитика.Договор
//		|		
//		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
//		|			ПО ДанныеРегистра.УдалитьОбъектРасчетов 				= ОбъектыРасчетов.Объект
//		|			И ОбъектыРасчетов.ТипРасчетов 							= ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом)
//		|			И ОбъектыРасчетов.Контрагент 							= Аналитика.Контрагент
//		|			И ОбъектыРасчетов.Организация							= Аналитика.Организация
//		|			И ОбъектыРасчетов.ВалютаВзаиморасчетов 					= ДанныеРегистра.Валюта
//		|
//		|			И (ВЫБОР
//		|				КОГДА ТИПЗНАЧЕНИЯ(ДанныеРегистра.УдалитьОбъектРасчетов) = ТИП(Справочник.ДоговорыКонтрагентов)
//		|						И Договора.РазрешенаРаботаСДочернимиПартнерами
//		|					ТОГДА Договора.Партнер
//		|				ИНАЧЕ Аналитика.Партнер
//		|			КОНЕЦ = ОбъектыРасчетов.Партнер)
//		|
//		|ГДЕ
//		|	ДанныеРегистра.Регистратор В (&Регистраторы)
//		|	И НЕ ДанныеРегистра.УдалитьОбъектРасчетов В (&ПустыеЗначенияОбъектовРасчетов)
//		|
//		|ОБЪЕДИНИТЬ ВСЕ
//		|
//		|ВЫБРАТЬ
//		|	ВЫБОР
//		|		КОГДА ДанныеРегистра.ОбъектРасчетов <> &ОбъектРасчетовПустаяСсылка
//		|			ТОГДА ДанныеРегистра.ОбъектРасчетов
//		|		ИНАЧЕ ЕСТЬNULL(ОбъектыРасчетов.Ссылка, &ОбъектРасчетовПустаяСсылка)
//		|	КОНЕЦ КАК ОбъектРасчетов,
//		|	ДанныеРегистра.Регистратор,
//		|	ДанныеРегистра.НомерСтроки,
//		|	ДанныеРегистра.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
//#Удаление
//		|	ДанныеРегистра.АналитикаУчетаПоПартнерам
//#КонецУдаления
//#Вставка
//		|	ДанныеРегистра.АналитикаУчетаПоПартнерам,
//		|	ДанныеРегистра.Валюта КАК Валюта
//#КонецВставки
//		|ИЗ
//		|	РегистрНакопления.РасчетыСКлиентамиПланОплат КАК ДанныеРегистра
//		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК Аналитика
//		|			ПО ДанныеРегистра.АналитикаУчетаПоПартнерам = Аналитика.Ссылка
//		|
//		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
//		|			ПО ОбъектыРасчетов.ТипРасчетов 				= ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом)
//		|			И ОбъектыРасчетов.Организация 				= Аналитика.Организация
//		|			И ОбъектыРасчетов.Контрагент 				= Аналитика.Контрагент
//		|			И ОбъектыРасчетов.Договор 					= Аналитика.Договор
//		|			И ОбъектыРасчетов.НаправлениеДеятельности 	= Аналитика.НаправлениеДеятельности
//		|			И ОбъектыРасчетов.Партнер 					= Аналитика.Партнер
//		|			И ОбъектыРасчетов.ВалютаВзаиморасчетов 		= ДанныеРегистра.Валюта
//		|			И ОбъектыРасчетов.Объект 					= НЕОПРЕДЕЛЕНО
//		|ГДЕ
//		|	ДанныеРегистра.Регистратор В (&Регистраторы)
//		|	И ДанныеРегистра.УдалитьОбъектРасчетов В (&ПустыеЗначенияОбъектовРасчетов)
//		|ИТОГИ ПО
//		|	Регистратор
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	КОЛИЧЕСТВО(*) КАК КоличествоСтрок,
//		|	ДанныеРегистра.Регистратор КАК Регистратор
//		|ИЗ
//		|	РегистрНакопления.РасчетыСКлиентамиПланОплат КАК ДанныеРегистра
//		|ГДЕ
//		|	ДанныеРегистра.Регистратор В (&Регистраторы)
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	ДанныеРегистра.Регистратор";
//	
//	Запрос.УстановитьПараметр("ПустыеЗначенияОбъектовРасчетов", ОбъектыРасчетовСервер.ПустыеЗначенияОбъектРасчетов());
//	Запрос.УстановитьПараметр("ОбъектРасчетовПустаяСсылка", Справочники.ОбъектыРасчетов.ПустаяСсылка());
//	
//	ВсеОбъектыРасчетовСгенерированы = ОбъектыРасчетовСервер.ВсеОбъектыРасчетовСгенерированы(Параметры.Очередь);
//	Для Каждого ПорцияДанных Из ОбновляемыеДанные Цикл
//	
//		НачатьТранзакцию();
//		
//		Попытка
//			ОбрабатываемыйДокумент = ПорцияДанных.Регистратор;
//			Блокировка = Новый БлокировкаДанных;
//			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяРегистра + ".НаборЗаписей");
//			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
//			ЭлементБлокировки.УстановитьЗначение("Регистратор", ОбрабатываемыйДокумент);
//			Блокировка.Заблокировать();
//			
//			Запрос.УстановитьПараметр("Регистраторы", ОбрабатываемыйДокумент);
//			РезультатЗапроса = Запрос.ВыполнитьПакет();
//			
//			ВыборкаРегистратор = РезультатЗапроса[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//			КоличествоСтрок = РезультатЗапроса[1].Выгрузить();
//			
//			Пока ВыборкаРегистратор.Следующий() Цикл
//				ВыборкаДетальныеЗаписи = ВыборкаРегистратор.Выбрать();
//				НаборЗаписей = СоздатьНаборЗаписей();
//				НаборЗаписей.Отбор.Регистратор.Установить(ВыборкаРегистратор.Регистратор);
//				НаборЗаписей.Прочитать();
//				ЕстьОшибкаЗапонения = Ложь;
//				
//				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//					НоваяСтрокаНабора = НаборЗаписей[ВыборкаДетальныеЗаписи.НомерСтроки - 1];
//					Если Не ЗначениеЗаполнено(НоваяСтрокаНабора.ОбъектРасчетов) Тогда
//						Если ВыборкаДетальныеЗаписи.ОбъектРасчетов = Справочники.ОбъектыРасчетов.ПустаяСсылка() Тогда
//							Если ОбъектыРасчетовСервер.ЕстьБитыеСсылкиВИсточникеОбъектаРасчетов(ВыборкаДетальныеЗаписи.ИсточникОбъектаРасчетов)
//								ИЛИ ОбъектыРасчетовСервер.ЕстьБитыеСсылкиВИсточникеОбъектаРасчетов(ВыборкаДетальныеЗаписи.АналитикаУчетаПоПартнерам) Тогда
//								ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
//								НСтр("ru = 'Не удалось заполнить объект расчетов наборе записей регистра накопления %1, строка № %2
//									|в источнике данных объекта расчетов обнаружена ссылка на несуществующий элемент.'"),
//									ВыборкаРегистратор.Регистратор,
//									ВыборкаДетальныеЗаписи.НомерСтроки);
//								ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
//									УровеньЖурналаРегистрации.Ошибка,
//									МетаданныеРегистра,
//									,
//									ТекстСообщения);
//							ИначеЕсли НоваяСтрокаНабора.АналитикаУчетаПоПартнерам = Справочники.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка()
//									И Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ИсточникОбъектаРасчетов) Тогда
//									ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
//									НСтр("ru = 'Не удалось заполнить объект расчетов наборе записей регистра накопления %1, строка № %2
//										|Не заполнена аналитика учета по партнерам.'"),
//										ВыборкаРегистратор.Регистратор,
//										ВыборкаДетальныеЗаписи.НомерСтроки);
//									ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
//										УровеньЖурналаРегистрации.Ошибка,
//										МетаданныеРегистра,
//										,
//										ТекстСообщения);
//							Иначе
//								Если ОбновлениеИнформационнойБазы.ОбъектОбработан(ВыборкаДетальныеЗаписи.ИсточникОбъектаРасчетов).Обработан Тогда
//									Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ИсточникОбъектаРасчетов) Тогда
//										ОбъектРасчетов = Неопределено;
//										Если Не ТипЗнч(ВыборкаДетальныеЗаписи.ИсточникОбъектаРасчетов) = Тип("СправочникСсылка.КлючиАналитикиУчетаПоПартнерам") Тогда
//											ОбъектыРасчетовСервер.ДогенерироватьОбъектыРасчетов(ВыборкаДетальныеЗаписи.ИсточникОбъектаРасчетов);
//											
//											ДопПараметрыПоиска 						= ОбъектыРасчетовСервер.ДополнительныеКритерииПоиска();
//											Аналитика 								= ВыборкаДетальныеЗаписи.АналитикаУчетаПоПартнерам;
//											ДопПараметрыПоиска.Контрагент 			= Аналитика.Контрагент;
//											ДопПараметрыПоиска.Партнер				= Аналитика.Партнер;
//											ДопПараметрыПоиска.ВалютаВзаиморасчетов = НоваяСтрокаНабора.Валюта;
//											ДопПараметрыПоиска.ОбновлениеИБ			= Истина;
//											
//											ОбъектРасчетов = ОбъектыРасчетовСервер.ПолучитьОбъектРасчетовПоСсылке(
//												ВыборкаДетальныеЗаписи.ИсточникОбъектаРасчетов,
//												Аналитика.Организация,
//												Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом,
//												ДопПараметрыПоиска);
//										ИначеЕсли Не ВсеОбъектыРасчетовСгенерированы Тогда 
//											ЕстьОшибкаЗапонения = Истина;
//											Прервать;
//										КонецЕсли;
//										
//										Если ЗначениеЗаполнено(ОбъектРасчетов) Тогда
//											НоваяСтрокаНабора.ОбъектРасчетов = ОбъектРасчетов;
//										Иначе
//											ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
//											НСтр("ru = 'Не удалось заполнить объект расчетов в наборе записей регистра накопления %1, 
//												|по источнику %2.'"),
//												ПолноеИмяРегистра,
//												ВыборкаДетальныеЗаписи.ИсточникОбъектаРасчетов);
//											ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
//												УровеньЖурналаРегистрации.Ошибка,
//												МетаданныеРегистра,
//												,
//												ТекстСообщения);
//										КонецЕсли;
//									КонецЕсли;
//								Иначе
//									ЕстьОшибкаЗапонения = Истина;
//									Прервать;
//								КонецЕсли;
//							КонецЕсли;
//							
//							Если Не ЗначениеЗаполнено(НоваяСтрокаНабора.ОбъектРасчетов)
//									И Не ОбъектыРасчетовСервер.ЕстьБитыеСсылкиВИсточникеОбъектаРасчетов(ВыборкаДетальныеЗаписи.ИсточникОбъектаРасчетов)
//									И Не ОбъектыРасчетовСервер.ЕстьБитыеСсылкиВИсточникеОбъектаРасчетов(ВыборкаДетальныеЗаписи.АналитикаУчетаПоПартнерам)
//									И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ИсточникОбъектаРасчетов) Тогда
//										ЕстьОшибкаЗапонения = Истина;
//										Прервать;
//							КонецЕсли;
//						Иначе
//							НоваяСтрокаНабора.ОбъектРасчетов = ВыборкаДетальныеЗаписи.ОбъектРасчетов;
//						КонецЕсли;
//					КонецЕсли;
//				КонецЦикла;
//				
//				Если ЕстьОшибкаЗапонения Тогда
//					Продолжить;
//				КонецЕсли;
//				
//				ИсходноеКоличествоСтрок = КоличествоСтрок.Найти(ВыборкаРегистратор.Регистратор, "Регистратор").КоличествоСтрок;
//				
//				Если ИсходноеКоличествоСтрок <> НаборЗаписей.Количество() Тогда
//				
//					ВызватьИсключение (СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
//						НСтр("ru='При обработке набора записей регистра накопления %1 обнаружились дубли строк по регистратору: %2'"),
//						МетаданныеРегистра.Имя,
//						ВыборкаРегистратор.Регистратор));
//				
//				КонецЕсли;
//				
//				Если НаборЗаписей.Модифицированность() Тогда
//					ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
//				Иначе
//					ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(НаборЗаписей);
//				КонецЕсли;
//	
//			КонецЦикла;
//			
//			ЗафиксироватьТранзакцию();
//		
//		Исключение
//	
//			ОтменитьТранзакцию();
//	
//			Шаблон = НСтр("ru = 'Не удалось записать данные в регистр %1 , по причине: %2'");
//			ТекстСообщения = СтрШаблон(Шаблон,
//				ПолноеИмяРегистра,
//				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
//	
//			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
//				УровеньЖурналаРегистрации.Ошибка,
//				МетаданныеРегистра,
//				,
//				ТекстСообщения);
//	
//		КонецПопытки;
//	
//	КонецЦикла;
//	
//	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяРегистра);
//	Если Параметры.ОбработкаЗавершена Тогда
//		ОперативныеВзаиморасчетыСервер.ПослеОбновленияРегистровВзаиморасчетов();
//	КонецЕсли;
//	
//КонецПроцедуры
