
&ИзменениеИКонтроль("НовыйИсходящийДокументОбъект")
Функция vs_НовыйИсходящийДокументОбъект(НастройкиОтправки, ОписанияСообщений, ИдентификаторСвязи, ИдентификаторыОснований)

	Если ТипЗнч(ОписанияСообщений) = Тип("Массив") И ОписанияСообщений.Количество() > 0 Тогда
		ОписаниеСообщения = ОписанияСообщений[0];
	Иначе
		ОписаниеСообщения = ОписанияСообщений;
	КонецЕсли;

	ДокументОбъект = Документы.ЭлектронныйДокументИсходящийЭДО.СоздатьДокумент();
	ДокументОбъект.Дата = ТекущаяДатаСеанса();

	Если НастройкиОтправки.СоздатьНомерАвтоматически Тогда
		ДокументОбъект.УстановитьНовыйНомер();
		ДокументОбъект.НомерДокумента = СтроковыеФункцииКлиентСервер.УдалитьПовторяющиесяСимволы(
		ДокументОбъект.Номер, "0");
#Вставка
		// Здесь можно описать новое поведение.
		ПрефиксацияОбъектовКлиентСервер.УдалитьПрефиксыИзНомераОбъекта(ДокументОбъект.НомерДокумента, Истина, Истина);
#КонецВставки
	КонецЕсли;

	ЗаполнитьИсходящийДокументОбъект(ДокументОбъект, НастройкиОтправки, ОписаниеСообщения, ИдентификаторСвязи,
	ИдентификаторыОснований);

	Возврат ДокументОбъект;

КонецФункции

&ИзменениеИКонтроль("ВыполнитьДействиеОтправитьВАрхив")
Процедура vs_ВыполнитьДействиеОтправитьВАрхив(ПараметрыВыполнения, РезультатДействий)

	Действие = Перечисления.ДействияПоЭДО.ОтправитьВАрхив;

	РезультатДействий.Итог.ОбработаноПоДействиям.Вставить(Действие, 0);

	Комментарий = КомментарийДействия(ПараметрыВыполнения, Перечисления.ДействияПоЭДО.ЗакрытьПринудительно);

	Если ЗначениеЗаполнено(ПараметрыВыполнения.ОбъектыДействий.ПакетыДокументов) Тогда

		Для Каждого ПакетДокументов Из ПараметрыВыполнения.ОбъектыДействий.ПакетыДокументов Цикл
			ОтправитьВАрхивДокументыПакета(ПакетДокументов, РезультатДействий, Комментарий);
		КонецЦикла;

	КонецЕсли;

	Если ЗначениеЗаполнено(ПараметрыВыполнения.ОбъектыДействий.ЭлектронныеДокументы)
		Или ЗначениеЗаполнено(ПараметрыВыполнения.ОбъектыДействий.Сообщения)
		Или ЗначениеЗаполнено(ПараметрыВыполнения.ОбъектыДействий.ОбъектыУчета)
		Или ЗначениеЗаполнено(ПараметрыВыполнения.ОбъектыДействий.ИдентификаторыОрганизаций) Тогда

		КонтекстДиагностики = РезультатДействий.КонтекстДиагностики;
#Вставка
		Если ПараметрыВыполнения.Свойство("КонтекстФормыВызова")
			и не КонтекстДиагностики.Свойство("КонтекстФормыВызова") Тогда
        	КонтекстДиагностики.Вставить("КонтекстФормыВызова",ПараметрыВыполнения.КонтекстФормыВызова);
		КонецЕсли;
#КонецВставки
		Выборка = ВыборкаДокументовДляОбработкиДействия(ПараметрыВыполнения.ОбъектыДействий);
		Пока Выборка.Следующий() Цикл
			Если ОтправитьВАрхив(Выборка.ЭлектронныйДокумент, КонтекстДиагностики, Комментарий) Тогда
				ЗаполнитьИтогВыполненияДействияПоЭДО(РезультатДействий.Итог, Действие, Выборка.ЭлектронныйДокумент);
			КонецЕсли;
		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

&ИзменениеИКонтроль("ОтправитьВАрхив")
Функция vs_ОтправитьВАрхив(ЭлектронныйДокумент, КонтекстДиагностики, Комментарий)

	Результат = Истина;

	Действие = Перечисления.ДействияПоЭДО.ОтправитьВАрхив;
	КонтекстВыполненияДействия = СоздатьКонтекстВыполненияДействияПоДокументу(ЭлектронныйДокумент, Действие);

	НачатьТранзакцию();
	Попытка

		ЭтоВходящийЭДО = ЭлектронныеДокументыЭДО.ЭтоВходящийЭДО(ЭлектронныйДокумент);

		ЗаблокироватьДанныеДокументаДляИзменения(ЭлектронныйДокумент, ЭтоВходящийЭДО);

		ДокументОбъект = ЭлектронныйДокумент.ПолучитьОбъект();
#Вставка
		Если КонтекстДиагностики.Свойство("КонтекстФормыВызова")
			и КонтекстДиагностики.КонтекстФормыВызова = "ТекущиеДелаПоЭДО.ОтправитьВАрхивВходящиеДокументы" Тогда
             ДокументОбъект.НаОзнакомлении = Истина;
		КонецЕсли;
#КонецВставки
		Если Не ДокументОбъект.НаОзнакомлении Тогда
			ЗафиксироватьТранзакцию();
			Возврат Результат;
		КонецЕсли;

		ТекстыЗапроса = Новый Массив;
		ТекстыЗапроса.Добавить(ТекстЗапросаСостоянияДокумента());
		ТекстыЗапроса.Добавить(ТекстЗапросаСвойствСообщенияИнформацииОтправителя());

		Запрос = Новый Запрос;
		Запрос.Текст = СтрСоединить(ТекстыЗапроса, ОбщегоНазначения.РазделительПакетаЗапросов());
		Запрос.УстановитьПараметр("ЭлектронныйДокумент", ДокументОбъект.Ссылка);

		ТитулыОтправителя = Новый Массив;
		ТитулыОтправителя.Добавить(Перечисления.ТипыЭлементовРегламентаЭДО.ИнформацияОтправителя);
		Если ОбщегоНазначения.ПодсистемаСуществует("ЭлектронноеВзаимодействие.ОбменСГИСЭПД") Тогда
			МодульОбменСГИСЭПД = ОбщегоНазначения.ОбщийМодуль("ОбменСГИСЭПД");
			МодульОбменСГИСЭПД.ЗаполнитьТитулыОтправителя(ТитулыОтправителя);	
		КонецЕсли;
		Запрос.УстановитьПараметр("ТитулыОтправителя", ТитулыОтправителя);

		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		Если РезультатыЗапроса[0].Пустой()
			ИЛИ РезультатыЗапроса[1].Пустой() Тогда
			Результат = Ложь;
			ДобавитьОшибкуОтменыОперации(КонтекстВыполненияДействия, КонтекстДиагностики);
			ОтменитьТранзакцию();
		КонецЕсли;

		ВыборкаСостояния = РезультатыЗапроса[0].Выбрать();
		ВыборкаСостояния.Следующий();

		Если Не ДействиеДоступно(Действие, ВыборкаСостояния.Состояние, ДокументОбъект, КонтекстДиагностики) Тогда
			Результат = Ложь;
			ДобавитьОшибкуОтменыОперации(КонтекстВыполненияДействия, КонтекстДиагностики);
			ОтменитьТранзакцию();
		КонецЕсли;

		СвойстваСообщения = РезультатыЗапроса[1].Выбрать();
		СвойстваСообщения.Выбрать();

		ДокументОбъект.НаОзнакомлении = Ложь;
		ДокументОбъект.Записать();

		СостояниеДокумента = ЭлектронныеДокументыЭДО.СостояниеДокумента(ЭлектронныйДокумент);
#Вставка
		Если КонтекстДиагностики.Свойство("КонтекстФормыВызова")
			и КонтекстДиагностики.КонтекстФормыВызова = "ТекущиеДелаПоЭДО.ОтправитьВАрхивВходящиеДокументы" Тогда
			ЗаписатьСостояниеДокумента(ЭлектронныйДокумент, Перечисления.СостоянияДокументовЭДО.ЗакрытПринудительно, "", ТекущаяДатаСеанса(), "Помещение в архив (vssoft)");
		КонецЕсли;
#КонецВставки
		РегистрыСведений.ЖурналДействийПоЭДО.ЗаписатьДействие(Действие, ДокументОбъект, СостояниеДокумента,
		ТекущаяДатаСеанса(), СвойстваСообщения, Комментарий);

		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ДобавитьОшибкуВыполненияДействия(ТекстОшибки, КонтекстВыполненияДействия, КонтекстДиагностики);	
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;

	Возврат Результат;

КонецФункции 

Процедура ЗаписатьСостояниеДокумента(ЭлектронныйДокумент, Состояние, СостояниеДополнение, ДатаИзменения, Комментарий = "")
	МенеджерЗаписи = РегистрыСведений.СостоянияДокументовЭДО.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ЭлектронныйДокумент = ЭлектронныйДокумент;
	МенеджерЗаписи.Состояние = Состояние;
	МенеджерЗаписи.СостояниеДополнение = СостояниеДополнение;
	МенеджерЗаписи.ДатаИзменения = ДатаИзменения;
	МенеджерЗаписи.Комментарий = Комментарий;
	МенеджерЗаписи.Записать();
КонецПроцедуры

