
&Перед("ПередЗаписью")
Процедура vs_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения тогда
		Отказ = vs_ОбщийМодуль.ЕстьДоизготовления(Ссылка);
	КонецЕсли;
	
	Если не Отказ и РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения  тогда
		Набор = РегистрыСведений.vs_ДанныеАвтоизготовления.СоздатьНаборЗаписей();
		Набор.Отбор.ЗаказНаСборку.Установить(Ссылка);
		Набор.Очистить();
		Набор.Записать();
		
		Набор = РегистрыСведений.ИТБК_ДанныеАвтоизготовления.СоздатьНаборЗаписей();
		Набор.Отбор.ЗаказНаСборку.Установить(Ссылка);
		Набор.Очистить();
		Набор.Записать();
	КонецЕсли;
	
КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура vs_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если Номенклатура.ВидНоменклатуры.ИспользоватьСерии тогда
		Количество = 1;
		КоличествоУпаковок = 1 ;
		Упаковка = Неопределено;
	КонецЕсли;
	
КонецПроцедуры
