
&После("ПриСозданииНаСервере")
Процедура vs_ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка)
	Элементы = Форма.Элементы;
	Если Форма.ИмяФормы	= "Документ.ЗаказПоставщику.Форма.ФормаДокумента" Тогда  // begin fix Designer08.09.2020 15:02:59
		Форма.Элементы.НомерВходящегоДокумента.Заголовок = "Счет поставщика";
		//СтруктураОтбора = Новый Структура("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "ОплатаПоДоговоруБезСчета_0a8b9b3ad54541998932dc50d98ccd96"));
		//ИскомыеСтроки = Форма.Объект.ДополнительныеРеквизиты.НайтиСтроки(СтруктураОтбора);
		//Если ИскомыеСтроки.Количество()
		//	и ИскомыеСтроки[0].Значение Тогда
		//Иначе
		//	Форма.Элементы.НомерВходящегоДокумента.АвтоОтметкаНезаполненного = Истина;	
		//	Форма.Элементы.ДатаВходящегоДокумента.АвтоОтметкаНезаполненного = Истина;
		//КонецЕсли;
		//Форма.Элементы.ГруппаЗаказПоДаннымПоставщика.Видимость = Ложь;
		Если Форма.Элементы.ГруппаДополнительныеРеквизиты.ПодчиненныеЭлементы.Количество() Тогда
			Форма.Элементы.Переместить(Форма.Элементы.ГруппаЗаказПоДаннымПоставщика, Форма.Элементы.ГруппаДополнительныеРеквизиты, Форма.Элементы.ГруппаДополнительныеРеквизиты.ПодчиненныеЭлементы[Форма.Элементы.ГруппаДополнительныеРеквизиты.ПодчиненныеЭлементы[0].Имя]);
		иначе
			Форма.Элементы.Переместить(Форма.Элементы.ГруппаЗаказПоДаннымПоставщика, Форма.Элементы.ГруппаДополнительныеРеквизиты);
		КонецЕсли;
	ИначеЕсли Форма.ИмяФормы	= "Документ.ЗаказКлиента.Форма.ФормаДокумента" Тогда
		Форма.Элементы.НомерПоДаннымКлиента.Заголовок = "Счет на оплату";
	ИначеЕсли Форма.ИмяФормы	= "Документ.ПередачаМатериаловВПроизводство.Форма.ФормаДокумента" Тогда
		НовыйЭлемент = Форма.Элементы.Вставить("ИТБК_ТехническийДокумент", Тип("ПолеФормы"), Форма.Элементы.ГруппаДополнительно, Форма.Элементы.ГруппаДополнительныеРеквизиты);
		НовыйЭлемент.Заголовок = "Технический документ (Мат.Отчет)";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПутьКДанным = "Объект.ИТБК_ТехническийДокумент";
		
		Форма.ТолькоПросмотр = Форма.Объект.ИТБК_ТехническийДокумент;
		Форма.Элементы.Статус.Видимость = Не Форма.Объект.ИТБК_ТехническийДокумент;
	ИначеЕсли Форма.ИмяФормы	= "Документ.ВнутреннееПотребление.Форма.ФормаДокумента" Тогда
		Если (Форма.Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеТоваровПоТребованию
			или Форма.Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПередачаВЭксплуатацию)
			и Форма.Элементы.ТоварыСтатьяРасходов.Видимость 
			и Форма.Элементы.ТоварыСтатьяРасходов.Доступность 
			и Форма.Элементы.Найти("vs_СтатьяРасходов") = Неопределено Тогда
			
			Элементы = Форма.Элементы;
			
			НовыйЭлемент = Элементы.Вставить("vs_СтатьяРасходов", Тип("ПолеФормы"), Элементы.ГруппаТовары, Элементы.Товары);
			НовыйЭлемент.Заголовок 				= 	"Статья расходов/активов (vssoft)";
			НовыйЭлемент.Вид 					= ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.ПутьКДанным 			= "Объект.vs_СтатьяРасходов";
			//НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
			//НовыйЭлемент.МаксимальнаяШирина 	= 28;
			//НовыйЭлемент.КнопкаВыпадающегоСписка= Истина;
			НовыйЭлемент.КнопкаВыбора           = Истина;
			НовыйЭлемент.КнопкаОткрытия			= Истина;
			НовыйЭлемент.Установитьдействие("ПриИзменении", "Подключаемый_ВыполнитьПереопределяемуюКоманду");
			
			//Элементы.ТоварыСтатьяРасходов.Видимость = Ложь;
			Элементы.ТоварыСтатьяРасходов.Доступность = Ложь;
			Элементы.ТоварыСтатьяРасходов.Ширина		= 1;
			Элементы.ТоварыСтатьяРасходов.ОтображатьВШапке = Ложь;
			Элементы.ТоварыСтатьяРасходов.ОтображатьВПодвале = Ложь;
			Элементы.ТоварыСтатьяРасходов.АвтоМаксимальнаяШирина = Ложь;
			Элементы.ТоварыСтатьяРасходов.Заголовок = ".";
		КонецЕсли;
	ИначеЕсли Форма.ИмяФормы	= "Документ.ЗаявкаНаРасходованиеДенежныхСредств.Форма.ФормаДокумента" Тогда
		//Команды
		НоваяКоманда = Форма.Команды.Добавить("vs_ЗаполнитьСчетНаОплату");
		НоваяКоманда.Действие = "vs_ЗаполнитьСчетНаОплату";	
		
		//НоваяГруппа = Форма.Элементы.Добавить("РасшифровкаПлатежаvsГруппаКнопкиаполнитьСчетНаОплату",Тип("ГруппаФормы"), Форма.Элементы.РасшифровкаБезРазбиения);
		НоваяКнопка = Форма.Элементы.Добавить("РасшифровкаПлатежаvs_ЗаполнитьСчетНаОплату", Тип("КнопкаФормы"), Форма.Элементы.РасшифровкаБезРазбиения);
		НоваяКнопка.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	    НоваяКнопка.ИмяКоманды = "vs_ЗаполнитьСчетНаОплату";
		НоваяКнопка.Заголовок = "Заполнить счет на оплату";
		
		Форма.Элементы.Переместить(НоваяКнопка, Форма.Элементы.РасшифровкаБезРазбиения, Форма.Элементы.РасшифровкаБезРазбиения.ПодчиненныеЭлементы.РасшифровкаБезРазбиенияКомментарий);
		
		НоваяКнопка = Форма.Элементы.Добавить("РасшифровкаПлатежаvs_ЗаполнитьСчетНаОплату1",Тип("КнопкаФормы"), Форма.Элементы.РасшифровкаПлатежа.КоманднаяПанель);
		НоваяКнопка.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	    НоваяКнопка.ИмяКоманды = "vs_ЗаполнитьСчетНаОплату";
		НоваяКнопка.Заголовок = "Заполнить счет на оплату";
		
		//Если Форма.Объект.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате Тогда
		//	НоваяКнопка.Доступность=Ложь;
		//КонецЕсли;
	ИначеЕсли Форма.ИмяФормы	= "Документ.КоммерческоеПредложениеКлиенту.Форма.ФормаДокумента" Тогда
		Статус = Форма.Объект.Статус;
		СВ = Элементы.Статус.СписокВыбора;
		Элементы.Статус.РежимВыбораИзСписка = Истина;
		СВ.Очистить();
		Если Не РольДоступна("ПолныеПрава") и Не РольДоступна("vs_ПравоИзмененияСтатусаКоммерческогоПредложенияКлиенту")
			и (Статус = Перечисления.СтатусыКоммерческихПредложенийКлиентам.Действует) Тогда
			СВ.Добавить(Форма.Объект.Статус);
			Элементы.Статус.Доступность = Ложь;
		ИначеЕсли Не РольДоступна("ПолныеПрава") и Не РольДоступна("vs_ПравоИзмененияСтатусаКоммерческогоПредложенияКлиенту") Тогда
			СВ.Добавить(Форма.Объект.Статус);
			Если СВ.НайтиПоЗначению(Перечисления.СтатусыКоммерческихПредложенийКлиентам.Черновик) = Неопределено Тогда
				СВ.Добавить(Перечисления.СтатусыКоммерческихПредложенийКлиентам.Черновик);
			КонецЕсли;
			Если СВ.НайтиПоЗначению(Перечисления.СтатусыКоммерческихПредложенийКлиентам.НеСогласовано) = Неопределено Тогда
				СВ.Добавить(Перечисления.СтатусыКоммерческихПредложенийКлиентам.НеСогласовано);
			КонецЕсли;
		Иначе
			СВ.Добавить(Перечисления.СтатусыКоммерческихПредложенийКлиентам.Черновик);
			СВ.Добавить(Перечисления.СтатусыКоммерческихПредложенийКлиентам.НеСогласовано);
            СВ.Добавить(Перечисления.СтатусыКоммерческихПредложенийКлиентам.Действует);
			СВ.Добавить(Перечисления.СтатусыКоммерческихПредложенийКлиентам.Отменено);
		КонецЕсли;
	ИначеЕсли Форма.ИмяФормы	= "Документ.СчетФактураВыданный.Форма.ФормаДокумента" Тогда
		Форма.Элементы.ПредставлениеНомера.УстановитьДействие("ПриИзменении", "Подключаемый_ВыполнитьПереопределяемуюКоманду");	
		//Форма.Элементы.ПредставлениеНомера.УстановитьДействие("ПриИзменении", "Подключаемый_ВыполнитьКомандуНаСервере");
	ИначеЕсли Форма.ИмяФормы	= "Документ.СчетФактураВыданныйАванс.Форма.ФормаДокументаРФ" Тогда
		НовыйЭлемент = Элементы.Вставить("ПредставлениеНомера", Тип("ПолеФормы"), Элементы.ГруппаШапкаПраво, Элементы.Корректировочный);
		НовыйЭлемент.Заголовок 				= 	"Номер на печать (vssoft)";
		НовыйЭлемент.Вид 					= ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным 			= "Объект.ПредставлениеНомера";
		НовыйЭлемент.Установитьдействие("ПриИзменении", "Подключаемый_ВыполнитьПереопределяемуюКоманду");	
		Элементы.Номер.Установитьдействие("ПриИзменении", "Подключаемый_ВыполнитьПереопределяемуюКоманду");
		
	ИначеЕсли Форма.ИмяФормы	= "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		Форма.Элементы.Номер.УстановитьДействие("ПриИзменении", "Подключаемый_ВыполнитьПереопределяемуюКоманду");
		//Форма.Команды.РеквизитыПечати.УстановитьДействие("Нажатие", "Подключаемый_ВыполнитьПереопределяемуюКоманду");
		Форма.Команды.РеквизитыПечати.Действие = "Подключаемый_ВыполнитьПереопределяемуюКоманду";
	ИначеЕсли Форма.ИмяФормы	= "Документ.АктВыполненныхРабот.Форма.ФормаДокумента" Тогда
		Форма.Элементы.Номер.УстановитьДействие("ПриИзменении", "Подключаемый_ВыполнитьПереопределяемуюКоманду");  // end fix Designer08.09.2020 15:03:03
	ИначеЕсли Форма.ИмяФормы	= "Отчет.vs_МатериальныйОтчет.Форма" Тогда  // begin fix Designer 14.06.2024 15:02:59 
		Если РольДоступна("ПолныеПрава") или РольДоступна("vs_ОтражениеМатериальногоОтчета") Тогда
			//Реквизиты
			МассивДобавляемыхРеквизитов = Новый Массив;
			МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("vs_ФормироватьДокументы",
				Новый ОписаниеТипов("Булево")));
			Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
			//Команды
			НоваяКоманда = Форма.Команды.Добавить("vs_ОтразитьМатериальныйОтчет");
			//НоваяКоманда.Действие = "Подключаемый_Команда";	
			НоваяКоманда.Действие = "ОтчетСкомпоноватьРезультат";	
		    //Кнопка
			НоваяКнопка = Элементы.Добавить("vs_Отразить",Тип("КнопкаФормы"), Элементы.ГруппаГлавное);
			НоваяКнопка.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		    НоваяКнопка.ИмяКоманды = "vs_ОтразитьМатериальныйОтчет";
			НоваяКнопка.Заголовок = "Отразить в учете";
            НоваяКнопка.ЦветФона = ЦветаСтиля.ВыделеннаяКнопкаФон;
			НоваяКнопка.ЦветТекста = ЦветаСтиля.ПодтверждениеОперацииОписаниеЦвет;
		
		КонецЕсли;	
	КонецЕсли;                                                                   
КонецПроцедуры

&После("ПриЧтенииНаСервере")
Процедура vs_ПриЧтенииНаСервере(Форма, ТекущийОбъект)                            // begin fix Designer27.10.2020 1:57:46
	Если Форма.ИмяФормы	= "Документ.ПередачаМатериаловВПроизводство.Форма.ФормаДокумента" Тогда
		Форма.ТолькоПросмотр = ТекущийОбъект.ИТБК_ТехническийДокумент;
		Форма.Элементы.Статус.Видимость = Не Форма.Объект.ИТБК_ТехническийДокумент;
	КонецЕсли;                                                                   // end fix Designer27.10.2020 1:57:39
КонецПроцедуры
