
&ИзменениеИКонтроль("ПараметрыДляПроведенияДокумента")
Функция vs_ПараметрыДляПроведенияДокумента(Документ, Свойства)

	Параметры = ПроведениеДокументов.ПараметрыУчетногоМеханизма();

	// Проведение
	Если Свойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда

		Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыНакопления.ЗаказыНаВнутреннееПотребление);
		Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыНакопления.ЗаказыНаПеремещение);
		Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыНакопления.ЗаказыНаСборку);

	КонецЕсли;

	// Контроль
	Если Свойства.РежимЗаписи <> РежимЗаписиДокумента.Запись Тогда

		ТипДокумента = ТипЗнч(Документ);

		ИсправительныйДокумент = ИсправлениеДокументов.ЭтоИсправительныйДокумент(Документ);

		Если ТипДокумента = Тип("ДокументОбъект.ЗаказНаВнутреннееПотребление")
			Или Свойства.РежимЗаписи = РежимЗаписиДокумента.Проведение
			И ТипДокумента = Тип("ДокументОбъект.ВнутреннееПотребление")
			Или ИсправительныйДокумент  Тогда
			Параметры.КонтрольныеРегистрыИзменений.Добавить(Метаданные.РегистрыНакопления.ЗаказыНаВнутреннееПотребление);
#Вставка
			Если Свойства.РежимЗаписи = РежимЗаписиДокумента.Проведение    // vs_Доизготовление
				И ТипДокумента = Тип("ДокументОбъект.ВнутреннееПотребление")Тогда
				Параметры.КонтрольныеРегистрыИзменений.Добавить(Метаданные.РегистрыНакопления.vs_Доизготовление);
				Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыНакопления.vs_Доизготовление);
            КонецЕсли;
#КонецВставки
		КонецЕсли;

		Если ТипДокумента = Тип("ДокументОбъект.ЗаказНаПеремещение")
			Или Свойства.РежимЗаписи = РежимЗаписиДокумента.Проведение
			И ТипДокумента = Тип("ДокументОбъект.ПеремещениеТоваров")
			Или ИсправительныйДокумент Тогда
			Параметры.КонтрольныеРегистрыИзменений.Добавить(Метаданные.РегистрыНакопления.ЗаказыНаПеремещение);
		КонецЕсли;

		Если ТипДокумента = Тип("ДокументОбъект.ЗаказНаСборку")
			Или Свойства.РежимЗаписи = РежимЗаписиДокумента.Проведение
			И ТипДокумента = Тип("ДокументОбъект.СборкаТоваров")
			Или ИсправительныйДокумент Тогда
			Параметры.КонтрольныеРегистрыИзменений.Добавить(Метаданные.РегистрыНакопления.ЗаказыНаСборку);
#Вставка
			Если Свойства.РежимЗаписи = РежимЗаписиДокумента.Проведение    // vs_Доизготовление
				И ТипДокумента = Тип("ДокументОбъект.СборкаТоваров") Тогда
				Параметры.КонтрольныеРегистрыИзменений.Добавить(Метаданные.РегистрыНакопления.vs_Доизготовление);
				Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыНакопления.vs_Доизготовление);
            КонецЕсли;
#КонецВставки
		КонецЕсли;

	КонецЕсли;

	Возврат Параметры;

КонецФункции
