#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура vs_СозданиеОбновлениеДокументовУстановкаЦенНоменклатуры() Экспорт
	//Запрос = Новый Запрос;
	//
	//Запрос.Текст = 
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	//|	ВидыЦен.Ссылка КАК Ссылка,
	//|	ВидыЦен.УстанавливатьЦенуПриВводеНаОсновании КАК УстанавливатьЦенуПриВводеНаОсновании,
	//|	ВидыЦен.ПометкаУдаления КАК ПометкаУдаления
	//|ПОМЕСТИТЬ ВидыЦен
	//|ИЗ
	//|	Справочник.ВидыЦен КАК ВидыЦен
	//|ГДЕ
	//|	ВидыЦен.УстанавливатьЦенуПриВводеНаОсновании
	//|	И ВидыЦен.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДействияВидовЦен.Действует)
	//|	И НЕ ВидыЦен.ПометкаУдаления
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|	УстановкаЦенНоменклатуры.ДокументОснование КАК ДокументОснование
	//|ПОМЕСТИТЬ ВТ_УстановкаЦенНоменклатуры
	//|ИЗ
	//|	Документ.УстановкаЦенНоменклатуры КАК УстановкаЦенНоменклатуры
	//|ГДЕ
	//|	УстановкаЦенНоменклатуры.Дата >= ДАТАВРЕМЯ(2019, 1, 1)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	УстановкаЦенНоменклатуры.ДокументОснование
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ПриобретениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	//|	ПриобретениеТоваровУслугТовары.Характеристика КАК Характеристика,
	//|	ПриобретениеТоваровУслугТовары.Упаковка КАК Упаковка,
	//|	ВидыЦен.Ссылка КАК ВидЦены,
	//|	ПриобретениеТоваровУслугТовары.Цена КАК Цена,
	//|	ПриобретениеТоваровУслугТовары.Ссылка КАК Ссылка
	//|ПОМЕСТИТЬ ВТ_Данные
	//|ИЗ
	//|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВидыЦен КАК ВидыЦен
	//|		ПО (ИСТИНА)
	//|ГДЕ
	//|	НЕ ПриобретениеТоваровУслугТовары.Ссылка В
	//|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|					УстановкаЦенНоменклатуры.ДокументОснование КАК ДокументОснование
	//|				ИЗ
	//|					ВТ_УстановкаЦенНоменклатуры КАК УстановкаЦенНоменклатуры)
	//|	И НЕ ПриобретениеТоваровУслугТовары.Цена = 0
	//|   И НЕ ПриобретениеТоваровУслугТовары.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ПриобретениеТоваровУслугТовары.Номенклатура,
	//|	ПриобретениеТоваровУслугТовары.Ссылка,
	//|	ПриобретениеТоваровУслугТовары.Характеристика,
	//|	ВидыЦен.Ссылка,
	//|	ПриобретениеТоваровУслугТовары.Цена,
	//|	ПриобретениеТоваровУслугТовары.Упаковка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_Данные.Номенклатура КАК Номенклатура,
	//|	ВТ_Данные.Характеристика КАК Характеристика,
	//|	ВТ_Данные.Упаковка КАК Упаковка,
	//|	ВТ_Данные.ВидЦены КАК ВидЦены,
	//|	ВТ_Данные.Цена КАК Цена,
	//|	ВТ_Данные.Ссылка КАК Ссылка
	//|ИЗ
	//|	ВТ_Данные КАК ВТ_Данные
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ВТ_Данные.Ссылка КАК Ссылка
	//|ИЗ
	//|	ВТ_Данные КАК ВТ_Данные
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВТ_Данные.Ссылка";

	//ОбработатьЗапрос(Запрос);
	// begin fix 29.11.2022 16:26:19	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВидыЦен.Ссылка КАК Ссылка,
	|	ВидыЦен.УстанавливатьЦенуПриВводеНаОсновании КАК УстанавливатьЦенуПриВводеНаОсновании,
	|	ВидыЦен.ПометкаУдаления КАК ПометкаУдаления,
	|	ВидыЦен.ЦенаВключаетНДС КАК ЦенаВключаетНДС
	|ПОМЕСТИТЬ ВидыЦен
	|ИЗ
	|	Справочник.ВидыЦен КАК ВидыЦен
	|ГДЕ
	|	ВидыЦен.УстанавливатьЦенуПриВводеНаОсновании
	|	И ВидыЦен.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДействияВидовЦен.Действует)
	|	И НЕ ВидыЦен.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УстановкаЦенНоменклатуры.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ ВТ_УстановкаЦенНоменклатуры
	|ИЗ
	|	Документ.УстановкаЦенНоменклатуры КАК УстановкаЦенНоменклатуры
	|ГДЕ
	|	УстановкаЦенНоменклатуры.Дата >= ДАТАВРЕМЯ(2019, 1, 1)
	|	И УстановкаЦенНоменклатуры.ПометкаУдаления = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	УстановкаЦенНоменклатуры.ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриобретениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	ПриобретениеТоваровУслугТовары.Характеристика КАК Характеристика,
	//|	ПриобретениеТоваровУслугТовары.Упаковка КАК Упаковка,
	|	ВидыЦен.Ссылка КАК ВидЦены,
	//|	ПриобретениеТоваровУслугТовары.Цена КАК Цена,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА ВидыЦен.ЦенаВключаетНДС
	|				И ПТУ.ЦенаВключаетНДС
	|			ТОГДА ПриобретениеТоваровУслугТовары.Цена
	|		КОГДА НЕ ВидыЦен.ЦенаВключаетНДС
	|				И НЕ ПТУ.ЦенаВключаетНДС
	|			ТОГДА ПриобретениеТоваровУслугТовары.Цена
	|		КОГДА ПриобретениеТоваровУслугТовары.Количество = 0
	|			ТОГДА 0
	|		КОГДА ВидыЦен.ЦенаВключаетНДС
	|				И НЕ ПТУ.ЦенаВключаетНДС
	|			ТОГДА ВЫРАЗИТЬ(ПриобретениеТоваровУслугТовары.СуммаСНДС / ПриобретениеТоваровУслугТовары.Количество КАК ЧИСЛО(15,2))
	|		КОГДА НЕ ВидыЦен.ЦенаВключаетНДС
	|				И ПТУ.ЦенаВключаетНДС
	|			ТОГДА ВЫРАЗИТЬ((ПриобретениеТоваровУслугТовары.СуммаСНДС - ПриобретениеТоваровУслугТовары.СуммаНДС) / ПриобретениеТоваровУслугТовары.Количество КАК ЧИСЛО(15,2))
	|	КОНЕЦ) КАК Цена,
	|	ПриобретениеТоваровУслугТовары.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслугТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК ПТУ
	|		ПО ПриобретениеТоваровУслугТовары.Ссылка = ПТУ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО ПриобретениеТоваровУслугТовары.Номенклатура = СпрНоменклатура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК СпрВидыНоменклатуры
	|		ПО СпрНоменклатура.ВидНоменклатуры = СпрВидыНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВидыЦен КАК ВидыЦен
	|		ПО (ИСТИНА)
	|ГДЕ
	|	НЕ ПриобретениеТоваровУслугТовары.Ссылка В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					УстановкаЦенНоменклатуры.ДокументОснование КАК ДокументОснование
	|				ИЗ
	|					ВТ_УстановкаЦенНоменклатуры КАК УстановкаЦенНоменклатуры)
	|	И НЕ ПриобретениеТоваровУслугТовары.Цена = 0
	|   И НЕ СпрВидыНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|	И ПТУ.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриобретениеТоваровУслугТовары.Номенклатура,
	|	ПриобретениеТоваровУслугТовары.Ссылка,
	|	ПриобретениеТоваровУслугТовары.Характеристика,
	|	ВидыЦен.Ссылка	//,
	//|	ПриобретениеТоваровУслугТовары.Цена,
	//|	ПриобретениеТоваровУслугТовары.Упаковка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.Номенклатура КАК Номенклатура,
	|	ВТ_Данные.Характеристика КАК Характеристика,
	//|	ВТ_Данные.Упаковка КАК Упаковка,
	|	ВТ_Данные.ВидЦены КАК ВидЦены,
	|	ВТ_Данные.Цена КАК Цена,
	|	ВТ_Данные.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Данные.Ссылка";

	vs_ОбработатьЗапрос(Запрос);
	// end fix 29.11.2022 16:26:48
КонецПроцедуры

Процедура vs_ОбработатьЗапрос(Запрос)
	
	МассивПакетов = Запрос.ВыполнитьПакет();
	
	ДокументыКСозданию = МассивПакетов[МассивПакетов.ВГраница()].Выгрузить();
	
	ДанныеДокументов = МассивПакетов[МассивПакетов.ВГраница()-1].Выгрузить();
	
	Для Каждого Док из ДокументыКСозданию Цикл
		Ссылка = Док.Ссылка;
		Отбор = Новый  Структура("Ссылка",Ссылка);
		
		НайденныеСтроки = ДанныеДокументов.НайтиСтроки(Отбор);
		
		Если НайденныеСтроки.Количество() Тогда
			
			ТЗТемп = ДанныеДокументов.Скопировать(НайденныеСтроки);
			
			НовыйДок = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
			НовыйДок.Товары.Загрузить(ТЗТемп);
			НовыйДок.Дата = Ссылка.Дата;
			НоваяСтрокаВидаЦен = НовыйДок.ВидыЦен.Добавить();
			НоваяСтрокаВидаЦен.ВидЦены =  НайденныеСтроки[0].ВидЦены;
			НовыйДок.ДокументОснование = Ссылка;
			НовыйДок.Согласован = Истина;
			НовыйДок.Статус =  Перечисления.СтатусыУстановокЦенНоменклатуры.Согласован;
			Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ВводОстатков") Тогда 
				НовыйДок.Дата = ?(ЗначениеЗаполнено(Ссылка.Партия),Ссылка.Партия.Дата,Ссылка.Дата);
				НовыйДок.Комментарий = Ссылка.Комментарий;
			КонецЕсли;
			    НовыйДок.Записать();
			Попытка
				НовыйДок.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				НС = ПолучитьНавигационнуюСсылку(НовыйДок.Ссылка);
				СтруктураСобытия = Новый Структура;
				СтруктураСобытия.Вставить("ИмяСобытия","vs_СозданиеОбновлениеДокументовУстановкаЦенНоменклатуры");
				СтруктураСобытия.Вставить("ПредставлениеУровня","Ошибка");
				СтруктураСобытия.Вставить("Комментарий",НС+"; " +ОписаниеОшибки());
				СтруктураСобытия.Вставить("ДатаСобытия",ТекущаяДата());
				СобытияДляЖурналаРегистрации = Новый СписокЗначений;
				СобытияДляЖурналаРегистрации.Добавить(СтруктураСобытия);
				ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СобытияДляЖурналаРегистрации);
			КонецПопытки;
		КонецЕсли;
		
		
	КонецЦикла;

	
КонецПроцедуры

#КонецЕсли