
//&ИзменениеИКонтроль("СформироватьПредставлениеСостоянияПоСтатусу")
//Процедура vs_СформироватьПредставлениеСостоянияПоСтатусу(Форма, Статус, ТекущаяДата)

//	Состояние = "";
//	СрокДействия = Форма.Объект.СрокДействия;

//	Если Статус = ПредопределенноеЗначение("Перечисление.СтатусыКоммерческихПредложенийКлиентам.НеСогласовано") Тогда
//		Состояние = НСтр("ru = 'На согласовании.'");
//#Вставка
//		//Если Форма.Объект.Согласован Тогда
//		//	Форма.Объект.Согласован = Ложь; 
//		//	Форма.Модифицированность = Истина;
//		//КонецЕсли;
//#КонецВставки
//	ИначеЕсли Статус = ПредопределенноеЗначение("Перечисление.СтатусыКоммерческихПредложенийКлиентам.Черновик") Тогда
//		Состояние = НСтр("ru = 'Подготавливается.'");
//#Вставка
//		Если Форма.Объект.Согласован Тогда
//			Форма.Объект.Согласован = Ложь;
//			Форма.Модифицированность = Истина;
//        КонецЕсли;
//#КонецВставки
//	ИначеЕсли Статус = ПредопределенноеЗначение("Перечисление.СтатусыКоммерческихПредложенийКлиентам.Отменено") Тогда
//		Состояние = НСтр("ru = 'Отменено.'");
//#Вставка
//		Если Форма.Объект.Согласован Тогда
//			Форма.Объект.Согласован = Ложь;
//			Форма.Модифицированность = Истина;
//        КонецЕсли;
//#КонецВставки
//	ИначеЕсли Статус = ПредопределенноеЗначение("Перечисление.СтатусыКоммерческихПредложенийКлиентам.Действует") Тогда

//		Если СрокДействия >= ТекущаяДата Тогда
//			Состояние = НСтр("ru = 'Действует.'");
//		Иначе
//			Состояние = НСтр("ru = 'Срок действия окончен.'");
//		КонецЕсли;

//	КонецЕсли;

//	ЭлементФормыСостояние = Форма.Элементы.Состояние; // ДекорацияФормы 
//	ЭлементФормыСостояние.Заголовок = Состояние;

//КонецПроцедуры
