#Область СлужебныеПроцедурыИФункции

Функция ТипыОбъектовСоСтороннимиПечатнымиФормами() Экспорт
	
	ТипыОбъектов = Новый Массив;
	ТипыОбъектов.Добавить(Тип("ДокументСсылка.Увольнение"));
	
	Возврат ТипыОбъектов;
	
КонецФункции

Процедура ЗаполнитьНастройкиПечатныхФормПоУмолчанию(ОписанияНастроек) Экспорт
	
	ЭДОБЗК.ДобавитьНастройкуПечатнойФормы(
		ОписанияНастроек,
		Документы.СогласиеНаПрисоединениеКЭДОБЗК.ИдентификаторКомандыПечатиЗаявления(),
		НСтр("ru = 'Заявление на согласие'"),
		Перечисления.СодержимоеДокументов.НеСодержитЗарплаты,
		,
		,
		Перечисления.ВариантыПодписанияДокументовЭДОБЗК.НеобходимаСобственноручнаяПодпись);
	
	ЭлектронныеТрудовыеКнижки.ЗаполнитьНастройкиПечатныхФормПоУмолчанию(ОписанияНастроек);
	УчетНДФЛДокументы.ЗаполнитьНастройкиПечатныхФормПоУмолчанию(ОписанияНастроек);
	КадровыйУчет.ЗаполнитьНастройкиПечатныхФормПоУмолчанию(ОписанияНастроек);
	УчетПособийСоциальногоСтрахования.ЗаполнитьНастройкиПечатныхФормПоУмолчанию(ОписанияНастроек);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ЗарплатаКадрыДляНебольшихОрганизаций") Тогда
		МодульЗарплатаКадрыДляНебольшихОрганизаций = ОбщегоНазначения.ОбщийМодуль("ЗарплатаКадрыДляНебольшихОрганизаций");
		МодульЗарплатаКадрыДляНебольшихОрганизаций.ЗаполнитьНастройкиПечатныхФормПоУмолчанию(ОписанияНастроек);
	КонецЕсли;
	
	БизнесПроцессыЗаявокСотрудников.ЗаполнитьНастройкиПечатныхФормПоУмолчанию(ОписанияНастроек);
	ЗаявкиСотрудников.ЗаполнитьНастройкиПечатныхФормПоУмолчанию(ОписанияНастроек);
	
КонецПроцедуры

Процедура ДокументЭДОБЗКФормаСпискаПриСозданииНаСервере(УправляемаяФорма, Отказ, СтандартнаяОбработка) Экспорт
	
	ТекстЗапроса = УправляемаяФорма.Список.ТекстЗапроса;
	ПозицияСкобки = СтрНайти(ТекстЗапроса, "}", НаправлениеПоиска.СКонца);
	Если ПозицияСкобки > 0 Тогда
		ТекстЗапроса = Лев(ТекстЗапроса, ПозицияСкобки - 1);
		ТекстЗапроса = ТекстЗапроса + ",
			|	(ИСТИНА В
			|		(ВЫБРАТЬ ПЕРВЫЕ 1
			|			ИСТИНА
			|		ИЗ
			|			РегистрСведений.СоставДокументовЗарплатаКадры КАК СоставДокументовЗарплатаКадры
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудниковИнтервальный КАК КадроваяИсторияСотрудниковИнтервальный
			|				ПО
			|					СоставДокументовЗарплатаКадры.ФизическоеЛицо = КадроваяИсторияСотрудниковИнтервальный.ФизическоеЛицо
			|		ГДЕ
			|			КадроваяИсторияСотрудниковИнтервальный.Подразделение В ИЕРАРХИИ (&Подразделение)
			|			И ДокументДокументЭДОБЗК.Дата МЕЖДУ КадроваяИсторияСотрудниковИнтервальный.ДатаНачала И КадроваяИсторияСотрудниковИнтервальный.ДатаОкончания
			|			И ДокументДокументЭДОБЗК.Ссылка = СоставДокументовЗарплатаКадры.ДокументФизическогоЛица))}";
		УправляемаяФорма.Список.ТекстЗапроса = ТекстЗапроса;
	КонецЕсли;
	
КонецПроцедуры

#Область УправлениеПечатью

// См. УправлениеПечатьюМультиязычностьПереопределяемый.ПриОпределенииДоступныхДляПереводаМакетов
Процедура ПриОпределенииДоступныхДляПереводаМакетов(Макеты) Экспорт
	
	Макеты.Добавить(Метаданные.Документы.ДокументЭДОБЗК.Макеты.ПФ_MXL_ПустойБланкДокументаЭДОБЗК);
	Макеты.Добавить(Метаданные.Документы.СогласиеНаПрисоединениеКЭДОБЗК.Макеты.ПФ_MXL_СогласиеНаПрисоединениеКЭДОБЗК_БумажныйДокумент);
	Макеты.Добавить(Метаданные.Документы.СогласиеНаПрисоединениеКЭДОБЗК.Макеты.ПФ_MXL_СогласиеНаПрисоединениеКЭДОБЗК_УНЭП);
	Макеты.Добавить(Метаданные.Отчеты.ДокументыЭДОБЗКСотрудников.Макеты.ПФ_MXL_КарточкаЭлектронногоДокумента);
	Макеты.Добавить(Метаданные.Отчеты.ШаблоныДокументовКабинетСотрудника.Макеты.ПФ_MXL_ШаблонДокументаКабинетСотрудника);
	
КонецПроцедуры

#КонецОбласти

Функция ВидДокументаПоОснованиюИРеквизитам(ОснованиеСсылка, РеквизитыОбъекта) Экспорт
	
	ВидДокумента = Неопределено;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(РеквизитыОбъекта, "ОтменяемаяЗаявка")
		И ЗначениеЗаполнено(РеквизитыОбъекта.ОтменяемаяЗаявка) Тогда
		
		ШаблонДокумента = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ШаблоныДокументов.ЗаявлениеНаОтмену");
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(РеквизитыОбъекта, "ШаблонДокумента")
		И ЗначениеЗаполнено(РеквизитыОбъекта.ШаблонДокумента) Тогда
		
		ШаблонДокумента = РеквизитыОбъекта.ШаблонДокумента;
	ИначеЕсли ТипЗнч(ОснованиеСсылка) = Тип("ДокументСсылка.ЗаявкаСправка2НДФЛКабинетСотрудника") Тогда
		ШаблонДокумента = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ШаблоныДокументов.ЗапросСправки2НДФЛ");
	ИначеЕсли ТипЗнч(ОснованиеСсылка) = Тип("ДокументСсылка.ЗаявкаНалоговыеВычетыКабинетСотрудника") Тогда
		ШаблонДокумента = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ШаблоныДокументов.ЗаявлениеНаНалоговыеВычеты");
	ИначеЕсли ТипЗнч(ОснованиеСсылка) = Тип("ДокументСсылка.ЗаявкаОтпускКабинетСотрудника") Тогда
		ШаблонДокумента = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ШаблоныДокументов.ЗаявлениеНаОтпуск");
	ИначеЕсли ТипЗнч(ОснованиеСсылка) = Тип("ДокументСсылка.ЗаявкаИзменениеЛичныхДанныхКабинетСотрудника") Тогда
		ШаблонДокумента = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ШаблоныДокументов.ЗаявлениеОбИзмененииЛичныхДанных");
	ИначеЕсли ТипЗнч(ОснованиеСсылка) = Тип("ДокументСсылка.ЗаявкаОтсутствиеКабинетСотрудника") Тогда
		ШаблонДокумента = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ШаблоныДокументов.Отсутствие");
	ИначеЕсли ТипЗнч(ОснованиеСсылка) = Тип("ДокументСсылка.ЗаявкаОтпускБезОплатыКабинетСотрудника") Тогда
		ШаблонДокумента = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ШаблоныДокументов.Отсутствие");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ШаблонДокумента) Тогда
		Если ТипЗнч(ОснованиеСсылка) = Тип("ДокументСсылка.ЗаявкаОтсутствиеКабинетСотрудника") Тогда
			ВидДокумента = Справочники.ВидыДокументовЭДОБЗК.ВидДокументаПоПричинеОтсутствия(РеквизитыОбъекта.ПричинаОтсутствия);
		ИначеЕсли ТипЗнч(ОснованиеСсылка) = Тип("ДокументСсылка.ЗаявкаОтпускБезОплатыКабинетСотрудника") Тогда
			ВидДокумента = Справочники.ВидыДокументовЭДОБЗК.ВидДокументаПоПричинеОтсутствия(
				Перечисления.ПричиныОтсутствийЗаявокКабинетСотрудника.ОтпускЗаСвойСчет);
		Иначе
			ВидДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ШаблонДокумента, "ВидДокумента");
		КонецЕсли;
	КонецЕсли;
	
	Возврат ВидДокумента;
	
КонецФункции

#КонецОбласти
