
&НаКлиенте
Процедура vs_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
	Если не Объект.Товары.Количество() тогда
		vs_НоменклатураПриИзмененииПослеНаСервере();
		ЗаполнитьКомплектующими(Неопределено);
	КонецЕсли;
КонецПроцедуры                                


&НаСервере
Процедура vs_ПриЧтенииНаСервереПосле(ТекущийОбъект)
	
	Элементы.ГруппаОсновное.ТолькоПросмотр 	=   ТекущийОбъект.Статус = Перечисления.СтатусыВнутреннихЗаказов.Закрыт ;
	Элементы.ГруппаТовары.ТолькоПросмотр 	=   ТекущийОбъект.Статус = Перечисления.СтатусыВнутреннихЗаказов.Закрыт ;
	
КонецПроцедуры


&НаКлиенте
Процедура vs_ПослеЗаписиПосле(ПараметрыЗаписи)
	Элементы.ГруппаОсновное.ТолькоПросмотр 	=   Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыВнутреннихЗаказов.Закрыт") ;
	Элементы.ГруппаТовары.ТолькоПросмотр 	=   Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыВнутреннихЗаказов.Закрыт") ;
КонецПроцедуры


&НаСервере
Процедура vs_НоменклатураПриИзмененииПослеНаСервере()
	
	Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","Автоизготовление_feccce2b4e25489e8cd74e9e3fdba306");
	Значение = объект.Номенклатура.ДополнительныеРеквизиты.Найти(Свойство);
	Если Значение <>  Неопределено 
		и Значение.Значение = Истина тогда
		Сообщить("Номенклатура """ + объект.Номенклатура + """ является автоизготавливаемой, изготовление невозможно");
		объект.Номенклатура = "";
		Возврат;
	КонецЕсли;
	

	Если объект.Номенклатура.ВидНоменклатуры.ИспользоватьСерии тогда
		объект.Количество = 1;
		объект.КоличествоУпаковок = 1 ;
		объект.Упаковка = Неопределено;
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура vs_НоменклатураПриИзмененииПосле(Элемент)
	vs_НоменклатураПриИзмененииПослеНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура vs_КоличествоУпаковокПриИзмененииПосле(Элемент)
	vs_НоменклатураПриИзмененииПослеНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура vs_СтатусПриИзмененииПосле(Элемент)
	Элементы.ГруппаОсновное.ТолькоПросмотр 	=   Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыВнутреннихЗаказов.Закрыт") ;
	Элементы.ГруппаТовары.ТолькоПросмотр 	=   Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыВнутреннихЗаказов.Закрыт") ;
КонецПроцедуры


&НаСервере
Процедура vs_ПриОткрытииПослеНаСервере()
	
	если объект.Ссылка.Пустая()  и не объект.ВариантКомплектации.Пустая() тогда
		ЗаполнитьТоварыПоВариантуКомплектации();
	КонецЕсли;
	Элементы.Товары.ТолькоПросмотр = Истина;
	Элементы.ТоварыРазбитьСтроку.Доступность = Ложь;
	Элементы.ТоварыВставитьСтроки.Доступность = Ложь;
	Элементы.ТоварыСкопироватьСтроки.Доступность = Ложь;
	Элементы.ТоварыПодобратьТовары.Доступность = Ложь;
	Элементы.ТоварыОтменитьВыделенныеСтроки.Доступность = Ложь;
КонецПроцедуры


&НаКлиенте
Процедура vs_ПриОткрытииПосле(Отказ)
	vs_ПриОткрытииПослеНаСервере();
КонецПроцедуры


&НаСервере
Процедура ОчиститьСохраненныеДанные()
	
	//запишем пустой набор для очистки
	МатериалыКомплектации = РегистрыСведений.ИТБК_ДанныеАвтоизготовления.СоздатьНаборЗаписей();
	МатериалыКомплектации.Отбор.ЗаказНаСборку.Установить(Объект.Ссылка);
	МатериалыКомплектации.Записать();
	
	МатериалыКомплектации = РегистрыСведений.vs_ДанныеАвтоизготовления.СоздатьНаборЗаписей();
	МатериалыКомплектации.Отбор.ЗаказНаСборку.Установить(Объект.Ссылка);
	МатериалыКомплектации.Записать();
	
КонецПроцедуры


&НаКлиенте
Процедура vs_ВариантКомплектацииЗавершение(Ответ, ДП) Экспорт
	
	Если  ответ = КодВозвратаДиалога.Да тогда
		Объект.Товары.Очистить();
		Объект.ВариантКомплектации = ДП;
		ЗаполнитьКомплектующими(Неопределено);
		ВариантКомплектацииПриИзменении(Элементы.ВариантКомплектации);
		ОчиститьСохраненныеДанные();
		ПоказатьПредупреждение(,"После записи документа необходимо перевыбрать заказ в рабочем месте Изготовления,если оно открыто",
		,"Внимание!!!");
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура vs_ВариантКомплектацииОбработкаВыбораВместо(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение<>Объект.ВариантКомплектации и не Объект.Ссылка.Пустая() тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьВопрос(новый ОписаниеОповещения("vs_ВариантКомплектацииЗавершение",ЭтаФорма,ВыбранноеЗначение),
		"При смене Варианта комплектации, состав материалов, потребляемых  при изготовлении, будет изменен в соответствии с новым Вариантом комплектации. Все изменения в составе материалов, внесенные ранее, будут потеряны! Продолжить?
		|Убедитесь, что в производстве не начато изготовление этого заказа  по старому (прежнему) Варианту комплектации!",
		РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет,"Внимание!!!");
	КонецЕсли;

КонецПроцедуры

