
//&ИзменениеИКонтроль("ОбработатьДанныеДляПереходаНаНовуюВерсию")
//Процедура vs_ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры)
//	
//	МетаданныеРегистра = Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам;
//	ПолноеИмяРегистра = МетаданныеРегистра.ПолноеИмя();
//	
//	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
//	ДополнительныеПараметры.ЭтоДвижения = Истина;
//	ДополнительныеПараметры.ПолноеИмяРегистра = ПолноеИмяРегистра;
//	
//	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
//	
//	Если ОбновляемыеДанные.Количество() > 0 Тогда
//		
//		Запрос = Новый Запрос;
//		Запрос.Текст = "
//		|ВЫБРАТЬ РАЗЛИЧНЫЕ
//		|	Движения.ДокументРегистратор КАК Взаимозачет
//		|ИЗ
//		|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК Движения
//		|ГДЕ
//		|	Движения.Регистратор В (&Регистраторы)
//		|	И ВЫРАЗИТЬ(Движения.ДокументРегистратор КАК Документ.ВзаимозачетЗадолженности).ВидОперации В (&ВидыОпераций)
//		|;
//		|ВЫБРАТЬ РАЗЛИЧНЫЕ
//		|	Движения.Регистратор КАК Регистратор
//		|ИЗ
//		|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК Движения
//		|ГДЕ
//		|	Движения.Регистратор В (&Регистраторы)
//		|";
//		Запрос.УстановитьПараметр("Регистраторы", ОбновляемыеДанные.ВыгрузитьКолонку("Регистратор"));
//		Запрос.УстановитьПараметр("ВидыОпераций", ВидыОпераций());
//		Результаты = Запрос.ВыполнитьПакет();
//		
//		ПроблемныйРегистратор = Неопределено;
//		
//		НачатьТранзакцию();
//		
//		Попытка
//			
//			Блокировка = Новый БлокировкаДанных;
//			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяРегистра + ".НаборЗаписей");
//			ЭлементБлокировки.ИсточникДанных = ОбновляемыеДанные;
//			ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Регистратор", "Регистратор");
//			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

//			Блокировка.Заблокировать();
//			ДокументыВзаимозачетов = Результаты[0].Выгрузить().ВыгрузитьКолонку("Взаимозачет");
//			ВыборкаПоРегистратору = Результаты[1].Выбрать();
//			Пока ВыборкаПоРегистратору.Следующий() Цикл
//				
//				ПроблемныйРегистратор = ВыборкаПоРегистратору.Регистратор;
//				
//				Набор = РегистрыНакопления.РасчетыСКлиентамиПоСрокам.СоздатьНаборЗаписей();
//				Набор.Отбор.Регистратор.Установить(ВыборкаПоРегистратору.Регистратор);
//				Набор.Прочитать();
//				
//				ЕстьИзменения = Ложь;
//				Для Каждого Запись Из Набор Цикл
//					Если Запись.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПереносДолга 
//						И ДокументыВзаимозачетов.Найти(Запись.ДокументРегистратор) <> Неопределено Тогда
//							Запись.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПереносДолга;
//							ЕстьИзменения = Истина;
//					КонецЕсли;
//				КонецЦикла;
//				
//				Если ЕстьИзменения Тогда
//					ОбновлениеИнформационнойБазы.ЗаписатьДанные(Набор);
//				Иначе
//					ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Набор);
//				КонецЕсли;
//				
//			КонецЦикла;
//			
//			ЗафиксироватьТранзакцию();
//			
//		Исключение
//			
//			ОтменитьТранзакцию();
//			Если ЗначениеЗаполнено(ПроблемныйРегистратор) Тогда
//				ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), ПроблемныйРегистратор);
//			Иначе
//				ТекстСообщения = НСтр("ru = 'Не удалось выполнить обработку данных регистра накопления Активы и пассивы, при обновлении по причине: %Причина%'");
//				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
//				ЗаписьЖурналаРегистрации(
//					ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
//					УровеньЖурналаРегистрации.Ошибка,
//					Метаданные.РегистрыНакопления.ПрочиеАктивыПассивы,
//					ТекстСообщения);
//			КонецЕсли;
//			
//		КонецПопытки;
//		
//	КонецЕсли;
//	
//	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяРегистра);
//	
//КонецПроцедуры
