
//&Вместо("ЗаполнитьРеквизитыСтрокиТовара")
//Процедура ИТБК_ЗаполнитьРеквизитыСтрокиТовара(СтрокаТовары, ОбластьМакета, НомерСтроки, ВыводитьКодНоменклатуры, ВыводитьКодТНВД, ВыводитьСерии, СчетФактураНаАванс)
//	
//	ИспользоватьНаборы = ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(СтрокаТовары, "ЭтоНабор");
//	
//	ПрефиксИПостфикс = НаборыСервер.ПолучитьПрефиксИПостфикс(СтрокаТовары, ИспользоватьНаборы);
//	
//	ОбластьМакета.Параметры.Заполнить(СтрокаТовары);
//	
//	//<<Ершов В. Д. 17.02.2021
//	
//	Если ТипЗнч(СтрокаТовары.Ссылка) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
//		
//		Если СтрокаТовары.Цена =0 Тогда
//			Запрос = Новый Запрос;
//			Запрос.Текст = 
//			"ВЫБРАТЬ
//			|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
//			|ИЗ
//			|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
//			|			&Дата,
//			|			ВидЦены = &ВидЦены
//			|				И Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних";
//			
//			Запрос.УстановитьПараметр("ВидЦены", СтрокаТовары.ссылка.ВидЦены);
//			Запрос.УстановитьПараметр("Дата", СтрокаТовары.Ссылка.Дата);
//			Запрос.УстановитьПараметр("Номенклатура", СтрокаТовары.Номенклатура);
//			
//			РезультатЗапроса = Запрос.Выполнить();
//			
//			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//			
//			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//				ОбластьМакета.Параметры.Цена = ВыборкаДетальныеЗаписи.Цена;
//				ОбластьМакета.Параметры.Сумма = СтрокаТовары.Количество* ВыборкаДетальныеЗаписи.Цена;
//			КонецЦикла;
//		КОнецЕсли;	
//		
//	КонецЕсли;	
//	//>>Ершов В. Д. 17.02.2021
//	СтруктураПараметров = Новый Структура;
//	СтруктураПараметров.Вставить("КоличествоМест", 0);
//	СтруктураПараметров.Вставить("КоличествоВОдномМесте", 0);
//	СтруктураПараметров.Вставить("НоменклатураКод", "");
//	СтруктураПараметров.Вставить("КодТНВЭД", "--");
//	
//	ЗаполнитьЗначенияСвойств(СтруктураПараметров, СтрокаТовары);
//	ОкруглитьДоЦелого(СтруктураПараметров.КоличествоМест);
//	СтруктураПараметров.Вставить("НомерСтроки", НомерСтроки);
//	
//	ДополнительныеПараметрыПолученияНаименованияДляПечати = НоменклатураКлиентСервер.ДополнительныеПараметрыПредставлениеНоменклатурыДляПечати();
//	ДополнительныеПараметрыПолученияНаименованияДляПечати.ВозвратнаяТара = СтрокаТовары.ЭтоВозвратнаяТара;	
//	Если ВыводитьКодТНВД <> Неопределено Тогда
//		ДополнительныеПараметрыПолученияНаименованияДляПечати.КодТНВЭД = ?(НЕ ВыводитьКодТНВД.ВыводитьВКолонке И ВыводитьКодТНВД.ВыводитьВСтроке, СтрокаТовары.КодТНВЭД, "");
//		Если НЕ ВыводитьКодТНВД.ВыводитьВКолонке Тогда
//			СтруктураПараметров.КодТНВЭД = "--";
//		КонецЕсли;
//	КонецЕсли;
//	
//	ПредставлениеНоменклатуры =  ПрефиксИПостфикс.Префикс
//		+ НоменклатураКлиентСервер.ПредставлениеНоменклатурыДляПечати(
//			Строка(СтрокаТовары.НоменклатураНаименование),
//			СтрокаТовары.ХарактеристикаНаименование,
//			,
//			,
//			ДополнительныеПараметрыПолученияНаименованияДляПечати)
//		+ ПрефиксИПостфикс.Постфикс;
//	
//	СтруктураПараметров.Вставить("ПредставлениеНоменклатуры", ПредставлениеНоменклатуры);
//		
//	Если Не ВыводитьКодНоменклатуры Тогда
//		СтруктураПараметров.НоменклатураКод = "";
//	КонецЕсли;
//	
//	ОбластьМакета.Параметры.Заполнить(СтруктураПараметров);
//	
//	Если ИспользоватьНаборы
//		И СтрокаТовары.ЭтоКомплектующие
//		И СтрокаТовары.ВариантПредставленияНабораВПечатныхФормах = Перечисления.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие
//		И (СтрокаТовары.ВариантРасчетаЦеныНабора = Перечисления.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоДолям
//		   ИЛИ СтрокаТовары.ВариантРасчетаЦеныНабора = Перечисления.ВариантыРасчетаЦенНаборов.ЦенаЗадаетсяЗаНаборРаспределяетсяПоЦенам) Тогда
//		// Область должна остаться незаполненной
//		ОбластьМакета.Параметры.Заполнить(НаборыСервер.ПустыеДанные());
//	ИначеЕсли ИспользоватьНаборы
//		И СтрокаТовары.ЭтоНабор
//		И СтрокаТовары.ВариантПредставленияНабораВПечатныхФормах = Перечисления.ВариантыПредставленияНаборовВПечатныхФормах.НаборИКомплектующие
//		И (СтрокаТовары.ВариантРасчетаЦеныНабора = Перечисления.ВариантыРасчетаЦенНаборов.РассчитываетсяИзЦенКомплектующих
//			ИЛИ СчетФактураНаАванс) Тогда
//		// Область должна остаться незаполненной
//		ОбластьМакета.Параметры.Заполнить(НаборыСервер.ПустыеДанные());
//	КонецЕсли;
//	
//КонецПроцедуры

//&Вместо("ЗаполнитьТабличныйДокументМХ18")
//Процедура ИТБК_ЗаполнитьТабличныйДокументМХ18(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати)
//	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
//	
//	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьОбщихФорм.ПФ_MXL_МХ18_ru");
//	Макет.КодЯзыка = Метаданные.Языки.Русский.КодЯзыка;
//	
//	ДанныеПечати        = ДанныеДляПечати.РезультатПоШапке.Выбрать();
//	ВыборкаПоДокументам = ДанныеДляПечати.РезультатПоТабличнойЧасти.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//	
//	ПервыйДокумент = Истина;
//	Пока ДанныеПечати.Следующий() Цикл
//		
//		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
//		ВыборкаПоДокументам.Сбросить();
//		Если НЕ ВыборкаПоДокументам.НайтиСледующий(СтруктураПоиска) Тогда
//			
//			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
//				НСтр("ru = 'В документе %1 отсутствуют товары. Печать накладной не требуется';
//					|en = 'Goods are missing in document %1. Printing of the invoice is not required'"),
//				ДанныеПечати.Ссылка);
//			
//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
//				Текст,
//				ДанныеПечати.Ссылка);
//			
//			Продолжить;
//			
//		КонецЕсли;
//		
//		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
//		
//		ВыборкаПоСкладам = ВыборкаПоДокументам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//		
//		Пока ВыборкаПоСкладам.Следующий() Цикл
//			
//			
//			Если Не ПервыйДокумент Тогда
//				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
//			КонецЕсли;
//			
//			ПервыйДокумент = Ложь;
//			
//			
//			// Выводим общие реквизиты шапки
//			ЗаполнитьРеквизитыШапкиМХ18(ДанныеПечати, ВыборкаПоСкладам, Макет, ТабличныйДокумент);
//			
//			// Выводим заголовок таблицы
//			ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
//			ТабличныйДокумент.Вывести(ЗаголовокТаблицы);
//			
//			НомерСтраницы   = 1;
//			
//			// Инициализация итогов в документе
//			ИтоговыеСуммы = СтруктураИтоговыеСуммы();
//			
//			// Создаем массив для проверки вывода
//			МассивВыводимыхОбластей = Новый Массив;
//			
//			// Выводим многострочную часть документа
//			ОбластьМакета  = Макет.ПолучитьОбласть("Строка");
//			ОбластьПодвала = Макет.ПолучитьОбласть("Подвал");
//			ОбластьВсего   = Макет.ПолучитьОбласть("Всего");
//			
//			НомерСтроки = 0;
//			ДобавитьИтоговыеДанныеПодвала(ИтоговыеСуммы, НомерСтроки, ВалютаРегламентированногоУчета);
//			ЗаполнитьРеквизитыПодвалаМХ18(ОбластьПодвала, ДанныеПечати, ИтоговыеСуммы);
//			
//			СтрокаТовары = ВыборкаПоСкладам.Выбрать();
//			КоличествоСтрок = СтрокаТовары.Количество();
//			Пока СтрокаТовары.Следующий() Цикл
//				
//				НомерСтроки = НомерСтроки + 1;
//				ЗаполнитьРеквизитыСтрокиТовара(СтрокаТовары, ОбластьМакета, НомерСтроки);
//				
//				МассивВыводимыхОбластей.Очистить();
//				МассивВыводимыхОбластей.Добавить(ОбластьМакета);
//				
//				Если НомерСтроки = КоличествоСтрок Тогда
//					МассивВыводимыхОбластей.Добавить(ОбластьВсего);
//					МассивВыводимыхОбластей.Добавить(ОбластьПодвала);
//				КонецЕсли;
//				
//				Если НЕ ТабличныйДокумент.ПроверитьВывод(МассивВыводимыхОбластей) Тогда
//					НомерСтраницы = НомерСтраницы + 1;
//					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
//					УстановитьПараметр(ЗаголовокТаблицы, "НомерСтраницы", "Страница " + НомерСтраницы);
//					ТабличныйДокумент.Вывести(ЗаголовокТаблицы);
//				КонецЕсли;
//				
//				ТабличныйДокумент.Вывести(ОбластьМакета);
//				
//				//<<Ершов В. Д. 17.02.2021
//				
//				Если ТипЗнч(СтрокаТовары.Ссылка) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
//					
//					Если СтрокаТовары.Цена =0 Тогда
//						Запрос = Новый Запрос;
//						Запрос.Текст = 
//						"ВЫБРАТЬ
//						|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
//						|ИЗ
//						|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
//						|			&Дата,
//						|			ВидЦены = &ВидЦены
//						|				И Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних";
//						
//						Запрос.УстановитьПараметр("ВидЦены", СтрокаТовары.ссылка.ВидЦены);
//						Запрос.УстановитьПараметр("Дата", СтрокаТовары.Ссылка.Дата);
//						Запрос.УстановитьПараметр("Номенклатура", СтрокаТовары.Номенклатура);
//						
//						РезультатЗапроса = Запрос.Выполнить();
//						
//						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
//						Цена = 0;
//						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
//							
//							Цена = ВыборкаДетальныеЗаписи.Цена;
//							
//						КонецЦикла;
//						
//						СтруктураСуммПоСтроке = СтруктураРесурсовДляИтогов();
//						
//						ЗаполнитьЗначенияСвойств(СтруктураСуммПоСтроке, СтрокаТовары);
//						ОкруглитьДоЦелого(СтруктураСуммПоСтроке.КоличествоМест);
//						Для Каждого Элемент Из СтруктураСуммПоСтроке Цикл
//							Если Элемент.Ключ = "Сумма" Тогда
//								ИтоговыеСуммы["Итого"+Элемент.Ключ+"НаСтранице"] = ИтоговыеСуммы["Итого"+Элемент.Ключ+"НаСтранице"] + (СтрокаТовары.Количество*Цена);
//								ИтоговыеСуммы["Итого"+Элемент.Ключ] = ИтоговыеСуммы["Итого"+Элемент.Ключ] + (СтрокаТовары.Количество*Цена);
//							Иначе
//								Если ЗначениеЗаполнено(Элемент.Значение) Тогда
//									ИтоговыеСуммы["Итого"+Элемент.Ключ+"НаСтранице"] = ИтоговыеСуммы["Итого"+Элемент.Ключ+"НаСтранице"] + Элемент.Значение;
//									ИтоговыеСуммы["Итого"+Элемент.Ключ] = ИтоговыеСуммы["Итого"+Элемент.Ключ] + Элемент.Значение;
//								КонецЕсли;	
//							КонецЕсли;
//						КонецЦикла;
//						
//					КОнецЕсли;	
//				Иначе
//					РассчитатьИтоговыеСуммы(ИтоговыеСуммы, СтрокаТовары);	
//				КонецЕсли;	
//				//>>Ершов В. Д. 17.02.2021
//			КонецЦикла;
//			
//			// Выводим итоги по документу в целом
//			ОбластьВсего.Параметры.Заполнить(ИтоговыеСуммы);
//			ТабличныйДокумент.Вывести(ОбластьВсего);
//			
//			// Выводим итоги по документу
//			ДобавитьИтоговыеДанныеПодвала(ИтоговыеСуммы, НомерСтроки, ВалютаРегламентированногоУчета);
//			ЗаполнитьРеквизитыПодвалаМХ18(ОбластьПодвала, ДанныеПечати, ИтоговыеСуммы);
//			ТабличныйДокумент.Вывести(ОбластьПодвала);
//			
//		КонецЦикла;
//		
//		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(
//			ТабличныйДокумент,
//			НомерСтрокиНачало,
//			ОбъектыПечати,
//			ДанныеПечати.Ссылка);
//		
//	КонецЦикла;
//	

//КонецПроцедуры
